[
  {
    "number": "509",
    "text": "During the Great Trek, the Voortrekkers clashed with the indigenous Zulu people. Who was the Zulu king at that time?",
    "options": {
      "A": "King Zwelithini",
      "B": "Dingane kaSenzangakhona",
      "C": "Cetshwayo kaMpande",
      "D": "Shaka Zulu"
    },
    "answer_url": "https://myschool.ng/classroom/history/68484?exam_type=jamb&type=obj&page=102",
    "correct_answer": "B",
    "explanation": "During the Great Trek, the Voortrekkers clashed with the indigenous Zulu people. The Zulu king at that time was Dingane kaSenzangakhona.",
    "year": "2023"
  },
  {
    "number": "510",
    "text": "Which European explorer is credited with discovering Sierra Leone in the 15th century?",
    "options": {
      "A": "Vasco da Gama",
      "B": "Christopher Columbus",
      "C": "Ferdinand Magellan",
      "D": "Pedro de Sintra"
    },
    "answer_url": "https://myschool.ng/classroom/history/68485?exam_type=jamb&type=obj&page=102",
    "correct_answer": "D",
    "explanation": "Vasco da Gama",
    "year": "2023"
  },
  {
    "number": "511",
    "text": "Which military leader introduced the \"War Against Indiscipline\" campaign in the 1980s?",
    "options": {
      "A": "General Ibrahim Babangida",
      "B": "General Murtala Ramat Mohammed",
      "C": "General Sani Abacha",
      "D": "General Muhammadu Buhari"
    },
    "answer_url": "https://myschool.ng/classroom/history/68486?exam_type=jamb&type=obj&page=103",
    "correct_answer": "D",
    "explanation": "The 'War Against Indiscipline' campaign was introduced by General Muhammadu Buhari in March 1984. The campaign was aimed at promoting discipline, orderliness, and respect for public properties among Nigerians.",
    "year": "2023"
  },
  {
    "number": "512",
    "text": "The Richards Constitution of 1946 introduced a new political structure in Nigeria. What was a major criticism of this constitution by Nigerian nationalists?",
    "options": {
      "A": "It failed to recognize the diversity of ethnic groups in Nigeria.",
      "B": "It favored the interests of urban elites over rural populations.",
      "C": "It restricted the activities of nationalist organizations.",
      "D": "It granted too much power to regional governments."
    },
    "answer_url": "https://myschool.ng/classroom/history/68487?exam_type=jamb&type=obj&page=103",
    "correct_answer": "A",
    "explanation": "The Richards Constitution of 1946 was criticized by Nigerian nationalists because it failed to recognize the diversity of ethnic groups in Nigeria. The constitution was seen as a tool for the British to continue indirect rule and did not adequately represent the interests of the various ethnic groups in the country.",
    "year": "2023"
  },
  {
    "number": "513",
    "text": "The Lyttleton Constitution of 1954 introduced which significant political reform in Nigeria?",
    "options": {
      "A": "Introduction of regional autonomy",
      "B": "Creation of the Office of the Governor-General",
      "C": "Introduction of the federal system",
      "D": "Establishment of the Legislative Council"
    },
    "answer_url": "https://myschool.ng/classroom/history/68488?exam_type=jamb&type=obj&page=103",
    "correct_answer": "C",
    "explanation": "The Lyttleton Constitution of 1954 introduced the federal system in Nigeria. This was a significant political reform as it decentralized power and allowed for regional governments to have more control over their affairs.",
    "year": "2023"
  },
  {
    "number": "514",
    "text": "The city of Ife, in present-day Nigeria, is famous for its artistic heritage, particularly its",
    "options": {
      "A": "Beadwork",
      "B": "Adire textiles",
      "C": "Wooden masks",
      "D": "Terracotta sculptures"
    },
    "answer_url": "https://myschool.ng/classroom/history/68489?exam_type=jamb&type=obj&page=103",
    "correct_answer": "D",
    "explanation": "The city of Ife, in present-day Nigeria, is famous for its artistic heritage, particularly its Terracotta sculptures. These sculptures, often of human heads, are renowned for their naturalism and detail, and are considered among the highest achievements of African art.",
    "year": "2023"
  },
  {
    "number": "515",
    "text": "Who is often considered the founder of modern Egypt and the ruler of Egypt from 1805 to 1848?",
    "options": {
      "A": "Mohammed Ali",
      "B": "Gamal Abdel Nasser",
      "C": "Khedive Ismail",
      "D": "King Farouk"
    },
    "answer_url": "https://myschool.ng/classroom/history/68490?exam_type=jamb&type=obj&page=103",
    "correct_answer": "A",
    "explanation": "Mohammed Ali is often considered the founder of modern Egypt and was the ruler of Egypt from 1805 to 1848. He is known for his military and administrative reforms that laid the groundwork for the modernization of Egypt.",
    "year": "2023"
  },
  {
    "number": "516",
    "text": "Which influential leader in the Sokoto Caliphate was responsible for administration and justice?",
    "options": {
      "A": "Waziri",
      "B": "Caliph",
      "C": "Emir",
      "D": "Imam"
    },
    "answer_url": "https://myschool.ng/classroom/history/68491?exam_type=jamb&type=obj&page=104",
    "correct_answer": "A",
    "explanation": "In the Sokoto Caliphate, the Waziri was responsible for administration and justice. The Waziri was the vizier or minister of the Caliphate, and his duties included overseeing the administration of the state and ensuring justice was served.",
    "year": "2023"
  },
  {
    "number": "517",
    "text": "Which colonial policy was implemented to extract resources and labor from Nigeria for Britain's benefit?",
    "options": {
      "A": "Assimilation",
      "B": "Indirect rule",
      "C": "Association",
      "D": "Exploitation"
    },
    "answer_url": "https://myschool.ng/classroom/history/68492?exam_type=jamb&type=obj&page=104",
    "correct_answer": "B",
    "explanation": "The colonial policy implemented by Britain in Nigeria was Indirect Rule. This system was introduced by Lord Lugard, the first Governor-General of Nigeria. Under this system, traditional rulers were allowed to govern their people as long as they followed British guidelines. This policy was primarily used to extract resources and labor from Nigeria for Britain's benefit.",
    "year": "2023"
  },
  {
    "number": "518",
    "text": "Which of the following was a significant trading commodity in the Nigeria area before 1800?",
    "options": {
      "A": "Coffee",
      "B": "Rubber",
      "C": "Cocoa",
      "D": "Kola nuts"
    },
    "answer_url": "https://myschool.ng/classroom/history/68493?exam_type=jamb&type=obj&page=104",
    "correct_answer": "D",
    "explanation": "Before 1800, Kola nuts were a significant trading commodity in the Nigeria area. They were used in social and religious ceremonies and also as a form of currency.",
    "year": "2023"
  },
  {
    "number": "519",
    "text": "The Omani Empire declined in the 19th century due to",
    "options": {
      "A": "Internal power struggles",
      "B": "Natural disasters",
      "C": "Invasions from neighboring empires",
      "D": "European colonialism"
    },
    "answer_url": "https://myschool.ng/classroom/history/68494?exam_type=jamb&type=obj&page=104",
    "correct_answer": "A",
    "explanation": "The decline of the Omani Empire in the 19th century was largely due to internal power struggles. The empire was weakened by a series of succession disputes and civil wars.",
    "year": "2023"
  },
  {
    "number": "520",
    "text": "Morocco is known for producing which luxury commodity, derived from the argan tree?",
    "options": {
      "A": "Olive oil",
      "B": "Coffee",
      "C": "Spices",
      "D": "Argan oil"
    },
    "answer_url": "https://myschool.ng/classroom/history/68496?exam_type=jamb&type=obj&page=104",
    "correct_answer": "D",
    "explanation": "Morocco is known for producing a luxury commodity derived from the argan tree, which is Argan oil. Argan oil is used in high-end cosmetic products and gourmet cooking, and is unique to the region of Morocco.",
    "year": "2023"
  },
  {
    "number": "521",
    "text": "Which pre-colonial kingdom in the Nigeria Area was renowned for its wealth and participation in the trans-Saharan trade?",
    "options": {
      "A": "Kanem-Bornu Empire",
      "B": "Sokoto Caliphate",
      "C": "Oyo Empire"
    },
    "answer_url": "https://myschool.ng/classroom/history/68497?exam_type=jamb&type=obj&page=105",
    "correct_answer": "A",
    "explanation": "The Kanem-Bornu Empire, located in the Nigeria Area, was renowned for its wealth and participation in the trans-Saharan trade. The empire was a center of Islamic learning and trade, with connections stretching from North Africa to the Arabian Peninsula.",
    "year": "2023"
  },
  {
    "number": "522",
    "text": "Which major event led to the decline of the Benin Kingdom's influence in the 19th century?",
    "options": {
      "A": "The American Civil War",
      "B": "The Scramble for Africa",
      "C": "The Opium Wars",
      "D": "The French Revolution"
    },
    "answer_url": "https://myschool.ng/classroom/history/68498?exam_type=jamb&type=obj&page=105",
    "correct_answer": "B",
    "explanation": "The decline of the Benin Kingdom's influence in the 19th century was majorly due to the Scramble for Africa. The Scramble for Africa was a period of rapid colonization of African territories by European powers in the late 19th century, which often led to the decline or destruction of existing African kingdoms and empires.",
    "year": "2023"
  },
  {
    "number": "523",
    "text": "The British colonial policy of \"indirect rule\" was first implemented in Nigeria by Lugard in which region?",
    "options": {
      "A": "Calabar",
      "B": "Oyo",
      "C": "Lagos",
      "D": "Kano"
    },
    "answer_url": "https://myschool.ng/classroom/history/68499?exam_type=jamb&type=obj&page=105",
    "correct_answer": "D",
    "explanation": "The British colonial policy of 'indirect rule' was first implemented in Nigeria by Lord Lugard in the Northern region, specifically in Kano. Indirect rule is a system of governance used by the British to control parts of their colonial empire, particularly in Africa and Asia, through pre-existing local power structures. These dependencies were often called 'protectorates' or 'trucial states'.",
    "year": "2023"
  },
  {
    "number": "524",
    "text": "The Aba Women's Riots of 1929 were a response to:",
    "options": {
      "A": "The prohibition of women from participating in politics.",
      "B": "The banning of traditional religious practices.",
      "C": "The imposition of heavy taxes on women traders.",
      "D": "Forced labor in European-owned plantations."
    },
    "answer_url": "https://myschool.ng/classroom/history/68500?exam_type=jamb&type=obj&page=105",
    "correct_answer": "C",
    "explanation": "The Aba Women's Riots of 1929, also known as the Women's War, was a response to the imposition of heavy taxes on women traders by the British colonial administration. The women protested against the Warrant Chiefs, who were representatives of the colonial government, and their oppressive taxation policies.",
    "year": "2023"
  },
  {
    "number": "525",
    "text": "The Kanem-Borno Empire prospered due to its control over",
    "options": {
      "A": "Ivory trade",
      "B": "Salt trade",
      "C": "Gold trade",
      "D": "Copper trade"
    },
    "answer_url": "https://myschool.ng/classroom/history/68501?exam_type=jamb&type=obj&page=105",
    "correct_answer": "B",
    "explanation": "The Kanem-Borno Empire prospered due to its control over the salt trade. The empire was strategically located on trans-Saharan trade routes, and it capitalized on this by controlling the trade of salt, a valuable commodity at the time.",
    "year": "2023"
  },
  {
    "number": "526",
    "text": "Apartheid in South Africa was a system that institutionalized racial segregation and discrimination. What year did it officially begin?",
    "options": {
      "A": "1948",
      "B": "1956",
      "C": "1971",
      "D": "1963"
    },
    "answer_url": "https://myschool.ng/classroom/history/68502?exam_type=jamb&type=obj&page=106",
    "correct_answer": "A",
    "explanation": "Apartheid officially began in South Africa in 1948. It was a system of institutionalized racial segregation and discrimination that lasted until the early 1990s. The National Party, which came to power in 1948, formalized and expanded segregationist laws into the apartheid system.",
    "year": "2023"
  },
  {
    "number": "527",
    "text": "The colonization of Liberia began in what year?",
    "options": {
      "A": "1875",
      "B": "1807",
      "C": "1807",
      "D": "1850"
    },
    "answer_url": "https://myschool.ng/classroom/history/68503?exam_type=jamb&type=obj&page=106",
    "correct_answer": "B",
    "explanation": "The colonization of Liberia began in the year 1822. Liberia was founded by the American Colonization Society (ACS) as a place to send free African-Americans, who were freed from slavery but faced racial discrimination in the United States. The ACS believed black people would face better chances for full lives in Africa.",
    "year": "2023"
  },
  {
    "number": "528",
    "text": "What was the outcome of the Battle of Adwa in 1896?",
    "options": {
      "A": "Ethiopia and Italy signed a peace treaty.",
      "B": "Italy withdrew from Ethiopia.",
      "C": "Ethiopia gained full independence from Italy.",
      "D": "Ethiopia was annexed by Italy."
    },
    "answer_url": "https://myschool.ng/classroom/history/68504?exam_type=jamb&type=obj&page=106",
    "correct_answer": "C",
    "explanation": "The outcome of the Battle of Adwa in 1896 was that Ethiopia gained full independence from Italy. The battle was a decisive victory for Ethiopia and marked the end of Italy's imperial ambitions in Africa.",
    "year": "2023"
  },
  {
    "number": "529",
    "text": "The ancient city of Carthage, once a powerful Phoenician civilization, was located in modern-day",
    "options": {
      "A": "Egypt",
      "B": "Algeria",
      "C": "Morocco",
      "D": "Tunisia"
    },
    "answer_url": "https://myschool.ng/classroom/history/68505?exam_type=jamb&type=obj&page=106",
    "correct_answer": "D",
    "explanation": "The ancient city of Carthage, once a powerful Phoenician civilization, was located in modern-day Tunisia. Carthage was a significant power in the Mediterranean and fought against Rome in the Punic Wars.",
    "year": "2023"
  },
  {
    "number": "530",
    "text": "Which organization played a crucial role in the fight against apartheid in South Africa and was led by Nelson Mandela?",
    "options": {
      "A": "Economic Community of West African States (ECOWAS)",
      "B": "African Union (AU)",
      "C": "Southern African Development Community (SADC)",
      "D": "African National Congress (ANC)"
    },
    "answer_url": "https://myschool.ng/classroom/history/68506?exam_type=jamb&type=obj&page=106",
    "correct_answer": "D",
    "explanation": "The African National Congress (ANC) played a crucial role in the fight against apartheid in South Africa. Nelson Mandela, who later became the first black president of South Africa, was a prominent leader of the ANC.",
    "year": "2023"
  },
  {
    "number": "531",
    "text": "Who was the Oba of Benin during the height of the kingdom's power in the 19th century?",
    "options": {
      "A": "Oba Ewuare II",
      "B": "Oba Ovonramwen",
      "C": "Oba Akenzua II",
      "D": "Oba Erediauwa"
    },
    "answer_url": "https://myschool.ng/classroom/history/68507?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "Oba Ovonramwen was the Oba of Benin during the height of the kingdom's power in the 19th century. He was the ruler when the Punitive Expedition of 1897 occurred, in which the British exiled him and burned and looted the royal palace, marking the end of the Kingdom of Benin.",
    "year": "2023"
  },
  {
    "number": "532",
    "text": "The decline of the Songhai Empire in the 16th century was partly due to",
    "options": {
      "A": "Internal unrest and external attacks",
      "B": "Arab invasions",
      "C": "British colonial expansion",
      "D": "Portuguese trade restrictions"
    },
    "answer_url": "https://myschool.ng/classroom/history/68508?exam_type=jamb&type=obj&page=107",
    "correct_answer": "A",
    "explanation": "The decline of the Songhai Empire in the 16th century was due to a combination of internal unrest and external attacks, particularly from the Moroccan army. The other options are not historically accurate.",
    "year": "2023"
  },
  {
    "number": "533",
    "text": "What was the major consequence of the Scramble for Africa in Yorubaland?",
    "options": {
      "A": "Yorubaland experienced rapid industrialization.",
      "B": "Yorubaland lost its independence and became a British protectorate.",
      "C": "Yoruba city-states formed a confederation.",
      "D": "Yorubaland became a French colony."
    },
    "answer_url": "https://myschool.ng/classroom/history/68509?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "The major consequence of the Scramble for Africa in Yorubaland was that Yorubaland lost its independence and became a British protectorate. The Scramble for Africa was a period of rapid colonization of African territories by European powers in the late 19th century. In the case of Yorubaland, it was the British who took control, thereby making it a British protectorate.",
    "year": "2023"
  },
  {
    "number": "534",
    "text": "Which conference, held in 1884-1885, laid the groundwork for the partition of Africa among European powers?",
    "options": {
      "A": "Congress of Vienna",
      "B": "Treaty of Tordesillas",
      "C": "Treaty of Versailles",
      "D": "Conference of Berlin"
    },
    "answer_url": "https://myschool.ng/classroom/history/68510?exam_type=jamb&type=obj&page=107",
    "correct_answer": "D",
    "explanation": "The Conference of Berlin, also known as the Berlin Conference, was held from 1884 to 1885. It was organized by Otto von Bismarck, the first chancellor of Germany, and involved representatives from various European nations. The main aim of the conference was to divide Africa among the European powers, thereby laying the groundwork for the partition of Africa. This is a significant event in history as it led to the 'Scramble for Africa', where European powers rushed to claim African territories.",
    "year": "2023"
  },
  {
    "number": "535",
    "text": "Which African country experienced a prolonged and violent struggle for independence against French colonial rule, culminating in a war of independence that lasted from 1954 to 1962?",
    "options": {
      "A": "Algeria",
      "B": "Tunisia",
      "C": "Tunisia",
      "D": "Morocco"
    },
    "answer_url": "https://myschool.ng/classroom/history/68512?exam_type=jamb&type=obj&page=107",
    "correct_answer": "A",
    "explanation": "Algeria experienced a prolonged and violent struggle for independence against French colonial rule, culminating in a war of independence that lasted from 1954 to 1962. The war ended with Algeria gaining its independence from France. This war is known for its guerrilla warfare and the use of torture by both sides, and it is considered one of the most important decolonization wars.",
    "year": "2023"
  },
  {
    "number": "536",
    "text": "Which Yoruba city-state was the last to fall to British colonial rule in the late 19th century?",
    "options": {
      "A": "Abeokuta",
      "B": "Oyo",
      "C": "Lagos",
      "D": "Ibadan"
    },
    "answer_url": "https://myschool.ng/classroom/history/68513?exam_type=jamb&type=obj&page=108",
    "correct_answer": "A",
    "explanation": "Abeokuta was the last Yoruba city-state to fall to British colonial rule in the late 19th century. The British had already established control over other Yoruba city-states like Lagos, Oyo, and Ibadan. However, Abeokuta resisted British rule for a long time before finally succumbing to it.",
    "year": "2023"
  },
  {
    "number": "537",
    "text": "How did the establishment of missionary schools during the colonial era affect the Nigerian economy?",
    "options": {
      "A": "It led to increased government spending on education.",
      "B": "It hindered economic development due to religious conflicts.",
      "C": "It improved the literacy rate and provided a skilled workforce.",
      "D": "It favored British education over traditional Nigerian education."
    },
    "answer_url": "https://myschool.ng/classroom/history/68514?exam_type=jamb&type=obj&page=108",
    "correct_answer": "C",
    "explanation": "The establishment of missionary schools during the colonial era had a positive impact on the Nigerian economy. These schools improved the literacy rate and provided a skilled workforce. The education provided by these schools enabled Nigerians to take up administrative and professional roles, thereby contributing to economic development.",
    "year": "2023"
  },
  {
    "number": "538",
    "text": "Lake Victoria, one of the largest freshwater lakes in the world, is shared by three countries. Which of the following countries is NOT among them?",
    "options": {
      "A": "Uganda",
      "B": "Tanzania",
      "C": "Kenya",
      "D": "Mozambique"
    },
    "answer_url": "https://myschool.ng/classroom/history/68515?exam_type=jamb&type=obj&page=108",
    "correct_answer": "D",
    "explanation": "Lake Victoria is one of the largest freshwater lakes in the world and is shared by three countries: Uganda, Kenya, and Tanzania. Mozambique is not among the countries that share Lake Victoria.",
    "year": "2023"
  },
  {
    "number": "539",
    "text": "Which British explorer is credited with the \"discovery\" of the Niger River, sparking further interest in the Nigeria Area?",
    "options": {
      "A": "James Cook",
      "B": "John Cabot",
      "C": "David Livingstone",
      "D": "Ferdinand Magellan"
    },
    "answer_url": "https://myschool.ng/classroom/history/68516?exam_type=jamb&type=obj&page=108",
    "correct_answer": "C",
    "explanation": "The British explorer credited with the 'discovery' of the Niger River is Mungo Park, but since his name is not in the options, none of the options is correct. The Niger River was already known to the local inhabitants, but Park's exploration brought it to the attention of the European world.",
    "year": "2023"
  },
  {
    "number": "540",
    "text": "Which Islamic reform movement aimed to purify the practice of Islam from local customs and traditions in West Africa during the 18th and 19th centuries?",
    "options": {
      "A": "Wahhabi Movement",
      "B": "Mahdist Movement",
      "C": "Sufi Brotherhoods",
      "D": "Qadiriyya Movement"
    },
    "answer_url": "https://myschool.ng/classroom/history/68517?exam_type=jamb&type=obj&page=108",
    "correct_answer": "B",
    "explanation": "The Mahdist Movement was an Islamic reform movement that aimed to purify the practice of Islam from local customs and traditions in West Africa during the 18th and 19th centuries. The movement was led by Muhammad Ahmad bin Abd Allah, who declared himself the Mahdi, the prophesied redeemer of Islam who will appear at end times to rid the world of evil and injustice.",
    "year": "2023"
  },
  {
    "number": "541",
    "text": "In 1991, Nigeria hosted the \"World Festival of Black Arts and Culture.\" Which city was the venue for this cultural event?",
    "options": {
      "A": "Abuja",
      "B": "Kano",
      "C": "Calabar",
      "D": "Lagos"
    },
    "answer_url": "https://myschool.ng/classroom/history/68518?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "The World Festival of Black Arts and Culture, also known as FESTAC, was hosted by Nigeria in 1991. The event took place in Lagos, which is Nigeria's most populous city and a major cultural hub.",
    "year": "2023"
  },
  {
    "number": "542",
    "text": "During the Mahdiyya Movement, the British-Egyptian forces were defeated at the Battle of",
    "options": {
      "A": "Kerreri",
      "B": "Dongola",
      "C": "Khartoum",
      "D": "Omdurman"
    },
    "answer_url": "https://myschool.ng/classroom/history/68519?exam_type=jamb&type=obj&page=109",
    "correct_answer": "C",
    "explanation": "The Battle of Khartoum was a significant battle during the Mahdiyya Movement where the British-Egyptian forces were defeated. The Mahdiyya Movement was a revolutionary Sudanese Islamic order in the late 19th century that rose against the oppressive Egyptian and British colonial rule.",
    "year": "2023"
  },
  {
    "number": "543",
    "text": "During the Second Republic, Nigeria experienced a boom in which sector?",
    "options": {
      "A": "Technology",
      "B": "Mining",
      "C": "Oil and gas",
      "D": "Agriculture"
    },
    "answer_url": "https://myschool.ng/classroom/history/68520?exam_type=jamb&type=obj&page=109",
    "correct_answer": "C",
    "explanation": "During the Second Republic, Nigeria experienced a boom in the oil and gas sector. The 1970s and early 1980s were a period of significant oil wealth for Nigeria, due to the increase in oil prices.",
    "year": "2023"
  },
  {
    "number": "544",
    "text": "What significant event occurred during the Murtala/Obasanjo regime's early days in office?",
    "options": {
      "A": "The declaration of war against neighboring countries",
      "B": "The release of political prisoners",
      "C": "The launch of the Green Revolution program",
      "D": "The Second Republic elections"
    },
    "answer_url": "https://myschool.ng/classroom/history/68521?exam_type=jamb&type=obj&page=109",
    "correct_answer": "B",
    "explanation": "During the early days of the Murtala/Obasanjo regime, one of the significant events was the release of political prisoners. This was part of the regime's efforts to promote national reconciliation and unity.",
    "year": "2023"
  },
  {
    "number": "545",
    "text": "Who was the Zulu king responsible for the expansion of the Zulu Kingdom during the MFECANE?",
    "options": {
      "A": "King Moshoeshoe",
      "B": "King Cetshwayo",
      "C": "Nelson Mandela",
      "D": "Shaka Zulu"
    },
    "answer_url": "https://myschool.ng/classroom/history/68522?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "Shaka Zulu was the king of the Zulu Kingdom from 1816 to 1828. He is credited with creating a fighting force that devastated the entire region, in a period known as the Mfecane or 'crushing'. His reforms to the army and innovative tactics made the Zulu one of the most powerful forces in South Africa.",
    "year": "2023"
  },
  {
    "number": "546",
    "text": "Which social group in Nigeria was most affected by the introduction of the indirect rule system?",
    "options": {
      "A": "Chief priest",
      "B": "Educated elites",
      "C": "Traditional rulers",
      "D": "Women in rural areas"
    },
    "answer_url": "https://myschool.ng/classroom/history/68523?exam_type=jamb&type=obj&page=110",
    "correct_answer": "C",
    "explanation": "The indirect rule system, introduced by the British, greatly affected the traditional rulers in Nigeria. This system used the existing traditional rulers and institutions to govern, thereby increasing their power and influence.",
    "year": "2023"
  },
  {
    "number": "547",
    "text": "Which constitutional conference in London paved the way for Nigeria's independence?",
    "options": {
      "A": "London Conference of 1945",
      "B": "London Conference of 1920",
      "C": "London Conference of 1963",
      "D": "London Conference of 1957"
    },
    "answer_url": "https://myschool.ng/classroom/history/68524?exam_type=jamb&type=obj&page=110",
    "correct_answer": "D",
    "explanation": "The London Conference of 1957 was a significant event that paved the way for Nigeria's independence. It was at this conference that the British government agreed to grant Nigeria self-governance in all matters except defense and foreign affairs. This decision set the stage for full independence, which was achieved in 1960.",
    "year": "2023"
  },
  {
    "number": "548",
    "text": "Which African leader famously stated, \"I am the captain of my soul\" and became an icon of the decolonization movement?",
    "options": {
      "A": "Nelson Mandela",
      "B": "Julius Nyerere",
      "C": "Patrice Lumumba",
      "D": "Jomo Kenyatta"
    },
    "answer_url": "https://myschool.ng/classroom/history/68525?exam_type=jamb&type=obj&page=110",
    "correct_answer": "A",
    "explanation": "Nelson Mandela famously stated, \"I am the captain of my soul.\" This quote is from the poem 'Invictus' by William Ernest Henley, which Mandela recited to other prisoners while he was incarcerated. Mandela became an icon of the decolonization movement in Africa, particularly in his home country of South Africa.",
    "year": "2023"
  },
  {
    "number": "549",
    "text": "The Mfecane was primarily driven by",
    "options": {
      "A": "Famine and drought",
      "B": "Intertribal conflicts and population movements",
      "C": "European colonial expansion",
      "D": "Arab slave trade"
    },
    "answer_url": "https://myschool.ng/classroom/history/68526?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "The Mfecane, which translates to 'The Crushing' in Zulu, was a period of widespread chaos and warfare among indigenous ethnic communities in southern Africa during the period between 1815 and about 1840. It was primarily driven by intertribal conflicts and population movements.",
    "year": "2023"
  },
  {
    "number": "550",
    "text": "What was the political structure of the Nupe Kingdom during this period?",
    "options": {
      "A": "Feudal system",
      "B": "Absolute monarchy",
      "C": "Tribal confederation",
      "D": "Parliamentary democracy"
    },
    "answer_url": "https://myschool.ng/classroom/history/68527?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "The Nupe Kingdom was traditionally ruled by an Etsu, or king, making it an absolute monarchy. In this system, the king has complete power and authority over the state and its people.",
    "year": "2023"
  },
  {
    "number": "551",
    "text": "What was the primary economic activity of the Nupe people during this period?",
    "options": {
      "A": "Hunting",
      "B": "Farming",
      "C": "Fishing",
      "D": "Trading"
    },
    "answer_url": "https://myschool.ng/classroom/history/68528?exam_type=jamb&type=obj&page=111",
    "correct_answer": "B",
    "explanation": "In this century, farming was predominant.",
    "year": "2023"
  },
  {
    "number": "552",
    "text": "How did the amalgamation affect the traditional political systems in Nigeria?",
    "options": {
      "A": "It had no impact on the traditional systems",
      "B": "It abolished the traditional systems",
      "C": "It strengthened the traditional systems",
      "D": "It led to the formation of a new political system"
    },
    "answer_url": "https://myschool.ng/classroom/history/68529?exam_type=jamb&type=obj&page=111",
    "correct_answer": "D",
    "explanation": "The amalgamation of Nigeria in 1914 by Lord Lugard led to the formation of a new political system. It brought together the Northern and Southern Protectorates and the Colony of Lagos under a single administration, creating a political entity and system that was different from the traditional systems.",
    "year": "2023"
  },
  {
    "number": "553",
    "text": "Which of the following was a significant effect of colonial education in Nigeria?",
    "options": {
      "A": "Elimination of traditional educational systems",
      "B": "Fostering unity among various ethnic groups",
      "C": "Limited access to education for the masses",
      "D": "Preservation of indigenous languages and cultures"
    },
    "answer_url": "https://myschool.ng/classroom/history/68530?exam_type=jamb&type=obj&page=111",
    "correct_answer": "C",
    "explanation": "One significant effect of colonial education in Nigeria was the limited access to education for the masses. The colonial education system was designed to serve the interests of the colonial powers and was not widely accessible to the general population. It was mainly focused on providing basic literacy skills and training in trades and professions that served the colonial administration.",
    "year": "2023"
  },
  {
    "number": "554",
    "text": "Which external influence contributed to the spread of the Bantu language in the Nigeria area?",
    "options": {
      "A": "Nok civilization",
      "B": "Egyptian traders",
      "C": "Phoenician explorers",
      "D": "Arab merchants"
    },
    "answer_url": "https://myschool.ng/classroom/history/68531?exam_type=jamb&type=obj&page=111",
    "correct_answer": "D",
    "explanation": "The interaction with Arab merchants was an external factor that influenced.",
    "year": "2023"
  },
  {
    "number": "555",
    "text": "Which Christian missionary is known for translating the Bible into several indigenous Liberian languages?",
    "options": {
      "A": "Edward Blyden",
      "B": "Samuel Ajayi Crowther",
      "C": "Mary Slessor",
      "D": "Lott Cary"
    },
    "answer_url": "https://myschool.ng/classroom/history/68532?exam_type=jamb&type=obj&page=111",
    "correct_answer": "B",
    "explanation": "Samuel Ajayi Crowther is known for translating the Bible into several indigenous Liberian languages. He was a linguist and the first African Anglican bishop in Nigeria. His work in translation was significant in the spread of Christianity in West Africa.",
    "year": "2023"
  },
  {
    "number": "556",
    "text": "Which major international power supported Biafra during the Civil War?",
    "options": {
      "A": "France",
      "B": "China",
      "C": "United Kingdom",
      "D": "United States"
    },
    "answer_url": "https://myschool.ng/classroom/history/68533?exam_type=jamb&type=obj&page=112",
    "correct_answer": "A",
    "explanation": "During the Biafra Civil War, France was the major international power that supported Biafra.",
    "year": "2023"
  },
  {
    "number": "557",
    "text": "How did Ethiopia's defeat of Italian forces at the Battle of Adwa impact the Pan-African movement?",
    "options": {
      "A": "It inspired other African nations to join the movement",
      "B": "It encouraged African diaspora communities to return to Africa",
      "C": "It led to the formation of the African Union",
      "D": "It accelerated the end of colonialism in Africa"
    },
    "answer_url": "https://myschool.ng/classroom/history/68534?exam_type=jamb&type=obj&page=112",
    "correct_answer": "A",
    "explanation": "Ethiopia's defeat of Italian forces at the Battle of Adwa in 1896 had a significant impact on the Pan-African movement. It inspired other African nations to resist colonial rule and join the movement for independence and self-determination.",
    "year": "2023"
  },
  {
    "number": "558",
    "text": "The \"Magna Carta,\" signed in 1215, limited the power of which monarch?",
    "options": {
      "A": "King Louis XIV of France",
      "B": "King Henry VIII of England",
      "C": "King John of England",
      "D": "Emperor Charlemagne of the Holy Roman Empire"
    },
    "answer_url": "https://myschool.ng/classroom/history/68535?exam_type=jamb&type=obj&page=112",
    "correct_answer": "C",
    "explanation": "The Magna Carta was signed by King John of England in 1215. It was a charter of liberties that required the King to proclaim certain liberties, and accept that his will was not arbitrary, effectively limiting his powers.",
    "year": "2023"
  },
  {
    "number": "559",
    "text": "Sierra Leone is home to a rich musical tradition, with one popular genre known as",
    "options": {
      "A": "Maringa",
      "B": "Reggae",
      "C": "Highlife",
      "D": "Salsa"
    },
    "answer_url": "https://myschool.ng/classroom/history/68536?exam_type=jamb&type=obj&page=112",
    "correct_answer": "A",
    "explanation": "The popular genre of music in Sierra Leone is known as 'Palm-wine' music or 'Maringa'.",
    "year": "2023"
  },
  {
    "number": "560",
    "text": "The Mahdiyya Movement began with the declaration of the Mahdi in what year?",
    "options": {
      "A": "1878",
      "B": "1882",
      "C": "1890",
      "D": "1885"
    },
    "answer_url": "https://myschool.ng/classroom/history/68537?exam_type=jamb&type=obj&page=112",
    "correct_answer": "D",
    "explanation": "The Mahdiyya Movement began with the declaration of the Mahdi in the year 1885. The Mahdiyya Movement was an Islamic revolt against the Egyptian military occupation of Sudan. It was led by Muhammad Ahmad bin Abd Allah, who declared himself the Mahdi, the prophesied redeemer of the Islamic faith, in 1881, but it wasn't until 1885 that the movement gained significant traction.",
    "year": "2023"
  },
  {
    "number": "561",
    "text": "How did the Murtala/Obasanjo regime handle the issue of minority rights and tensions among various ethnic groups?",
    "options": {
      "A": "Encouraging forced assimilation of minority cultures",
      "B": "Implementing a quota system in government employment and education",
      "C": "Imposing martial law in regions with conflicts",
      "D": "Granting autonomy to regions seeking independence"
    },
    "answer_url": "https://myschool.ng/classroom/history/68538?exam_type=jamb&type=obj&page=113",
    "correct_answer": "B",
    "explanation": "The Murtala/Obasanjo regime in Nigeria implemented a quota system in government employment and education to handle the issue of minority rights and tensions among various ethnic groups. This was done to ensure fair representation and equal opportunities for all ethnic groups in the country.",
    "year": "2023"
  },
  {
    "number": "562",
    "text": "Which region of Nigeria was known for its active involvement in long-distance trade during the pre-1800 period?",
    "options": {
      "A": "Sahara Desert",
      "B": "Niger Delta",
      "C": "Lake Chad Basin",
      "D": "Benue River Valley"
    },
    "answer_url": "https://myschool.ng/classroom/history/68539?exam_type=jamb&type=obj&page=113",
    "correct_answer": "B",
    "explanation": "The Niger Delta region of Nigeria was known for its active involvement in long-distance trade during the pre-1800 period. The region's location along the Niger River made it a hub for trade and commerce.",
    "year": "2023"
  },
  {
    "number": "563",
    "text": "The movement led by El Hadj Umar Tall in the 19th century aimed to create an Islamic state in",
    "options": {
      "A": "Senegal",
      "B": "Mali",
      "C": "Guinea",
      "D": "Mauritania"
    },
    "answer_url": "https://myschool.ng/classroom/history/68540?exam_type=jamb&type=obj&page=113",
    "correct_answer": "B",
    "explanation": "El Hadj Umar Tall was a West African political leader, Islamic scholar, and Tijani Sufi who founded a brief empire encompassing much of what is now Guinea, Senegal, and Mali in the 19th century. His movement aimed to create an Islamic state in Mali.",
    "year": "2023"
  },
  {
    "number": "564",
    "text": "Which international boycott significantly contributed to the end of apartheid in South Africa?",
    "options": {
      "A": "The Suez Canal Boycott",
      "B": "The Anti-Apartheid Boycott",
      "C": "The Boston Tea Party Boycott",
      "D": "The Montgomery Bus Boycott"
    },
    "answer_url": "https://myschool.ng/classroom/history/68541?exam_type=jamb&type=obj&page=113",
    "correct_answer": "B",
    "explanation": "The Anti-Apartheid Boycott significantly contributed to the end of apartheid in South Africa. This international movement was initiated in response to the policy of apartheid and involved numerous boycotts and sanctions against South Africa. These actions were instrumental in putting pressure on the South African government to end apartheid.",
    "year": "2023"
  },
  {
    "number": "565",
    "text": "In which year did Nigeria host the Commonwealth Heads of Government Meeting (CHOGM)?",
    "options": {
      "A": "1999",
      "B": "2013",
      "C": "2007",
      "D": "2003"
    },
    "answer_url": "https://myschool.ng/classroom/history/68542?exam_type=jamb&type=obj&page=113",
    "correct_answer": "D",
    "explanation": "Nigeria hosted the Commonwealth Heads of Government Meeting (CHOGM) in the year 2003. CHOGM is a biennial summit meeting of the heads of government from all Commonwealth nations. Every two years the meeting is held in a different member state, and is chaired by that nation's respective Prime Minister or President who becomes the Commonwealth Chairperson-in-Office.",
    "year": "2023"
  },
  {
    "number": "566",
    "text": "The Omani influence in East Africa led to the growth of a distinct Swahili culture. What contributed to the development of this culture?",
    "options": {
      "A": "Chinese trade missions",
      "B": "Persian conquests",
      "C": "Indian migration",
      "D": "Portuguese colonization"
    },
    "answer_url": "https://myschool.ng/classroom/history/68543?exam_type=jamb&type=obj&page=114",
    "correct_answer": "B",
    "explanation": "The Omani influence in East Africa led to the growth of a distinct Swahili culture. This was largely due to Arab and Persian influences.",
    "year": "2023"
  },
  {
    "number": "567",
    "text": "What was the primary reason for the military takeover by the Abacha regime?",
    "options": {
      "A": "To implement economic reforms",
      "B": "To promote religious freedom",
      "C": "To restore democracy",
      "D": "To fight corruption"
    },
    "answer_url": "https://myschool.ng/classroom/history/68544?exam_type=jamb&type=obj&page=114",
    "correct_answer": "C",
    "explanation": "The primary reason for the military takeover by the Abacha regime was to restore democracy. This is a common reason given by military regimes when they seize power, often citing corruption, inefficiency, or instability in the existing democratic government. However, it's important to note that the actual outcomes of such takeovers often do not align with these stated goals.",
    "year": "2023"
  },
  {
    "number": "568",
    "text": "Which historical period is characterized by the emergence of written language and the invention of the wheel?",
    "options": {
      "A": "Bronze Age",
      "B": "Middle Ages",
      "C": "Stone Age",
      "D": "Neolithic Age"
    },
    "answer_url": "https://myschool.ng/classroom/history/68545?exam_type=jamb&type=obj&page=114",
    "correct_answer": "A",
    "explanation": "The Bronze Age is characterized by the emergence of written language and the invention of the wheel. This period marked the first time humans started to work with metal. Bronze tools and weapons, brick and stone buildings, and irrigation systems were new innovations of this period. The invention of the wheel is also attributed to this period.",
    "year": "2023"
  },
  {
    "number": "569",
    "text": "What was the purpose of the Pan-African Congresses that began in 1900?",
    "options": {
      "A": "To advocate for African colonization of Europe",
      "B": "To promote European imperialism in Africa",
      "C": "To discuss strategies for African independence and unity",
      "D": "To establish trade alliances with Asian countries"
    },
    "answer_url": "https://myschool.ng/classroom/history/68546?exam_type=jamb&type=obj&page=114",
    "correct_answer": "C",
    "explanation": "The Pan-African Congresses were a series of meetings held in the 20th century that aimed to address the issues facing Africa as a result of European colonization. The main purpose of these congresses was to discuss strategies for African independence and unity.",
    "year": "2023"
  },
  {
    "number": "570",
    "text": "The system of Government in the Sokoto Caliphate was",
    "options": {
      "A": "Democracy",
      "B": "Parliamentary",
      "C": "Totalitarianism",
      "D": "Communism"
    },
    "answer_url": "https://myschool.ng/classroom/history/68547?exam_type=jamb&type=obj&page=114",
    "correct_answer": "C",
    "explanation": "The system of Government in the Sokoto Caliphate was a form of Totalitarianism as the Emir was supreme.",
    "year": "2023"
  },
  {
    "number": "571",
    "text": "The first colonial capital of Nigeria was established in",
    "options": {
      "A": "Lagos",
      "B": "Port Harcourt",
      "C": "Calabar",
      "D": "Kano"
    },
    "answer_url": "https://myschool.ng/classroom/history/68548?exam_type=jamb&type=obj&page=115",
    "correct_answer": "C",
    "explanation": "The first colonial capital of Nigeria was established in Calabar. Calabar served as the first capital of Nigeria in the early stages of Nigeria's colonial period, before the capital was moved to Lagos.",
    "year": "2023"
  },
  {
    "number": "572",
    "text": "The Great Walls of Kano, ancient defensive walls, were built to protect the city from potential attacks in what century?",
    "options": {
      "A": "15th century",
      "B": "12th century",
      "C": "13th century",
      "D": "18th century"
    },
    "answer_url": "https://myschool.ng/classroom/history/68549?exam_type=jamb&type=obj&page=115",
    "correct_answer": "A",
    "explanation": "The Great Walls of Kano were defensive walls built to protect the city of Kano, in present-day Nigeria, from potential attacks. They were built in the 15th century.",
    "year": "2023"
  },
  {
    "number": "573",
    "text": "The Treaty of Nanjing, signed after the First Opium War, resulted in the cession of which territory to Great Britain?",
    "options": {
      "A": "Macau",
      "B": "Hong Kong",
      "C": "Taiwan",
      "D": "Shanghai"
    },
    "answer_url": "https://myschool.ng/classroom/history/68550?exam_type=jamb&type=obj&page=115",
    "correct_answer": "B",
    "explanation": "The Treaty of Nanjing, signed in 1842, ended the First Opium War between the United Kingdom and China. As a result of the treaty, China ceded the territory of Hong Kong to the British Empire.",
    "year": "2023"
  },
  {
    "number": "574",
    "text": "Which of the following trade commodities was highly sought after and contributed to the rise of several states in the Nigeria area up to 1800?",
    "options": {
      "A": "Ivory",
      "B": "Gold",
      "C": "Spices",
      "D": "Salt"
    },
    "answer_url": "https://myschool.ng/classroom/history/68551?exam_type=jamb&type=obj&page=115",
    "correct_answer": "D",
    "explanation": "Salt was a highly sought-after trade commodity that contributed to the rise of several states in the Nigeria area up to 1800. Salt was used as a medium of exchange in many parts of West Africa.",
    "year": "2023"
  },
  {
    "number": "575",
    "text": "Which event marked the rise of Mohammed Ali to power in Egypt?",
    "options": {
      "A": "The French Invasion of Egypt",
      "B": "The British Occupation of Egypt",
      "C": "The Mamluk Massacre",
      "D": "The Ottoman-Saudi War"
    },
    "answer_url": "https://myschool.ng/classroom/history/68552?exam_type=jamb&type=obj&page=115",
    "correct_answer": "C",
    "explanation": "Mohammed Ali came to power in Egypt following the Mamluk Massacre. The Mamluks were a military caste in Egypt, and their massacre by Mohammed Ali marked a significant shift in power.",
    "year": "2023"
  },
  {
    "number": "576",
    "text": "The Rwandan genocide in 1994 resulted in the mass killing of which ethnic group?",
    "options": {
      "A": "Zulus",
      "B": "Tutsis",
      "C": "Hutus",
      "D": "Bantus"
    },
    "answer_url": "https://myschool.ng/classroom/history/68553?exam_type=jamb&type=obj&page=116",
    "correct_answer": "B",
    "explanation": "The Rwandan genocide was a mass slaughter of Tutsi in Rwanda during the Rwandan Civil War, which had started in 1990. It is estimated that during the approximately 100-day period from April 7 to mid-July 1994, between 500,000 and 1,000,000 Tutsis were killed, constituting an estimated 70% of the Tutsi population.",
    "year": "2023"
  },
  {
    "number": "577",
    "text": "What event marked the official end of apartheid in South Africa?",
    "options": {
      "A": "The release of Nelson Mandela from prison",
      "B": "The signing of the Freedom Charter",
      "C": "The Sharpeville Massacre",
      "D": "The Truth and Reconciliation Commission hearings"
    },
    "answer_url": "https://myschool.ng/classroom/history/68554?exam_type=jamb&type=obj&page=116",
    "correct_answer": "A",
    "explanation": "The official end of apartheid in South Africa was marked by the release of Nelson Mandela from prison in 1990. This was followed by the negotiations that led to the end of the apartheid regime and the establishment of a democratic government in South Africa.",
    "year": "2023"
  },
  {
    "number": "578",
    "text": "The Richards Constitution of 1946 introduced the concept of regionalism in Nigeria, dividing the country into how many regions?",
    "options": {
      "A": "5",
      "B": "4",
      "C": "2",
      "D": "3"
    },
    "answer_url": "https://myschool.ng/classroom/history/68555?exam_type=jamb&type=obj&page=116",
    "correct_answer": "D",
    "explanation": "The Richards Constitution of 1946 introduced the concept of regionalism in Nigeria, dividing the country into three regions: Northern, Western, and Eastern. This was done to decentralize power and give more autonomy to the regions, which were largely divided along ethnic lines.",
    "year": "2023"
  },
  {
    "number": "579",
    "text": "During The Great Trek, the Boers clashed with which indigenous African groups?",
    "options": {
      "A": "Maasai and Kikuyu.",
      "B": "Zulu and Xhosa.",
      "C": "San and Khoikhoi.",
      "D": "Berber and Tuareg."
    },
    "answer_url": "https://myschool.ng/classroom/history/68556?exam_type=jamb&type=obj&page=116",
    "correct_answer": "B",
    "explanation": "During The Great Trek, the Boers, Dutch settlers in South Africa, clashed with the Zulu and Xhosa indigenous African groups. The Great Trek was a migration of Dutch-speaking colonists inland in South Africa in the 1830s.",
    "year": "2023"
  },
  {
    "number": "580",
    "text": "Who was the leader of the opposition in Nigeria during the Second Republic?",
    "options": {
      "A": "Abubakar Tafawa Balewa",
      "B": "Shehu Shagari",
      "C": "Obafemi Awolowo",
      "D": "Ahmadu Bello"
    },
    "answer_url": "https://myschool.ng/classroom/history/68557?exam_type=jamb&type=obj&page=116",
    "correct_answer": "C",
    "explanation": "During the Second Republic of Nigeria (1979-1983), the leader of the opposition was Chief Obafemi Awolowo. He was the leader of the Unity Party of Nigeria (UPN), which was one of the major opposition parties at the time.",
    "year": "2023"
  },
  {
    "number": "581",
    "text": "Muhammadu Buhari served as Nigeria's military head of state during which period?",
    "options": {
      "A": "1976-1979",
      "B": "2007-2010",
      "C": "1993-1998",
      "D": "1983-1985"
    },
    "answer_url": "https://myschool.ng/classroom/history/68558?exam_type=jamb&type=obj&page=117",
    "correct_answer": "D",
    "explanation": "Muhammadu Buhari served as Nigeria's military head of state from December 31, 1983, to August 27, 1985. This period is covered by the option '1983-1985'.",
    "year": "2023"
  },
  {
    "number": "582",
    "text": "The Efik Kingdom had a highly developed system of writing known as",
    "options": {
      "A": "Hieroglyphics",
      "B": "Cuneiform",
      "C": "Ajami",
      "D": "Nsibidi"
    },
    "answer_url": "https://myschool.ng/classroom/history/68559?exam_type=jamb&type=obj&page=117",
    "correct_answer": "D",
    "explanation": "The Efik Kingdom had a highly developed system of writing known as Nsibidi. Nsibidi is a system of symbols indigenous to what is now southeastern Nigeria that is apparently an ideographic script, though there have been suggestions that it includes logographic elements.",
    "year": "2023"
  },
  {
    "number": "583",
    "text": "The Oyo Empire reached its peak during the reign of which Alaafin?",
    "options": {
      "A": "Oba Ewuare",
      "B": "Oduduwa",
      "C": "Shango",
      "D": "Abiodun"
    },
    "answer_url": "https://myschool.ng/classroom/history/68560?exam_type=jamb&type=obj&page=117",
    "correct_answer": "D",
    "explanation": "The Oyo Empire reached its peak during the reign of Alaafin Abiodun. He was a ruler who expanded the empire to its greatest size and the empire enjoyed a period of peace and prosperity during his reign.",
    "year": "2023"
  },
  {
    "number": "584",
    "text": "Which initiative was launched by the Buhari administration to tackle corruption in Nigeria?",
    "options": {
      "A": "EFCC (Economic and Financial Crimes Commission)",
      "B": "Operation Python Dance",
      "C": "Operation Crocodile Smile",
      "D": "Operation Lafiya Dole"
    },
    "answer_url": "https://myschool.ng/classroom/history/68561?exam_type=jamb&type=obj&page=117",
    "correct_answer": "A",
    "explanation": "The Buhari administration launched the EFCC to tackle corruption in Nigeria.",
    "year": "2023"
  },
  {
    "number": "585",
    "text": "The Magna Carta, signed in 1215, is an important historical document that limited the power of which figure?",
    "options": {
      "A": "Kings and Monarchs",
      "B": "The Pope",
      "C": "Military Generals",
      "D": "Wealthy Merchants"
    },
    "answer_url": "https://myschool.ng/classroom/history/68562?exam_type=jamb&type=obj&page=117",
    "correct_answer": "A",
    "explanation": "The Magna Carta, signed in 1215, is an important historical document that limited the power of Kings and Monarchs. It was a charter of liberties to which the English barons forced King John to give his assent. It is widely viewed as one of the most important legal documents in the development of modern democracy.",
    "year": "2023"
  },
  {
    "number": "586",
    "text": "What contributed significantly to the rise of early states in Nigeria?",
    "options": {
      "A": "Industrial revolution",
      "B": "Arab trade routes",
      "C": "European colonization",
      "D": "Agricultural advancements"
    },
    "answer_url": "https://myschool.ng/classroom/history/68563?exam_type=jamb&type=obj&page=118",
    "correct_answer": "D",
    "explanation": "Agricultural advancements contributed significantly to the rise of early states in Nigeria. The development of farming led to economic growth and the formation of complex societies and states. It allowed for the production of surplus food, which could support a class of people who did not need to devote their lives to farming.",
    "year": "2023"
  }
]