[
  {
    "number": "2372",
    "text": "Which of the following is not emphasized in a product possibility curve?",
    "options": {
      "A": "Scarcity of resources",
      "B": "Unemployment of labour",
      "C": "Inefficiency in the use of resources",
      "D": "Economic development"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70851?exam_type=jamb&type=obj&page=475",
    "correct_answer": "D",
    "explanation": "A product possibility curve, also known as a production possibility frontier or curve, illustrates the different combinations of goods or services that an economy can produce given its available resources and technology. It shows the trade-off between producing one good/service over another.",
    "year": "2024"
  },
  {
    "number": "2373",
    "text": "Which of the following NOT among the objectives of OPEC?",
    "options": {
      "A": "to stabilize the price of oil in the world market",
      "B": "to established petroleum refineries in all member state",
      "C": "to stabilize the revenue from oil to producing countries",
      "D": "to make sure that oil flows to all the consuming countries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70852?exam_type=jamb&type=obj&page=475",
    "correct_answer": "B",
    "explanation": "OPEC, which stands for the Organization of the Petroleum Exporting Countries, is an intergovernmental organization consisting of major oil-producing countries. Its main objectives are to coordinate and unify the petroleum policies of its member countries and ensure the stabilization of oil markets. However, establishing petroleum refineries in member states is not one of OPEC's objectives.",
    "year": "2024"
  },
  {
    "number": "2374",
    "text": "A market situation with few sellers and many buyers is called",
    "options": {
      "A": "duopoly",
      "B": "Omonopoly",
      "C": "perfect competition",
      "D": "oligopoly"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70853?exam_type=jamb&type=obj&page=475",
    "correct_answer": "D",
    "explanation": "An oligopoly refers to a market situation where there are a few dominant sellers or firms operating in the market. These sellers have a substantial market share and can influence market conditions, including prices and competition. Oligopoly often involve intense competition among the few sellers.",
    "year": "2024"
  },
  {
    "number": "2375",
    "text": "MPC + MPS equals",
    "options": {
      "A": "Zero",
      "B": "Multiplier",
      "C": "One",
      "D": "APS"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70854?exam_type=jamb&type=obj&page=475",
    "correct_answer": "C",
    "explanation": "MPC (Marginal Propensity to Consume) and MPS (Marginal Propensity to Save) are two concepts used in economics to describe how individuals allocate their income between consumption and saving.MPC represents the proportion of an additional unit of income that is consumed rather than saved. MPS represents the proportion of an additional unit of income that is saved rather than consumed. Therefore, MPC + MPS represents the total proportion of an additional unit of income that is either consumed or saved.The sum of MPC and MPS is always equal to one, which means that every additional unit of income is either consumed o saved in its entirety. This is because income",
    "year": "2024"
  },
  {
    "number": "2376",
    "text": "Producers operating in a free market economy are more efficient as a result of",
    "options": {
      "A": "the existence of competition",
      "B": "government regulation of their activities",
      "C": "the very few number of participants",
      "D": "the commitment of the shareholders"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70855?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "In a free market economy, multiple producers are allowed to enter the market and compete with each other. This competition creates incentives for producers to become more efficient in order to gain a competitive advantage. When producers compete, they strive to offer better quality products, lower prices, and improved customer service. To achieve these goals, they need to find ways to reduce costs, increase productivity, and innovate. The pressure of competition encourages producers to constantly improve their efficiency to attract customers and maximize profits",
    "year": "2024"
  },
  {
    "number": "2377",
    "text": "In income determination theory, acceleration principles shows that",
    "options": {
      "A": "investment is the causes, while income is the effects",
      "B": "income and investment are both effects",
      "C": "incomes is of on effect on investment",
      "D": "income and investment are both causes"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70856?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "In income determination theory, the acceleration principle suggests that investment is the primary driver or cause, whil income is the resulting effect. The acceleration principle states that changes in investment levels lead to amplified or accelerated changes in income.The acceleration principle posits that changes in investment levels have a multiplier effect on income. When investment increases, it leads to increased production, employment, and income generation.",
    "year": "2024"
  },
  {
    "number": "2378",
    "text": "The largest component of national income in developing countries consist of",
    "options": {
      "A": "wages and salaries",
      "B": "rent",
      "C": "profit",
      "D": "profit and rent"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70857?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "The majority of the population in these countries is employed in labor-intensive sectors such as agriculture, manufacturing, and services. Wages and salaries earned by workers in these sectors form a significant portion of national income.It's important to note that the composition of national income can vary based on the specific characteristics of each country and its stage of development. However, in general, wages and salaries tend to be the largest component of national income in developing countries due to the prominence of labor-intensive sectors.",
    "year": "2024"
  },
  {
    "number": "2379",
    "text": "Holding money to take care of contingencies is",
    "options": {
      "A": "a precautionary motive",
      "B": "a transactions motive",
      "C": "an expansionary motive",
      "D": "a speculative motive"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70860?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "The precautionary motive refers to holding money as a precautionary measure to address uncertain future events or emergencies. It involves setting aside a portion of money for unexpected expenses, unforeseen circumstances, or contingencies that may arise. This motive emphasizes the need for a financial buffer to deal with unforeseen events and maintain financial stability.NOTE: Precautionary motive for holding money varies direct with the level of income",
    "year": "2024"
  },
  {
    "number": "2380",
    "text": "In the long-run, a firm must shut down if its average revenue is",
    "options": {
      "A": "greater than average cost",
      "B": "equal to the average cost",
      "C": "equal to the minimum average revenue is",
      "D": "less than average variable cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70861?exam_type=jamb&type=obj&page=476",
    "correct_answer": "D",
    "explanation": "If the firm's average revenue is less than average variable cost, it means the firm is not generating enough revenue to cover its variable costs, such as labor, raw materials, and other variable inputs. In this situation, the firm is incurring losses on each unit produced and sold. Continuing to operate would result in further losses, making it more economical viable for the firm to shut down in the long run.",
    "year": "2024"
  },
  {
    "number": "2381",
    "text": "The act of cultivating land and rearing of animal for man's use is",
    "options": {
      "A": "forestry",
      "B": "agriculture",
      "C": "mono culture",
      "D": "horticulture"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70862?exam_type=jamb&type=obj&page=477",
    "correct_answer": "B",
    "explanation": "Agriculture involves the cultivation of land to grow crops and the rearing of animals for various purposes such as food production, fiber, and other products. It encompasses activities such as preparing the soil, planting, harvesting, and raising livestock.",
    "year": "2024"
  },
  {
    "number": "2382",
    "text": "In the event of bankruptcy, owners of joint-stock companies lose",
    "options": {
      "A": "both company and private assets",
      "B": "only the capital invested",
      "C": "only their dividends",
      "D": "their private properties"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70863?exam_type=jamb&type=obj&page=477",
    "correct_answer": "B",
    "explanation": "In a joint-stock company, the owners (shareholders) invest their capital by purchasing shares of the company. If the company goes bankrupt, the owners may lose the value of their invested capital. They may not receive any return on their investment and could potentially lose the entire amount they invested in the company. However, their loss is limited to the capital they invested, and their personal assets are generally protected.",
    "year": "2024"
  },
  {
    "number": "2383",
    "text": "The main disadvantages of deflationary policies is",
    "options": {
      "A": "full employment in the country",
      "B": "increasing cost of living",
      "C": "unemployment in the country",
      "D": "improved standard of living"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70864?exam_type=jamb&type=obj&page=477",
    "correct_answer": "C",
    "explanation": "Deflationary policies, which often involve reducing aggregate demand through measures like fiscal austerity or monetar tightening, can lead to a decline in economic activity and a subsequent increase in unemployment. Reduced spending an investment can result in businesses cutting back on production and workforce, leading to higher unemployment rates",
    "year": "2024"
  },
  {
    "number": "2384",
    "text": "If government in a fiscal year has its revenue receipts less than the expenditure, such country is having",
    "options": {
      "A": "deficit budget",
      "B": "favorable budget",
      "C": "balanced budget",
      "D": "surplus budget"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70865?exam_type=jamb&type=obj&page=477",
    "correct_answer": "A",
    "explanation": "A deficit budget occurs when a government's expenditures exceed its revenue receipts in a fiscal year. It means that the government is spending more than it is earning, resulting in a budget deficit. Governments often resort to borrowing or other methods to finance the deficit.",
    "year": "2024"
  },
  {
    "number": "2385",
    "text": "A firm's average cost decreases in the long-run because of",
    "options": {
      "A": "increasing returns to scale",
      "B": "diminishing average returns",
      "C": "decreasing average fixed cost",
      "D": "decreasing marginal returns"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70866?exam_type=jamb&type=obj&page=477",
    "correct_answer": "A",
    "explanation": "Increasing returns to scale occur when a firm increases its inputs (such as labor and capital) in the production process, resulting in a more than proportionate increase in output. As a result, the firm experiences economies of scale, leading t a decrease in average cost. When the firm can produce more output with the same or lower cost per unit, the average cost decreases.",
    "year": "2024"
  },
  {
    "number": "2386",
    "text": "What is the median term in the distribution below; 14, 13 29,15,13,17,12.",
    "options": {
      "A": "14",
      "B": "13",
      "C": "15",
      "D": "12"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70867?exam_type=jamb&type=obj&page=478",
    "correct_answer": "A",
    "explanation": "Arranging the given numbers in ascending order: 12, 13, 13, 14, 15, 17, 29There are seven numbers in the distribution, so the middle term would be the fourth term since (7+1)/2 = 4th numberThe fourth term in the sorted distribution is 14.",
    "year": "2024"
  },
  {
    "number": "2387",
    "text": "The following are type of business organization EXCEPT",
    "options": {
      "A": "co-operative society",
      "B": "partnership",
      "C": "Entrepreneurship",
      "D": "public corporation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70868?exam_type=jamb&type=obj&page=478",
    "correct_answer": "C",
    "explanation": "Entrepreneurship is not a type of business organization but refers to the activity of starting and running a business. It is the process of identifying business opportunities, taking risks, and organizing resources to create and grow a business venture. Entrepreneurship can be associated with any type of business organization, such as sole proprietorship, partnership, or corporation.",
    "year": "2024"
  },
  {
    "number": "2388",
    "text": "From the diagram below, moving from point A to B and from B to c is due to",
    "options": {
      "A": "Economic depression",
      "B": "Unemployment",
      "C": "Economic growth",
      "D": "Opportunity cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70869?exam_type=jamb&type=obj&page=478",
    "correct_answer": "D",
    "explanation": "Opportunity cost is a key concept in economics that refers to the value of the next best alternative forgone when making a choice. It plays a significant role in determining the downward shift in the production possibilities curve (PPC).The PPC represents the different combinations of two goods or services that an economy can produce given its limited resources and technology. It illustrates the trade-offs that occur when resources are allocated between the production o different goods.When there is a downward shift or inward shift in the PPC, it indicates a decrease in the economy's productive capacity. This shift can be influenced by several factors, including changes in resource availability, technology, or the efficiency of resource allocation. However, opportunity cost can help explain how these factors lead to a downward shift.",
    "year": "2024"
  },
  {
    "number": "2389",
    "text": "The contribution of petroleum to the economy of Nigerian is most prominent in the area of",
    "options": {
      "A": "revenue generation",
      "B": "infrastructural development",
      "C": "fuel provision",
      "D": "employment generation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70870?exam_type=jamb&type=obj&page=478",
    "correct_answer": "A",
    "explanation": "The petroleum sector, particularly oil and gas production and exports, significantly contributes to revenue generation fo the Nigerian economy. Nigeria is one of the largest oil-producing countries in Africa and relies heavily on oil exports to generate revenue. Oil revenue plays a crucial role in government finances, budgetary allocations, and public spending on various sectors like education, healthcare, infrastructure, and social welfare programs.",
    "year": "2024"
  },
  {
    "number": "2390",
    "text": "Which of the following is NOT a feature of capitalism?",
    "options": {
      "A": "Free enterprise",
      "B": "private ownership of property",
      "C": "competition",
      "D": "detailed economics planning"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70871?exam_type=jamb&type=obj&page=478",
    "correct_answer": "D",
    "explanation": "Capitalism is an economic system characterized by several key features, such as free enterprise, competition, private ownership of property, and entrepreneurs pursuing profit. However, capitalism typically operates based on market force and decentralized decision-making, rather than relying on detailed economic planning by a central authority.",
    "year": "2024"
  },
  {
    "number": "2391",
    "text": "When an economy is having a balance of payment surplus the best alternative opened to it is to",
    "options": {
      "A": "devalue its currency",
      "B": "borrow from abroad",
      "C": "promote imports into the country",
      "D": "increase its foreign reserve"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70872?exam_type=jamb&type=obj&page=479",
    "correct_answer": "D",
    "explanation": "A balance of payment surplus means that the country's exports of goods, services, and capital exceed its imports. This leads to an inflow of foreign currency into the country.The surplus funds can be used to purchase foreign currencies and assets, thereby increasing the country's foreign reserve holdings. This can provide a cushion for the country in case of future economic uncertainties or can be used for strategic purposes such as stabilizing the exchange rate.",
    "year": "2024"
  },
  {
    "number": "2392",
    "text": "One of the function of united nation conference on trade and development (UNTAD) is to",
    "options": {
      "A": "transfer technology from developed to less developed countries",
      "B": "increase share of less developed countries in world trade",
      "C": "increase impact of developed countries over less developed countries",
      "D": "make goods available in developed countries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70873?exam_type=jamb&type=obj&page=479",
    "correct_answer": "A",
    "explanation": "The United Nations Conference on Trade and Development (UNCTAD) is a UN body that focuses on trade and development issues, particularly those affecting developing countries. One of the functions of UNCTAD is to facilitate the transfer of technology from developed to less developed countries. This involves promoting the dissemination and adoption of technology in less developed countries to enhance their productive capacities, economic growth, and development.UNCTAD recognizes that technology plays a crucial role in bridging the development gap between countries. By facilitating the transfer of technology, UNCTAD aims to enable developing countries to access and utilize advanced knowledge, skills, and technological innovations available in developed countries. This transfer of technology can occur through various means such as technical assistance, capacity building, knowledge sharing, and promoting partnerships between developed and developing countries.",
    "year": "2024"
  },
  {
    "number": "2393",
    "text": "Wholesalers play an important in the distribution of goods and services because they",
    "options": {
      "A": "are located very close to consumers",
      "B": "pass information on from retailers to consumers",
      "C": "sell in small units to consumers",
      "D": "finance both producers and retailers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70874?exam_type=jamb&type=obj&page=479",
    "correct_answer": "D",
    "explanation": "Wholesalers often provide financing to both producers and retailers. They offer credit facilities and trade financing options to producers, allowing them to maintain a steady production flow. Wholesalers also extend credit to retailers, enabling them to purchase goods in bulk and stock their inventory. By providing financing, wholesalers help facilitate th smooth flow of goods and services throughout the distribution chain.",
    "year": "2024"
  },
  {
    "number": "2394",
    "text": "Economics problems arise in all societies because",
    "options": {
      "A": "the services of economists are not employed",
      "B": "resource are not in adequate supply",
      "C": "there is no proper planning",
      "D": "resources are mismanaged by leaders"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70875?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "Economics problems arise in all societies due to the fundamental problem of scarcity. Scarcity means that resources are limited in comparison to unlimited wants and needs. This scarcity necessitates choices and trade-offs, leading to economic problems.",
    "year": "2024"
  },
  {
    "number": "2395",
    "text": "A downward sloping demand curve means that",
    "options": {
      "A": "price must be lowered to sell more",
      "B": "total revenue declines as price is lowered",
      "C": "demand falls as output increases",
      "D": "demand falls as output falls"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70876?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "When the price of a product decreases, consumers are generally willing to buy more of it. As a result, the quantity demanded increases. However, since each unit is sold at a lower price, the decline in price outweighs the increase in quantity, leading to a decrease in total revenue (total revenue = price x quantity). This is why a downward sloping demand curve indicates that the total revenue declines as the price is lowered.",
    "year": "2024"
  },
  {
    "number": "2396",
    "text": "The bank established to finances project aimed at promoting economic and social development within the African continent is",
    "options": {
      "A": "African bank for commerce and industry",
      "B": "economic bank for African",
      "C": "recovery fund bank for Africa",
      "D": "African development bank"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70878?exam_type=jamb&type=obj&page=480",
    "correct_answer": "D",
    "explanation": "The African Development Bank (AfDB) is the bank established to finance projects aimed at promoting economic and social development within the African continent. It was founded in 1964 and consists of 54 African member countries as well as 27 non-African countries. The AfDB's primary goal is to reduce poverty and improve living conditions by supporting various development projects and initiatives across Africa.",
    "year": "2024"
  },
  {
    "number": "2397",
    "text": "The diagram belwo, shows the relationship between",
    "options": {
      "A": "minimum wage and unemployment",
      "B": "equilibrium wage rate and philip curve",
      "C": "W4 and W3",
      "D": "wage rate and unemployment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70879?exam_type=jamb&type=obj&page=480",
    "correct_answer": "D",
    "explanation": "The Phillip curve is an economic concept that shows the inverse relationship between inflation and unemployment in the short run. It suggests that when unemployment is low, inflation tends to be high, and vice versa. The Phillip curve ca be used to understand the relationship between wage rate and unemployment in terms of inflationary pressures.",
    "year": "2024"
  },
  {
    "number": "2398",
    "text": "Which of these is NOT associated with the problem of internal trade?",
    "options": {
      "A": "bargaining",
      "B": "market trade unions",
      "C": "lack of specialization",
      "D": "natural barriers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70880?exam_type=jamb&type=obj&page=480",
    "correct_answer": "B",
    "explanation": "Market trade unions are not typically associated with the problem of internal trade. Trade unions are typically formed b workers or employees to protect their rights, negotiate better working conditions, and advocate for their interests. While trade unions can have an impact on labor markets and industrial relations, they are not directly linked to the challenges or problems specifically related to internal trade.",
    "year": "2024"
  },
  {
    "number": "2399",
    "text": "The middle value of an array figure arranged in descending order is referred to as the",
    "options": {
      "A": "Variance",
      "B": "mean",
      "C": "mode",
      "D": "median"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70881?exam_type=jamb&type=obj&page=480",
    "correct_answer": "D",
    "explanation": "The median is a measure of central tendency that represents the middle value of a dataset when arranged in either ascending or descending order. When the dataset is arranged in descending order, the middle value is the median. It divides the dataset into two equal halves, with half of the values above and half below the median.",
    "year": "2024"
  },
  {
    "number": "2400",
    "text": "An exceptional demand curve can result from",
    "options": {
      "A": "increase in price of raw materials",
      "B": "change in taste of consumer",
      "C": "increase in the size of the population",
      "D": "expectation of future price increase"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70882?exam_type=jamb&type=obj&page=480",
    "correct_answer": "B",
    "explanation": "An exceptional demand curve can result from a change in the taste of consumers. When there is a shift in consumer preferences or a change in their tastes, it can lead to a significant and sudden change in the demand for a particular product. This can result in an exceptional demand curve, where the quantity demanded at each price point differs significantly from the previous demand curve.For example, if a new trend or fashion becomes popular among consumers, the demand for related products may increas dramatically, causing an exceptional demand curve. Similarly, if there is a sudden decline in the popularity of a product due to changing tastes, it can result in an exceptional demand curve with lower quantities demanded at each price level.",
    "year": "2024"
  },
  {
    "number": "2401",
    "text": "If the prices of a commodity increases from N8.00 to N10.00 and the demand decreases from 100 to 80 respectively, wha is the price elasticity of demand for the commodity?",
    "options": {
      "A": "1",
      "B": "0.8",
      "C": "0.5",
      "D": "1.5"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70883?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "Price Elasticity of Demand = (Percentage Change in Quantity Demanded) / (Percentage Change in Price) x 100First, let's calculate the percentage change in quantity demanded:Percentage Change in Quantity Demanded = ((New Quantity Demanded - Initial Quantity Demanded) / Initial Quantity Demanded) x 100Percentage Change in Quantity Demanded = ((80 - 100) / 100) x 100= -20%Next, let's calculate the percentage change in price:Percentage Change in Price = ((New Price - Initial Price) / Initial Price) x 100Percentage Change in Price = ((10 - 8) / 8) x 100= 25%",
    "year": "2024"
  },
  {
    "number": "2402",
    "text": "A producer who can only influence the price of his product but canNOT determine the quantity to be sold is referred to\nas",
    "options": {
      "A": "duopoly",
      "B": "monopolist",
      "C": "monopsonist",
      "D": "oligopoly"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70884?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "A monopolist is a producer or seller who has exclusive control over the supply of a particular product or service in a market. They have the ability to influence the price of their product due to the absence of direct competition. However, monopolist does not have the ability to determine the quantity to be sold, as it depends on the demand for the product.",
    "year": "2024"
  },
  {
    "number": "2403",
    "text": "Which of the following is NOT a factor that brings about changes in demand?",
    "options": {
      "A": "the price of the good or service",
      "B": "a change in real income",
      "C": "government policy",
      "D": "increase in population"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70885?exam_type=jamb&type=obj&page=481",
    "correct_answer": "A",
    "explanation": "Changes in the price of a good or service do not bring about changes in demand; rather, they affect the quantity demanded. Changes in demand refer to shifts in the entire demand curve, which are caused by factors other than the price itself.",
    "year": "2024"
  },
  {
    "number": "2404",
    "text": "A price floor is usually fixed",
    "options": {
      "A": "above the equilibrium and causes surpluses",
      "B": "below the equilibrium and causes surpluses",
      "C": "above the equilibrium and causes shortage",
      "D": "at the equilibrium and causes no shortage"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70886?exam_type=jamb&type=obj&page=481",
    "correct_answer": "A",
    "explanation": "A price floor is typically fixed above the equilibrium price. By setting the price floor higher than the equilibrium, it creates a surplus or excess supply in the market. Producers are incentivized to increase their supply at the higher price, but consumers demand less at the inflated price. As a result, there is an imbalance in the market with a surplus of the product.The presence of surpluses created by the price floor can lead to various issues such as increased storage costs, wasted resources, and potential government interventions to address the surplus.",
    "year": "2024"
  },
  {
    "number": "2405",
    "text": "If the price of commodity X rises and consumers shift to commodity Y, then commodities X and Y are",
    "options": {
      "A": "inferior goods",
      "B": "substitutes",
      "C": "complements",
      "D": "bought together"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70887?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "Substitutes are goods that can be used in place of each other to satisfy a similar need or want. When the price of commodity X increases, consumers may find that commodity Y offers a comparable benefit at a lower cost, prompting them to switch their consumption from X to Y. The increase in the price of X leads to a higher demand for Y, indicating that the two commodities are substitutes.",
    "year": "2024"
  },
  {
    "number": "2406",
    "text": "The willingness of an individual backed up with purchasing power at a given time is",
    "options": {
      "A": "effective demand",
      "B": "demand",
      "C": "desire",
      "D": "utility"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70888?exam_type=jamb&type=obj&page=482",
    "correct_answer": "A",
    "explanation": "Effective demand refers to the willingness and ability of an individual or a group of individuals to purchase goods or services at a given time, backed up by their purchasing power. It combines both the desire or willingness to buy a product or service (demand) and the financial ability to make the purchase (purchasing power).",
    "year": "2024"
  },
  {
    "number": "2407",
    "text": "The formular used by the Expenditure approach to calculate National income is",
    "options": {
      "A": "Y=C+I+X-M-G",
      "B": "Y=C+I+G+X-M",
      "C": "Y=C+X-M-I+G",
      "D": "Y=C-I+X-M+G"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70889?exam_type=jamb&type=obj&page=482",
    "correct_answer": "B",
    "explanation": "The correct answer is Y = C + I +G+X - M.The formula used by the Expenditure approach to calculate National Income is often referred to as the GDP (Gross Domestic Product) formula. This formula measures the total expenditure or spending in an economy and is derived from the components of expenditure.",
    "year": "2024"
  },
  {
    "number": "2408",
    "text": "If the marginal utility of commodity is equal to its price, then",
    "options": {
      "A": "the market is not in equilibrium",
      "B": "more of the commodity can be consumed",
      "C": "total utility is also equal to its price",
      "D": "the consumer is in equilibrium"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70890?exam_type=jamb&type=obj&page=482",
    "correct_answer": "D",
    "explanation": "Consumer equilibrium is achieved when the marginal utility per unit of price is the same for all goods or commodities that the consumer is consuming. Marginal utility represents the additional satisfaction or benefit derived from consuming an additional unit of a good, while the price represents the cost of obtaining that unit. When the marginal utility of a commodity is equal to its price, it suggests that the consumer is allocating their budget in such a way that the last unit of the commodity provides the same level of satisfaction as its cost. This indicates that the consumer has optimized their consumption and is in equilibrium.",
    "year": "2024"
  },
  {
    "number": "2409",
    "text": "From the diagram below, the equilibrium wage rate is",
    "options": {
      "A": "L3",
      "B": "L2",
      "C": "W2",
      "D": "W1"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70891?exam_type=jamb&type=obj&page=482",
    "correct_answer": "C",
    "explanation": "The equilibrium wage rate is achieved when the demand for labour equals the supply of labour in a particular labour market. At this point, there is no excess demand or excess supply of labour, and the market is in balance.From the diagram above, the equilibrium wage rate is W2.",
    "year": "2024"
  },
  {
    "number": "2410",
    "text": "When combination of two goods which a consumer derive equal satisfaction is plotted on a graph, the graph is known as",
    "options": {
      "A": "opportunity curve",
      "B": "utility curve",
      "C": "demand curve",
      "D": "indifference curve"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70892?exam_type=jamb&type=obj&page=482",
    "correct_answer": "D",
    "explanation": "An indifference curve represents different combinations of two goods that yield the same level of utility or satisfaction for an individual consumer. It signifies that the consumer is indifferent or equally satisfied with any point along thecurve.",
    "year": "2024"
  },
  {
    "number": "2411",
    "text": "The comparison of the standard of living between Nigeria and Ghana is best down through the use of",
    "options": {
      "A": "gross National incomes",
      "B": "per capita income",
      "C": "Net National income",
      "D": "Net disposable income"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70893?exam_type=jamb&type=obj&page=483",
    "correct_answer": "B",
    "explanation": "Per capita income is calculated by dividing the total income of a country by its population. It provides an average measure of income per person in a country and is commonly used to compare the standard of living between different countries.",
    "year": "2024"
  },
  {
    "number": "2412",
    "text": "The formular (N + 1)/2 is used to determine the",
    "options": {
      "A": "median",
      "B": "mean",
      "C": "standard deviation",
      "D": "mode"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70894?exam_type=jamb&type=obj&page=483",
    "correct_answer": "A",
    "explanation": "The formula (N + 1)/2 is used to determine the median of a dataset. The median is the middle value in a set of ordered numbers. When the dataset has an odd number of values, the formula (N + 1)/2 helps identify the position of the median value.N represents the total number of values in the dataset. By adding 1 to N and dividing it by 2, we get the position of the median value within the ordered set.For example, if we have a dataset with 9 values, (N = 9), the position of the median would be (9 + 1)/2 = 10/2= 5.This means the fifth value in the ordered set would be the median.",
    "year": "2024"
  },
  {
    "number": "2413",
    "text": "If the standard deviation of a set of numbers is 3.6, what is the variance?",
    "options": {
      "A": "12.96",
      "B": "12.69",
      "C": "12.9",
      "D": "12.98"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70895?exam_type=jamb&type=obj&page=483",
    "correct_answer": "A",
    "explanation": "S.d = √vSquare both side:Variance = (So)2Variance = 3.62V = 3.6 x 3.6Variance = 12.96",
    "year": "2024"
  },
  {
    "number": "2414",
    "text": "The following will occur when maximum price is fixed below the free market price EXCEPT that",
    "options": {
      "A": "black market will be encouraged",
      "B": "excess demand will occur",
      "C": "excess supply will occur",
      "D": "rationing of commodities will occur"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70896?exam_type=jamb&type=obj&page=483",
    "correct_answer": "C",
    "explanation": "Maximum price is fixed above the equilibrium price to protect the consumers or the buyers. When the price is fixed below the equilibrium price, there will be excess demand over supply and it will lead to:- rationing- hoarding- black market- bribery and corruption",
    "year": "2024"
  },
  {
    "number": "2415",
    "text": "If the population of a school is 600 and 60% are In JSS, how many students are in SSS?",
    "options": {
      "A": "244",
      "B": "240",
      "C": "224",
      "D": "204"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70897?exam_type=jamb&type=obj&page=483",
    "correct_answer": "B",
    "explanation": "==Number of students in JSS = 60% of 600= 0.60 x 600 = 360Since the remaining students are in SSS, we can calculate the number of students in SSS: Number of students in SSS = Total school population - Number of students in JSS Number of students in SSS = 600 - 360= 240",
    "year": "2024"
  },
  {
    "number": "2416",
    "text": "The revolution of Cassava from ordinary food crop to export crop will lead to",
    "options": {
      "A": "increase in production of other crops",
      "B": "increase in the prices of cassava products",
      "C": "decrease in production of local starch",
      "D": "decrease In production of cassava"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70898?exam_type=jamb&type=obj&page=484",
    "correct_answer": "B",
    "explanation": "The recent revolution of cassava from an ordinary food crop to an export crop is likely to lead to an increase in the price of cassava products.When cassava transitions from being primarily used as a food crop to an export crop, its demand and value in the international market tend to increase. This increased demand can result in higher prices for cassava products such as cassava flour, starch, or other processed derivatives.",
    "year": "2024"
  },
  {
    "number": "2417",
    "text": "When the total product starts falling, then the marginal product is",
    "options": {
      "A": "increasing",
      "B": "maximum",
      "C": "zero",
      "D": "negative"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70899?exam_type=jamb&type=obj&page=484",
    "correct_answer": "D",
    "explanation": "The marginal product refers to the additional output produced when one additional unit of input is added while keeping other inputs constant. When the total product starts falling, it means that the additional units of input are contributing less to the overall output, resulting in a decrease in the total product.Since the marginal product is the change in total product divided by the change in input, a decrease in total product means the change in total product is negative. Therefore, the marginal product is negative when the total product is falling.",
    "year": "2024"
  },
  {
    "number": "2418",
    "text": "The following are the objectives of agricultural policies in Nigeria EXCEPT\nA. provision of food\nB. provision of agricultural raw materials to industrial sectors\nC. increasing prices of agricultural Inputs\nD. creation of rural employment",
    "options": {
      "A": "provision of agricultural raw materials to industrial sectors",
      "B": "creation of rural employment",
      "C": "provision of food",
      "D": "increasing prices of agricultural Inputs"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70900?exam_type=jamb&type=obj&page=484",
    "correct_answer": "D",
    "explanation": "The objectives are: provision of food, provision of agricultural raw materials to industrial sectors, creation of rural employment.However, increasing prices of agricultural inputs is not typically an objective of agricultural policies in Nigeria. Instead, policies often focus on measures to improve access to affordable agricultural inputs, such as seeds, fertilizers, and machinery, in order to support farmers and enhance productivity.",
    "year": "2024"
  },
  {
    "number": "2419",
    "text": "The following can be used to improve a country's balance of payment EXCEPT",
    "options": {
      "A": "anti-dumping policies",
      "B": "granting subsidies to export producers",
      "C": "decreasing taxation on personal income",
      "D": "increasing import duties"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70901?exam_type=jamb&type=obj&page=484",
    "correct_answer": "C",
    "explanation": "Decreasing taxation on personal income is not typically a measure used to directly improve a country's balance of payments. The balance of payments refers to the record of a country's transactions with the rest of the world, including trade in goods and services, financial transactions, and transfers.",
    "year": "2024"
  },
  {
    "number": "2420",
    "text": "In the equation Q = a - bp + e; Q and P are ... Variables respectively.",
    "options": {
      "A": "independent and dependent",
      "B": "dependent and independent",
      "C": "independent and constant",
      "D": "error term and independent"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70902?exam_type=jamb&type=obj&page=484",
    "correct_answer": "B",
    "explanation": "In the given equation, Q represents the dependent variable, which means it is the variable that is being explained or predicted based on the values of other variables. In this case, Q is the dependent variable because its value depends on the values of other variables in the equation.On the other hand, P represents the independent variable, which means it is the variable that is being manipulated or controlled and is expected to have an effect on the dependent variable. In this equation, P is the independent variable as its value can be changed or adjusted independently of other variables to observe its impact on Q.",
    "year": "2024"
  },
  {
    "number": "2421",
    "text": "Which of the following is NOT an objective of Economic planning?",
    "options": {
      "A": "Equitable allocation of resources",
      "B": "Widening the income gap",
      "C": "Achieving economic growth",
      "D": "Creating employment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70903?exam_type=jamb&type=obj&page=485",
    "correct_answer": "B",
    "explanation": "Widening the income gap is not an objective of economic planning. Economic planning typically aims to address socio- economic challenges and achieve certain developmental goals. Instead, economic planning often aims to reduce income inequalities and promote inclusive growth that benefits a broader segment of the population.",
    "year": "2024"
  },
  {
    "number": "2422",
    "text": "The following determine the level of consumption EXCEPT",
    "options": {
      "A": "level of income",
      "B": "the rate of taxes paid",
      "C": "savings",
      "D": "the political climate"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70904?exam_type=jamb&type=obj&page=485",
    "correct_answer": "D",
    "explanation": "The political climate is not typically considered a direct determinant of the level of consumption. The level of consumption is primarily influenced by factors such as the expectation of price changes, the level of income, savings, and the rate of taxes paid. These factors have a direct impact on individuals' purchasing power and their ability and willingness to consume goods and services.",
    "year": "2024"
  },
  {
    "number": "2423",
    "text": "The following are problems of development planning in Nigeria EXCEPT",
    "options": {
      "A": "inadequate capital",
      "B": "under-population",
      "C": "inadequate statistical data",
      "D": "poor implementation of economic planning"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70905?exam_type=jamb&type=obj&page=485",
    "correct_answer": "B",
    "explanation": "The problems of development planning in Nigeria include issues such as the death of skilled manpower, inadequate capital, inadequate statistical data, and poor implementation of economic planning. These factors can pose significant challenges to the planning and execution of development initiatives.However, under-population is not typically considered a problem of development planning in Nigeria. Nigeria is one of the most populous countries in the world, with a large and growing population. Overpopulation or population growth may present its own set of challenges, but it is not commonly listed as a problem in the context of development planning in the country.",
    "year": "2024"
  },
  {
    "number": "2424",
    "text": "The system of farming which involves the use of a large hectare of land planted with economic crops is known as",
    "options": {
      "A": "peasant farming",
      "B": "tree planting",
      "C": "plantation farming",
      "D": "mechanized farming"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70906?exam_type=jamb&type=obj&page=485",
    "correct_answer": "C",
    "explanation": "The system of farming that involves the use of a large hectare of land planted with economic crops is known as plantation farming. In this type of farming, a single crop or a limited number of crops are cultivated on a large-scale agricultural estate or plantation.Plantation farming typically involves the cultivation of crops such as tea, coffee, rubber, cocoa, sugarcane, palm oil, and various other cash crops. These crops are often grown for commercial purposes and are intended for sale in domestic or international markets.Plantation farming is characterized by large-scale operations, extensive land use, and the application of mechanization, modern agricultural techniques, and sometimes even labor-intensive practices. It often requires significant capital investment, specialized machinery, and a well-organized management structure.",
    "year": "2024"
  },
  {
    "number": "2425",
    "text": "At the equilibrium price,",
    "options": {
      "A": "demand equates supply",
      "B": "price is equal to demand only",
      "C": "demand is less than supply",
      "D": "demand is greater than supply"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70907?exam_type=jamb&type=obj&page=485",
    "correct_answer": "A",
    "explanation": "The equilibrium price is the price at which the quantity demanded by consumers equals the quantity supplied by producers in a market. It represents the point of balance between demand and supply.At the equilibrium price, the quantity that consumers are willing to buy (demand) matches the quantity that producers are willing to sell (supply). There is no shortage or surplus in the market because the quantity demanded and the quantity supplied are in equilibrium.",
    "year": "2024"
  },
  {
    "number": "2426",
    "text": "Which of the following is a disadvantage of localization of industries?",
    "options": {
      "A": "Creating structural unemployment",
      "B": "Reducing cost of production",
      "C": "Encouraging the growth of skilled labour",
      "D": "Encouraging subsidiary industries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70908?exam_type=jamb&type=obj&page=486",
    "correct_answer": "D",
    "explanation": "Localization of industries, also known as industrial clustering or agglomeration, refers to the concentration of similar industries or related businesses in a specific geographic area. While there are various advantages associated with localization, such as promoting knowledge spillovers, fostering collaboration, and enhancing economies of scale, it can also have disadvantages.One of the disadvantages is the creation of structural unemployment. When industries concentrate in a particular region job opportunities may become limited to that specific area. As a result, workers in other regions or industries may face challenges in finding employment, leading to structural unemployment. This can be particularly problematic if the localized industry experiences a decline or faces disruptions, resulting in job losses for a significant portion of the workforce.",
    "year": "2024"
  },
  {
    "number": "2427",
    "text": "Stock exchange market deals with",
    "options": {
      "A": "sales of second hand securities",
      "B": "sales of foreign exchange",
      "C": "exchange of stock fish for stock",
      "D": "exchange of treasury bills"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70909?exam_type=jamb&type=obj&page=486",
    "correct_answer": "A",
    "explanation": "The stock exchange market primarily deals with the sales of second-hand securities. It is a marketplace where individuals and institutions can buy and sell financial instruments, such as stocks, bonds, and derivatives.The stock exchange provides a platform for investors to trade securities issued by companies, government entities, or other organizations. It facilitates the buying and selling of these securities between investors, allowing them to participate in the ownership of companies or debt instruments.While the stock exchange market primarily focuses on the trading of stocks (equities), it also includes the trading of other securities such as bonds, mutual funds, exchange-traded funds (ETFs), options, and futures contracts.",
    "year": "2024"
  },
  {
    "number": "2428",
    "text": "Which of the following is NOT a major role of OPEC in production, and marketing of petroleum?",
    "options": {
      "A": "Stabilizing oil prices putting a production ceiling",
      "B": "Refining of petroleum products in member countries",
      "C": "Raising the revenue of member countries from oil through price increase",
      "D": "Ensuring efficient and regular supply of oil to the two market"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70910?exam_type=jamb&type=obj&page=486",
    "correct_answer": "B",
    "explanation": "The refining of petroleum products is not a major role of OPEC (Organization of the Petroleum Exporting Countries) in the production and marketing of petroleum. OPEC primarily focuses on coordinating and unifying petroleum policies among its member countries, ensuring the efficient and regular supply of oil to the global market, raising the revenue of member countries through price increases, and stabilizing oil prices.",
    "year": "2024"
  },
  {
    "number": "2429",
    "text": "The satisfaction derived from the consumption of a commodity is referred to as",
    "options": {
      "A": "consumption",
      "B": "production",
      "C": "utility",
      "D": "demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70911?exam_type=jamb&type=obj&page=486",
    "correct_answer": "C",
    "explanation": "Utility is the satisfaction a consumer derived from the consumption of a particular commodity. The types are: total, average and marginal utility.",
    "year": "2024"
  },
  {
    "number": "2430",
    "text": "An industry engaged in the extraction of raw materials and its conversion into semi-finished goods is called industry.",
    "options": {
      "A": "mining",
      "B": "manufacturing",
      "C": "processing",
      "D": "conversion"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70912?exam_type=jamb&type=obj&page=486",
    "correct_answer": "C",
    "explanation": "Processing involves transforming raw materials or inputs into more refined or semi-finished products. This can include various stages of production, such as refining, manufacturing, assembly, or other forms of processing.The processing industry plays a vital role in taking raw materials from their natural state and converting them into products that can be used for further processing or consumed by end-users. This industry typically adds value to the rav materials by applying different processes, technologies, and expertise.NOTE: Although manufacturing is involved in the production of goods, it does not specifically address the extraction of raw materials. Manufacturing encompasses a broader range of industries involved in producing finished goods from raw materials, components, or parts.",
    "year": "2024"
  },
  {
    "number": "2431",
    "text": "An industry operating in a perfect competitive market situation will maximum profit when",
    "options": {
      "A": "DD < SS",
      "B": "MC > AC",
      "C": "MC = MR",
      "D": "MC < AR"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70913?exam_type=jamb&type=obj&page=487",
    "correct_answer": "C",
    "explanation": "In perfect competition, a firm's marginal cost (MC) represents the additional cost incurred by producing one more unit output, while marginal revenue (MR) represents the additional revenue generated from selling one more unit of output. To maximize profit, a firm in a perfectly competitive market will produce at the quantity where marginal cost equals marginal revenue.When MC is less than MR (MC < MR), producing an additional unit of output will generate more revenue than the cost incurred, indicating that increasing production is profitable. Conversely, when MC is greater than MR (MC > MR), producing an additional unit of output would result in higher costs than the revenue generated, leading to a decrease in profit. The profit is maximized at the quantity where MC is equal to MR.",
    "year": "2024"
  },
  {
    "number": "2432",
    "text": "Which of the following is NOT a function of marketing boards in Nigeria?",
    "options": {
      "A": "Grading of farm produce",
      "B": "Importation of farm produce",
      "C": "Fixing of prices for farm produce",
      "D": "Marketing of farm produce"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70914?exam_type=jamb&type=obj&page=487",
    "correct_answer": "B",
    "explanation": "Marketing boards in Nigeria typically perform various functions related to the marketing and distribution of agricultura products. However, importation of farm produce is not a function usually associated with marketing boards in Nigeria.Importation is typically managed by relevant government agencies responsible for trade and import policies, such as customs authorities or specialized trade departments.",
    "year": "2024"
  },
  {
    "number": "2433",
    "text": "Persistent fall In the general price level is known as",
    "options": {
      "A": "deflation",
      "B": "devaluation",
      "C": "general price Increase",
      "D": "inflation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70915?exam_type=jamb&type=obj&page=487",
    "correct_answer": "A",
    "explanation": "Deflation refers to a persistent fall in the general price level of goods and services in an economy over a period of time. I means that, on average, prices are decreasing, and the purchasing power of money is increasing. Deflation can occur due to factors such as a decrease in the money supply, lower production costs, or reduced consumer demand.",
    "year": "2024"
  },
  {
    "number": "2434",
    "text": "Which of the following will NOT bring about an increase in Labour force?",
    "options": {
      "A": "Decrease in death rate",
      "B": "Better medical services",
      "C": "Immigration",
      "D": "Emigration"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70916?exam_type=jamb&type=obj&page=487",
    "correct_answer": "D",
    "explanation": "Emigration refers to the act of leaving one's own country to permanently settle in another country. It typically involves individuals moving out of a particular country. Therefore, emigration would not bring about an increase in the labor force of the country from which people are emigrating.",
    "year": "2024"
  },
  {
    "number": "2435",
    "text": "The diagram below represent",
    "options": {
      "A": "Business cycle",
      "B": "National income",
      "C": "Inflationary gap",
      "D": "Circular flow of income"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70917?exam_type=jamb&type=obj&page=487",
    "correct_answer": "D",
    "explanation": "The diagram represents the circular flow of a two sector economy which represent firms (Business sector) and Household (Private sector).",
    "year": "2024"
  },
  {
    "number": "2436",
    "text": "What add funds to the circular flow?",
    "options": {
      "A": "Expenditure approach",
      "B": "withdrawal",
      "C": "leakages",
      "D": "injection"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70918?exam_type=jamb&type=obj&page=488",
    "correct_answer": "D",
    "explanation": "Injection refers to the economic activities that add fund or tend to increase planned aggregate demand, e.g. Investment, government spending, export etc.NOTE: Leakages also known as withdrawal and it refers to the out flow of the income or amount which reduces the amount of planned spending on domestic goods and service, e.g. savings, taxes, import etc.",
    "year": "2024"
  },
  {
    "number": "2437",
    "text": "Economic problem arises as a result of",
    "options": {
      "A": "money cost",
      "B": "opportunity cost",
      "C": "choice",
      "D": "scarcity"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70919?exam_type=jamb&type=obj&page=488",
    "correct_answer": "D",
    "explanation": "The economic problem arises as a result of scarcity. Scarcity refers to the condition where unlimited wants and needs exceed the limited resources available to fulfill them. In other words, resources such as land, labor, capital, and entrepreneurship are limited in comparison to the infinite desires and needs of individuals and society.Because of scarcity, individuals, businesses, and societies must make choices about how to allocate their limited resources efficiently. This leads to the economic problem, which involves determining what to produce, how to produce it, and for whom to produce it.",
    "year": "2024"
  },
  {
    "number": "2438",
    "text": "The following are rewards for factors of production EXCEPT",
    "options": {
      "A": "profit",
      "B": "rent",
      "C": "interest",
      "D": "subsidy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70920?exam_type=jamb&type=obj&page=488",
    "correct_answer": "D",
    "explanation": "Factors of production are the resources or inputs used in the production process, including land, labor, capital, and entrepreneurship. Each factor receives a specific reward or payment for its contribution to the production process. The rewards for factors of production are as follows: Rent, Wages (Salaries), Interest and Profit",
    "year": "2024"
  },
  {
    "number": "2439",
    "text": "When an increase in the price of a commodity lead to a fall In the demand for another, the demand for the two commodities are said to be",
    "options": {
      "A": "competitive",
      "B": "joint",
      "C": "composite",
      "D": "derived"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70921?exam_type=jamb&type=obj&page=488",
    "correct_answer": "B",
    "explanation": "Joint demand refers to goods that are typically consumed together. If the price of one increases, it can lead to a decrease in demand for the complementary good. E.g., the increase in the price of cream (a complementary good) leads to a fall in the demand for coffee,",
    "year": "2024"
  },
  {
    "number": "2440",
    "text": "Which of the following is NOT a function of the IMF?",
    "options": {
      "A": "Providing financial aid to members experiencing balance of payment difficulties",
      "B": "Promoting international monetary cooperation",
      "C": "Exchange rate stabilization",
      "D": "assisting member countries in printing and issuing their currency"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70922?exam_type=jamb&type=obj&page=488",
    "correct_answer": "D",
    "explanation": "Assisting member countries in printing and issuing their currency is not a function of the International Monetary Fund (IMF). The IMF focuses on promoting international monetary cooperation, exchange rate stabilization, providing financial aid to countries with balance of payment difficulties, and serving as a clearing house for member countries.",
    "year": "2024"
  },
  {
    "number": "2441",
    "text": "Which of the following is NOT included in-measuring the National income through the income approach?",
    "options": {
      "A": "profit earned by NITEL plc",
      "B": "Profit earned by Nigerian bottling company plc",
      "C": "Income earned by a bricklayer",
      "D": "Allowance given to an aged mother by a civil servant"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70923?exam_type=jamb&type=obj&page=489",
    "correct_answer": "D",
    "explanation": "The income approach is one of the methods used to measure national income, which calculates national income by summing up all the incomes earned by different factors of production within an economy. However, the allowance given to an aged mother by a civil servant would not be included in the measurement of national income through the income approach.The income approach typically includes the following components:-Wages and salaries earned by individuals, such as the income earned by a bricklayer and the salary earned by a doctor. - Profits earned by businesses, such as the profit earned by Nigerian Bottling Company Plc and NITEL Plc.- Rent earned from the use of property and land.- Interest earned on savings and investments.Allowances given to individuals by civil servants, is not considered as part of national income because they do not represent income generated from production or factor inputs within the economy.",
    "year": "2024"
  },
  {
    "number": "2442",
    "text": "If two bags of rice were sold for #1,250 a month ago and two weeks later, the same amount was used to procure one bag. This simply means that the value of money is",
    "options": {
      "A": "constant",
      "B": "fluctuating",
      "C": "increasing",
      "D": "decreasing"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70979?exam_type=jamb&type=obj&page=489",
    "correct_answer": "D",
    "explanation": "In this scenario, the price of rice has increased relative to the amount of money (N1,250) that could be used to purchase it. Initially, N1,250 could buy two bags of rice, but after two weeks, the same amount can only buy one bag.This decrease in purchasing power demonstrates that the value of money has declined. In other words, the same amount of money can now buy fewer goods or services than before. This situation is often referred to as inflation, where the general price level of goods and services rises over time, reducing the purchasing power of money.",
    "year": "2024"
  },
  {
    "number": "2443",
    "text": "The demand for factors of production is said to be",
    "options": {
      "A": "joint",
      "B": "complementary",
      "C": "derived",
      "D": "composite"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70980?exam_type=jamb&type=obj&page=489",
    "correct_answer": "C",
    "explanation": "The concept of derived demand refers to the demand for a factor of production, such as labour or capital, that is derived from the demand for the final goods or services that the factor helps to produce. In other words, the demand for factors of production is derived from the demand for the products that require those factors.For example, the demand for labour in the construction industry is derived from the demand for new houses or building: If there is an increase in the demand for housing, it will lead to an increase in the demand for construction workers.",
    "year": "2024"
  },
  {
    "number": "2444",
    "text": "The trade-off between two commodities along the Production Possibility Curve (PPC) shows",
    "options": {
      "A": "transferable output",
      "B": "unattainable combination",
      "C": "scarcity principle",
      "D": "opportunity cost principle"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70981?exam_type=jamb&type=obj&page=489",
    "correct_answer": "D",
    "explanation": "The Production Possibility Curve represents the various combinations of two goods or commodities that can be produced with limited resources and technology. It reflects the trade-offs a society or individual faces when allocating resources between different goods or activities.As you move along the PPC, producing more of one commodity requires sacrificing the production of the other commodity. This trade-off is known as the opportunity cost. The opportunity cost is the value of the next best alternative foregone when a choice is made.For example, if an economy decides to produce more consumer goods, it must allocate fewer resources to producing capital goods. The opportunity cost of producing more consumer goods is the foregone production of capital goods.",
    "year": "2024"
  },
  {
    "number": "2445",
    "text": "A major characteristics of a firm operating at a long-run equilibrium position is that",
    "options": {
      "A": "average variable cost is fixed",
      "B": "all costs can be varied",
      "C": "only variable cost changes",
      "D": "fixed cost can not be changed"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70982?exam_type=jamb&type=obj&page=489",
    "correct_answer": "B",
    "explanation": "A major characteristic of a firm operating at a long-run equilibrium position is that all costs can be varied. In the long run, a firm has flexibility in adjusting its inputs and production level to optimize its operations.In the long run, a firm can make adjustments to various factors of production, such as labor, capital, and technology. This flexibility allows the firm to change its costs according to the desired level of output. Fixed costs, such as rent for a facility, can be adjusted by choosing a different location or size of the facility. Variable costs, such as raw materials and labor, can also be adjusted by changing the quantity of inputs used.",
    "year": "2024"
  },
  {
    "number": "2446",
    "text": "An economy in which decision of what to produce is taken partly by private individuals and state is referred to as Economy.",
    "options": {
      "A": "communist",
      "B": "mixed",
      "C": "socialist",
      "D": "capitalist"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70983?exam_type=jamb&type=obj&page=490",
    "correct_answer": "B",
    "explanation": "A mixed economy is an economic system that incorporates elements of both capitalism and socialism. In a mixed economy, the decision of what to produce is taken partly by private individuals and partly by the state or government. This means that there is a combination of privately-owned businesses and government intervention in economic activities.",
    "year": "2024"
  },
  {
    "number": "2447",
    "text": "Which of the following is NOT associated with minimum price legislation?",
    "options": {
      "A": "wastages of resources",
      "B": "excess supply",
      "C": "excess demand",
      "D": "unemployment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70984?exam_type=jamb&type=obj&page=490",
    "correct_answer": "C",
    "explanation": "Minimum price legislation, also known as price floors, is a form of government intervention that establishes a legally mandated minimum price for a particular good or service. The purpose is to ensure that producers receive a certain level of income or to protect certain industries. The effects are:a. Excess supply over demandb. Inflationary result from price increasec. A waste of perishable products occurd. Unemployment will result from excess supply of laboure. Inefficiency in the use of production resources",
    "year": "2024"
  },
  {
    "number": "2448",
    "text": "Which of the following is the correct order in the chain of distribution?",
    "options": {
      "A": "Consumer -> Distributor → Retailer → Producer",
      "B": "Producer → Wholesaler → Retailer → Consumer",
      "C": "Retailer → Consumer → Producer → Wholesaler",
      "D": "Producer → Consumer → Retailer → Wholesaler"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70985?exam_type=jamb&type=obj&page=490",
    "correct_answer": "B",
    "explanation": "The correct order in the chain of distribution is: Producer → Wholesaler → Retailer → Consumer.In this distribution chain, the products or goods flow from the producer to the wholesaler, then to the retailer, and finally to the consumer.",
    "year": "2024"
  },
  {
    "number": "2449",
    "text": "The problem of \"how to produce\" in any economy is solved by",
    "options": {
      "A": "combining capital and labour intensive methods of production",
      "B": "adopting the least cost method of production",
      "C": "using capital intensive method of production",
      "D": "employing the services of a manager"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70986?exam_type=jamb&type=obj&page=490",
    "correct_answer": "B",
    "explanation": "The problem of \"how to produce\" in any economy refers to the decision of choosing the most efficient and effective methods of production. This decision involves considering factors such as the available resources, technology, and the desired level of output. The goal is to minimize costs while maximizing productivity.",
    "year": "2024"
  },
  {
    "number": "2450",
    "text": "Under perfect competition, a profit maximizing firm will hire labour up to the point where the last unit of labor adds",
    "options": {
      "A": "less to TR as to TC",
      "B": "as much to TR as to TC",
      "C": "more to TC than to TR",
      "D": "less to TC than to TR"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70987?exam_type=jamb&type=obj&page=490",
    "correct_answer": "D",
    "explanation": "Under perfect competition, a profit-maximizing firm will hire labor up to the point where the marginal revenue product of labor (MRP) is equal to the wage rate. MRP represents the additional revenue generated by adding one more unit of labor.Since the firm aims to maximize profits, it will continue hiring labor until the MRP is greater than or equal to the wage rate. At this point, the last unit of labor hired contributes more to total revenue than to total cost, resulting in increased profits for the firm.",
    "year": "2024"
  },
  {
    "number": "2451",
    "text": "The use of tax and expenditure policy to regulate the economy is known as",
    "options": {
      "A": "monetary policy",
      "B": "physical measures",
      "C": "deregulation",
      "D": "fiscal policy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/70988?exam_type=jamb&type=obj&page=491",
    "correct_answer": "D",
    "explanation": "Fiscal policy refers to the use of government spending and taxation to influence the overall economy. It involves the use of taxes and government expenditures to stabilize the economy, promote economic growth, control inflation, and manage other macroeconomic objectives. Fiscal policy can be expansionary (increasing government spending and/or reducing taxes) or contractionary (reducing government spending and/or increasing taxes) based on the economic conditions and policy goals.",
    "year": "2024"
  }
]