[
  {
    "number": "587",
    "text": "What was a significant change introduced by the Shehus in the administration of Borno?",
    "options": {
      "A": "Centralization of the military",
      "B": "Abolition of the slave trade",
      "C": "Introduction of Sharia law",
      "D": "Conversion to Christianity"
    },
    "answer_url": "https://myschool.ng/classroom/history/71099?exam_type=jamb&type=obj&page=118",
    "correct_answer": "A",
    "explanation": "The significant change introduced by the Shehus in the administration of Borno was the centralization of the military. This helped in strengthening the control and power of the Shehus over the region. The correct option that matches this answer is 'Centralization of the military'.",
    "year": "2024"
  },
  {
    "number": "588",
    "text": "The elective principle introduced by the Clifford Constitution allowed for elections in which Nigerian cities?",
    "options": {
      "A": "Lagos and Kano",
      "B": "Lagos and Enugu",
      "C": "Lagos and Calabar",
      "D": "Lagos and Ibadan"
    },
    "answer_url": "https://myschool.ng/classroom/history/71100?exam_type=jamb&type=obj&page=118",
    "correct_answer": "C",
    "explanation": "The elective principle introduced by the Clifford Constitution allowed for elections in Lagos and Calabar.",
    "year": "2024"
  },
  {
    "number": "589",
    "text": "The primary role of the Executive Council in colonial Nigeria was to",
    "options": {
      "A": "Oversee the judiciary",
      "B": "Manage local government affairs",
      "C": "Advise the Governor-General on policy matters",
      "D": "Draft laws for the Legislative Council to pass"
    },
    "answer_url": "https://myschool.ng/classroom/history/71101?exam_type=jamb&type=obj&page=118",
    "correct_answer": "C",
    "explanation": "The correct answer is Advise the Governor-General on policy matters. The primary role of the Executive Council in colonial Nigeria was to advise the Governor-General on policy matters and assist in the administration of the colony.",
    "year": "2024"
  },
  {
    "number": "590",
    "text": "Indirect rule was most successful in",
    "options": {
      "A": "Eastern Nigeria",
      "B": "Northern Nigeria",
      "C": "Southern Nigeria",
      "D": "The Niger Delta region"
    },
    "answer_url": "https://myschool.ng/classroom/history/71102?exam_type=jamb&type=obj&page=118",
    "correct_answer": "B",
    "explanation": "Indirect rule was most successful in Northern Nigeria. This region had a pre-existing system of administration that aligned well with the principles of indirect rule, making it easier for the British colonial authorities to govern through local traditional rulers.",
    "year": "2024"
  },
  {
    "number": "591",
    "text": "Nigeria's involvement in which UN agency has been crucial in addressing global health issues?",
    "options": {
      "A": "ILO",
      "B": "WHO",
      "C": "UNESCO",
      "D": "FAO"
    },
    "answer_url": "https://myschool.ng/classroom/history/71103?exam_type=jamb&type=obj&page=119",
    "correct_answer": "B",
    "explanation": "Nigeria's involvement in the World Health Organization (WHO) has been crucial in addressing global health issues. WHCis a specialized agency of the United Nations responsible for international public health.",
    "year": "2024"
  },
  {
    "number": "592",
    "text": "The Abacha regime is known for instituting which economic policy aimed at centralizing control of Nigeria's oil revenue?",
    "options": {
      "A": "Structural Adjustment Program (SAP)",
      "B": "Green Revolution",
      "C": "Petroleum Trust Fund (PTF)",
      "D": "National Economic Empowerment and Development Strategy (NEEDS)"
    },
    "answer_url": "https://myschool.ng/classroom/history/71104?exam_type=jamb&type=obj&page=119",
    "correct_answer": "C",
    "explanation": "The economic policy known for centralizing control of Nigeria's oil revenue during the Abacha regime was the 'Petroleum Trust Fund (PTF)', which aimed at managing and distributing oil revenues for developmental projects.",
    "year": "2024"
  },
  {
    "number": "593",
    "text": "Which Christian missionary is credited with the translation of the Bible into Yoruba?",
    "options": {
      "A": "James Johnson",
      "B": "Samuel Ajayi Crowther",
      "C": "Henry Venn",
      "D": "Thomas Birch Freeman"
    },
    "answer_url": "https://myschool.ng/classroom/history/71105?exam_type=jamb&type=obj&page=119",
    "correct_answer": "B",
    "explanation": "The correct answer is Samuel Ajayi Crowther. He is credited with the translation of the Bible into Yoruba. Samuel Ajayi Crowther was a Yoruba ex-slave who became the first African Anglican bishop in Nigeria and played a significant role in the translation of the Bible into Yoruba language.",
    "year": "2024"
  },
  {
    "number": "594",
    "text": "One major effect of the establishment of Native Authorities was",
    "options": {
      "A": "The empowerment of traditional rulers within the colonial administration",
      "B": "The abolition of all traditional customs",
      "C": "The weakening of traditional power structures",
      "D": "The immediate modernization of local governance"
    },
    "answer_url": "https://myschool.ng/classroom/history/71106?exam_type=jamb&type=obj&page=119",
    "correct_answer": "A",
    "explanation": "The correct answer is The empowerment of traditional rulers within the colonial administration. One major effect of the establishment of Native Authorities was the empowerment of traditional rulers within the colonial administration, giving them some authority in local governance.",
    "year": "2024"
  },
  {
    "number": "595",
    "text": "The rise of the Kingdom of Ashanti was primarily driven by the trade of which commodity?",
    "options": {
      "A": "Salt",
      "B": "Ivory",
      "C": "Spices",
      "D": "Gold"
    },
    "answer_url": "https://myschool.ng/classroom/history/71107?exam_type=jamb&type=obj&page=119",
    "correct_answer": "D",
    "explanation": "The rise of the Kingdom of Ashanti was primarily driven by the trade of Gold. Gold was a significant commodity in the region and played a crucial role in the economic development and power of the Ashanti Kingdom.",
    "year": "2024"
  },
  {
    "number": "596",
    "text": "The primary goal of early Christian missionaries in Nigeria was to",
    "options": {
      "A": "Promote Western fashion",
      "B": "Establish trade routes",
      "C": "Spread Christianity and convert the local population",
      "D": "Gain political control"
    },
    "answer_url": "https://myschool.ng/classroom/history/71108?exam_type=jamb&type=obj&page=120",
    "correct_answer": "C",
    "explanation": "The correct answer is Spread Christianity and convert the local population. The primary goal of early Christian missionaries in Nigeria was to spread Christianity and convert the local population to the Christian faith.",
    "year": "2024"
  },
  {
    "number": "597",
    "text": "Benin's military campaigns often targeted which neighboring ethnic group?",
    "options": {
      "A": "The Hausa",
      "B": "The Yoruba",
      "C": "The Nupe",
      "D": "The Igbo"
    },
    "answer_url": "https://myschool.ng/classroom/history/71109?exam_type=jamb&type=obj&page=120",
    "correct_answer": "B",
    "explanation": "Benin's military campaigns often targeted The Yoruba ethnic group. This is historically accurate as the Benin Empire engaged in military conflicts with neighboring groups, including the Yoruba.",
    "year": "2024"
  },
  {
    "number": "598",
    "text": "The Battle of Blood River in 1838 was fought between the Boers and which indigenous group?",
    "options": {
      "A": "The Ndebele",
      "B": "The Sotho",
      "C": "The Zulus",
      "D": "The Xhosas"
    },
    "answer_url": "https://myschool.ng/classroom/history/71110?exam_type=jamb&type=obj&page=120",
    "correct_answer": "C",
    "explanation": "The Battle of Blood River in 1838 was fought between the Boers and the Zulus.",
    "year": "2024"
  },
  {
    "number": "599",
    "text": "The amalgamation of 1914 resulted in the creation of",
    "options": {
      "A": "unified legal system for all of Nigeria",
      "B": "The establishment of regional governments",
      "C": "A new capital at Lagos",
      "D": "Separate administrative structures for North and South"
    },
    "answer_url": "https://myschool.ng/classroom/history/71111?exam_type=jamb&type=obj&page=120",
    "correct_answer": "D",
    "explanation": "The amalgamation of 1914 resulted in the creation of separate administrative structures for North and South. It led to the unification of the Northern and Southern Protectorates of Nigeria, creating distinct administrative regions.",
    "year": "2024"
  },
  {
    "number": "600",
    "text": "The Nupe kingdom reached its peak under the leadership of which notable ruler?",
    "options": {
      "A": "Etsu Aliyu",
      "B": "Etsu Mamudu",
      "C": "Etsu Tsoede",
      "D": "Etsu Abubakar"
    },
    "answer_url": "https://myschool.ng/classroom/history/71112?exam_type=jamb&type=obj&page=120",
    "correct_answer": "B",
    "explanation": "The Nupe Kingdom reached its peak under the leadership of Etsu (King) Mamudu. He was a significant ruler in the 19th century, known for consolidating power, expanding the kingdom, and making the Nupe a dominant force in the region. Etsu Mamudu strengthened the military and administration, contributing to the kingdom's prosperity and influence during his reign.",
    "year": "2024"
  },
  {
    "number": "601",
    "text": "Which policy implemented by the British in the 1930s aimed at developing infrastructure and boosting agriculture in Nigeria?",
    "options": {
      "A": "The Colonial Development and Welfare Act",
      "B": "The Northern Nigerian Development Plan",
      "C": "The Nigerian Industrial Development Plan"
    },
    "answer_url": "https://myschool.ng/classroom/history/71113?exam_type=jamb&type=obj&page=121",
    "correct_answer": "A",
    "explanation": "The policy implemented by the British in the 1930s aimed at developing infrastructure and boosting agriculture in Nigeria was The Colonial Development and Welfare Act. This act focused on improving the economic and social conditions in British colonies, including Nigeria.",
    "year": "2024"
  },
  {
    "number": "602",
    "text": "Which ancient civilization built the Great Zimbabwe?",
    "options": {
      "A": "The Swahili",
      "B": "The Mutapa",
      "C": "The Zulu",
      "D": "The Shona"
    },
    "answer_url": "https://myschool.ng/classroom/history/71114?exam_type=jamb&type=obj&page=121",
    "correct_answer": "D",
    "explanation": "The Great Zimbabwe was built by the Shona civilization. The correct option that matches this answer is \"The Shona'. The Shona people constructed the Great Zimbabwe, which was a significant ancient city and a UNESCO World Heritage Site.",
    "year": "2024"
  },
  {
    "number": "603",
    "text": "The rise of nationalist movements in Nigeria was significantly influenced by",
    "options": {
      "A": "The spread of Islam",
      "B": "World War II and the Atlantic Charter",
      "C": "The Berlin Conference of 1884-1885",
      "D": "The American Civil War"
    },
    "answer_url": "https://myschool.ng/classroom/history/71115?exam_type=jamb&type=obj&page=121",
    "correct_answer": "B",
    "explanation": "The correct answer is World War II and the Atlantic Charter. The rise of nationalist movements in Nigeria was significantly influenced by the experiences of Nigerians who fought in World War II and the principles of self- determination outlined in the Atlantic Charter.",
    "year": "2024"
  },
  {
    "number": "604",
    "text": "Which Omani Sultan moved the capital from Muscat to Zanzibar in the 19th century?",
    "options": {
      "A": "Khalid bin Barghash",
      "B": "Sa'id bin Sultan",
      "C": "Thuwaini bin Said",
      "D": "Sultan bin Saif"
    },
    "answer_url": "https://myschool.ng/classroom/history/71116?exam_type=jamb&type=obj&page=121",
    "correct_answer": "B",
    "explanation": "The Omani Sultan who moved the capital from Muscat to Zanzibar in the 19th century was Seyyid Said, also known as Sa'id bin Sultan.",
    "year": "2024"
  },
  {
    "number": "605",
    "text": "Which of the following best describes the main cause of the Mfecane?",
    "options": {
      "A": "The spread of Christianity",
      "B": "Competition over scarce resources",
      "C": "European colonization",
      "D": "Internal trade disputes"
    },
    "answer_url": "https://myschool.ng/classroom/history/71117?exam_type=jamb&type=obj&page=121",
    "correct_answer": "B",
    "explanation": "The correct answer is Competition over scarce resources. The main cause of the Mfecane was competition over scarce resources among various Nguni groups in southern Africa. This led to widespread warfare, displacement of populations, and social upheaval in the early 19th century.",
    "year": "2024"
  },
  {
    "number": "606",
    "text": "The Yoruba city-state of Ibadan rose to prominence in the 19th century primarily due to",
    "options": {
      "A": "Its role as a center of education",
      "B": "Its location on major trade routes",
      "C": "The military prowess of its leaders",
      "D": "The discovery of gold"
    },
    "answer_url": "https://myschool.ng/classroom/history/71118?exam_type=jamb&type=obj&page=122",
    "correct_answer": "C",
    "explanation": "The Yoruba city-state of Ibadan rose to prominence in the 19th century primarily due to the military prowess of its leaders. Ibadan became a dominant force in the Yoruba region through its military strength and strategic alliances, rather than its location, gold, or education.",
    "year": "2024"
  },
  {
    "number": "607",
    "text": "The primary economic activity that drew Europeans to Nigeria in the early period was",
    "options": {
      "A": "The transatlantic slave trade",
      "B": "Agricultural exports",
      "C": "Agricultural exports",
      "D": "Textile manufacturing"
    },
    "answer_url": "https://myschool.ng/classroom/history/71119?exam_type=jamb&type=obj&page=122",
    "correct_answer": "A",
    "explanation": "The primary economic activity that drew Europeans to Nigeria in the early period was the transatlantic slave trade. This trade involved the forced transportation of African people to the Americas for labor, which was a significant economic activity at that time.",
    "year": "2024"
  },
  {
    "number": "608",
    "text": "The capital of the Kanem-Borno Empire moved from Kanem to Borno primarily due to",
    "options": {
      "A": "Environmental changes",
      "B": "Religious differences",
      "C": "External invasions",
      "D": "Internal conflicts"
    },
    "answer_url": "https://myschool.ng/classroom/history/71120?exam_type=jamb&type=obj&page=122",
    "correct_answer": "A",
    "explanation": "The correct answer is Environmental changes. The capital of the Kanem-Borno Empire moved from Kanem to Borno primarily due to environmental changes. Borno had better access to water and was more suitable for agriculture compared to Kanem, which suffered from environmental degradation.",
    "year": "2024"
  },
  {
    "number": "609",
    "text": "One of the key factors that led to military intervention in Nigeria's First Republic was",
    "options": {
      "A": "Widespread corruption and political instability",
      "B": "External military threats",
      "C": "The refusal of political leaders to implement Western education",
      "D": "The lack of interest in independence"
    },
    "answer_url": "https://myschool.ng/classroom/history/71121?exam_type=jamb&type=obj&page=122",
    "correct_answer": "A",
    "explanation": "The correct answer is Widespread corruption and political instability. One of the key factors that led to military intervention in Nigeria's First Republic was the widespread corruption and political instability that undermined the democratic process.",
    "year": "2024"
  },
  {
    "number": "610",
    "text": "Which of these leaders succeeded Usman dan Fodio as the head of the Sokoto Caliphate?",
    "options": {
      "A": "Umar Tall",
      "B": "Al-Kanemi",
      "D": "Muhammad al-Amin"
    },
    "answer_url": "https://myschool.ng/classroom/history/71122?exam_type=jamb&type=obj&page=122",
    "correct_answer": "B",
    "explanation": "Muhammadu Bello succeeded Usman dan Fodio as the head of the Sokoto Caliphate. He was one of the prominent leader:of the Fulani Jihad and played a key role in the administration of the caliphate.",
    "year": "2024"
  },
  {
    "number": "611",
    "text": "The Pan-African Congress of 1945, which called for an end to colonial rule in Africa, was held in which city?",
    "options": {
      "A": "Accra",
      "B": "Paris",
      "C": "London",
      "D": "Manchester"
    },
    "answer_url": "https://myschool.ng/classroom/history/71123?exam_type=jamb&type=obj&page=123",
    "correct_answer": "C",
    "explanation": "The Pan-African Congress of 1945, which called for an end to colonial rule in Africa, was held in Manchester. The correct option that matches this answer is 'London'. The congress was held in Manchester, England, and was attended by various African leaders and activists advocating for independence and self-governance.",
    "year": "2024"
  },
  {
    "number": "612",
    "text": "The Mahdiyya Movement in Sudan was primarily a response to",
    "options": {
      "A": "Egyptian and Ottoman control",
      "B": "British colonial rule",
      "C": "French influence in North Africa",
      "D": "The spread of Christianity"
    },
    "answer_url": "https://myschool.ng/classroom/history/71124?exam_type=jamb&type=obj&page=123",
    "correct_answer": "A",
    "explanation": "The Mahdiyya Movement in Sudan was primarily a response to Egyptian and Ottoman control. This movement was led by Muhammad Ahmad, who claimed to be the Mahdi, a messianic figure in Islam, and sought to overthrow the Egyptian- Ottoman rule in Sudan.",
    "year": "2024"
  },
  {
    "number": "613",
    "text": "Which Islamic reform leader established the Massina Empire in present-day Mali?",
    "options": {
      "A": "Ahmad Lobbo",
      "B": "Al-Hajj Umar Tal",
      "C": "Usman dan Fodio",
      "D": "Muhammad Bello"
    },
    "answer_url": "https://myschool.ng/classroom/history/71125?exam_type=jamb&type=obj&page=123",
    "correct_answer": "A",
    "explanation": "The Islamic reform leader who established the Massina Empire in present-day Mali was Seku Amadu (Sheikh Amadu Lobbo). He founded the empire in the early 19th century (1818) as part of a larger Islamic reform movement in West Africa aimed at establishing a theocratic state based on Islamic law (Sharia).",
    "year": "2024"
  },
  {
    "number": "614",
    "text": "Which of the following was a significant factor in the rise of Nigerian nationalism in the early 20th century?",
    "options": {
      "A": "The Atlantic Charter of 1941",
      "B": "The British colonial policy of assimilation",
      "C": "The introduction of indirect rule",
      "D": "The Berlin Conference of 1884-1885"
    },
    "answer_url": "https://myschool.ng/classroom/history/71126?exam_type=jamb&type=obj&page=123",
    "correct_answer": "C",
    "explanation": "The rise of Nigerian nationalism in the early 20th century was significantly influenced by the introduction of indirect rule. Indirect rule system allowed for the preservation of traditional institutions and authority, which in turn led to the emergence of nationalist movements seeking self-governance within the colonial structure.",
    "year": "2024"
  },
  {
    "number": "615",
    "text": "What significant development in Benin's political structure occurred during the reign of Oba Ewedo?",
    "options": {
      "A": "The establishment of a centralized monarchy",
      "B": "The introduction of the use of cowries as currency",
      "C": "The division of the kingdom into administrative units",
      "D": "The establishment of trade relations with the Portuguese"
    },
    "answer_url": "https://myschool.ng/classroom/history/71127?exam_type=jamb&type=obj&page=123",
    "correct_answer": "A",
    "explanation": "The correct development was the establishment of a hereditary/centralized monarchy.",
    "year": "2024"
  },
  {
    "number": "616",
    "text": "Which constitution laid the foundation for federalism in Nigeria?",
    "options": {
      "A": "Clifford Constitution of 1922",
      "B": "Lyttleton Constitution of 1954",
      "C": "Macpherson Constitution of 1951",
      "D": "Richards Constitution of 1946"
    },
    "answer_url": "https://myschool.ng/classroom/history/71128?exam_type=jamb&type=obj&page=124",
    "correct_answer": "B",
    "explanation": "The Lyttleton Constitution of 1954 laid the foundation for federalism in Nigeria. This constitution established a federal system of government in Nigeria, dividing powers between the central government and regional governments, which is a key aspect of federalism.",
    "year": "2024"
  },
  {
    "number": "617",
    "text": "The invasion by which group significantly contributed to the fall of the Old Oyo Empire?",
    "options": {
      "A": "The Nupe",
      "B": "The Benin",
      "C": "The Hausa",
      "D": "The Fulani"
    },
    "answer_url": "https://myschool.ng/classroom/history/71129?exam_type=jamb&type=obj&page=124",
    "correct_answer": "D",
    "explanation": "The invasion by the Fulani significantly contributed to the fall of the Old Oyo Empire. The Fulani Jihad led by Usman dan Fodio weakened the empire and eventually led to its collapse.",
    "year": "2024"
  },
  {
    "number": "618",
    "text": "Which of the following cash crops became highly significant in Nigeria during the colonial period?",
    "options": {
      "A": "Rice",
      "B": "Millet",
      "C": "Maize",
      "D": "Cocoa"
    },
    "answer_url": "https://myschool.ng/classroom/history/71130?exam_type=jamb&type=obj&page=124",
    "correct_answer": "D",
    "explanation": "The correct answer is Cocoa. Cocoa became highly significant in Nigeria during the colonial period due to its economic importance and the establishment of cocoa plantations by the colonial powers.",
    "year": "2024"
  },
  {
    "number": "619",
    "text": "Which Nigerian leader led the resistance against British colonization in the Aba Women's War of 1929?",
    "options": {
      "A": "Funmilayo Ransome-Kuti",
      "B": "Ikonna Nwanyi",
      "C": "Madam Tinubu",
      "D": "Nana of Itsekiri"
    },
    "answer_url": "https://myschool.ng/classroom/history/71131?exam_type=jamb&type=obj&page=124",
    "correct_answer": "A",
    "explanation": "Funmilayo Ransome-Kuti led the resistance against British colonization in the Aba Women's War of 1929. She was a prominent Nigerian activist and played a significant role in the women's movement in Nigeria.",
    "year": "2024"
  },
  {
    "number": "620",
    "text": "Which economic factor was a major influence behind the 1914 amalgamation?",
    "options": {
      "A": "The financial deficits in Northern Nigeria",
      "B": "The need to control oil resources",
      "C": "The desire to unify currency systems",
      "D": "The expansion of railway networks"
    },
    "answer_url": "https://myschool.ng/classroom/history/71132?exam_type=jamb&type=obj&page=124",
    "correct_answer": "C",
    "explanation": "The desire to unify currency systems was a major economic factor behind the 1914 amalgamation of Nigeria. The British colonial administration aimed to streamline economic policies and governance by unifying the currency systems in the region.",
    "year": "2024"
  },
  {
    "number": "621",
    "text": "Mohammad Ali Pasha is often referred to as the \"founder of modern Egypt\" due to his reforms in which sectors?",
    "options": {
      "A": "Religion, trade, and healthcare",
      "B": "Military, education, and agriculture",
      "C": "Art, architecture, and governance",
      "D": "Industrialization, law, and literature"
    },
    "answer_url": "https://myschool.ng/classroom/history/71133?exam_type=jamb&type=obj&page=125",
    "correct_answer": "B",
    "explanation": "Mohammad Ali Pasha is often referred to as the 'founder of modern Egypt' due to his reforms in military, education, and agriculture sectors. The correct option that matches this answer is 'Military, education, and agriculture'. Mohammad Ali Pasha implemented significant reforms in these sectors, modernizing Egypt and laying the foundation for its development.",
    "year": "2024"
  },
  {
    "number": "622",
    "text": "The creation of the Mid-Western Region in 1963 was primarily a response to",
    "options": {
      "A": "The demands of the minority groups in the Niger Delta",
      "B": "Ethnic tensions in the Western Region",
      "C": "The growing influence of the NCNC",
      "D": "The secessionist threats from Biafra"
    },
    "answer_url": "https://myschool.ng/classroom/history/71134?exam_type=jamb&type=obj&page=125",
    "correct_answer": "A",
    "explanation": "The correct answer is The demands of the minority groups in the Niger Delta. The creation of the Mid-Western Region ir 1963 was primarily a response to the demands of the minority groups in the Niger Delta who sought more autonomy an representation in the Nigerian political structure.",
    "year": "2024"
  },
  {
    "number": "623",
    "text": "Which of the following Yoruba states rose to prominence as a result of the decline of Oyo?",
    "options": {
      "A": "Egba",
      "B": "Ibadan",
      "C": "Ife",
      "D": "Ijebu"
    },
    "answer_url": "https://myschool.ng/classroom/history/71135?exam_type=jamb&type=obj&page=125",
    "correct_answer": "B",
    "explanation": "The Yoruba state that rose to prominence as a result of the decline of Oyo was Ibadan. After the decline of the Oyo Empire, Ibadan emerged as a powerful Yoruba city-state in the 19th century.",
    "year": "2024"
  },
  {
    "number": "624",
    "text": "Which treaty did Menelik II reject, leading to the Italian invasion and the subsequent Battle of Adwa?",
    "options": {
      "A": "Treaty of Addis Ababa",
      "B": "Treaty of Ucciali",
      "C": "Treaty of Algiers",
      "D": "Treaty of Wuchale"
    },
    "answer_url": "https://myschool.ng/classroom/history/71136?exam_type=jamb&type=obj&page=125",
    "correct_answer": "D",
    "explanation": "The correct treaty that Menelik II rejected was the Treaty of Wuchale, which led to the Italian invasion and the Battle of Adwa.",
    "year": "2024"
  },
  {
    "number": "625",
    "text": "The fall of which kingdom marked a significant milestone in the British conquest of the Nigerian area?",
    "options": {
      "A": "Benin Kingdom in 1897",
      "B": "Sokoto Caliphate in 1903",
      "C": "Kanem-Bornu Empire in 1914",
      "D": "Oyo Empire in 1825"
    },
    "answer_url": "https://myschool.ng/classroom/history/71137?exam_type=jamb&type=obj&page=125",
    "correct_answer": "A",
    "explanation": "The correct answer is Benin Kingdom in 1897. The fall of the Benin Kingdom marked a significant milestone in the British conquest of the Nigerian area as it led to the British annexation of Benin and the looting of valuable artifacts.",
    "year": "2024"
  },
  {
    "number": "626",
    "text": "The Sharpeville Massacre of 1960 was a turning point in the struggle against apartheid because it led to",
    "options": {
      "A": "Increased support for apartheid policies",
      "B": "The banning of the African National Congress (ANC) and Pan Africanist Congress (PAC)",
      "C": "International recognition of South Africa's independence",
      "D": "The immediate end of apartheid"
    },
    "answer_url": "https://myschool.ng/classroom/history/71138?exam_type=jamb&type=obj&page=126",
    "correct_answer": "A",
    "explanation": "The correct answer is Increased support for apartheid policies. The Sharpeville Massacre of 1960, where 69 people were killed by police during a peaceful protest, led to increased international condemnation of apartheid policies andincreased support for the anti-apartheid movement.",
    "year": "2024"
  },
  {
    "number": "627",
    "text": "Which principle was established at the Berlin Conference to justify European claims to African territories?",
    "options": {
      "A": "The Monroe Doctrine",
      "B": "Effective occupation",
      "C": "Terra nullius",
      "D": "The Treaty of Tordesillas"
    },
    "answer_url": "https://myschool.ng/classroom/history/71149?exam_type=jamb&type=obj&page=126",
    "correct_answer": "B",
    "explanation": "The principle established at the Berlin Conference to justify European claims to African territories was 'Effective occupation.' This principle required European powers to demonstrate effective control over a territory to legitimize their claims, regardless of prior African ownership or sovereignty.",
    "year": "2024"
  },
  {
    "number": "628",
    "text": "The Cuban Missile Crisis of 1962 brought the world to the brink of nuclear war. It was a standoff between which two superpowers?",
    "options": {
      "A": "The United Kingdom and the Soviet Union",
      "B": "The Soviet Union and NATO",
      "C": "The United States and the Soviet Union",
      "D": "The United States and China"
    },
    "answer_url": "https://myschool.ng/classroom/history/71150?exam_type=jamb&type=obj&page=126",
    "correct_answer": "C",
    "explanation": "The Cuban Missile Crisis of 1962 was a standoff between the United States and the Soviet Union. The crisis was a result of the placement of Soviet nuclear missiles in Cuba, which was seen as a direct threat to the United States.",
    "year": "2024"
  },
  {
    "number": "629",
    "text": "The humanitarian crisis during the Nigerian Civil War was exacerbated by",
    "options": {
      "A": "The intervention of foreign mercenaries",
      "B": "The destruction of infrastructure by the Biafran forces",
      "C": "International sanctions against Nigeria",
      "D": "A blockade imposed by the Nigerian government on Biafra"
    },
    "answer_url": "https://myschool.ng/classroom/history/71151?exam_type=jamb&type=obj&page=126",
    "correct_answer": "D",
    "explanation": "The humanitarian crisis during the Nigerian Civil War was exacerbated by a blockade imposed by the Nigerian government on Biafra. The blockade led to severe food and medical shortages in Biafra, worsening the already dire humanitarian situation during the conflict.",
    "year": "2024"
  },
  {
    "number": "630",
    "text": "The introduction of the 1946 Richards Constitution in Nigeria was significant because",
    "options": {
      "A": "It established a federal system with equal representation for all ethnic groups",
      "B": "It led to the abolition of traditional chieftaincies and local governance",
      "C": "It resulted in the complete independence of Nigeria from British control",
      "D": "It marked the first significant step towards self-government and regional representation"
    },
    "answer_url": "https://myschool.ng/classroom/history/71152?exam_type=jamb&type=obj&page=126",
    "correct_answer": "D",
    "explanation": "The introduction of the 1946 Richards Constitution in Nigeria was significant because it marked the first significant step towards self-government and regional representation. The constitution laid the foundation for increased Nigerian participation in governance and paved the way for future constitutional developments.",
    "year": "2024"
  },
  {
    "number": "631",
    "text": "Khedive Ismail's ambitious modernization projects in Egypt led to",
    "options": {
      "A": "Massive debt and eventual control by European powers",
      "B": "The unification of the Arab world under Egyptian leadership",
      "C": "Egypt becoming a global economic powerhouse",
      "D": "The full industrialization of Egypt"
    },
    "answer_url": "https://myschool.ng/classroom/history/71153?exam_type=jamb&type=obj&page=127",
    "correct_answer": "A",
    "explanation": "Khedive Ismail's ambitious modernization projects in Egypt led to massive debt and eventual control by European powers. The modernization efforts, including the construction of the Suez Canal, put Egypt in significant debt, leading to European intervention.",
    "year": "2024"
  },
  {
    "number": "632",
    "text": "Theodore II's efforts at unifying Ethiopia were challenged by",
    "options": {
      "A": "European colonizers seeking to divide the country",
      "B": "Religious factions within the Ethiopian Orthodox Church",
      "C": "Regional lords and noblemen who resisted central authority",
      "D": "The invasion of neighboring Sudan"
    },
    "answer_url": "https://myschool.ng/classroom/history/71154?exam_type=jamb&type=obj&page=127",
    "correct_answer": "C",
    "explanation": "Theodore II's efforts at unifying Ethiopia were challenged by regional lords and noblemen who resisted central authorit These local power structures posed significant obstacles to the centralization efforts of Theodore II, hindering his unification goals.",
    "year": "2024"
  },
  {
    "number": "633",
    "text": "The United Nations General Assembly adopted a resolution in 1973 declaring apartheid as a",
    "options": {
      "A": "Crime against humanity",
      "B": "Domestic policy of South Africa",
      "C": "Form of racial discrimination",
      "D": "Legal system"
    },
    "answer_url": "https://myschool.ng/classroom/history/71155?exam_type=jamb&type=obj&page=127",
    "correct_answer": "A",
    "explanation": "The United Nations General Assembly adopted a resolution in 1973 declaring apartheid as a crime against humanity. Apartheid was a system of institutionalized racial segregation and discrimination in South Africa, and the resolution condemned it as a crime against humanity.",
    "year": "2024"
  },
  {
    "number": "634",
    "text": "Which of the following social changes was a direct result of urbanization in colonial Nigeria?",
    "options": {
      "A": "The complete assimilation of Nigerian elites into British culture",
      "B": "The decline of traditional chieftaincy institutions",
      "C": "The growth of labor unions and political activism",
      "D": "The eradication of ethnic and regional differences"
    },
    "answer_url": "https://myschool.ng/classroom/history/71156?exam_type=jamb&type=obj&page=127",
    "correct_answer": "C",
    "explanation": "Urbanization led to a mix of traditional and modern influences, and the growth of labor unions and political activism was one of the outcomes.",
    "year": "2024"
  },
  {
    "number": "635",
    "text": "Christian missionary activities in Liberia were primarily dominated by which denomination in the 19th century?",
    "options": {
      "A": "Baptist",
      "B": "Anglican",
      "C": "Presbyterian",
      "D": "Methodist"
    },
    "answer_url": "https://myschool.ng/classroom/history/71157?exam_type=jamb&type=obj&page=127",
    "correct_answer": "D",
    "explanation": "Christian missionary activities in Liberia in the 19th century were primarily dominated by the Methodist denomination The Methodist Church played a significant role in establishing missions and schools in Liberia during that period.",
    "year": "2024"
  },
  {
    "number": "636",
    "text": "The impact of the Mfecane on trade in Southern Africa was",
    "options": {
      "A": "The decline of trade networks due to increased conflict",
      "B": "Enhancement of trade relations with European traders",
      "C": "Disruption of existing trade routes and establishment of new ones",
      "D": "The integration of African trade systems with European markets"
    },
    "answer_url": "https://myschool.ng/classroom/history/71158?exam_type=jamb&type=obj&page=128",
    "correct_answer": "C",
    "explanation": "The impact of the Mfecane on trade in Southern Africa was the disruption of existing trade routes and the establishment of new ones. The conflicts during the Mfecane led to the reorganization of trade networks in the region.",
    "year": "2024"
  },
  {
    "number": "637",
    "text": "The Nupe rulers, known as the Emir, exercised control through",
    "options": {
      "A": "A complex system of provincial governors and military commanders",
      "B": "Heavy taxation and land acquisition policies",
      "C": "The establishment of a theocratic government",
      "D": "Direct control over all economic activities"
    },
    "answer_url": "https://myschool.ng/classroom/history/71159?exam_type=jamb&type=obj&page=128",
    "correct_answer": "A",
    "explanation": "The Nupe rulers, known as the Emir, exercised control through a complex system of provincial governors and military commanders. This system allowed for effective governance and control over the region.",
    "year": "2024"
  },
  {
    "number": "638",
    "text": "The Islamic reform movement led by Al-Hajj Umar Tall was characterized by",
    "options": {
      "A": "The introduction of Western education and technology in West Africa",
      "B": "The development of alliances with European colonial powers",
      "C": "The promotion of commercial agriculture and trade with Europe",
      "D": "The establishment of a theocratic state in Senegal and the western Sudan"
    },
    "answer_url": "https://myschool.ng/classroom/history/71160?exam_type=jamb&type=obj&page=128",
    "correct_answer": "D",
    "explanation": "The Islamic reform movement led by Al-Hajj Umar Tall was characterized by the establishment of a theocratic state in Senegal and the western Sudan. This is evident from the historical accounts of Umar Tall's efforts to establish an Islamic state based on his interpretation of Islamic law and governance.",
    "year": "2024"
  },
  {
    "number": "639",
    "text": "Which ECOWAS protocol allows for the free movement of persons, goods, and services within member states?",
    "options": {
      "A": "The ECOWAS Trade Liberalization Scheme",
      "B": "The Protocol on Free Movement",
      "C": "The Abuja Agreement",
      "D": "The Treaty of Lagos"
    },
    "answer_url": "https://myschool.ng/classroom/history/71161?exam_type=jamb&type=obj&page=128",
    "correct_answer": "B",
    "explanation": "The ECOWAS protocol that allows for the free movement of persons, goods, and services within member states is The Protocol on Free Movement. This protocol aims to promote integration and economic development within the Economic Community of West African States (ECOWAS).",
    "year": "2024"
  },
  {
    "number": "640",
    "text": "The Satiru Uprising of 1906 was a significant event in colonial Nigeria. What was the primary cause of this rebellion?",
    "options": {
      "A": "Resistance to the imposition of colonial rule",
      "B": "Opposition to Christian missionary activities",
      "C": "Disputes over land ownership",
      "D": "Discontent with British taxation policies"
    },
    "answer_url": "https://myschool.ng/classroom/history/71162?exam_type=jamb&type=obj&page=128",
    "correct_answer": "A",
    "explanation": "The primary cause of the Satiru Uprising of 1906 was resistance to the imposition of colonial rule. The British colonial rule was seen as oppressive and exploitative, leading to various uprisings and rebellions across Nigeria.",
    "year": "2024"
  },
  {
    "number": "641",
    "text": "Mohammed Ali's economic reforms in Egypt included",
    "options": {
      "A": "The reduction of agricultural production and reliance on imports",
      "B": "The establishment of state monopolies over key industries",
      "C": "The introduction of a free market economy",
      "D": "The privatization of major state enterprises"
    },
    "answer_url": "https://myschool.ng/classroom/history/71163?exam_type=jamb&type=obj&page=129",
    "correct_answer": "B",
    "explanation": "Mohammed Ali's economic reforms in Egypt included the establishment of state monopolies over key industries. This centralized control was a key aspect of his economic policies.",
    "year": "2024"
  },
  {
    "number": "642",
    "text": "The Kanem-Borno Empire was one of the most powerful states in the Nigeria area during the 19th century. Its capital during this period was",
    "options": {
      "A": "Kukawa",
      "B": "Maiduguri",
      "C": "Dikwa",
      "D": "Ngazargamu"
    },
    "answer_url": "https://myschool.ng/classroom/history/71164?exam_type=jamb&type=obj&page=129",
    "correct_answer": "D",
    "explanation": "During the 19th century, the capital of the Kanem-Borno Empire was Ngazargamu. This city served as the political and administrative center of the empire, showcasing its power and influence in the Nigeria area.",
    "year": "2024"
  },
  {
    "number": "643",
    "text": "Which of the following was a major export commodity of the Oyo Empire during the pre-colonial period?",
    "options": {
      "A": "Ivory",
      "B": "Kola nuts",
      "C": "Salt",
      "D": "Gold"
    },
    "answer_url": "https://myschool.ng/classroom/history/71165?exam_type=jamb&type=obj&page=129",
    "correct_answer": "B",
    "explanation": "Kola nuts were a major export commodity of the Oyo Empire during the pre-colonial period. They were highly valued fo their stimulant properties and were traded extensively within and outside the empire.",
    "year": "2024"
  },
  {
    "number": "644",
    "text": "The rise of the Kanem-Borno Empire in the 9th century was primarily due to",
    "options": {
      "A": "Agricultural surplus",
      "B": "Conquest of neighboring empires",
      "C": "Diplomatic alliances with the Ottoman Empire",
      "D": "Control of trans-Saharan trade routes"
    },
    "answer_url": "https://myschool.ng/classroom/history/71166?exam_type=jamb&type=obj&page=129",
    "correct_answer": "D",
    "explanation": "The empire's rise was mainly attributed to its control of trans-Saharan trade routes, which facilitated economic prosperity and political influence in the region.",
    "year": "2024"
  },
  {
    "number": "645",
    "text": "The infamous Middle Passage refers to",
    "options": {
      "A": "The journey of enslaved Africans across the Atlantic Ocean to the Americas",
      "B": "The migration of Africans to Europe for labor",
      "C": "The pathway used by missionaries in Africa",
      "D": "The route taken by European explorers to reach Asia"
    },
    "answer_url": "https://myschool.ng/classroom/history/71167?exam_type=jamb&type=obj&page=129",
    "correct_answer": "A",
    "explanation": "The infamous Middle Passage refers to the journey of enslaved Africans across the Atlantic Ocean to the Americas. It waa horrific and inhumane voyage that resulted in immense suffering and loss of life among the enslaved population.",
    "year": "2024"
  },
  {
    "number": "646",
    "text": "Seku Amadu initiated a jihad in the early 19th century and established the Massina Empire. His jihad was primarily against",
    "options": {
      "A": "The Asante Empire",
      "B": "The Bambara Kingdoms",
      "C": "The French colonial forces",
      "D": "The Sokoto Caliphate"
    },
    "answer_url": "https://myschool.ng/classroom/history/71168?exam_type=jamb&type=obj&page=130",
    "correct_answer": "D",
    "explanation": "Seku Amadu initiated a jihad against the Sokoto Caliphate. The Sokoto Caliphate was a powerful Islamic state in the region, and Seku Amadu's jihad was aimed at challenging their authority and establishing his own empire.",
    "year": "2024"
  },
  {
    "number": "647",
    "text": "The activities of the British East Africa Company led to",
    "options": {
      "A": "The discovery of gold mines in South Africa",
      "B": "The establishment of protectorates in East Africa",
      "C": "The formation of the United Nations",
      "D": "The creation of a trans-Saharan trade route"
    },
    "answer_url": "https://myschool.ng/classroom/history/71169?exam_type=jamb&type=obj&page=130",
    "correct_answer": "B",
    "explanation": "The activities of the British East Africa Company led to the establishment of protectorates in East Africa. The company played a significant role in the colonization and establishment of British control in East Africa.",
    "year": "2024"
  },
  {
    "number": "648",
    "text": "Which economic policy introduced by the Buhari regime had a significant impact on Nigeria's foreign exchange market?",
    "options": {
      "A": "Export promotion",
      "B": "Countertrade",
      "C": "Structural Adjustment Program (SAP)",
      "D": "Import substitution industrialization"
    },
    "answer_url": "https://myschool.ng/classroom/history/71170?exam_type=jamb&type=obj&page=130",
    "correct_answer": "C",
    "explanation": "The economic policy introduced by the Buhari regime that had a significant impact on Nigeria's foreign exchange marke was the Structural Adjustment Program (SAP). SAP aimed to restructure the economy through liberalization, privatization, and deregulation, impacting various sectors including the foreign exchange market.",
    "year": "2024"
  },
  {
    "number": "649",
    "text": "The primary aim of the Ekumeku Movement in the Asaba hinterland was to",
    "options": {
      "A": "Promote the spread of Christianity",
      "B": "Resist British taxation and land policies",
      "C": "Establish an independent Asaba kingdom",
      "D": "Integrate with neighboring ethnic groups"
    },
    "answer_url": "https://myschool.ng/classroom/history/71171?exam_type=jamb&type=obj&page=130",
    "correct_answer": "B",
    "explanation": "The primary aim of the Ekumeku Movement in the Asaba hinterland was to resist British taxation and land policies. This movement was a resistance movement against British colonial policies in the Asaba region.",
    "year": "2024"
  },
  {
    "number": "650",
    "text": "The arrival of the Portuguese on the West African coast in the 15th century marked the beginning of European influence in the region. Their primary interest was in",
    "options": {
      "A": "Establishing colonies",
      "B": "Converting the local population to Christianity",
      "C": "Engaging in the trans-Atlantic slave trade",
      "D": "Trading gold and spices"
    },
    "answer_url": "https://myschool.ng/classroom/history/71172?exam_type=jamb&type=obj&page=130",
    "correct_answer": "C",
    "explanation": "The primary interest of the Portuguese upon arriving on the West African coast in the 15th century was engaging in the trans-Atlantic slave trade. This marked the beginning of a dark period in history where Africans were forcibly taken as slaves to the Americas.",
    "year": "2024"
  },
  {
    "number": "651",
    "text": "The Sokoto Caliphate's relations with the British colonial powers in the 19th century were",
    "options": {
      "A": "Generally cooperative, with the Caliphate aiding British administrative efforts",
      "B": "Marked by frequent conflicts and military confrontations",
      "C": "Based on treaties and trade agreements leading to mutual cooperation",
      "D": "Limited to diplomatic negotiations and sporadic trade interactions"
    },
    "answer_url": "https://myschool.ng/classroom/history/71173?exam_type=jamb&type=obj&page=131",
    "correct_answer": "C",
    "explanation": "The Sokoto Caliphate's relations with the British colonial powers in the 19th century were based on treaties and trade agreements leading to mutual cooperation. This cooperation was evident in various agreements and interactions between the Caliphate and the British authorities during that period.",
    "year": "2024"
  },
  {
    "number": "652",
    "text": "The rise of consular authority in Africa during the colonial era involved",
    "options": {
      "A": "The removal of all forms of European governance",
      "B": "European consuls exercising political and economic control in their respective regions",
      "C": "The promotion of African trade unions and cooperatives",
      "D": "The establishment of local African consulates to manage trade"
    },
    "answer_url": "https://myschool.ng/classroom/history/71174?exam_type=jamb&type=obj&page=131",
    "correct_answer": "B",
    "explanation": "The rise of consular authority in Africa during the colonial era involved European consuls exercising political and economic control in their respective regions. Consuls played a crucial role in representing European interests and exerting influence in African territories.",
    "year": "2024"
  },
  {
    "number": "653",
    "text": "The primary destination of the Voortrekkers during the Great Trek was",
    "options": {
      "A": "The southern part of Mozambique",
      "B": "The interior regions of modern-day South Africa, such as the Transvaal and the Orange Free State",
      "C": "The coastal regions of Namibia",
      "D": "The highlands of Kenya"
    },
    "answer_url": "https://myschool.ng/classroom/history/71175?exam_type=jamb&type=obj&page=131",
    "correct_answer": "B",
    "explanation": "The primary destination of the Voortrekkers during the Great Trek was the interior regions of modern-day South Africa, such as the Transvaal and the Orange Free State. The Voortrekkers were Boer pastoralists who migrated inland during th Great Trek.",
    "year": "2024"
  },
  {
    "number": "654",
    "text": "The major policy direction of the Obasanjo administration following the death of Murtala Mohammed was",
    "options": {
      "A": "Preparing the country for a transition to civilian rule and democratic elections",
      "B": "Strengthening alliances with other military regimes in Africa",
      "C": "Increasing military spending and expanding Nigeria's influence in international conflicts",
      "D": "Pursuing aggressive land and agricultural reforms to boost the economy"
    },
    "answer_url": "https://myschool.ng/classroom/history/71176?exam_type=jamb&type=obj&page=131",
    "correct_answer": "A",
    "explanation": "The major policy direction of the Obasanjo administration following the death of Murtala Mohammed was preparing the country for a transition to civilian rule and democratic elections. Obasanjo's administration focused on the restoration c civilian rule after a period of military governance, leading to the eventual transition to democratic elections in Nigeria.",
    "year": "2024"
  },
  {
    "number": "655",
    "text": "The challenge of building effective political institutions in newly independent African states has been exacerbated by",
    "options": {
      "A": "The prevalence of democratic governance models",
      "B": "High levels of foreign direct investment",
      "C": "Widespread support for national unity",
      "D": "A lack of experienced administrative personnel and leadership"
    },
    "answer_url": "https://myschool.ng/classroom/history/71177?exam_type=jamb&type=obj&page=131",
    "correct_answer": "D",
    "explanation": "The challenge of building effective political institutions in newly independent African states has been exacerbated by a lack of experienced administrative personnel and leadership. This lack of expertise and leadership has hindered the development of stable political institutions.",
    "year": "2024"
  },
  {
    "number": "656",
    "text": "The concept of \"The White Man's Burden,\" which justified European imperialism, was popularized by which British writer?",
    "options": {
      "A": "H.G. Wells",
      "B": "Joseph Conrad",
      "C": "Charles Dickens",
      "D": "Rudyard Kipling"
    },
    "answer_url": "https://myschool.ng/classroom/history/71178?exam_type=jamb&type=obj&page=132",
    "correct_answer": "D",
    "explanation": "The concept of 'The White Man's Burden, which justified European imperialism, was popularized by Rudyard Kipling. Kipling's poem of the same name portrayed imperialism as a duty of the white race to civilize and uplift non-white peoples.",
    "year": "2024"
  },
  {
    "number": "657",
    "text": "The Omani Sultanate's control over Zanzibar led to",
    "options": {
      "A": "The widespread conversion of Zanzibar to Christianity",
      "B": "The complete cessation of the slave trade in the region",
      "C": "The establishment of a major center for the East African slave trade",
      "D": "The creation of a unified East African political entity"
    },
    "answer_url": "https://myschool.ng/classroom/history/71179?exam_type=jamb&type=obj&page=132",
    "correct_answer": "C",
    "explanation": "The Omani Sultanate's control over Zanzibar led to the establishment of a major center for the East African slave trade. Zanzibar became a significant hub for the slave trade under Omani rule.",
    "year": "2024"
  },
  {
    "number": "658",
    "text": "One of Gowon's major achievements was the hosting of which international event in Lagos in 1973?",
    "options": {
      "A": "The All-Africa Games",
      "B": "The Non-Aligned Movement Conference",
      "C": "The OAU Summit",
      "D": "The Commonwealth Heads of Government Meeting"
    },
    "answer_url": "https://myschool.ng/classroom/history/71180?exam_type=jamb&type=obj&page=132",
    "correct_answer": "C",
    "explanation": "Gowon's major achievement was hosting The OAU Summit in Lagos in 1973. The OAU (Organization of African Unity) Summit was a significant international event that brought together African leaders to discuss and address key issues affecting the continent.",
    "year": "2024"
  },
  {
    "number": "659",
    "text": "One of the key impacts of French colonialism in West Africa was",
    "options": {
      "A": "The imposition of the French legal system and civil code",
      "B": "The abolition of all indigenous forms of governance",
      "C": "The replacement of Islam with Christianity",
      "D": "The promotion of Swahili as the lingua franca"
    },
    "answer_url": "https://myschool.ng/classroom/history/71181?exam_type=jamb&type=obj&page=132",
    "correct_answer": "A",
    "explanation": "One of the key impacts of French colonialism in West Africa was the imposition of the French legal system and civil code This helped in the administration and governance of the colonies by the French authorities.",
    "year": "2024"
  },
  {
    "number": "660",
    "text": "Which leader, influenced by the Sokoto Caliphate, established a theocratic state in Masina in the early 19th century?",
    "options": {
      "A": "Al-Hajj Umar",
      "B": "Ahmadou Sekou",
      "C": "Samori Ture",
      "D": "Seku Amadu"
    },
    "answer_url": "https://myschool.ng/classroom/history/71182?exam_type=jamb&type=obj&page=132",
    "correct_answer": "D",
    "explanation": "The leader influenced by the Sokoto Caliphate who established a theocratic state in Masina in the early 19th century wa Seku Amadu. He was inspired by the Sokoto Caliphate's model of Islamic governance and sought to establish a similar theocratic state in Masina.",
    "year": "2024"
  },
  {
    "number": "661",
    "text": "The role of the Truth and Reconciliation Commission (TRC) in post-apartheid South Africa was to",
    "options": {
      "A": "Facilitate the redistribution of land and resources among previously disadvantaged groups",
      "B": "Oversee the transition of economic policies from apartheid to democracy",
      "C": "Enforce legal action against all members of the apartheid regime",
      "D": "Investigate human rights violations and promote national healing"
    },
    "answer_url": "https://myschool.ng/classroom/history/71183?exam_type=jamb&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "The role of the Truth and Reconciliation Commission (TRC) in post-apartheid South Africa was to investigate human rights violations and promote national healing. The TRC played a crucial role in uncovering past atrocities, providing a platform for victims to share their stories, and fostering reconciliation in the country.",
    "year": "2024"
  },
  {
    "number": "662",
    "text": "The apartheid policy of \"separate development\" was also known as",
    "options": {
      "A": "Afrikaner nationalism",
      "B": "Bantustans",
      "C": "Homelands",
      "D": "Segregation"
    },
    "answer_url": "https://myschool.ng/classroom/history/71184?exam_type=jamb&type=obj&page=133",
    "correct_answer": "B",
    "explanation": "The apartheid policy of 'separate development' was also known as Bantustans. This policy involved the creation of separate territories for different racial groups in South Africa, known as Bantustans, as part of the apartheid system.",
    "year": "2024"
  },
  {
    "number": "663",
    "text": "The primary impact of the Mahdist Revolt in Sudan on Ethiopia was",
    "options": {
      "A": "The direct military support provided to Ethiopian forces",
      "B": "The diversion of British and Italian resources away from Ethiopia",
      "C": "The establishment of a Mahdist alliance with Ethiopian rulers",
      "D": "The establishment of a political union between Sudan and Ethiopia"
    },
    "answer_url": "https://myschool.ng/classroom/history/71185?exam_type=jamb&type=obj&page=133",
    "correct_answer": "B",
    "explanation": "The primary impact of the Mahdist Revolt in Sudan on Ethiopia was the diversion of British and Italian resources away from Ethiopia. The Mahdist Revolt (1881-1899), led by Muhammad Ahmad al-Mahdi, occupied British and other colonia powers' attention in Sudan, reducing their focus on Ethiopia. This created a temporary window for Ethiopia to consolidate its power and resist external pressures, including colonial encroachments by European powers.",
    "year": "2024"
  },
  {
    "number": "664",
    "text": "The Ebira people, also from the Niger-Benue Valley, are known for their resistance to which British colonial policy in the early 20th century?",
    "options": {
      "A": "Forced labor",
      "B": "Land expropriation",
      "C": "Taxation",
      "D": "Indirect rule"
    },
    "answer_url": "https://myschool.ng/classroom/history/71186?exam_type=jamb&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "The Ebira people resisted the British colonial policy of taxation in the early 20th century. Taxation was one of the key methods used by the British to extract resources from the colonies, leading to resistance and uprisings.",
    "year": "2024"
  },
  {
    "number": "665",
    "text": "The British amalgamation of Nigeria in 1914 was primarily motivated by",
    "options": {
      "A": "desire to promote cultural unity among the diverse ethnic groups",
      "B": "Pressure from the League of Nations",
      "C": "Economic considerations, particularly the need to make the Northern Protectorate financially viable",
      "D": "The influence of nationalist movements"
    },
    "answer_url": "https://myschool.ng/classroom/history/71187?exam_type=jamb&type=obj&page=133",
    "correct_answer": "C",
    "explanation": "The British amalgamation of Nigeria in 1914 was primarily motivated by economic considerations, particularly the nee to make the Northern Protectorate financially viable. By merging the Northern and Southern Protectorates, the British aimed to create a more economically sustainable administrative unit.",
    "year": "2024"
  },
  {
    "number": "666",
    "text": "The Voortrekker Monument, inaugurated in 1949, is a symbol of Afrikaner nationalism. It commemorates which historical event?",
    "options": {
      "A": "The Great Trek",
      "B": "The founding of Cape Colony",
      "C": "The Battle of Blood River",
      "D": "The Union of South Africa"
    },
    "answer_url": "https://myschool.ng/classroom/history/71188?exam_type=jamb&type=obj&page=134",
    "correct_answer": "A",
    "explanation": "The Voortrekker Monument commemorates The Great Trek, which was a significant historical event in Afrikaner history The monument symbolizes the pioneering spirit and nationalism of the Afrikaner people during their migration inland i the early 19th century.",
    "year": "2024"
  }
]