[
  {
    "number": "1903",
    "text": "The second ballot is based on the principle that a successful candidate must obtain",
    "options": {
      "A": "absolute majority",
      "B": "simple majority",
      "C": "forty percent of the votes",
      "D": "fifty percent of the votes"
    },
    "answer_url": "https://myschool.ng/classroom/government/47080?exam_type=jamb&type=obj&page=381",
    "correct_answer": "A",
    "explanation": "Before the Second Ballot System is introduce in an election is when none of the candidates wins the election byabsolute majorityin a general election, another election would be conducted. In this final election, only the candidates with the highest votes are allowed to contest.So the second ballot is based on the principle that a successful candidate must obtainAbsolute MajorityAbsolute Majority Systemis a system of voting in which a candidate must acquire more than half of the total vote cast before he can be declared winner.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1904",
    "text": "The tenure of the president of the UN Security Council is",
    "options": {
      "A": "one month",
      "B": "six months",
      "C": "two years",
      "D": "one year"
    },
    "answer_url": "https://myschool.ng/classroom/government/47081?exam_type=jamb&type=obj&page=381",
    "correct_answer": "A",
    "explanation": "The Security Council is one of the organs of U.N.O and it is assumed to be the most powerful of all the organs, making up the organization. Formerly, it was made up of 5 permanent members also known as the Permanent Five, Big Five, or P5 and 6 non-permanent members, but it was enlarged in 1965, bringing 6 non-permanent members to 10, making it 15 members. The permanent members are:United States of America (USA), China, Britain, France and Russia.The President of the United Nations Security Council is the presiding officer of that body. The President is the head of the delegation from the United Nations Security Council member state that holds the rotating presidency for a tenure ofOne Month.the presidency rotates monthly among the state members of the Security Council. The rotation takes place in alphabetical order of the member states' official United Nations names in English.[2\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1905",
    "text": "Political authority is vested in the_________",
    "options": {
      "A": "state",
      "B": "judiciary",
      "C": "government",
      "D": "armed forces"
    },
    "answer_url": "https://myschool.ng/classroom/government/47082?exam_type=jamb&type=obj&page=381",
    "correct_answer": "C",
    "explanation": "Political Authority is the authority conferred on a persons holding political offices, e.g the president, legislators etc. and the president, legislator and others are considered to be the GovernmentSo Political authority is vested in theGovernment\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1906",
    "text": "Unicameral legislatures are popular in",
    "options": {
      "A": "unitary system",
      "B": "federal system",
      "C": "confederal",
      "D": "rigid system"
    },
    "answer_url": "https://myschool.ng/classroom/government/47083?exam_type=jamb&type=obj&page=382",
    "correct_answer": "A",
    "explanation": "In government,unicameralism(Latin uni, one + camera, chamber) is the practice of having one legislative or parliamentary chamber. Thus, a unicameral parliament or unicameral legislature is a legislature which consists of one chamber or house.\nA unitarystate is a state governed as a single power in which the central government is ultimately supreme. The central government may create administrative divisions. Such units exercise only the powers that the central government chooses to delegate. Although political power may be delegated through devolution to local governments by statute, the central government may abrogate the acts of devolved governments or curtail their powers. A large majority of the world's states have a unitary system of government and adopt a unicameral legislature (of a legislative body having a single legislative chamber.)\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1907",
    "text": "In the cabinet system of government, individual responsibility of ministers means that ____________",
    "options": {
      "A": "only ministers can be held responsible for errors",
      "B": "a minister must hold his subordinates responsible for his failures",
      "C": "the prime ministers can remove an erring minister",
      "D": "no individual can be held responsible for government decisions"
    },
    "answer_url": "https://myschool.ng/classroom/government/47084?exam_type=jamb&type=obj&page=382",
    "correct_answer": "A",
    "explanation": "Individual ministerial responsibility is a constitutional convention in governments using the Westminster System that a cabinet minister bears the ultimate responsibility for the actions of their ministry or department.According to Individual Ministerial Responsibility:• Ministers are individually responsible for the work of their departments and are answerable to Parliament for all their departments activities.• They are expected to accept responsibility for any failure in administration, any injustice to an individual or any aspect of policy which may be criticised in parliament, whether personally or not\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1908",
    "text": "An important aspect of an unwritten constitution is that it",
    "options": {
      "A": "is easy to understand to everybody",
      "B": "safeguards the monarchy",
      "C": "contains customary laws and conventions",
      "D": "is not easily amended"
    },
    "answer_url": "https://myschool.ng/classroom/government/47085?exam_type=jamb&type=obj&page=382",
    "correct_answer": "C",
    "explanation": "An unwritten constitution refers to when the whole body of fundamental laws,customs, conventions, principles, rules and regulations according to which a particular government of a country operates are not written down or codified in a single document.An important aspect of an unwritten constitution is that it containscustomary laws and conventions\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1909",
    "text": "In 1993, Nigerian troops were on peace-keeping assignment to",
    "options": {
      "A": "Liberia and Burundi",
      "B": "Rwanda and liberia",
      "C": "Chad and Liberia",
      "D": "Liberia and somalia"
    },
    "answer_url": "https://myschool.ng/classroom/government/47086?exam_type=jamb&type=obj&page=382",
    "correct_answer": "D",
    "explanation": "Nigerian troops were actively involved in peace-keeping missions in both Liberia and Somalia in 1993. In Liberia, they were part of the Economic Community of West African States Monitoring Group (ECOMOG), which aimed to restore peace during the Liberian Civil War. In Somalia, Nigerian troops were part of the United Nations Operation in Somalia II (UNOSOM II), which sought to stabilise the country amidst civil unrest.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1910",
    "text": "Power refers to the__________",
    "options": {
      "A": "ability to impose one’s will upon others",
      "B": "duties an individual imposes on himself",
      "C": "legal nature of a constitution",
      "D": "duties political parties demand of their registered members"
    },
    "answer_url": "https://myschool.ng/classroom/government/47087?exam_type=jamb&type=obj&page=382",
    "correct_answer": "A",
    "explanation": "Power is referred to as the ability to control others by imposing ones will on others\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1911",
    "text": "The creation of more states in Nigeria has_______",
    "options": {
      "A": "eliminated ethnic and religious conflicts",
      "B": "reduced the gap between the rich and poor states",
      "C": "increased the powers of the federal government",
      "D": "increased the powers of the states and local government"
    },
    "answer_url": "https://myschool.ng/classroom/government/47088?exam_type=jamb&type=obj&page=383",
    "correct_answer": "A",
    "explanation": "The creation of more states in Nigeria has eliminated ethnic and religious conflicts which used to be a bane of crises in the country, as both minor and major ethnic groups are involved.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1912",
    "text": "An Agency of the united Nations which specializes in the welfare of children is the _______",
    "options": {
      "A": "WHO",
      "B": "UNESCO",
      "C": "UNICEF",
      "D": "UNDP"
    },
    "answer_url": "https://myschool.ng/classroom/government/47089?exam_type=jamb&type=obj&page=383",
    "correct_answer": "C",
    "explanation": "UNICEF is an agency of UNO that deals and specializes in the welfare, education and needs of children all over the world\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1913",
    "text": "A society that is politically organized under a government is called",
    "options": {
      "A": "sovereign state",
      "B": "community",
      "C": "national state",
      "D": "polity"
    },
    "answer_url": "https://myschool.ng/classroom/government/47090?exam_type=jamb&type=obj&page=383",
    "correct_answer": "D",
    "explanation": "A polity is an organized society, such as a nation, city, or church, together with its government and administration.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1914",
    "text": "In the Oyo empire, the Alaafin was",
    "options": {
      "A": "an absolute monarch",
      "B": "popularly elected",
      "C": "a constitutional monarch",
      "D": "worshipped as a deity"
    },
    "answer_url": "https://myschool.ng/classroom/government/47091?exam_type=jamb&type=obj&page=383",
    "correct_answer": "C",
    "explanation": "The system was based on constitutional monarchy in which the monarch exercise authority in accordance with the written or unwritten constitution, it was not absolute.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1915",
    "text": "Nigeria broke diplomatic relations with France in 1961 because of_________",
    "options": {
      "A": "her poor relations with the Francophone countries",
      "B": "France atomic test in the sahara desert",
      "C": "France diplomatic relations with Israel",
      "D": "General de-Gaulle’s negative attitude towards her"
    },
    "answer_url": "https://myschool.ng/classroom/government/47092?exam_type=jamb&type=obj&page=383",
    "correct_answer": "B",
    "explanation": "In the realm of bilateral relations, Nigeria did not hesitate to break diplomatic ties with France in 1961 when France tested an atomic bomb in the Sahara Desert. The action was against the firm warning by Nigeria having observed that the test was going to be injurious to Nigeria and some other African countries. Thus, Nigeria imposed stern economic measures on France, first banning all ship movements of French origins from navigating the coastal areas of Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1916",
    "text": "In 1991, the African Economic Community Treaty was signed in",
    "options": {
      "A": "Addis Ababa",
      "B": "Abuja",
      "C": "Lome",
      "D": "Tripoli"
    },
    "answer_url": "https://myschool.ng/classroom/government/47093?exam_type=jamb&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "The African Economic Community (AEC) is an organization of African Union states establishing grounds for mutual economic development among the majority of African states. The stated goals of the organization include the creation of free trade areas, customs unions, a single market, a central bank, and a common currencyIn 1980, the OAU Extraordinary Summit adopted the Lagos Plan of Action as a major step towards the goal of integration.The commitments in this Plan and the Final Act of Lagos were translated into concrete form inAbuja, Nigeria in June 1991when the OAU Heads of State and Government signed the Treaty establishing the African Economic Community (AEC) during the 27th Ordinary Session of the Assembly\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1917",
    "text": "Based on its objectives, the Organization of African Unity can primarily be classified as",
    "options": {
      "A": "a social organization",
      "B": "a political organization",
      "C": "a cultural organization",
      "D": "an economic organization"
    },
    "answer_url": "https://myschool.ng/classroom/government/47094?exam_type=jamb&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "The OAU was founded with the main objective of promoting unity and solidarity among African states, coordinating and intensifying cooperation for development, defending the sovereignty and territorial integrity of its member states and eradicating all forms of colonialism in Africa. These make the OAU primarily a political organization.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1918",
    "text": "The Premier of Western region immediately after Independence was ______",
    "options": {
      "A": "Chief Obafemi Awolowo",
      "B": "Chief Ladoke Akintola",
      "C": "Chief Dr. M.A. Majekodunmi",
      "D": "Alhaji S. Adegbenro"
    },
    "answer_url": "https://myschool.ng/classroom/government/47095?exam_type=jamb&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "Nigeria became independent on 1 October 1960 and became a republic on 1 October 1963. On 16 January 1966 a military coup brought Major General Johnson Aguiyi-Ironsi to power, terminating the first period of democratic rule. During this period an appointed governor was nominal head of state while an elected premier led the government.The Premier of Western region immediately after Independence wasChief Samuel Ladoke Akintola\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1919",
    "text": "A typical form of delegated legislation is",
    "options": {
      "A": "acts of parliaments",
      "B": "decree",
      "C": "bye-law",
      "D": "gazette"
    },
    "answer_url": "https://myschool.ng/classroom/government/47096?exam_type=jamb&type=obj&page=384",
    "correct_answer": "C",
    "explanation": "Delegated legislation may be defined as the act of transferring power and functions through the acts of parliament to other organisations such as ministers, local governments, public corporations etc. Laws made by these bodies are referred to asBYE-LAWS.Bye-Lawsare rules and regulations made by local government authorities or local councils, public corporations and other similar bodies for the smooth running of their responsibility. These bye-laws have effects only within the areas of jurisdiction of these authorities that made them.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1920",
    "text": "A major feature of the system of government in the Sokoto Caliphate was that",
    "options": {
      "A": "it was based on customs and traditions",
      "B": "it was theocratic",
      "C": "it was democratic",
      "D": "power was effectively decentralized"
    },
    "answer_url": "https://myschool.ng/classroom/government/47097?exam_type=jamb&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "Theocratic system of government is whereby a deity or religious institution is regarded as the source from which authority came from.\nThe Sokoto caliphate ruled with the idea of Islam, and that the sultans were regarded as the religious head\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1921",
    "text": "The goal of the theory of separation of power is to",
    "options": {
      "A": "make the executive dependent on the legislative",
      "B": "give more powers to the legislative",
      "C": "protect individual liberty",
      "D": "creates efficiency in the judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/47098?exam_type=jamb&type=obj&page=385",
    "correct_answer": "C",
    "explanation": "When there’s separating of powers, the powers are shared equally among the arms of government; the judiciary, legislative and executive to act as checks and balances on each other, hence to protect the liberty of an individual.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1922",
    "text": "The first executive president of Nigeria was_________",
    "options": {
      "A": "Dr. Nnamdi Azikiwe",
      "B": "Sir Abubakar Tafawa Balewa",
      "C": "General Yakubu Gowon",
      "D": "Alhaji Shehu Shagari"
    },
    "answer_url": "https://myschool.ng/classroom/government/47099?exam_type=jamb&type=obj&page=385",
    "correct_answer": "D",
    "explanation": "A lot of people do not considerNnamdi Azikiweto be the first Executive President of Nigeria. Instead, they argue that the true president should be elected and not appointed, thus, Shehu Shagari, who took the post in 1979, should be considered the first President of Nigeria.Shehu Usman Aliyu Shagariwas the first president of the federal republic of Nigeria between the years 1979 and 1983, a period known as the second republic, before his government was overthrown by the military.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1923",
    "text": "The major difference between a state and a nation is that the latter presupposes a _______",
    "options": {
      "A": "heterogeneous",
      "B": "Homogeneous population",
      "C": "well-defined territory",
      "D": "more organized system"
    },
    "answer_url": "https://myschool.ng/classroom/government/47100?exam_type=jamb&type=obj&page=385",
    "correct_answer": "B",
    "explanation": "A nation depicts a people with common values, common people, history and heritage.\nA homogeneous population is a population or group of people with the same history, language etc.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1924",
    "text": "The primary function of the judiciary is to ______",
    "options": {
      "A": "interpret laws",
      "B": "make laws",
      "C": "regulate behaviour",
      "D": "execute laws"
    },
    "answer_url": "https://myschool.ng/classroom/government/47101?exam_type=jamb&type=obj&page=385",
    "correct_answer": "A",
    "explanation": "The judiciary is the arm of government that interprets laws for the people to understand and obey.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1925",
    "text": "A constitution of any country is basically___________",
    "options": {
      "A": "a mere piece of paper",
      "B": "a guide to how the country should be governed",
      "C": "a document stating what the leaders should do",
      "D": "a document stating how to acquire power"
    },
    "answer_url": "https://myschool.ng/classroom/government/47102?exam_type=jamb&type=obj&page=385",
    "correct_answer": "B",
    "explanation": "A constitution is a set of fundamental principles or established regulations according to which a state or other organization is governed\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1926",
    "text": "The highest decision-making body in Nigeria under the Buhari's military regime was the ________",
    "options": {
      "A": "Armed forces ruling council",
      "B": "Supreme military council",
      "C": "National council of states",
      "D": "Federal executive council"
    },
    "answer_url": "https://myschool.ng/classroom/government/47104?exam_type=jamb&type=obj&page=386",
    "correct_answer": "B",
    "explanation": "Buhari became the military head of state and during his regime, he established the supreme military council which consists of the various heads of region\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1927",
    "text": "A system of government in which the central government is supreme over other levels is",
    "options": {
      "A": "totalitarian",
      "B": "confederal",
      "C": "federal",
      "D": "unitary"
    },
    "answer_url": "https://myschool.ng/classroom/government/47105?exam_type=jamb&type=obj&page=386",
    "correct_answer": "D",
    "explanation": "Aunitary system of governmentis one in which thecentral government holds supreme powerover all other levels of government, such as local or regional authorities. These lower levels operate under the central government's authority and can be modified or even abolished by it.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1928",
    "text": "The main source of local government finance since the 1976 reform has been___________",
    "options": {
      "A": "local rates",
      "B": "levies",
      "C": "revenue from court fines and licences",
      "D": "the federal government"
    },
    "answer_url": "https://myschool.ng/classroom/government/47106?exam_type=jamb&type=obj&page=386",
    "correct_answer": "D",
    "explanation": "The federal government has been a major source of local government finance through allocations.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1929",
    "text": "Nigeria is a member of____________",
    "options": {
      "A": "OPEC, NATO and ECOWAS",
      "B": "OAU, the UNO and ECOWAS",
      "C": "ECOWAS, NATO and OAU",
      "D": "The Commonwealth of Nations, OPEC and the OAS"
    },
    "answer_url": "https://myschool.ng/classroom/government/47107?exam_type=jamb&type=obj&page=386",
    "correct_answer": "B",
    "explanation": "OAU, UNO and ECOWAS are international organizations in which Nigeria is a member both regionally and globally.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1930",
    "text": "In the old OYO empire, the Ajele",
    "options": {
      "A": "mobilized the army",
      "B": "ensured good governance of the district",
      "C": "was the head of the army",
      "D": "ensured the safety of the trade routes"
    },
    "answer_url": "https://myschool.ng/classroom/government/47108?exam_type=jamb&type=obj&page=386",
    "correct_answer": "B",
    "explanation": "Ajele is used to describe the political agent appointed by the Alaafin of Oyo to supervise and oversee the Alaafin's interest and monitor commerce\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1931",
    "text": "A bye-law is made by",
    "options": {
      "A": "parliament",
      "B": "congress",
      "C": "an electoral college",
      "D": "the local government"
    },
    "answer_url": "https://myschool.ng/classroom/government/47109?exam_type=jamb&type=obj&page=387",
    "correct_answer": "D",
    "explanation": "Bye-laws are laws or regulations that are made by local authorities to manage issues within their specific areas of jurisdiction. The local government have been delegated power by an Act of Parlament to make bye-laws that are specific to their local community.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1932",
    "text": "A human community that is usually cohesive and homogeneous is a",
    "options": {
      "A": "clan",
      "B": "state",
      "C": "nation",
      "D": "kingship"
    },
    "answer_url": "https://myschool.ng/classroom/government/47110?exam_type=jamb&type=obj&page=387",
    "correct_answer": "C",
    "explanation": "A nation is a large body of people, cohesive and homogenous united by common descent, history, culture, or language, inhabiting a particular country or territory.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1933",
    "text": "A true democracy in the modern sense exists where the",
    "options": {
      "A": "elite rules",
      "B": "elected representatives rule",
      "C": "majority of the people vote",
      "D": "majority of the people rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/47112?exam_type=jamb&type=obj&page=387",
    "correct_answer": "B",
    "explanation": "A true democracy in a modern sense exists where the elected representatives rule. Democracy is a government where people exercise power of governance through representatives. Such representative must come in to govern through popular, periodic free and fair election.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1934",
    "text": "A state that is ruled by an elected citizen is",
    "options": {
      "A": "an empire",
      "B": "a monarchy",
      "C": "a republic",
      "D": "a plutocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/47113?exam_type=jamb&type=obj&page=387",
    "correct_answer": "C",
    "explanation": "A republic is a state that is ruled by an elected citizen into power to represent the people.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1935",
    "text": "Political socialisation is associated with",
    "options": {
      "A": "free choice of party programmes",
      "B": "military takeover of civilian government",
      "C": "the transmission of political values",
      "D": "political transition"
    },
    "answer_url": "https://myschool.ng/classroom/government/47114?exam_type=jamb&type=obj&page=387",
    "correct_answer": "C",
    "explanation": "Political Socialization is the process by which individuals learn and acquire political values and behaviour\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1936",
    "text": "OPEC has strong influence with the__________",
    "options": {
      "A": "IMF",
      "B": "EU",
      "C": "ADB",
      "D": "AU"
    },
    "answer_url": "https://myschool.ng/classroom/government/47115?exam_type=jamb&type=obj&page=388",
    "correct_answer": "D",
    "explanation": "OPEC is an economic body formed to meet the interests of petroleum exporting countries in which African nation states are involved and easily influenced by its policies as they are regarded as third world countries\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1937",
    "text": "The development of a classless society is the goal of __________",
    "options": {
      "A": "liberalism",
      "B": "marxism",
      "C": "conservatism",
      "D": "feudalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/47116?exam_type=jamb&type=obj&page=388",
    "correct_answer": "B",
    "explanation": "Marxism is a political and economic theory developed by Karl Marx and Friedrich Engels, which advocates for the creation of a classless society. According to Marxist theory, society should be free of class distinctions, where wealth and power are shared equally among all people, thereby eliminating the divide between the bourgeoisie (capitalists) and the proletariat (workers).\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1938",
    "text": "Rhodesia was the former name of",
    "options": {
      "A": "Zambia",
      "B": "Namibia",
      "C": "Zimbabwe",
      "D": "Swaziland"
    },
    "answer_url": "https://myschool.ng/classroom/government/47118?exam_type=jamb&type=obj&page=388",
    "correct_answer": "C",
    "explanation": "The country known today as Zimbabwe was formerly called Rhodesia. It was named after Cecil Rhodes, the British imperialist. The name \"Rhodesia\" was used during the colonial period and up until the country gained independence in 1980 when it was renamed Zimbabwe.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1939",
    "text": "The Yoruba traditional system of government was",
    "options": {
      "A": "monarchical",
      "B": "egalitarian",
      "C": "republican",
      "D": "democratic"
    },
    "answer_url": "https://myschool.ng/classroom/government/47119?exam_type=jamb&type=obj&page=388",
    "correct_answer": "A",
    "explanation": "Monarchical system of government is whereby a king or monarch rules with undivided authority\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1940",
    "text": "Citizenship of a state by descent requires that______",
    "options": {
      "A": "one is born and bred in the state",
      "B": "one’s mother was born in the state",
      "C": "one’s grand parents were citizens of that state",
      "D": "one is domiciled in that state"
    },
    "answer_url": "https://myschool.ng/classroom/government/47120?exam_type=jamb&type=obj&page=388",
    "correct_answer": "C",
    "explanation": "Citizenship by descent is when a person’s family lineage is a citizen of that country\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1941",
    "text": "The institutions which constitute the main organs of the government of a nation are the___________",
    "options": {
      "A": "trustee and the presidium",
      "B": "judiciary and the civil service",
      "C": "legislature, the executive and the judiciary",
      "D": "civil service and the senate"
    },
    "answer_url": "https://myschool.ng/classroom/government/47632?exam_type=jamb&type=obj&page=389",
    "correct_answer": "C",
    "explanation": "The legislature, executive and judiciary make up the arms of government\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1942",
    "text": "One major achievement of the Clifford constitution was_________",
    "options": {
      "A": "creating a Northern majority in the legislative council",
      "B": "introducing indirect rule",
      "C": "amalgamating the Northern and Southern provinces",
      "D": "establishing the legislative council"
    },
    "answer_url": "https://myschool.ng/classroom/government/47687?exam_type=jamb&type=obj&page=389",
    "correct_answer": "D",
    "explanation": "The Clifford constitution introduced new legislative and executive councils. The Clifford Constitution created a new Legislative Council for the Colony and Protectorate of Nigeria. This was a significant development as it allowed for limited African representation in government. Although the majority of the members were still British officials, it marked the beginning of a legislative process that included Nigerians.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1943",
    "text": "The British government revoked the charter of the Royal Niger Company and took over the administration of Nigeria in which year?",
    "options": {
      "A": "1861",
      "B": "1900",
      "C": "1886",
      "D": "1914"
    },
    "answer_url": "https://myschool.ng/classroom/government/47688?exam_type=jamb&type=obj&page=389",
    "correct_answer": "B",
    "explanation": "TheBritish government revoked the charter of the Royal Niger Company on January 1, 1900, taking over the administration of Nigeria. This marked the beginning offormal British colonial rulein the region. The territories previously controlled by the company were reorganized intothe Protectorate of Northern Nigeria and the Protectorate of Southern Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1944",
    "text": "The fundamental rights of citizens include rights to___________",
    "options": {
      "A": "free education, employment and freedom of thought",
      "B": "life, speech and association",
      "C": "life, liberty and property",
      "D": "association, property and social security"
    },
    "answer_url": "https://myschool.ng/classroom/government/47689?exam_type=jamb&type=obj&page=389",
    "correct_answer": "B",
    "explanation": "Right to life, right to freedom of speech, and right of association are basic fundamental rights of citizens.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1945",
    "text": "Which of the following is a founding member of OPEC?",
    "options": {
      "A": "Nigeria",
      "B": "Indonesia",
      "C": "Venezuela",
      "D": "Algeria"
    },
    "answer_url": "https://myschool.ng/classroom/government/47690?exam_type=jamb&type=obj&page=389",
    "correct_answer": "C",
    "explanation": "Venezuela is one of the nation states that founded OPEC in 1960\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1946",
    "text": "A major feature of the pre-colonial Igbo political system was that___________",
    "options": {
      "A": "it was autocratic",
      "B": "it was based on customs and traditions",
      "C": "it was theocratic",
      "D": "power was effectively decentralized"
    },
    "answer_url": "https://myschool.ng/classroom/government/47691?exam_type=jamb&type=obj&page=390",
    "correct_answer": "D",
    "explanation": "The Igbo political system of the pre-colonial era was democratic and power was decentralized in which everyone is involved in decision making.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1947",
    "text": "Which of the following spearheaded the transformation of the Organization of African Unity into the African Union?",
    "options": {
      "A": "Thabo Mbeki",
      "B": "Kwame Nkrumah",
      "C": "Herbert Macaulay",
      "D": "Uhuru Kenyatta"
    },
    "answer_url": "https://myschool.ng/classroom/government/47692?exam_type=jamb&type=obj&page=390",
    "correct_answer": "A",
    "explanation": "Thabo Mbeki of South Africa was the leader of the defunct OAU who spearheaded the transformation of OAU to AU.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1948",
    "text": "All of the following are examples of public corporation in Nigeria EXCEPT?",
    "options": {
      "A": "Joint Admissions and Matriculation Board",
      "B": "Nigerian Steel Development Authority",
      "C": "Zenith Bank plc",
      "D": "Nigeria Railway Corporation"
    },
    "answer_url": "https://myschool.ng/classroom/government/47694?exam_type=jamb&type=obj&page=390",
    "correct_answer": "C",
    "explanation": "Public corporations are governmental bodies or organizations set up for the interests of the public without gain or profits.\nZenith bank plc. is a private corporation because it is owned by an individual for profits\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1949",
    "text": "The role of an Alkali under the Hausa-Fulani political system is primarily to _____________",
    "options": {
      "A": "adjudicate under Islamic laws",
      "B": "make Islamic laws",
      "C": "execute Islamic laws",
      "D": "make treaties under Islamic laws"
    },
    "answer_url": "https://myschool.ng/classroom/government/47695?exam_type=jamb&type=obj&page=390",
    "correct_answer": "A",
    "explanation": "TheAlkaliact as judges, administering laws. At times, minor cases may be passed to the village head to be settled by them.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1950",
    "text": "Capitalism is an economic system which emphasises_______________",
    "options": {
      "A": "Communism",
      "B": "Collectivism",
      "C": "Individualism",
      "D": "Internationalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/47696?exam_type=jamb&type=obj&page=390",
    "correct_answer": "C",
    "explanation": "Capitalism is private ownership of the means of production, where individuals and businesses operate for profit. The system promotes individual economic freedom, competition and the accumulation of wealth by individuals or corporations. Capitalism promotes individualism because it is based on the idea that individuals have the right to own property, make economic decisions and pursue their own economic interests\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1951",
    "text": "A government controlled by a few people for their own interests is said to be____________",
    "options": {
      "A": "Autocracy",
      "B": "A tyranny",
      "C": "Oligarchy",
      "D": "Monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/47698?exam_type=jamb&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "Oligarchy is referred to as a government controlled and run by only a few people\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1952",
    "text": "Pressure groups are formed mainly to__________",
    "options": {
      "A": "capture state power",
      "B": "replace bad governments",
      "C": "compete with the military for power",
      "D": "satisfy the needs and interests of members"
    },
    "answer_url": "https://myschool.ng/classroom/government/47700?exam_type=jamb&type=obj&page=391",
    "correct_answer": "D",
    "explanation": "The main objective of pressure groups is to meet the needs and interests of their members. Pressure groups are organised groups of people who come together to influence government policies or actions to favour their particular interests or causes. They do not seek to capture state power, replace governments or compete with the military; instead, they aim to push for specific issues or policies that benefit their members or the society at large. Whether it's labour unions, business associations, environmental groups or other types of pressure groups, their main goal is to advocate for and protect the specific interests of their members.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1953",
    "text": "The operation of the rule of law is abused by the__________",
    "options": {
      "A": "conspiracy by the two house of the legislature to impeach the president",
      "B": "inability of the press to discharge its responsibilities",
      "C": "unfriendly attitude of pressure groups",
      "D": "existence of administrative tribunals and special immunities"
    },
    "answer_url": "https://myschool.ng/classroom/government/47701?exam_type=jamb&type=obj&page=391",
    "correct_answer": "D",
    "explanation": "The operation of the rule of law can be abused by theexistence of administrative tribunals and special immunities.\nTherule of Lawrefers to the principle that all individuals and institutions, including the government, are subject to and accountable under the law. It ensures that laws are applied equally and fairly, without favouritism.\nWhile these tribunals are established to handle specific types of disputes (e.g., labour, tax), they sometimes operate outside the regular judicial system, which can lead to inconsistencies in how laws are applied. If these tribunals are not bound by the same legal standards as regular courts, it can undermine the rule of law.\nAlso, when certain individuals (e.g., government officials, diplomats) are granted special legal immunities, it means they are not held accountable under the same laws as ordinary citizens. This can lead to an abuse of power and a violation of the rule of law, as it creates a system where some people are above the law.",
    "year": "2018"
  },
  {
    "number": "1954",
    "text": "The citizenship of a country could be acquired through_____________",
    "options": {
      "A": "registration and arbitration",
      "B": "presidential proclamation",
      "C": "birth and naturalization",
      "D": "parliamentary legislation"
    },
    "answer_url": "https://myschool.ng/classroom/government/47703?exam_type=jamb&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "The citizenship of a country can be acquired throughbirth and naturalization. Citizenship by birth is acquired automatically when a person is born within a country's territory, or through descent if one or both parents are citizens of that country. The specifics can vary depending on the country's laws, but birthright citizenship is a common method worldwide.\nCitizenship by naturalisation is granted to a foreign national after they fulfil certain criteria set by the country's laws, such as residing in the country for a specific period, demonstrating knowledge of the language, taking an oath of allegiance and understanding the country's constitution and laws.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1955",
    "text": "In a democratic government, franchise is given to all_________",
    "options": {
      "A": "adult citizens",
      "B": "citizens",
      "C": "resident adults",
      "D": "loyal party members"
    },
    "answer_url": "https://myschool.ng/classroom/government/47705?exam_type=jamb&type=obj&page=391",
    "correct_answer": "A",
    "explanation": "Franchise is the right to vote, and in a democratic government, all adult citizens are given the free right to vote their leaders\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1956",
    "text": "Which of the following led to the introduction of indirect rule in Nigeria by the British?",
    "options": {
      "A": "Need for adequate financial resources",
      "B": "Manpower and personnel shortages",
      "C": "Speedy transition to independence",
      "D": "Desire for rapid development"
    },
    "answer_url": "https://myschool.ng/classroom/government/47706?exam_type=jamb&type=obj&page=392",
    "correct_answer": "B",
    "explanation": "Due to the need for both human and financial resources, the British colonial government introduced the indirect rule system to effectively control the area\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1957",
    "text": "Nigeria’s membership of the ECOWAS is informed by her desire to___________",
    "options": {
      "A": "develop a market in the sub-region",
      "B": "form sub-regional high command",
      "C": "become a sub-regional power",
      "D": "promote economic integration"
    },
    "answer_url": "https://myschool.ng/classroom/government/47707?exam_type=jamb&type=obj&page=392",
    "correct_answer": "D",
    "explanation": "Nigeria joined ECOWAS so as to promote and enhance economic integration among West African countries\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1958",
    "text": "The first Head of Government in Nigeria after independence was__________",
    "options": {
      "A": "Nnamdi Azikiwe",
      "B": "Ahmadu Bello",
      "C": "Tafawa Balewa",
      "D": "Herbert Macaulay"
    },
    "answer_url": "https://myschool.ng/classroom/government/47708?exam_type=jamb&type=obj&page=392",
    "correct_answer": "C",
    "explanation": "Tafawa Balewa was the first prime minister of Nigeria after independence and was referred to as the head of government.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1959",
    "text": "One advantage of unwritten constitution is that it___________",
    "options": {
      "A": "is easy to understand by everybody",
      "B": "safeguards the monarchy",
      "C": "contains customary laws and conventions",
      "D": "is not easily amended"
    },
    "answer_url": "https://myschool.ng/classroom/government/47709?exam_type=jamb&type=obj&page=392",
    "correct_answer": "C",
    "explanation": "One advantage of an unwritten constitution is that it contains customary laws and conventions. This means that the Constitution is not limited to the laws that are written down in a single document but can also include laws that have developed over time through custom and practice. The other options are not advantages of an unwritten constitution.\nOption (A) is false. An unwritten constitution can be difficult to understand, especially for ordinary citizens, because it is not codified in a single document.\nOption (B) is not universally true. While an unwritten constitution may safeguard the monarchy in some countries, this is not the case in all countries with unwritten constitutions.\nOption (D) is false. An unwritten constitution can be amended through ordinary legislation, which can make it easier to amend than a written constitution\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1960",
    "text": "Bicameral legislatures are popular in____________-",
    "options": {
      "A": "Unitary system",
      "B": "Federal system",
      "C": "Confederal",
      "D": "Rigid system"
    },
    "answer_url": "https://myschool.ng/classroom/government/47710?exam_type=jamb&type=obj&page=392",
    "correct_answer": "B",
    "explanation": "Federal system of government operates bicameral legislatures in which the law making body is in two levels.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1961",
    "text": "The major motivation of British colonisation of Nigeria was to______________",
    "options": {
      "A": "spread religion",
      "B": "satisfy British economic interests",
      "C": "westernize Nigerians",
      "D": "protect Nigeria from external attack"
    },
    "answer_url": "https://myschool.ng/classroom/government/47711?exam_type=jamb&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "British colonization of Nigeria was fueled by their economic interest in the area, in search of cheap natural and human resources for the development of their economy.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1962",
    "text": "Which of the following countries made up the Casablanca Group?",
    "options": {
      "A": "Liberia, Mali, Egypt",
      "B": "Tunisia, Morocco, Guinea",
      "C": "Mali, Algeria, Egypt",
      "D": "Cote d’Ivoire, Ghana, Libya"
    },
    "answer_url": "https://myschool.ng/classroom/government/47712?exam_type=jamb&type=obj&page=393",
    "correct_answer": "C",
    "explanation": "The Casablanca group are African countries which are radical in achieving the aim of African nationalism. Members include Mali, Algeria, Egypt etc\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1963",
    "text": "The body responsible for exercising the functions of local governments in the 1976 reforms was the________",
    "options": {
      "A": "local government commission",
      "B": "local government council",
      "C": "local government committee",
      "D": "committee of chairmen and supervisory councilors"
    },
    "answer_url": "https://myschool.ng/classroom/government/47713?exam_type=jamb&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "Local government council is a body responsible for exercising the functions of local governments.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1964",
    "text": "One feature of the federal system of government is that the centre is____________",
    "options": {
      "A": "superior to the other components",
      "B": "inferior to the other components",
      "C": "equal to the other components",
      "D": "of-unlimited jurisdiction"
    },
    "answer_url": "https://myschool.ng/classroom/government/47714?exam_type=jamb&type=obj&page=393",
    "correct_answer": "A",
    "explanation": "The centre government is more powerful and superior over the other levels of government.\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1965",
    "text": "A political manifesto is a document which outlines__________",
    "options": {
      "A": "a country’s development",
      "B": "a party’s programme",
      "C": "the national policy",
      "D": "an ethnic interest"
    },
    "answer_url": "https://myschool.ng/classroom/government/47715?exam_type=jamb&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "A political manifesto is a document which shows and outlines a political party’s programme and agenda of which they aim to achieve when they gain power in government\nThere is an explanation video availablebelow.",
    "year": "2018"
  },
  {
    "number": "1966",
    "text": "Public opinion is the view expressed by a_________",
    "options": {
      "A": "few members of the society",
      "B": "few articulate members in the society",
      "C": "majority of the members of a society",
      "D": "group of individuals in the society"
    },
    "answer_url": "https://myschool.ng/classroom/government/47716?exam_type=jamb&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "Public opinion is regarded as the views and opinions given by the public on various issues relating to the government on the running of the country\nThere is an explanation video availablebelow.",
    "year": "2018"
  }
]