[
  {
    "number": "917",
    "text": "'Symbol of fruitfulness, symbol of barrenness Mother and destroyer, the calm and the storm!\nLife and desire and dreams and death\nFrank Collymore, Hymn to the Sea,\nThe address to the sea in the lines above is done by the use of",
    "options": {
      "A": "personification",
      "B": "praise",
      "C": "symbolism",
      "D": "apostrophe"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12834?exam_type=jamb&type=obj&page=184",
    "correct_answer": "A",
    "explanation": "Anapostropheis a figure of speech in which a speaker directly addresses someone or something that is not present or is an abstract concept, often treating it as though it were a person. In the given lines, the speaker addresses the sea directly, referring to it as a \"symbol of fruitfulness,\" \"barrenness,\" \"Mother,\" \"destroyer,\" and other qualities. The sea is personified and spoken to as if it can hear and respond.",
    "year": "2001"
  },
  {
    "number": "918",
    "text": "'When he gave me the bottle, and I opened it, I was shocked by the odour that hit my nose.\nI immediately corked it again, and spat on the floor.'\nIsidore Okpewho, The Last Duty.\nThe reaction in the passage above is that of",
    "options": {
      "A": "rejection",
      "B": "anger",
      "C": "protest",
      "D": "nausea"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12836?exam_type=jamb&type=obj&page=184",
    "correct_answer": "D",
    "explanation": "The strong negative response to the odour, immediately corking the bottle, and spitting on the floor suggests a physical reaction of disgust or nausea to the smell.",
    "year": "2001"
  },
  {
    "number": "919",
    "text": "'CYCLIST gets down and begins to prop his bicycle,\nCYCLIST: All right. If you're sure it won't take long.\nBARBER: I am known for my lightning clippers Even the soldiers know me. I can shave the head of an entire battalion between one coup and the next.\nsit down and relax your back. Cycling is not easy when you've abandoned it for some time...\nWole Soyinka, The Beautification of Area Boy.\nThe literary devices in the dialogue above are",
    "options": {
      "A": "humour and irony",
      "B": "allusion and paradox",
      "C": "irony and parody",
      "D": "hyperbole and allusion"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12837?exam_type=jamb&type=obj&page=184",
    "correct_answer": "D",
    "explanation": "Hyperboleis an exaggerated statement that is not meant to be taken literally. In the dialogue, theBarbersays, \"I can shave the head of an entire battalion between one coup and the next.\" This is clearly an exaggeration to emphasize the speed at which he works.Allusionis a reference to something outside the immediate text. The Barber gives a famous reference to the era when coups succeeded one another in Nigeria's history.",
    "year": "2001"
  },
  {
    "number": "920",
    "text": "'For seven days it rained that June;\nA storm half out to sea kept turning around like a dog trying to settle himself on a rug; We were the fleas that complained in his hair.'\nJohn Updike, Wash\nThe images set in the lines above are of",
    "options": {
      "A": "the days of Noah",
      "B": "rain and flood in June",
      "C": "discomfort and likely destruction",
      "D": "an animal, insects and fun"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12838?exam_type=jamb&type=obj&page=184",
    "correct_answer": "C",
    "explanation": "The passage uses vivid imagery to convey a sense of discomfort and a looming threat of destruction. The storm \"kept turning around like a dog trying to settle himself on a rug,\" which suggests the storm's restlessness and chaotic nature. Additionally, the comparison of people to \"fleas that complained in his hair\" evokes a sense of irritation and helplessness in the face of a powerful and uncontrollable force (the storm).",
    "year": "2001"
  },
  {
    "number": "921",
    "text": "'We have been asleep, Mr. Speaker, my fellow citizens; asleep in our dream of security! Asleep in our well-meaning, sportsmanlike way of wishing the other fellow well. Asleep in the false security of accepting all men of goodwill who would be free as men of honor.'\nRalph Ellison, Juneteenth.\nThe force of the speech above is sustained on.",
    "options": {
      "A": "delivery",
      "B": "musicality",
      "C": "repetition",
      "D": "oratory"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12839?exam_type=jamb&type=obj&page=185",
    "correct_answer": "C",
    "explanation": "In the passage, the phrase \"asleep\" is repeated multiple times to emphasise the speaker's point. This repetition creates a rhythmic, almost hypnotic effect, reinforcing the idea that society has been complacent or unaware of the real dangers or challenges. The repeated use of \"asleep\" helps to underline the speaker's urgency and frustration, making the speech more powerful and impactful.",
    "year": "2001"
  },
  {
    "number": "922",
    "text": "'Thomas Gradgrind, sir. A man who proceeds upon the principle that two is not to be talked into allowing for anything over.'\nCharles Dickens, Hard Times\nFrom the passage above, Thomas Gradgrind is",
    "options": {
      "A": "dogmatic",
      "B": "hostile",
      "C": "theoretical",
      "D": "eloguent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12841?exam_type=jamb&type=obj&page=185",
    "correct_answer": "A",
    "explanation": "Dogmaticrefers to someone who strongly adheres to a set of principles and is unwilling to consider any alternatives or deviations. In the passage, Thomas Gradgrind is described as a person who strictly follows rigid principles (in this case, mathematical precision), implying he is inflexible in his thinking.",
    "year": "2001"
  },
  {
    "number": "923",
    "text": "'Jose Palacios, his oldest servant, found him floating naked with his eyes open in the purifying waters of his bath and thought he had drowned.\nHe knew this was one of the many ways the General meditated, but the ecstasy in which he lay drifting seemed that of a man no longer of this world.'\nGabriel Garcia Marquez, The General in His Labyrinth.\nThe master in the passage above is obviously in a state of",
    "options": {
      "A": "labyrinth",
      "B": "drowning",
      "C": "forgetfulness",
      "D": "trance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12842?exam_type=jamb&type=obj&page=185",
    "correct_answer": "D",
    "explanation": "The passage describes the master floating naked in the bath with his eyes open, showing signs of meditative ecstasy and drifting, which are indicative of a trance-like state where the person is deeply absorbed or lost in thoughts or sensations. This state is further emphasized by the description of the ecstasy in which the master is lying, suggesting a detachment from the physical world and a heightened state of consciousness or meditation.",
    "year": "2001"
  },
  {
    "number": "924",
    "text": "The character 'boy' is used alongside 'the old Man' in the novel to demonstrate.",
    "options": {
      "A": "the humiliation that is in old age",
      "B": "man's refudeal to grow old",
      "C": "different types of characters in the story",
      "D": "the failing productivity that accompanies old age"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12843?exam_type=jamb&type=obj&page=185",
    "correct_answer": "D",
    "explanation": "InThe Old Man and the Sea, the character of the boy is a contrast to the old man (Santiago) and symbolizes both the old man's past vitality and the reality of his current situation. The relationship between Santiago and the boy illustratesthe failing productivity that accompanies old agebecause Santiago is no longer able to provide for himself or catch fish as he once did.",
    "year": "2001"
  },
  {
    "number": "925",
    "text": "The skeleton of the marlin implies the",
    "options": {
      "A": "sharks' predatory inclination",
      "B": "futility of human struggle",
      "C": "old man's  lack of faith",
      "D": "old man's incompetence in fishing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12844?exam_type=jamb&type=obj&page=185",
    "correct_answer": "B",
    "explanation": "InThe Old Man and the Sea, the skeleton of the marlin symbolises thefutility of human struggle. Santiago's heroic battle to catch the fish and his ultimate defeat by the sharks demonstrate the fleeting nature of success and the inevitability of loss, despite one's best efforts. The marlin's skeleton, once beautiful and strong, now remains a symbol of Santiago's failed attempt to preserve his victory.",
    "year": "2001"
  },
  {
    "number": "926",
    "text": "The Old Man and the Sea epitomises",
    "options": {
      "A": "the relationship between a man and a fish",
      "B": "the vain expectations of man",
      "C": "life on the high seas",
      "D": "a fulfilled life"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12845?exam_type=jamb&type=obj&page=186",
    "correct_answer": "B",
    "explanation": "The Old Man and the Seais seen as a story about the human struggle against nature, symbolized by Santiago's battle with the marlin. While Santiago’s effort and determination are heroic, his ultimate loss of the fish to the sharks suggests the futility and the transient nature of human endeavours.",
    "year": "2001"
  },
  {
    "number": "927",
    "text": "Santiago loses his catch to the sharks because",
    "options": {
      "A": "the blood attracts them",
      "B": "he does not sail home early",
      "C": "the sharks are predators",
      "D": "it is too dark"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12846?exam_type=jamb&type=obj&page=186",
    "correct_answer": "A",
    "explanation": "InThe Old Man and the Sea, Santiago catches a giant marlin, but during his struggle to bring it in, the fish is wounded. The blood from the marlin attracts sharks, which eventually attack the fish. Despite Santiago’s efforts to fend off the sharks, they devour the marlin, leaving Santiago with little to show for his efforts.",
    "year": "2001"
  },
  {
    "number": "928",
    "text": "Laye's stay with Uncle Mamadou reveals a lot about",
    "options": {
      "A": "his unwillingness to stay with his parents",
      "B": "his affection for his uncle",
      "C": "the strength of communal living in Africa",
      "D": "the irresponsibility of his parents"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12849?exam_type=jamb&type=obj&page=186",
    "correct_answer": "C",
    "explanation": "InThe African Child, Camara Laye's stay with Uncle Mamadou showcases the traditional African practice of communal living, where extended families and the community play an important role in raising children.",
    "year": "2001"
  },
  {
    "number": "929",
    "text": "The setting of The African Child is a kingdom with",
    "options": {
      "A": "Islamic and modern traditions",
      "B": "pre-Islamic and Islamic traditions",
      "C": "pre-Islamic traditions",
      "D": "pre-Islamic and modern traditions"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12850?exam_type=jamb&type=obj&page=186",
    "correct_answer": "A",
    "explanation": "InThe African Childby Camara Laye, the setting of the story reflects a combination of Islamic culture and the influences of modernity. The story is set in a traditional and predominantly agrarian community undergoing influences from Islam and France.",
    "year": "2001"
  },
  {
    "number": "930",
    "text": "Laye's first-person narrative techinique",
    "options": {
      "A": "makes the work very humorous",
      "B": "makes his work less realistic",
      "C": "quickens the tempo of his narrative",
      "D": "makes his story more believable"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12851?exam_type=jamb&type=obj&page=186",
    "correct_answer": "D",
    "explanation": "InThe African Child, Camara Laye uses a first-person narrative technique, where the protagonist recounts his experiences directly. This approach provides an intimate perspective, allowing readers to connect with the character's personal emotions, thoughts and experiences.",
    "year": "2001"
  },
  {
    "number": "931",
    "text": "Pa Noble became a living legend because",
    "options": {
      "A": "several conflicting stories were woven around him",
      "B": "he attained the status of a first-class citizen",
      "C": "he was the only successful son of a Benin chief",
      "D": "he was rich and very generous"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12852?exam_type=jamb&type=obj&page=187",
    "correct_answer": "A",
    "explanation": "InSecond Class Citizenby Buchi Emecheta, Pa Noble is a character surrounded by various stories, some of which are exaggerated or conflicted. These stories, along with his larger-than-life image, contribute to his status as a \"living legend.\" The different narratives about him, which blend fact with fiction, elevate his reputation in the community, making him more than just a man, but a legendary figure.",
    "year": "2001"
  },
  {
    "number": "932",
    "text": "The marriage of Adah and Francis collapses because of",
    "options": {
      "A": "Adah's unifaithfulness to Francis",
      "B": "the influence of British culture",
      "C": "Adah's  desire for personal fulfilment",
      "D": "external pressures on the couple"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12853?exam_type=jamb&type=obj&page=187",
    "correct_answer": "D",
    "explanation": "The collapse of Adah and Francis's marriage is primarily due to external pressures on the couple. Throughout the novel,  Adah and Francis face numerous challenges and obstacles that put a strain on their relationship. These external pressures include societal expectations, financial difficulties, and the impact of cultural and racial discrimination. These factors contribute to the breakdown of their marriage and this highlights the influence of external forces on their personal lives and relationship.",
    "year": "2001"
  },
  {
    "number": "933",
    "text": "The character of Marshal in the play shows that",
    "options": {
      "A": "human beings are selfless",
      "B": "human beings are the same",
      "C": "men love women",
      "D": "human beings love power"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12854?exam_type=jamb&type=obj&page=187",
    "correct_answer": "D",
    "explanation": "InMorountodun, the character of Marshal represents the pursuit of power. Throughout the play, Marshal's actions and motivations reveal a deep desire for control and influence, particularly over others. His character is driven by the need for power, which influences his decisions and his relationships with other characters.",
    "year": "2001"
  },
  {
    "number": "934",
    "text": "The sub-plots of the play are united by",
    "options": {
      "A": "an interest in peace",
      "B": "the audience participlation",
      "C": "a lack of focus",
      "D": "a common concern for the heroine"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12855?exam_type=jamb&type=obj&page=187",
    "correct_answer": "D",
    "explanation": "InMorountodun, the various sub-plots are united by their focus on the central character, Morountodun. These sub-plots revolve around the heroine's struggles, including her journey, her relationships and the larger societal issues she faces. The attention to her character ties together the different threads of the play, making her the central figure around which the action and various conflicts unfold.",
    "year": "2001"
  },
  {
    "number": "935",
    "text": "The war in Femi Osofisan's Morountondun symbolizes the struggle between the",
    "options": {
      "A": "capitalists and the socialists",
      "B": "bourgeoisie and the proleteriat",
      "C": "market women and the men",
      "D": "farmers and the consumers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12857?exam_type=jamb&type=obj&page=187",
    "correct_answer": "B",
    "explanation": "InMorountodunby Femi Osofisan, the war symbolizes a broader societal struggle between the ruling class (bourgeoisie) and the working class (proletariat). This conflict is evident in the play, where the exploitation and oppression of the working class by those in power are central themes.",
    "year": "2001"
  },
  {
    "number": "936",
    "text": "The frequent intervention of the Director makes the stage experience of Morountodun very",
    "options": {
      "A": "prolonged",
      "B": "boring",
      "C": "informal",
      "D": "uncoordinated"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12859?exam_type=jamb&type=obj&page=188",
    "correct_answer": "C",
    "explanation": "InMorountodun, the director’s frequent interventions serve to break the traditional boundaries of a stage performance, making the experience less formal and more interactive.",
    "year": "2001"
  },
  {
    "number": "937",
    "text": "Not yet old enough for a man, nor young enough for a boy; as a squash is before 't is almost an apple; 't is with him in standing water, between boy and man. He is very well-favoured, and he speaks very shrewishly; one would think his mother's milk were scarce out of him.\nThe images in the quotation above express the speaker's",
    "options": {
      "A": "contempt and admiration",
      "B": "hatred and pity",
      "C": "contempt and disregard",
      "D": "disregard and pity"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12864?exam_type=jamb&type=obj&page=188",
    "correct_answer": "C",
    "explanation": "In this passage fromTwelfth Night, the speaker (Feste) describes someone who is in the awkward phase between childhood and adulthood. The use of \"squash\" and \"codling\" (unripe fruits) as metaphors highlights how the person is neither fully a boy nor a man. The speaker's comment on the person's \"shrewish\" speech and the suggestion that \"his mother's milk were scarce out of him\" expresses disdain and a lack of respect.",
    "year": "2001"
  },
  {
    "number": "938",
    "text": "Come away, come away, death,\nAnd in sad cypress let me be laid...\nIn the lines above, the character is",
    "options": {
      "A": "expressing his unhappiness about death",
      "B": "expressing his preference for a cypress coffin",
      "C": "lamenting over his unreciprocated love",
      "D": "wishing for death to come"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12868?exam_type=jamb&type=obj&page=188",
    "correct_answer": "C",
    "explanation": "The lines you refer to are from Feste's song inTwelfth Night, where the character expresses sorrow over love that is not returned. The use of \"Come away, come away, death\" reflects the speaker's deep despair, wishing for death as an escape from the pain of unrequited love. The mention of being laid in \"sad cypress,\" a tree often associated with mourning, reinforces the theme of sadness and loss, rather than a preference for death itself or a cypress coffin.",
    "year": "2001"
  },
  {
    "number": "939",
    "text": "Duke:\nBe clamorous, and leap all civil bounds,\nRather than make unprofited return.\nDuke's statement above to Cesario means that he should",
    "options": {
      "A": "make trouble to see Olivia",
      "B": "jump the fence to see Olivia",
      "C": "shout to be seen and heard by Olivia",
      "D": "fortify himself against any denial to see Olivia"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12876?exam_type=jamb&type=obj&page=188",
    "correct_answer": "D",
    "explanation": "In this line, the Duke is urging Cesario (Viola in disguise) to take bold action in his pursuit of Olivia. The phrase \"be clamorous\" suggests making a loud or forceful approach to capture Olivia's attention, and \"leap all civil bounds\" implies disregarding social norms or restrictions in order to achieve the goal. Therefore, the Duke is encouraging Cesario to be conspicuous and assertive in a way that will ensure Olivia notices him, even if it means disregarding conventional social boundaries.",
    "year": "2001"
  },
  {
    "number": "940",
    "text": "The traditional verse form of speech as dialogue in Twelfth Night is used to symbolize the",
    "options": {
      "A": "impressiveness of the character",
      "B": "distinction between verse and prose",
      "C": "function of poetry in the play",
      "D": "traditionlity of the play"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12878?exam_type=jamb&type=obj&page=188",
    "correct_answer": "A",
    "explanation": "InTwelfth Night, Shakespeare uses verse (typically iambic pentameter) for more elevated, serious or formal moments, often when characters like Orsino or Viola speak. Prose is used for more casual, comedic, or lower-class characters (like Sir Toby or Feste). This distinction helps to highlight differences in social class of the characters.",
    "year": "2001"
  },
  {
    "number": "941",
    "text": "Twelfth Night is preoccupied with the juxtaposition of",
    "options": {
      "A": "death and disappointment",
      "B": "appearance and reality",
      "C": "life and disappointment",
      "D": "love and death"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12881?exam_type=jamb&type=obj&page=189",
    "correct_answer": "B",
    "explanation": "Twelfth Nightexplores the theme ofappearance versus reality, where characters often disguise themselves, leading to confusion and mistaken identities. This theme runs throughout the play, particularly in the cases of Viola and Cesario, and the humorous situations that arise from the characters' misperceptions and misunderstandings.",
    "year": "2001"
  },
  {
    "number": "942",
    "text": "In Niyi Osundare' s ' They Too Are The Earth', the musical effect is achieved by",
    "options": {
      "A": "repetition",
      "B": "double rhymes",
      "C": "assonance",
      "D": "end rhymes"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12885?exam_type=jamb&type=obj&page=189",
    "correct_answer": "A",
    "explanation": "Repetitionis a key technique used by Osundare in this poem to create rhythm and musicality. The repeated use of words or phrases enhances the poem's musicality and places emphasis on the parts of the poem that convey the theme.",
    "year": "2001"
  },
  {
    "number": "943",
    "text": "The rhyming pattern in the last stanza of Okigbo' s Hurrah for Thunder' makes the stanza",
    "options": {
      "A": "an octave",
      "B": "a  quatrain",
      "C": "a couplet",
      "D": "a sestet"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12886?exam_type=jamb&type=obj&page=189",
    "correct_answer": "C",
    "explanation": "The last stanza of Okigbo's \"Hurrah for Thunder\" is a couplet. ACoupletis a pair of lines that usually rhyme.",
    "year": "2001"
  },
  {
    "number": "944",
    "text": "In Keats ' Ode on a Grecian Urn', the recurrent use of the rhetorical question in the lines above suggests",
    "options": {
      "A": "admiration and amazement",
      "B": "confusion and fear",
      "C": "shock and surprie",
      "D": "worry and sadness"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12887?exam_type=jamb&type=obj&page=189",
    "correct_answer": "A",
    "explanation": "In Keats'Ode on a Grecian Urn, the recurrent use of the rhetorical question in the lines above suggestsadmiration and amazement. The rhetorical questions in the poem are used by the speaker to reflect on the timeless beauty and mystery of the scenes depicted on the urn. These questions express the speaker's awe and fascination with the urn's ability to capture eternal moments, frozen in time.",
    "year": "2001"
  },
  {
    "number": "945",
    "text": "This question is based on General Literary Principles.\nThe most important concepts in poetry are",
    "options": {
      "A": "story and action",
      "B": "plot and rhythm",
      "C": "rhythm and imagery",
      "D": "plot and character"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12897?exam_type=jamb&type=obj&page=189",
    "correct_answer": "C",
    "explanation": "While elements like plot and character are more prominent in narrative forms like fiction or drama, poetry relies heavily on rhythm (meter, rhyme, and other sound patterns) and imagery (vivid and descriptive language) to convey emotions, ideas and experiences.",
    "year": "2001"
  },
  {
    "number": "946",
    "text": "This question is based on General Literary Principles.\nThe literary device which anticipates that an event will take place is best described as",
    "options": {
      "A": "foreshadowing",
      "B": "rising action",
      "C": "flashback",
      "D": "parody"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12898?exam_type=jamb&type=obj&page=190",
    "correct_answer": "A",
    "explanation": "Foreshadowingis a technique used by writers to give hints or clues about what will happen later in the story. It helps build suspense and prepares the audience for upcoming events.",
    "year": "2001"
  },
  {
    "number": "947",
    "text": "This question is based on General Literary Principles.\nThe flat character in a literary work",
    "options": {
      "A": "is the same as the round character",
      "B": "cannot be found in an allegory",
      "C": "is capable of growing",
      "D": "always embodies a quality"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12899?exam_type=jamb&type=obj&page=190",
    "correct_answer": "D",
    "explanation": "Aflat characteris a simple, one-dimensional character who embodies a single trait, quality or idea. Such characters do not undergo significant development or growth throughout the story. They are often used to support the plot or highlight aspects of more complex characters.",
    "year": "2001"
  },
  {
    "number": "948",
    "text": "This question is based on General Literary Principles.\nThe overwhelming pride that destroys the tragic hero is called",
    "options": {
      "A": "tragedy",
      "B": "nemesis",
      "C": "catharsis",
      "D": "hubris"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12902?exam_type=jamb&type=obj&page=190",
    "correct_answer": "D",
    "explanation": "Hubrisrefers to excessive pride or arrogance in a character, often atragic hero, which leads to their downfall. This concept is a hallmark of classical tragedy, where the hero's inability to recognise their flaws or limitations causes catastrophic consequences.",
    "year": "2001"
  },
  {
    "number": "949",
    "text": "This question is based on General Literary Principles.\nA farce refers to a drama that has elements of the",
    "options": {
      "A": "serious",
      "B": "comic",
      "C": "satiric",
      "D": "tragic"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12904?exam_type=jamb&type=obj&page=190",
    "correct_answer": "B",
    "explanation": "Afarceis a type of comedy that uses exaggerated and absurd situations, improbable events and physical humour to entertain the audience. It often relies on slapstick, mistaken identities and ridiculous scenarios for comedic effect.",
    "year": "2001"
  },
  {
    "number": "950",
    "text": "This question is based on General Literary Principles.\nCatharsis is experienced",
    "options": {
      "A": "after one has written a play",
      "B": "when a play is still being staged",
      "C": "before watching a play",
      "D": "after watching a play"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12906?exam_type=jamb&type=obj&page=190",
    "correct_answer": "B",
    "explanation": "Catharsis occurswhile the play is being staged, particularly during the moments of heightened emotional intensity, such as the climax and resolution. Audience members experience a release of emotions as they witness the unfolding tragedy or intense drama. This emotional engagement happens in real-time as the events resonate with the audience's fears and sympathies.",
    "year": "2001"
  },
  {
    "number": "951",
    "text": "This question is based on General Literary Principles.\nAn extended fictional narrative which is realistic is known as a",
    "options": {
      "A": "diary",
      "B": "novel",
      "C": "novella",
      "D": "short story"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12908?exam_type=jamb&type=obj&page=191",
    "correct_answer": "B",
    "explanation": "Anovelis a long, fictional narrative that explores realistic characters, settings and events and delves deeply into themes and human experiences. ADiaryrefers to a personal, non-fictional record of daily events and thoughts. ANovellais a shorter fictional narrative than a novel but longer than a short story. AShort storyis a brief fictional narrative focusing on a single event or character.",
    "year": "2001"
  },
  {
    "number": "952",
    "text": "This question is based on General Literary Principles.\nThe technique in which both the stage and the auditorium are involved in a lay production is called",
    "options": {
      "A": "theatre of the absurd",
      "B": "role-playing",
      "C": "audience participation",
      "D": "total theatre"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12910?exam_type=jamb&type=obj&page=191",
    "correct_answer": "C",
    "explanation": "Audience participationinvolves direct interaction with the audience in the auditorium as the play is acted on stage.",
    "year": "2001"
  },
  {
    "number": "953",
    "text": "The theme of Browning's My Last Duchess' is",
    "options": {
      "A": "an aristocrats's marital problems",
      "B": "the pitfalls of a duchess now dead",
      "C": "an  ambassador's personal life",
      "D": "the pride and arrogance of an aristocrat"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12916?exam_type=jamb&type=obj&page=191",
    "correct_answer": "D",
    "explanation": "The Duke, the speaker in the poem, reveals his pride, arrogance and obsessive desire for control as he narrates the story of his late wife. He views her as a possession rather than a person and values her only because of how she reflects on his status and authority. His disdain for her independent expressions of joy and his chilling implications about her fate underscore his hubris and authoritarian nature.",
    "year": "2001"
  },
  {
    "number": "954",
    "text": "Tanure Ojaide's  The Owl Wakes Us portrays a society that is",
    "options": {
      "A": "unstable",
      "B": "hunted by the owl",
      "C": "gripped with fear",
      "D": "peaceful"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12920?exam_type=jamb&type=obj&page=191",
    "correct_answer": "A",
    "explanation": "In Ojaide’s poem, the presence of the owl and its call awakens us to an impending doom on society due to societal instability.",
    "year": "2001"
  },
  {
    "number": "955",
    "text": "In Mapanje's  When This Carnival Finally Closes', the poet is describing the",
    "options": {
      "A": "role of spirits in a carnival",
      "B": "preparation for a carnival",
      "C": "role of drumming and dancing in a carnival",
      "D": "role of sycophancy and bad leadership"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12921?exam_type=jamb&type=obj&page=191",
    "correct_answer": "D",
    "explanation": "The poem is a metaphorical commentary on the political situation, where the \"carnival\" symbolises the chaotic, superficial and corrupt nature of leadership. The speaker reflects on the end of this \"carnival\" as a moment of reckoning, hinting at the negative effects of sycophancy, exploitation, and misgovernance, which have been prominent throughout the event.",
    "year": "2001"
  },
  {
    "number": "956",
    "text": "From the tone of Wole Soyinka's 'Telephone Conversation', the two persons talking hold each other in",
    "options": {
      "A": "mutual suspicion",
      "B": "deep affection",
      "C": "high esteem",
      "D": "outright contempt"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12925?exam_type=jamb&type=obj&page=192",
    "correct_answer": "A",
    "explanation": "The poem explores a telephone conversation between a prospective tenant (the speaker) and a landlady. The landlady's reaction to the speaker's race and her questions reveal a sense of suspicion and prejudice, while the speaker's responses indicate discomfort and unease. Both characters display a lack of trust and understanding towards each other, characterized by mutual suspicion and subtle conflict.",
    "year": "2001"
  },
  {
    "number": "957",
    "text": "The major theme of Thomas  Gray''s Elegy Written in a Country Churchyard'' is that death renders life",
    "options": {
      "A": "meaningless for the rich",
      "B": "meaningful for the poor",
      "C": "meaningless for all",
      "D": "meaningful for all"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12928?exam_type=jamb&type=obj&page=192",
    "correct_answer": "C",
    "explanation": "Gray's poem meditates on death and the lives of ordinary people, particularly those buried in the churchyard. It reflects on how death brings equality to all, regardless of social status, and that everyone, whether rich or poor, will eventually face it. The poem suggests that the simple lives of the poor, though uncelebrated, have meaning and dignity in the face of death. It is a reflection on the shared human experience of mortality.",
    "year": "2001"
  },
  {
    "number": "958",
    "text": "Browning's  My Last Duchess  apparently shows the Duke's",
    "options": {
      "A": "hatred for common love",
      "B": "desire to marry beautiful women",
      "C": "appreciation of works of art",
      "D": "praise of Fra Pandolf"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12929?exam_type=jamb&type=obj&page=192",
    "correct_answer": "D",
    "explanation": "The poem is written to praise Fra Pandolf, the woman he marries because he his displeased by his late wife.",
    "year": "2001"
  },
  {
    "number": "959",
    "text": "In Rubadiri''s '' Stanley Meets Mutesa'',  the poet portrays the hardship experienced by the explorer's party through",
    "options": {
      "A": "visual and verbal images",
      "B": "visual and tactile images",
      "C": "olfactory and visual images",
      "D": "auditory and olfactory images"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12930?exam_type=jamb&type=obj&page=192",
    "correct_answer": "A",
    "explanation": "The poet usesvisual imagesto describe the difficult physical environment and the appearance of the setting, allowing the reader to see the hardships the explorers face.verbal imagesare used to evoke the physical sensations of speech.",
    "year": "2001"
  },
  {
    "number": "960",
    "text": "John Keats' 'Ode on a Grecian Urn' expresses the idea that",
    "options": {
      "A": "the Grecian Urn is ancient",
      "B": "the Grecian Urn is mysterious",
      "C": "every work of art is beautiful",
      "D": "life is long, art is longer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12933?exam_type=jamb&type=obj&page=192",
    "correct_answer": "D",
    "explanation": "In the poem, Keats reflects on the timeless nature of art, symbolized by the Grecian urn. The urn preserves an image of eternal beauty and perfection, untouched by the passage of time. The idea that \"life is long, art is longer\" comes from the notion that while human life is fleeting, art—capturing beauty and meaning—endures far beyond the lives of those who create it.",
    "year": "2001"
  },
  {
    "number": "961",
    "text": "'The curfew tolls the knell of parting day,\nThe lowing herd wind slowly o'er the lea,\nThe plowman homeward plods his weary way;\nAnd leaves the world to darkness and to me.'\nIn the lines above from Gray's 'Elegy Written in a Country Churchyard',  the imagery is",
    "options": {
      "A": "of an approaching night in a rustic setting",
      "B": "about a village under a curfew one night",
      "C": "of an approaching death in a village",
      "D": "of a man abandoned in his homeward journey"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/12942?exam_type=jamb&type=obj&page=193",
    "correct_answer": "C",
    "explanation": "The imagery in these lines evokes a tranquil rural scene at twilight, where the \"curfew tolls\" signalling the end of the day, and various elements of the countryside—such as the \"lowing herd\" and the \"plowman homeward\"—paint a picture of a peaceful, quiet evening setting. The transition from day to night and the solitude that follows are key components of the imagery. The image of approaching darkness symbolises the advent of death, which is the central theme of the poem.",
    "year": "2001"
  },
  {
    "number": "1657",
    "text": "In Oswald Mtshali's 'Nightfall in Soweto', night",
    "options": {
      "A": "drives man's enemy",
      "B": "fools man's enemy",
      "C": "hides man's enemy",
      "D": "aids man's enemy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/41536?exam_type=jamb&type=obj&page=332",
    "correct_answer": "D",
    "explanation": "In the poem, the night is portrayed as a time when the dangers and challenges faced by the people of Soweto are concealed or obscured, allowing evil or danger to creep unnoticed. The \"enemy\" refers to the social, political, and possibly physical dangers lurking in the darkness, which the night aids .",
    "year": "2001"
  },
  {
    "number": "1658",
    "text": "The diction of Femi Osofisan's Morountodun can be described as",
    "options": {
      "A": "political and rhetorical",
      "B": "arrogant and condemnatory",
      "C": "urgent but apolitical",
      "D": "poetic but difficult"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/41537?exam_type=jamb&type=obj&page=332",
    "correct_answer": "A",
    "explanation": "The play addresses societal and political issues, with characters engaging in discussions that reveal the social, cultural and political struggles of the time. The dialogue inMorountodunuses rhetorical devices, persuasive language and impassioned speeches to convey its themes and persuade the audience to reflect on the issues at hand.",
    "year": "2001"
  },
  {
    "number": "1659",
    "text": "This question is based on Literary Appreciation. \n'Careened,\nThese oily tears\nDripping down the tears on your depressed face,\nWill one day be staunched,\nI swear!\nIbiwari Ikiriko, Oily Tears\nThe tone of the poet is",
    "options": {
      "A": "optimistic",
      "B": "supplicatory",
      "C": "sympathetic",
      "D": "piteous"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/41538?exam_type=jamb&type=obj&page=332",
    "correct_answer": "A",
    "explanation": "The poet speaks abouttearsanddepressionand expresses a sense of understanding and emotional connection with the subject of the poem. The use of words like \"oily tears\" and \"depressed face\" evokes empathy for the emotional pain being described.",
    "year": "2001"
  },
  {
    "number": "1660",
    "text": "This question is based on Literary Appreciation. \n'Lift not the painted veil which those who live call\nlife: though unreal shapes be pictured there,\nAnd it but mimic all we would believe\nWith colours idly spread - behind, lurk fear,'\nP.B Shelley, Sonnet.\nThe stanza above is an example of a",
    "options": {
      "A": "quatrain",
      "B": "couplet",
      "C": "free verse",
      "D": "limerick"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/literature-in-english/41539?exam_type=jamb&type=obj&page=332",
    "correct_answer": "A",
    "explanation": "Aquatrainis a stanza of four lines, often with a specific rhyme scheme. The stanza contains four lines, making it a quatrain.",
    "year": "2001"
  }
]