[
  {
    "number": "1967",
    "text": "In a democratic system _______",
    "options": {
      "A": "Majority Vote",
      "B": "Legal Sovereignty shouldn't be unquestionable",
      "C": "Electoral college is always necessary",
      "D": "Minority vote but majority rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/55040?exam_type=jamb&type=obj&page=394",
    "correct_answer": "B",
    "explanation": "Legal sovereignty shouldn't be unquestionable because in a democratic system, the powers of the legislature should be subject to necessary executive and judicial review respectively for the sake of checks and balance and accountability.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1968",
    "text": "That type of sovereignty that thrives on legitimacy is__________",
    "options": {
      "A": "external sovereignty",
      "B": "vested on any form of government",
      "C": "legal sovereignty",
      "D": "within the people's mandate"
    },
    "answer_url": "https://myschool.ng/classroom/government/55041?exam_type=jamb&type=obj&page=394",
    "correct_answer": "D",
    "explanation": "Sovereignty that thrives on legitimacy is often referred to aspopular sovereigntyorpolitical sovereignty, which means that the authority of the government is derived from the people's consent. This aligns with the idea of sovereignty beingwithin the people's mandate, as legitimacy is granted through democratic processes such as elections, referenda, and public support.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1969",
    "text": "The right of a citizen to seek redress means the right to________",
    "options": {
      "A": "fair hearing",
      "B": "free access to legal materials",
      "C": "seek an appeal under another judgement",
      "D": "exercise his political liberty"
    },
    "answer_url": "https://myschool.ng/classroom/government/55043?exam_type=jamb&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "Seek an appeal under another judgement is the best answer because,  ''the right to seek redress'' is a fundamental element of rule of law. It means that aggrieved parties should be afforded the opportunity to have their cases re-examined especially by a court of higher authority.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1970",
    "text": "An order compelling a lower court or public corporation to perform in accordance with legitimacy is called_________",
    "options": {
      "A": "the writ of mandamus",
      "B": "the great writ",
      "C": "the writ of ombudsman",
      "D": "none of the above"
    },
    "answer_url": "https://myschool.ng/classroom/government/55045?exam_type=jamb&type=obj&page=394",
    "correct_answer": "A",
    "explanation": "Writ (i.e Order) of Mandamus is usually issued to mandate a public authority to perform its statutory or the functions tied to its establishment. On the alternative, the great writ means the habeas corpus writ issued to order the release of a body or person unlawfully detained or imprisoned to stand judgement\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1971",
    "text": "A form of government which has its slogan to be 'ruling of the best' is__________",
    "options": {
      "A": "democracy",
      "B": "aristocracy",
      "C": "timocracy",
      "D": "plutocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/55046?exam_type=jamb&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "Aristocracy being a rule by the Noble is believed to be a ruling of the best class of persons. Timocracy on the other hand, is believed by Aristotle to be a government strictly by property-owners with emphasis on honour and proprietary interest holdings.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1972",
    "text": "Deconcentration of power means the_______",
    "options": {
      "A": "sharing of powers among tiers of government",
      "B": "creation of semi autonomous units to govern other parts of a state",
      "C": "process of setting strategies or policies for the subsidiary territories in the state by putting recognized personnel in place",
      "D": "act of delegating powers and authority to component units that exist in a state"
    },
    "answer_url": "https://myschool.ng/classroom/government/55049?exam_type=jamb&type=obj&page=395",
    "correct_answer": "C",
    "explanation": "Deconcentration involves the passing down of selected administrative functions to lower levels or units within government agencies or departments with the centre remaining in control\nLike the series of political office arrangements and portfolios in the Hausa/Fulani Empire i.e the Galadima, Waziri and the rest, deconcentration of power is obtainable unlike in devolution which Options B and D implicitly cover. Option A refers to the Decentralization of powers.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1973",
    "text": "The concept of the independence of the judiciary means that________",
    "options": {
      "A": "The judiciary must not attempt to meddle into legislative and executive affairs",
      "B": "The powers of the courts can not be subjected of executive re-assessment",
      "C": "The sanctity of the office of the Judges and Justices must be preserved without prejudice",
      "D": "All means of legislative or executive influence on judicial decision making must be disabled"
    },
    "answer_url": "https://myschool.ng/classroom/government/55050?exam_type=jamb&type=obj&page=395",
    "correct_answer": "D",
    "explanation": "Strictly speaking, independence of the judiciary isn't restricted to the idea of non-interference by the legislature or executive or either of agencies on judicial decision making but particularly ensuring that all the gateways to the activities that may put the judiciary in a vulnerable state to the other arms of government must be shut down.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1974",
    "text": "The political party serves as________",
    "options": {
      "A": "A platform upon which the rights and liberties of the people can be attained",
      "B": "The group aggregating the interest of all in the state",
      "C": "A platform for rebelling against military rule",
      "D": "A platform for interest representation"
    },
    "answer_url": "https://myschool.ng/classroom/government/55051?exam_type=jamb&type=obj&page=395",
    "correct_answer": "D",
    "explanation": "Political parties act as a means through which various interests and concerns of the people are represented and advocated for within the political system. They aggregate diverse viewpoints and channel them into actionable policies, ensuring that the voices of different groups are heard in governance.",
    "year": "2019"
  },
  {
    "number": "1975",
    "text": "A party can be said to have national outlook if________",
    "options": {
      "A": "it is ethnic based but has branches all over the state",
      "B": "its membership cut across ethnic boundaries",
      "C": "it is registered by the electoral commission as a national party",
      "D": "it is headed by individuals who are famous within and without the country"
    },
    "answer_url": "https://myschool.ng/classroom/government/55052?exam_type=jamb&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "Unlike the ethnic based philosophy, nature or outlook of the Action Group, Northern Peoples Congress in the First Republic, a multi-ethnic and all embracing political party is that with a Nation wide outlook\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1976",
    "text": "Argumentation, negotiation and deliberation on the subject matter of a bill begins at the_______",
    "options": {
      "A": "third stage",
      "B": "first reading",
      "C": "committee stage",
      "D": "second reading"
    },
    "answer_url": "https://myschool.ng/classroom/government/55054?exam_type=jamb&type=obj&page=396",
    "correct_answer": "D",
    "explanation": "At the second stage or reading of a bill, the debate on the subject matter of concern of the bill begins, this process becomes heightened at the Third Stage and particularly at the Committee Stage.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1977",
    "text": "A vote of no confidence means______",
    "options": {
      "A": "the same as impeachment in a presidential system",
      "B": "the ability of the head of state to dissolve the parliament when collective responsibility fails to hold",
      "C": "the act of showing disapproval to the prime minister having breached the collective responsibility doctrine",
      "D": "the disapproval with dismissal in effect, the ministers and its head"
    },
    "answer_url": "https://myschool.ng/classroom/government/55056?exam_type=jamb&type=obj&page=396",
    "correct_answer": "D",
    "explanation": "vote of no confidence; a vote showing that a majority does not support the policy of a leader or governing body.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1978",
    "text": "A cabinet reshuffle takes place......",
    "options": {
      "A": "only when a motion of no confidence is passed",
      "B": "when dissolution is held",
      "C": "when prorogation and collective responsibility have their way",
      "D": "when the shadow cabinet fails in its effectiveness"
    },
    "answer_url": "https://myschool.ng/classroom/government/55059?exam_type=jamb&type=obj&page=396",
    "correct_answer": "B",
    "explanation": "A cabinet reshuffle takes place when dissolution is held. In parliamentary systems, a cabinet reshuffle may occur when there is a general election and the government is dissolved, leading to a need for reorganizing the cabinet with new ministers or changing existing ones. The membership of the Cabinet will be substituted or reshuffled, especially when there is the dissolution of the cabinet in its entirety in a Parliamentary/ Westminster system.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1979",
    "text": "Popular political participation means________",
    "options": {
      "A": "having majority of the people partaking in politics",
      "B": "having a good number of voters in the electoral process",
      "C": "the aggregate efforts of more than half of the citizens to partake in public debate and politics",
      "D": "the sum total of all activities exerted by the majority with enthusiasm actively involving in all aspects of their political sphere"
    },
    "answer_url": "https://myschool.ng/classroom/government/55060?exam_type=jamb&type=obj&page=396",
    "correct_answer": "D",
    "explanation": "The sum total of all activities exerted by the majority with enthusiasm actively involving in all aspects of their political sphere is the best answer not only because is the all-encompassing answer but also because popular political participation is the aggregation of all efforts of the citizens partaking deliberately and consciously in their governance affairs.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1980",
    "text": "The area from which one or more members or representatives are elected in public offices is called the electoral ........",
    "options": {
      "A": "College",
      "B": "Constituency",
      "C": "Ward",
      "D": "District"
    },
    "answer_url": "https://myschool.ng/classroom/government/55063?exam_type=jamb&type=obj&page=396",
    "correct_answer": "B",
    "explanation": "Constituency is the definition for the political area from which an individual is elected into a representative office.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1981",
    "text": "Citizenship by naturalization________",
    "options": {
      "A": "is the same as citizenship by marriage and registeration",
      "B": "refers to the process of attaining citizenship through honorary means",
      "C": "is the act of a non-citizen having satisfied the constitutional criteria becoming a legal member of a state",
      "D": "is the medium by which an alien through the judiciary receives certification and attains citizenship by birth"
    },
    "answer_url": "https://myschool.ng/classroom/government/55065?exam_type=jamb&type=obj&page=397",
    "correct_answer": "C",
    "explanation": "Citizenship by naturalization provides the medium for non-citizens who have satisfied or fulfilled the requirements of good citizenship according to a State Law, to become Citizens.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1982",
    "text": "The last measure used by the pressure groups issuing a condition to be satisfied within a stipulated time is called_______",
    "options": {
      "A": "Lobbying",
      "B": "Ultimatum",
      "C": "Dialogue",
      "D": "Strike"
    },
    "answer_url": "https://myschool.ng/classroom/government/55066?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "Pressure groups commonly issued deadlines(ultimatum) for the government to fulfill their requests and queries before embarking on strike action.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1983",
    "text": "Generally, a political party with only manifestoes without fulfilment is a/an _____",
    "options": {
      "A": "conservative party",
      "B": "elitist party",
      "C": "theocratic party",
      "D": "republican party"
    },
    "answer_url": "https://myschool.ng/classroom/government/55068?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "Elitist is often used as a critique label, to describe a political party definitive of social class and rankings of top profiled politicians without much agenda for social justice. Elitist parties are often seen as focusing more on presenting themselves as representatives of a particular elite or ideology rather than actively implementing their policies or fulfilling their promises.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1984",
    "text": "A form of government organized by a council of military officers is called______",
    "options": {
      "A": "Militocracy",
      "B": "Stratocracy",
      "C": "Military Junta",
      "D": "Mobocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/55071?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "A stratocracy is a form of government headed by military chiefs.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1985",
    "text": "The non-stratified society in the pre-colonial era was that of the ........ where decisions were made________",
    "options": {
      "A": "Yoruba, by the Oyomesi",
      "B": "Igbo, by consensus",
      "C": "Hausa/Fulani, by the Emir",
      "D": "Igbo, by the Okpara"
    },
    "answer_url": "https://myschool.ng/classroom/government/55072?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "The Igbo precolonial was seen as ''headless'' and decisions were made based on popular consultations and acceptability.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1986",
    "text": "The Hausa/Fulani Empire as a result of its heterogeneous population adopted_________",
    "options": {
      "A": "A unitary system where full concentration of power prevailed",
      "B": "A federal structure where powers were decentralized although autocratic",
      "C": "A quasi federal structure with devolution",
      "D": "A partial federal set up with deconcentration"
    },
    "answer_url": "https://myschool.ng/classroom/government/55073?exam_type=jamb&type=obj&page=398",
    "correct_answer": "D",
    "explanation": "The hausa/fulani empire for geo-political reasons apportioned different portfolios of authorities for serve the multiplicity of functions and administrative interests. The offices of Sarkin fada, as head of palace workers, Waziri as prime minister among others are pointers in this regard.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1987",
    "text": "Twelve States creation is a known achievement of the ... regime",
    "options": {
      "A": "Abdulsalam Abubakar's",
      "B": "Ibrahim Babaginda's",
      "C": "Yakubu Gowon's",
      "D": "Murtala Mohammed's"
    },
    "answer_url": "https://myschool.ng/classroom/government/55076?exam_type=jamb&type=obj&page=398",
    "correct_answer": "C",
    "explanation": "Yakubu Gowon created 12 states for Nigeria in 1967.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1988",
    "text": "The basis of the Nigerian foreign policy thrust particularly during the Independence Constitution era was ... in nature",
    "options": {
      "A": "afrocentric",
      "B": "eurocentric",
      "C": "neo-colonialistic",
      "D": "anti-apartheid"
    },
    "answer_url": "https://myschool.ng/classroom/government/55077?exam_type=jamb&type=obj&page=398",
    "correct_answer": "A",
    "explanation": "Afrocentrism is the term used to describe the nature and interests of the Nigerian foreign policy targets withy preference for African neighboring States.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1989",
    "text": "The Brussel conference in 1889/90 was based on______",
    "options": {
      "A": "putting an end to slave trade",
      "B": "the scramble for Africa",
      "C": "furthering the decision on colonialism as previously discussed in the Berlin conference",
      "D": "deciding on how to penetrate Africa for economic adventurism"
    },
    "answer_url": "https://myschool.ng/classroom/government/55078?exam_type=jamb&type=obj&page=398",
    "correct_answer": "A",
    "explanation": "The Brussel Conference unlike the Berlin Conference was targeted at the reconsideration of the unjust virtues and vices occasioned by colonialism, thereby specifically seeking to eradicate slave trade and related activities.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1990",
    "text": "According to Lewis Samuel, '________ is identified with pure conquest and unequivocal exploitation...'",
    "options": {
      "A": "Neo colonialism",
      "B": "Progressive Imperialism",
      "C": "Regressive Imperialism",
      "D": "Colonialism"
    },
    "answer_url": "https://myschool.ng/classroom/government/55080?exam_type=jamb&type=obj&page=398",
    "correct_answer": "C",
    "explanation": "The ideology of regressive imperialism is pure economic advantage and enrichment of the imperialists devoid of any ethical consideration.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1991",
    "text": "One of the major defects of the Nigerian council which necessitated its replacement was that....",
    "options": {
      "A": "the meetings of the council were poorly attended",
      "B": "the council could only make law for the southern protectorate",
      "C": "the executive council was powerful than it",
      "D": "the council was unrepresentative"
    },
    "answer_url": "https://myschool.ng/classroom/government/55082?exam_type=jamb&type=obj&page=399",
    "correct_answer": "D",
    "explanation": "The unrepresentative nature and figurehead stance of the Nigerian Council's membership is a stand-alone reason for the flaw of the platform. Most members were Whites who didn't understand the interests of the people they seek to govern.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1992",
    "text": "An important provision of the 1946 constitution was that it ........",
    "options": {
      "A": "conceived federalism for Nigeria",
      "B": "introduced federalism in Nigeria",
      "C": "introduced official majority in the legislative council for the 1st time",
      "D": "for the 1st time, introduced the office of the head of government at the regional level"
    },
    "answer_url": "https://myschool.ng/classroom/government/55084?exam_type=jamb&type=obj&page=399",
    "correct_answer": "A",
    "explanation": "The Authur Richard Constitution of 1946 set the foundational road map for a full fledged federalism for Nigeria starting essentially with the Lyttleton's 1954 Constitution, and built upon thereafter.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1993",
    "text": "In the all-Nigerian constitutional conference of 1950________",
    "options": {
      "A": "all official members of the legislative council participated",
      "B": "it was resolved that the Nigerians federation be organized on ethnic basis",
      "C": "it was concluded that a quasi-federal structure should be developed for colonial Nigeria",
      "D": "all unofficial members of the legislative council participated"
    },
    "answer_url": "https://myschool.ng/classroom/government/55086?exam_type=jamb&type=obj&page=399",
    "correct_answer": "C",
    "explanation": "TheAll-Nigerian Constitutional Conference of 1950, held inIbadan, was a significant event in Nigeria’s constitutional development. Delegates from different regions of Nigeria met to discuss the future political structure of the country. One of the key resolutions of the conference was the adoption of aquasi-federal system, which meant that Nigeria would move towards a federal system of government but with some centralized features. This decision later influenced theMacpherson Constitution of 1951, which introduced regional legislatures and a degree of autonomy for the three regions (Northern, Western, and Eastern regions).",
    "year": "2019"
  },
  {
    "number": "1994",
    "text": "Implementations of the target programmes of the government is the primary duty of the _____ a part of the _____",
    "options": {
      "A": "Courts; Judiciary",
      "B": "Public Service; Civil Service",
      "C": "Civil Service; Public Service",
      "D": "Ministers; Ministry of Works"
    },
    "answer_url": "https://myschool.ng/classroom/government/55088?exam_type=jamb&type=obj&page=399",
    "correct_answer": "C",
    "explanation": "The Civil Service is an integral branch of the public service which primarily functions to implement the policies of the government.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1995",
    "text": "The most recent target plans and agenda of the United Nations are known as the______",
    "options": {
      "A": "Resolution 2020",
      "B": "Millenium Development Goals",
      "C": "Agenda 2063",
      "D": "Sustainable Development Goals"
    },
    "answer_url": "https://myschool.ng/classroom/government/55089?exam_type=jamb&type=obj&page=399",
    "correct_answer": "D",
    "explanation": "The 17 United Nations Sustainable Development Goals (SDGs) are the most recent aspirational global agenda for the sake of environmental sustainability, strong governance institutions and partnerships among related others.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1996",
    "text": "The federal judge under the 1963 constitution could be removed by the______",
    "options": {
      "A": "2/3 majority of the National Assembly",
      "B": "Federal Judicial Service Commission",
      "C": "Nigerian Judicial Council",
      "D": "Executive president"
    },
    "answer_url": "https://myschool.ng/classroom/government/55091?exam_type=jamb&type=obj&page=400",
    "correct_answer": "A",
    "explanation": "2/3 majority support or vote of the National Assembly members was enough under the 1963 Constitution to remove a federal judge.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1997",
    "text": "Under the 1999 constitution, the Chief Law Officer and the Supreme Court Judge respectively are the_______",
    "options": {
      "A": "Chief Justice, Chief Judge",
      "B": "Minister of Justice, Chief Judge",
      "C": "Attorney-General, Chief Justice",
      "D": "Chief Registrar of the Supreme Court, Chief Justice"
    },
    "answer_url": "https://myschool.ng/classroom/government/55093?exam_type=jamb&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "The Attorney General of the Federation is the same as the Minister of Justice while the judge at the Supreme Court level is the Chief Justice.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1998",
    "text": "Which of the following was not responsible for the coalition between A. G and N. C. N. C.?",
    "options": {
      "A": "The kano riot of 1953",
      "B": "Awolowo's faction seeking to get N. P. C. out of power as opposed to Akintola's option",
      "C": "contest for the federal election of 1964",
      "D": "Akintola's faction which broke out of A. G. to form UPP"
    },
    "answer_url": "https://myschool.ng/classroom/government/55094?exam_type=jamb&type=obj&page=400",
    "correct_answer": "A",
    "explanation": "All the following options facilitated the coalition of the action Group and the National Council of the Nigerian Citizens except the The Kano Riot of 1953\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "1999",
    "text": "In the 4th republic, the political parties were______",
    "options": {
      "A": "NAP, PDP and APGA",
      "B": "PDP, APP, AD",
      "C": "UPGA, NNA, CAN",
      "D": "PDP, APGA, AD"
    },
    "answer_url": "https://myschool.ng/classroom/government/55096?exam_type=jamb&type=obj&page=400",
    "correct_answer": "B",
    "explanation": "In the4th Republic of Nigeria, which began in1999, the main political parties were:\nPDP(Peoples Democratic Party)APP(All Peoples Party)AD(Alliance for Democracy)\nThese parties were the dominant players in the political landscape during the early years of the 4th Republic.",
    "year": "2019"
  },
  {
    "number": "2000",
    "text": "The Economic and Financials Crime Commission (EFCC) scope and nature of duty may not extend to_______",
    "options": {
      "A": "arresting suspects of cyber crime and online fraud",
      "B": "arresting the giver and the taker in a corruption case",
      "C": "conducting trials and punishing persons involved in corruption matters",
      "D": "investigating cases of substance and drug abuse intersecting with money laundering"
    },
    "answer_url": "https://myschool.ng/classroom/government/55097?exam_type=jamb&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "The EFCC as it is, is an executive body that must discharge its functions strictly in line with the reasons for its establishment. None of those functions extend to exercising judicial powers by punishing and conducting trials for suspects, which the strict duty of the court.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2001",
    "text": "The Green Revolution programme was the effected manifesto of the ........ in 1979",
    "options": {
      "A": "UPN",
      "B": "NPN",
      "C": "NPP",
      "D": "GNPP"
    },
    "answer_url": "https://myschool.ng/classroom/government/55100?exam_type=jamb&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "The National Party of Nigeria (NPN) is popularly known for its Green Revolution agricultural project in the late 1979s.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2002",
    "text": "Nigeria's federalism is often considered a flaw along the standard test of the Classical federalism ideology labelled along with_______",
    "options": {
      "A": "Abraham Lincoln",
      "B": "K.C Wheare",
      "C": "Thomas Hobbes",
      "D": "Aristotle"
    },
    "answer_url": "https://myschool.ng/classroom/government/55101?exam_type=jamb&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "Kenneth Clinton Wheare is noted to having postulated that the fundamental, negotiable element of federalism is voluntary submission of rights by the component units in a federal set up.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2003",
    "text": "The most representative organ of the united nations is the_______",
    "options": {
      "A": "General Assembly",
      "B": "Security Council",
      "C": "Economic and Social Council",
      "D": "International Court of Justice"
    },
    "answer_url": "https://myschool.ng/classroom/government/55102?exam_type=jamb&type=obj&page=401",
    "correct_answer": "A",
    "explanation": "General Assembly. The UN General Assembly comprises the Heads of State and Government of all the State Parties in the UN body.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2004",
    "text": "Executive Council of the African Union makes decision by_______",
    "options": {
      "A": "1/3 majority vote",
      "B": "discretion",
      "C": "consensus",
      "D": "the veto of the General Secretariat"
    },
    "answer_url": "https://myschool.ng/classroom/government/55104?exam_type=jamb&type=obj&page=401",
    "correct_answer": "C",
    "explanation": "The Council of Ministers of the State Parties of the AU, the Executive Council makes decision primarily by consensus or by 2/3 majority support.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2005",
    "text": "Amendment of the U. N. O. charter is the duty of the ........",
    "options": {
      "A": "Security Council",
      "B": "Secretariat",
      "C": "General Assembly",
      "D": "Trusteeship Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/55105?exam_type=jamb&type=obj&page=401",
    "correct_answer": "C",
    "explanation": "The UN General Assembly has the duty of amending relevant provisions of the UN Charter.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2006",
    "text": "The fact that the office of the Chairman is rotational in ECOWAS makes it a perfect example of a/an ........",
    "options": {
      "A": "Cartel",
      "B": "Confederacy",
      "C": "Economic and Egalitarian political merger",
      "D": "Collegiate"
    },
    "answer_url": "https://myschool.ng/classroom/government/55106?exam_type=jamb&type=obj&page=402",
    "correct_answer": "D",
    "explanation": "A Collegiate is used to describe a rotational system of governance within a specific circle of qualified practitioners or representatives.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2007",
    "text": "The newspaper established by Dr. Nnamdi Azikiwe to project the interest of nationalists was__________",
    "options": {
      "A": "West African Pilot",
      "B": "Lagos Weekly Record",
      "C": "Daily Times",
      "D": "The Comet"
    },
    "answer_url": "https://myschool.ng/classroom/government/55276?exam_type=jamb&type=obj&page=402",
    "correct_answer": "A",
    "explanation": "The West African Pilot was the newspaper of Dr Azikiwe which served as a medium for propagating nationalist ideas and solidarity movements towards self-realization.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2008",
    "text": "The delineation of electoral constituencies for reasons of political advantage is termed___________",
    "options": {
      "A": "dissolution",
      "B": "prorogation",
      "C": "gerrymandering",
      "D": "delimitation"
    },
    "answer_url": "https://myschool.ng/classroom/government/55278?exam_type=jamb&type=obj&page=402",
    "correct_answer": "C",
    "explanation": "Gerrymandering is the process of creating political constituencies in order to favour the electoral scores of a political party.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2009",
    "text": "A predominant feature of the Precolonial governance system was that_________",
    "options": {
      "A": "the British Indirect rule system penetrated it largely",
      "B": "the governance structures were largely undefined",
      "C": "the customary laws were prevalent",
      "D": "theocratic system was widely embraced"
    },
    "answer_url": "https://myschool.ng/classroom/government/55280?exam_type=jamb&type=obj&page=402",
    "correct_answer": "C",
    "explanation": "Throughout the precolonial era in Nigeria, the native laws of the people governed them. They were largely unwritten and enforced by distinct units set in place for those purposes.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2010",
    "text": "In most recent times, a seemingly workable solution to the Nigerian federal question is that of_______",
    "options": {
      "A": "state police",
      "B": "restructuring",
      "C": "terrorism",
      "D": "revenue allocation"
    },
    "answer_url": "https://myschool.ng/classroom/government/55281?exam_type=jamb&type=obj&page=402",
    "correct_answer": "B",
    "explanation": "Although Options A, B and C are recurring options for the Nigerian federalism, the clarion call for restructuring is louder than ever before.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2011",
    "text": "The concept of delegated legislation is often criticised for all but one of the following reasons?",
    "options": {
      "A": "it may lead to abuse of the powers",
      "B": "for reasons of sheer ignorance on legislative substance and procedure",
      "C": "for reasons of expertise rule making on specific subject matters",
      "D": "it is a clear violation of the separation of powers concept"
    },
    "answer_url": "https://myschool.ng/classroom/government/55283?exam_type=jamb&type=obj&page=403",
    "correct_answer": "C",
    "explanation": "Delegated Legislation is supported largely because certain specialist idea is needed for the purpose of rule making on areas upon which the legislature may not have sufficient knowledge and skill in. Example, the INEC is empowered to make election guidelines and regulations aside the Electoral Act and in furtherance of its duties.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2012",
    "text": "____ is noted for having said \"man by nature is a political animal\"",
    "options": {
      "A": "Thomas Hobbes",
      "B": "Aristotle",
      "C": "Plato",
      "D": "J.J Rosseau"
    },
    "answer_url": "https://myschool.ng/classroom/government/55287?exam_type=jamb&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "According to Aristotle, every human interaction intersects with political determinations and interests.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2013",
    "text": "The term ultra vires means_________",
    "options": {
      "A": "the exercise of supervisory functions by the judiciary",
      "B": "a situation where a public authority dutifully performs its functions",
      "C": "a situation where a public authority acts beyond the scope of its duties",
      "D": "the act of exercising administrative competence over a matter"
    },
    "answer_url": "https://myschool.ng/classroom/government/55289?exam_type=jamb&type=obj&page=403",
    "correct_answer": "C",
    "explanation": "A public authority is said to have ultra vires when it has acted beyond the boundaries of its duties as provided for in its enabling law or as prescribed by the Executive.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2014",
    "text": "Class stratification is a peculiar feature of___________",
    "options": {
      "A": "capitalism",
      "B": "communism",
      "C": "socialism",
      "D": "feudalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/55291?exam_type=jamb&type=obj&page=403",
    "correct_answer": "A",
    "explanation": "In a capitalist system, there is a clear differentiation gap between the ruling class and the ruled or the proletarates.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2015",
    "text": "One of the following reasons is unlikely to necessitate the emergence of a federal system?",
    "options": {
      "A": "social factors",
      "B": "geographical factors",
      "C": "cultural diversity",
      "D": "political sovereignty"
    },
    "answer_url": "https://myschool.ng/classroom/government/55292?exam_type=jamb&type=obj&page=403",
    "correct_answer": "D",
    "explanation": "Other options are necessary reasons for the adoption of a federal system except for sake of defining or strengthening the political sovereignty which invariably belongs to the citizens.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2016",
    "text": "Lobbying is often a strategy adopted by________",
    "options": {
      "A": "political parties",
      "B": "public corporations",
      "C": "public authorities",
      "D": "pressure groups"
    },
    "answer_url": "https://myschool.ng/classroom/government/55296?exam_type=jamb&type=obj&page=404",
    "correct_answer": "D",
    "explanation": "Pressure groups often adopt lobbying as a negotiation mechanism with critical governement stakeholders and or legislators so that significant policies and laws giving effect to their interests are implemented.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2017",
    "text": "A political party often with a radical viewpoint and perspective to sensitive state affairs matters is often labelled as a ___party",
    "options": {
      "A": "conservatist",
      "B": "liberal",
      "C": "democratic",
      "D": "elitist"
    },
    "answer_url": "https://myschool.ng/classroom/government/55298?exam_type=jamb&type=obj&page=404",
    "correct_answer": "B",
    "explanation": "A liberal political party often seeks to argue for change and transformation of the present state of things in a state including those matters of relative social and economic importance.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2018",
    "text": "Opinion sampling may be necessary for the following reasons except________",
    "options": {
      "A": "for aggregating popular thinking and standpoint on a subject matter",
      "B": "for preparing public expenditure",
      "C": "to evaluate the political strength of a political party",
      "D": "to inspire public reasoning on population census"
    },
    "answer_url": "https://myschool.ng/classroom/government/55300?exam_type=jamb&type=obj&page=404",
    "correct_answer": "D",
    "explanation": "To inspire public reasoning on population census is the best answer, as it is the least reason why opinion sampling mechanisms, by way of online survey or through opinion polls are organised.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2019",
    "text": "The defining processes for the formation of a people's political behaviour is___________",
    "options": {
      "A": "political socialisation",
      "B": "political culture",
      "C": "political demonstration",
      "D": "political participation"
    },
    "answer_url": "https://myschool.ng/classroom/government/55302?exam_type=jamb&type=obj&page=404",
    "correct_answer": "A",
    "explanation": "Political socialisation refers to the series of learning processes and experiences which serve to sharpen the orientation and perspective of the people to their democratic affairs.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2020",
    "text": "The ____ Reform is influential to the inception of Local Government in Nigeria",
    "options": {
      "A": "1979",
      "B": "1978",
      "C": "1976",
      "D": "1975"
    },
    "answer_url": "https://myschool.ng/classroom/government/55304?exam_type=jamb&type=obj&page=404",
    "correct_answer": "C",
    "explanation": "The Murtala/Obasanjo 1976 Reform necessitated the discovery of the essence of a local government council and establishment.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2021",
    "text": "Colonialist arrival in Nigeria is traceable particularly to the_____",
    "options": {
      "A": "introduction of christianity",
      "B": "annexation of the Lagos Colony",
      "C": "emergence of economic adventurism",
      "D": "introduction of the indirect rule policy"
    },
    "answer_url": "https://myschool.ng/classroom/government/55307?exam_type=jamb&type=obj&page=405",
    "correct_answer": "B",
    "explanation": "It must be stated with emphatic clarity that the annexation of Lagos as a 'Colony' in 1861 is significant to the effectuation of colonialism in Nigeria. All the other factors of economic advantage and the spread of christianity are complementary and implied reasons.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2022",
    "text": "The Indigenat Policy is attributable to the ___",
    "options": {
      "A": "French colonies",
      "B": "British Crown colonies",
      "C": "German colonies",
      "D": "Portugese colonies"
    },
    "answer_url": "https://myschool.ng/classroom/government/55308?exam_type=jamb&type=obj&page=405",
    "correct_answer": "A",
    "explanation": "The indigénat policy was introduced by the French colonies in various forms and degrees of severity to control and exploit the French colonial population and subject them to arbitrary punishments, forced labour and a separate court system. It was an obnoxious policy that gave French officials the right to arbitrarily arrest and imprison any African for about two yeas without trial.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2023",
    "text": "The solidarity for self-governance system and liberty of Africans demonstrated by Africans and Non-Africans in diaspora is termed__________",
    "options": {
      "A": "Nationalism",
      "B": "Afrocentrism",
      "C": "Neo-colonialism",
      "D": "Pan-Africanism"
    },
    "answer_url": "https://myschool.ng/classroom/government/55310?exam_type=jamb&type=obj&page=405",
    "correct_answer": "D",
    "explanation": "Pan-Africanism is the ideology upheld by a wide majority of the advocates for the independence of African States during the colonialism era and beyond.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2024",
    "text": "Acceleration of the independence movements in the British West African Colonies was essentially because of the________",
    "options": {
      "A": "posture of the British Governor Generals",
      "B": "influence of the christianity ideology",
      "C": "tolerance for political participation and demonstration through political parties",
      "D": "speedy grant of independence in the French Colonies"
    },
    "answer_url": "https://myschool.ng/classroom/government/55312?exam_type=jamb&type=obj&page=405",
    "correct_answer": "C",
    "explanation": "The tolerance posture for the development of political parties and interest groups in the British West African Colonies spurred the pace of the drive for their autonomy.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2025",
    "text": "The cultural organisation which metamorphosed into the Northern People's Congress (NPC) was__________",
    "options": {
      "A": "Arewa Consultative Forum",
      "B": "Jamiyyar Mutanen Arewa",
      "C": "Borno Youth Movement",
      "D": "Northern Elders Forum"
    },
    "answer_url": "https://myschool.ng/classroom/government/55313?exam_type=jamb&type=obj&page=405",
    "correct_answer": "B",
    "explanation": "The Northern People's Congress was an offshoot of the Jamiyyar Mutanen Arewa.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2026",
    "text": "The legitimate claims and entitlements available by reasons of birth and residence and/or certification, to a community of people may be abscribed as their___________",
    "options": {
      "A": "fundamental rights",
      "B": "civil liberties",
      "C": "communitarian privilege",
      "D": "citizenship rights"
    },
    "answer_url": "https://myschool.ng/classroom/government/55314?exam_type=jamb&type=obj&page=406",
    "correct_answer": "D",
    "explanation": "Citizenship rights are the legal privileges and opportunities available to the citizens of a State. Examples, only citizens are eligible to contest elections and own properties in Nigeria. Fundamental rights and civil liberties are an aggregation of their individual and collective entitlements by reasons of being human.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2027",
    "text": "A moral or legal conviction for the observance of the constitution may be described as________",
    "options": {
      "A": "the rule of law",
      "B": "constitutionalism",
      "C": "immunity",
      "D": "political obligation"
    },
    "answer_url": "https://myschool.ng/classroom/government/55317?exam_type=jamb&type=obj&page=406",
    "correct_answer": "B",
    "explanation": "Constitutionalism is the term used to describe compliance with the provisions of the constitution.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2028",
    "text": "The primary essence of a public corporation is__________",
    "options": {
      "A": "profit realization",
      "B": "public utility",
      "C": "for the formulation of government policies",
      "D": "for the resolution of administrative disputes"
    },
    "answer_url": "https://myschool.ng/classroom/government/55318?exam_type=jamb&type=obj&page=406",
    "correct_answer": "B",
    "explanation": "The primary essence of a public corporation is public utility. Public corporations are established primarily to provide services or utilities to the public. Although they generate profit, this is not their primary aim.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2029",
    "text": "The principle that determines the pattern of interaction of a country in international politics is known as____________",
    "options": {
      "A": "foreign policy",
      "B": "international trade",
      "C": "alignment policy",
      "D": "international relations"
    },
    "answer_url": "https://myschool.ng/classroom/government/55320?exam_type=jamb&type=obj&page=406",
    "correct_answer": "A",
    "explanation": "The foreign policy thrust of a state defines its delibrate and strategic plan of actions in interaction with other states.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2030",
    "text": "The arm of government responsible for the approval of war is the_____",
    "options": {
      "A": "judiciary",
      "B": "executive",
      "C": "legislature",
      "D": "none"
    },
    "answer_url": "https://myschool.ng/classroom/government/55321?exam_type=jamb&type=obj&page=406",
    "correct_answer": "C",
    "explanation": "While declaration of war is the duty of the executive, the legislature approves or disapproves of it as embarking on war means and requires additional expenditure and budget scrutiny.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2031",
    "text": "The West African Students' Union (WASU) was formed in____________",
    "options": {
      "A": "1925",
      "B": "1924",
      "C": "1922",
      "D": "1923"
    },
    "answer_url": "https://myschool.ng/classroom/government/55323?exam_type=jamb&type=obj&page=407",
    "correct_answer": "A",
    "explanation": "WASU was formed by Chief Ladipo Solanke among others in 1925.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2032",
    "text": "The Chick's commission was set up to look into the issue of revenue allocation in___________",
    "options": {
      "A": "1946",
      "B": "1957",
      "C": "1951",
      "D": "1953"
    },
    "answer_url": "https://myschool.ng/classroom/government/55324?exam_type=jamb&type=obj&page=407",
    "correct_answer": "D",
    "explanation": "As part of the Commissions set up for the review of the Nigerian federalism challenges, the Chick's commission was set up in 1953.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2033",
    "text": "The head of the districts in the Hausa/Fulani Empire were the_________",
    "options": {
      "A": "Emirs of Gwandu and Sokoto",
      "B": "Galadima",
      "C": "Hakimi",
      "D": "Sarkin Ruwa"
    },
    "answer_url": "https://myschool.ng/classroom/government/55325?exam_type=jamb&type=obj&page=407",
    "correct_answer": "C",
    "explanation": "The Hakimi was the titled administrative officers in charge of the districts in the heterogeneous Hausa/Fulani Empire.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2034",
    "text": "Under the 1979 constitution of Nigeria, each State was allowed to elect________",
    "options": {
      "A": "three senators",
      "B": "from two to five senators depending on the population",
      "C": "five senators",
      "D": "as many senators as the state could finance."
    },
    "answer_url": "https://myschool.ng/classroom/government/55326?exam_type=jamb&type=obj&page=407",
    "correct_answer": "C",
    "explanation": "Unlike the position under the present 1999 Constitution as amended, each state was permitted to elect 5 senators into the House of Representatives.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2035",
    "text": "The Armed Forces Ruling Council (AFRC) is attributable to the ____ regime",
    "options": {
      "A": "Ibrahim Babangida's",
      "B": "Murtala/Obasanjo's",
      "C": "Yakubu Gowon's",
      "D": "Abdulsalam Abubakar's"
    },
    "answer_url": "https://myschool.ng/classroom/government/55328?exam_type=jamb&type=obj&page=407",
    "correct_answer": "A",
    "explanation": "Unlike the Supreme Military Council of the Muhammadu Buhari's military regime, the AFRC is attributtable to the Babangida's regime.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2036",
    "text": "The dwindling and market falls in oil prices are prime indicators for Nigeria politico-economic consideration for________",
    "options": {
      "A": "indigenization policy",
      "B": "diversification",
      "C": "the adoption of the United Nations' Vision 2030",
      "D": "nationalisation policy"
    },
    "answer_url": "https://myschool.ng/classroom/government/55329?exam_type=jamb&type=obj&page=408",
    "correct_answer": "B",
    "explanation": "In most recent times, the prevalent politico-economic discussions in Nigeria has been on the need for economic diversification for reasons of economic boom and social transformation.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2037",
    "text": "Nigeria's top contribution to Africa's agenda of decolonisation and anti-racism was mostly enhanced with the formation of the_________",
    "options": {
      "A": "New Partnership for Africa's Development (NEPAD)",
      "B": "Organization of African Unity (OAU)",
      "C": "Economic Community of West African States (ECOWAS)",
      "D": "Organization of Petroleum Exporting Countries (OPEC)"
    },
    "answer_url": "https://myschool.ng/classroom/government/55330?exam_type=jamb&type=obj&page=408",
    "correct_answer": "B",
    "explanation": "In the wake of the call for the decolonisation of Africa, Nigeria actively contributed to the formation of the OAU for a solidarity movement in that direction.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2038",
    "text": "One of the following political parties produced Nigeria's first Prime Minister_______",
    "options": {
      "A": "Northern People's Congress (NPC)",
      "B": "National Council of Nigerian Citizens (NCNC)",
      "C": "Action Group (AG)",
      "D": "Unity Party of Nigeria (UPN)"
    },
    "answer_url": "https://myschool.ng/classroom/government/55332?exam_type=jamb&type=obj&page=408",
    "correct_answer": "A",
    "explanation": "NPC was the party of Tafawa Balewa, Nigeria's first prime minister.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2039",
    "text": "The National Assembly in the second republic was made up of the________",
    "options": {
      "A": "House of Chiefs and the Senate",
      "B": "Lower House and the House of Representatives",
      "C": "Senate and the House of Lords",
      "D": "None"
    },
    "answer_url": "https://myschool.ng/classroom/government/55334?exam_type=jamb&type=obj&page=408",
    "correct_answer": "D",
    "explanation": "The Chambers of the National Assembly since 1979 are the House of Representatives and the Senate respectively. The National Assembly was bicameral, consisting of these two chambers. The Senate was the upper chamber, while the House of Representatives was the lower chamber.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2040",
    "text": "The All Progressives Congress (APC) is the result of a coalition of the following parties except the___________",
    "options": {
      "A": "All Nigeria Peoples Party (ANPP)",
      "B": "Action Congress of Nigeria (ACN)",
      "C": "United Progressive Grand Alliance (UPGA)",
      "D": "Congress for Progressive Change (CPC)"
    },
    "answer_url": "https://myschool.ng/classroom/government/55336?exam_type=jamb&type=obj&page=408",
    "correct_answer": "C",
    "explanation": "APC is the result of the merger of the parties in options A, B, and D including a faction of the All Progressives Grand Alliance (APGA).\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2041",
    "text": "The process by which electorates remove elected official is called_________",
    "options": {
      "A": "impeachment",
      "B": "re-call",
      "C": "vote of no confidence",
      "D": "referendum"
    },
    "answer_url": "https://myschool.ng/classroom/government/55337?exam_type=jamb&type=obj&page=409",
    "correct_answer": "B",
    "explanation": "The power of impeachment belongs to the legislature to check the Executive act of gross misconduct while Re-call is exercisable within the reach of the electorates. This procedure allows voters to remove and replace a public official before the end of their term of office. It is a form of direct democracy that provides a way for the electorate to ensure accountability of elected officials.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2042",
    "text": "The Economic and Social Council (ECOSOC) is an organ of the_________",
    "options": {
      "A": "African Union",
      "B": "Commonwealth of Nations",
      "C": "United Nations",
      "D": "New Partnership for Africa's Development"
    },
    "answer_url": "https://myschool.ng/classroom/government/55340?exam_type=jamb&type=obj&page=409",
    "correct_answer": "C",
    "explanation": "ECOSOC is an organ of the UN basically concerned with matters of economic and socio-cultural importance to the global community.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2043",
    "text": "Nigeria joined the Organisation of Petroleum Exporting Countries (OPEC) in__________",
    "options": {
      "A": "1970",
      "B": "1971",
      "C": "1972",
      "D": "1973"
    },
    "answer_url": "https://myschool.ng/classroom/government/55342?exam_type=jamb&type=obj&page=409",
    "correct_answer": "B",
    "explanation": "Nigeria joined OPEC in 1971 during Yakubu Gowon's military regime.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2044",
    "text": "The International Criminal Court (ICC) has its headquarters in__________",
    "options": {
      "A": "Hagues, Netherlands",
      "B": "Vienna, Austria",
      "C": "New York, United States",
      "D": "Ottawa, Canada"
    },
    "answer_url": "https://myschool.ng/classroom/government/55345?exam_type=jamb&type=obj&page=409",
    "correct_answer": "A",
    "explanation": "The ICC sits at the Hagues, Netherlands. The ICC is an intergovernmental organisation and international tribunal that prosecutes individuals for crimes of genocide, crimes against humanity, war crimes, and the crime of aggression. The Hague is known as the city of peace and justice and it houses several international legal institutions, including the ICC.\nThere is an explanation video availablebelow.",
    "year": "2019"
  },
  {
    "number": "2045",
    "text": "The current Secretary-General of the United Nations is_________",
    "options": {
      "A": "Ban Ki-moon",
      "B": "Filippo Grandi",
      "C": "Jorge Sampaio",
      "D": "Antonio Guterres"
    },
    "answer_url": "https://myschool.ng/classroom/government/55348?exam_type=jamb&type=obj&page=409",
    "correct_answer": "D",
    "explanation": "As of 2019, Antonio Guterres, a Portuguese diplomat was the ninth serving Secretary-General of the United Nations. He assumed office on January 1, 2017, succeeding Ban Ki-moon. Antonio Guterres is a Portuguese politician and diplomat who previously served as the United Nations High Commissioner for Refugees from 2005 to 2015. His extensive experience in international relations and commitment to addressing global challenges have been central to his role as the Secretary-General.\nThere is an explanation video availablebelow.",
    "year": "2019"
  }
]