[
  {
    "number": "927",
    "text": "Prophet Muhammad(SAW) lost his mother at the age of _____",
    "options": {
      "A": "2",
      "B": "4",
      "C": "6",
      "D": "5"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65613?exam_type=jamb&type=obj&page=186",
    "correct_answer": "C",
    "explanation": "At the age of six, Prophet Muhammad(SAW) lost his biological mother, Amina, to illness and was raised by his paternal grandfather, Abd al-Muttalib, until he died when Prophet Muhammad(SAW) was eight. He then came under the care of his uncle Abu Talib, the new leader of Banu Hashim",
    "year": "2014"
  },
  {
    "number": "928",
    "text": "The seal of all the prophets was prophet___",
    "options": {
      "A": "Ayyub (a.s.w.)",
      "B": "Muhammed (S.A.W.)",
      "C": "Yahya (a.s.w.)",
      "E": "Ibrahim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65614?exam_type=jamb&type=obj&page=186",
    "correct_answer": "B",
    "explanation": "Muhammad as the Seal of the ProphetsMuhammad is the final prophet in Islam, known as the 'Seal of the Prophets'. This means that Muslims regard Muhammad as Allah's final messenger. The Qur'an is formed from the revelations Muhammad received from God through the Angel Jibril.",
    "year": "2014"
  },
  {
    "number": "929",
    "text": "The Prophet was survived by only one child. This was___",
    "options": {
      "A": "Ruqayah",
      "B": "Ibrahim",
      "C": "Fatimoh",
      "D": "Zainab"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65615?exam_type=jamb&type=obj&page=186",
    "correct_answer": "C",
    "explanation": "Fatimah bint Muhammad (Arabic: فَاطِمَة بِنْت مُحَمَّد‎) 615 AD/5 BH - died 28 August 632 commonly known as Fāṭimah al-Zahrāʾ (فَاطِمَة ٱلزَّهْرَاء), was the youngest daughter of the Islamic prophet Muhammad and Khadijah, according to Sunni Muslims, but according to Shia Muslims,their only child who lived to adulthood, and therefore part of Muhammad's household.",
    "year": "2014"
  },
  {
    "number": "930",
    "text": "The Khalifah who ordered the compilation of the Qu'ran in a book form was ___",
    "options": {
      "A": "Umar b. al Kattab",
      "B": "Ali b. Talid",
      "C": "Abu Bakr b. Abu Quhafah",
      "D": "Uthman b. Affan"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65616?exam_type=jamb&type=obj&page=186",
    "correct_answer": "D",
    "explanation": "Uthman ibn Affan (Arabic: عثمان بن عفان‎;579/583 - 17 June 656), was a son-in-law and notable companion of the Islamic prophet Muhammad, as well as the third of the Rashidun, or \"Rightly Guided Caliphs\". Born into a prominent Meccan clan, Banu Umayya of the Quraysh tribe, he played a major role in early Islamic history, and is known for having ordered the compilation of the standard version of the Quran",
    "year": "2014"
  },
  {
    "number": "931",
    "text": "A muslim woman who notices blood after the expiration of the maximum days of her blood of birth should__",
    "options": {
      "A": "take her bath and continue in prayers",
      "B": "not take her bath but continue to pray",
      "C": "should abstain from prayers for five more days",
      "D": "take bath but not pray"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65617?exam_type=jamb&type=obj&page=187",
    "correct_answer": "A",
    "explanation": "Women and girls don't have to participate in the fasting and prayer rituals while on their periods because they're considered less \"pure\" while menstruating - but they aren't simply excused. Instead, they are expected to make up the missed days of fasting as soon as their periods are over and they are ritually cleansed",
    "year": "2014"
  },
  {
    "number": "932",
    "text": "To ensure the authenticity of the compiled text of the Holy Qur'ān, extracts written on various materials were cross-checked with texts",
    "options": {
      "A": "Written by Zayd bin Thābit",
      "B": "recalled from memory by early memorizers",
      "C": "delivered by angel Jirīl to the Prophet (S.A.W)",
      "D": "written by the Prophet (S.A.W) himself"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65618?exam_type=jamb&type=obj&page=187",
    "correct_answer": "B",
    "explanation": "Muhammad (SAW) did not write Quran as he didn't know how to write. According to tradition, several of Prophet Muhammad's companions served as scribes and recorded the revelations. Shortly after his death, the Quran was compiled by the companions, who had written down or memorized parts of it.Caliph Uthman established a standard version, now known as the Uthmanic codex, which is generally considered the archetype of the Quran known today.",
    "year": "2014"
  },
  {
    "number": "933",
    "text": "The expressions above Iqra'', ′allama and al - qalam in Sūrat al− ′Alaq emphasize the importance of",
    "options": {
      "A": "Generosity.",
      "B": "Knowledge",
      "C": "Humility",
      "D": "Worship"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65619?exam_type=jamb&type=obj&page=187",
    "correct_answer": "A",
    "explanation": ": Qur'an 68:1-41-Nun. By the pen and what they inscribe,2-You are not, [O Muhammad], by the favor of your Lord, a madman.3-And indeed, for you is a reward uninterrupted4-And indeed, you are of a great moral character.",
    "year": "2014"
  },
  {
    "number": "934",
    "text": "Which of the following terms portrays the Qur'ān as a healing for man's spiritual and moral waywardness?",
    "options": {
      "A": "ash - Shifā'",
      "B": "al - Maw'izah",
      "C": "ar - Rahmah3",
      "D": "al - Burhān"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65620?exam_type=jamb&type=obj&page=187",
    "correct_answer": "A",
    "explanation": "The Book of Healing (Arabic: کتاب الشفاء‎, also known as The Cure) is a scientific and philosophical encyclopedia written by Abu Ali ibn Sīna (aka Avicenna) from medieval Persia, near Bukhara in Maverounnahr. He most likely began to compose the book in 1014, completed it around 1020, and published it in 1027.",
    "year": "2014"
  },
  {
    "number": "935",
    "text": "The first man created by Allah was called _____ (ASW)",
    "options": {
      "A": "Dawud",
      "B": "Musa",
      "C": "Isa",
      "D": "Adam"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65621?exam_type=jamb&type=obj&page=187",
    "correct_answer": "D",
    "explanation": "Âdam or Aadam (Arabic: آدم‎) is believed to have been the first human and nabi (Arabic: نَـبِي‎, prophet) on Earth, in Islam. Adam's role as the father of the human race is looked upon by Muslims with reverence. Muslims also refer to his wife, Haawa (Arabic: حَـواء‎, Eve), as the \"mother of mankind\".Muslims see Adam as the first Human on Earth, as the Quran states that all the Prophets preached the same faith of Islam.",
    "year": "2014"
  },
  {
    "number": "936",
    "text": "Belief in oneness of Allah is the cornerstone of Islamic _____",
    "options": {
      "A": "Monotheism",
      "B": "Brotherhood",
      "C": "Politics",
      "D": "Socialism"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65622?exam_type=jamb&type=obj&page=188",
    "correct_answer": "A",
    "explanation": "Surah Al-Kafirun 109:1-6(109:1) Say: \"O unbelievers(109:2) I do not worship those that you worship(109:3) neither do you worship Him Whom I worship(109:4) nor will I worship those whom you have worshipped109:5) nor are you going to worship Him Whom I worship(109:6) To you is your religion, and to me, my religion",
    "year": "2014"
  },
  {
    "number": "937",
    "text": "The divine attribute of omnipotence is implied in",
    "options": {
      "A": "al-Basīr",
      "B": "al-Qadīr",
      "C": "as-Samī",
      "D": "al-'Alīm."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65623?exam_type=jamb&type=obj&page=188",
    "correct_answer": "B",
    "explanation": "The Surat al-Qadir (Surah of the Omnipotent) is an Arabic epistle of Baha'-Allāh most probably addressed to a Bābī entitled al-Qadir. It is oriented around the theme of the theophany, significance and human manifestation of the Name of God, the Omnipotent (al-qadir). It contains what seems one of the earliest expressions of Baha'-Allah's dissatisfaction with the inadequate leadership role of his half-brother Mirza Yahya Nuri, Subh-i Azal (c. 1834-1914). This Tablet most likely dates to the early-mid Edirne (Adrianople) period (c. 1865-6?).",
    "year": "2014"
  },
  {
    "number": "938",
    "text": "The religion of the Arabs before the advent of Islam was _____",
    "options": {
      "A": "Idol worshipping",
      "B": "Christianity",
      "C": "Judaism",
      "D": "Judaism"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65624?exam_type=jamb&type=obj&page=188",
    "correct_answer": "A",
    "explanation": "Arabian polytheism, the dominant form of religion in pre-Islamic Arabia, was based on veneration of deities and spirits. Worship was directed to various gods and goddesses, including Hubal and the goddesses al-Lāt, al-'Uzzā, and Manāt, at local shrines and temples such as the Kaaba in Mecca.",
    "year": "2014"
  },
  {
    "number": "939",
    "text": "The importance of the Hadith lies in the fact that it _____",
    "options": {
      "A": "Supplements the Qu'ran and serves as a second source of Islamic law",
      "B": "Was recorded and collected in some attentic",
      "C": "Was officially collected by Muslim Caliphs",
      "D": "Provides reliable information on thr biography of the Prophet (SAW)"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65625?exam_type=jamb&type=obj&page=188",
    "correct_answer": "A",
    "explanation": "Several hadith (oral traditions concerning the words and deeds of the Islamic prophet Muhammad) indicate the importance as sources of Islam not only the Quran (the revelation of God to Muhammad, infallible but containing compressed information), but also of the Sunnah (a detailed explanation of the everyday application of the principles established in the Qur'an, based on hadith). One of these hadith quotes Muhammad as saying (in his Farewell Sermon:I have left with you two things which, if you follow them, you will never go astray: the Book of God and the sunna of His Prophet.",
    "year": "2014"
  },
  {
    "number": "940",
    "text": "One of the following is not part of the names of the Qu'ran.",
    "options": {
      "A": "Al-Bayyinah",
      "B": "An-Nur",
      "C": "Al-Huda",
      "D": "Ar-Rahman"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65626?exam_type=jamb&type=obj&page=188",
    "correct_answer": "D",
    "explanation": "Ar-Raḥmān (Arabic: الرحمان‎, \"The Most Merciful\") is the 55th Chapter (surah) of the Qur'an with 78 verses (āyāt). Most muslim scholars place Sūrat ar-Rahman in the Meccan period",
    "year": "2014"
  },
  {
    "number": "941",
    "text": "'It is most hateful in the sight of Allah that you say that which you do not' (Q. 61:3). The main teaching of the verse above is honesty in",
    "options": {
      "A": "Deeds",
      "B": "Words",
      "C": "Words and deeds",
      "D": "Deeds and worship"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65627?exam_type=jamb&type=obj&page=189",
    "correct_answer": "C",
    "explanation": "Qur'an 61:3Great is hatred in the sight of Allah that you say what you do not do.",
    "year": "2014"
  },
  {
    "number": "942",
    "text": "Which of the angels is in charge of paradise? ____",
    "options": {
      "A": "Mikail",
      "B": "Ridwan",
      "C": "Israfil",
      "D": "Israil"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65628?exam_type=jamb&type=obj&page=189",
    "correct_answer": "B",
    "explanation": "Riḍwan (or Riswan) is an angel in Islam, who guards the gates of heaven. His name is absent in the Quran and early tafsir, named by Ibn Hisham Ismāʿīl instead, he namely appears in later reports and Mi'raj narration.",
    "year": "2014"
  },
  {
    "number": "943",
    "text": "Prophet Muhammad(SAW) lost his mother at the age of _____",
    "options": {
      "A": "2",
      "B": "6",
      "C": "4",
      "D": "5"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65629?exam_type=jamb&type=obj&page=189",
    "correct_answer": "B",
    "explanation": "At the age of six, Prophet Muhammad(SAW) lost his biological mother, Amina, to illness and was raised by his paternal grandfather, Abd al-Muttalib, until he died when Prophet Muhammad(SAW) was eight. He then came under the care of his uncle Abu Talib, the new leader of Banu Hashim.",
    "year": "2014"
  },
  {
    "number": "944",
    "text": "The expression above appears in Sūrat al - Kāfirūn",
    "options": {
      "A": "four times",
      "B": "once",
      "C": "three times",
      "D": "twice"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65630?exam_type=jamb&type=obj&page=189",
    "correct_answer": "D",
    "explanation": "Qur'an 109:4Nor will I be a worshipper of what you worship.Qur'an 109:5Nor will I be a worshipper of what you worship.",
    "year": "2014"
  },
  {
    "number": "945",
    "text": "Al-Mutamatti means one___",
    "options": {
      "A": "who performed 'Umarah and waited for Hajj and performed Hajj",
      "B": "who visited most important places in Makka and Madinah",
      "C": "who enjoyed life in Makka and Madina",
      "D": "none of the above"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65631?exam_type=jamb&type=obj&page=189",
    "correct_answer": "A",
    "explanation": "It is then obligatory for the mutamatti (pilgrim who enters ihram for umrah from the miqat designated for his or her country and completes the umrah to enter ihram for hajj from Mecca) to offer an animal sacrifice. A pilgrim who enters ihram for umrah, months before hajj, is called a mutamir, not a mutamatti.",
    "year": "2014"
  },
  {
    "number": "946",
    "text": "The migration of the Prophet Muhammad (SAW) from Mecca to Madinah was called?",
    "options": {
      "A": "Safar",
      "B": "Hirah",
      "C": "Gar6",
      "D": "Hijrah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65632?exam_type=jamb&type=obj&page=190",
    "correct_answer": "D",
    "explanation": "The Hegira is the migration or journey of the Islamic prophet Muhammad and his followers from Mecca to Yathrib, later renamed by him Medina, in the year 622.In May 622, after being warned of a plot to assassinate him, Muhammad secretly left his home in Mecca to emigrate to Yathrib, 320 km (200 mi) north of Mecca, along with his companion Abu Bakr. Yathrib was soon renamed Madīnat an-Nabī (Arabic: مَدينة النّبي‎, literally \"City of the Prophet\"), but an-Nabī was soon dropped, so its name is \"Medina\", meaning \"the city\".",
    "year": "2014"
  },
  {
    "number": "947",
    "text": "Asmā' ar - rijāl is a term used by scholars of",
    "options": {
      "A": "jurisprudence",
      "B": "Usūl",
      "C": "history",
      "D": "Hadīth"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65633?exam_type=jamb&type=obj&page=190",
    "correct_answer": "D",
    "explanation": "The author collected in this book the names and biographies of all, or most, of the hadith narrators mentioned in the six canonical hadith collections. These six books are Sahih al-Bukhari and Sahih Muslim and the four Sunan books by Al-Nasa'i, al-Tirmidhi, Abu Dawood and Ibn Majah.",
    "year": "2014"
  },
  {
    "number": "948",
    "text": "In the Islamic belief system, the opposite of Tawhīd is",
    "options": {
      "A": "Shukr",
      "B": "Qadā",
      "C": "Shirk",
      "D": "Qadar"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65634?exam_type=jamb&type=obj&page=190",
    "correct_answer": "C",
    "explanation": "In Islam, shirk is the sin of idolatry or polytheism. It means ascribing to, or the establishment of, partners placed beside Allah. It is termed Tawhid. Mušrikūn مشركون are those who practice shirk, which literally means \"association\" and refers to accepting other gods and divinities alongside God",
    "year": "2014"
  },
  {
    "number": "949",
    "text": "In the hadīth that ends with '...piety is based right here ...', the Prophet (S.A.W.) meant the",
    "options": {
      "A": "Heart",
      "B": "city of al-Madīnah",
      "C": "hand",
      "D": "city of Makkah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65635?exam_type=jamb&type=obj&page=190",
    "correct_answer": "A",
    "explanation": "Piety is defined in the hadith, a collection of Muhammad's sayings. It is reported by An-Nawwas bin Sam'an: \"The Prophet Muhammad said, \"Piety is good manner, and sin is that which creates doubt and you do not like people to know it.\" - Sahih Muslim, 32:6195,Sahih Muslim, 32:6196",
    "year": "2014"
  },
  {
    "number": "951",
    "text": "The pre-Islamic period is known as",
    "options": {
      "A": "Jahillyyah",
      "B": "Sunnat",
      "C": "Mujahidud",
      "D": "Al-Bait"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65637?exam_type=jamb&type=obj&page=191",
    "correct_answer": "A",
    "explanation": "Jahiliyyah (Arabic: ‏جَاهِلِيَّة‎‎ jāhilīyah, \"ignorance\") is an Islamic concept referring to the period of time and state of affairs in Arabia before the advent of Islam in 610 CE.It is often translated as the \"Age of Ignorance\".",
    "year": "2014"
  },
  {
    "number": "954",
    "text": "The purification performed in the absence of water",
    "options": {
      "A": "Janabah",
      "B": "Tayammum",
      "C": "Janazah",
      "D": "Taslim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65640?exam_type=jamb&type=obj&page=191",
    "correct_answer": "B",
    "explanation": "Tayammum (Arabic: تيمم‎) is the Islamic act of dry Ritual purification using a purified sand or dust, which may be performed in place of ritual washing (wudu or ghusl) if no clean water is readily available or if one is suffering from moisture-induced skin inflammation or scaling.\"O you who believe! When you intend to offer As-Salat (the prayer), wash your faces and your hands (forearms) up to the elbows, rub (by passing wet hands over) your heads, and (wash) your feet up to ankles. If you are in a state of Janaba (i.e. after a sexual discharge), purify yourselves (bathe your whole body). But if you are ill or on a journey, or any of you comes after answering the call of nature, or you have been in contact with women (i.e. sexual intercourse), and you find no water, then perform tayammum with clean earth and rub therewith your faces and hands. Allah does not want to place you in difficulty, but He wants to purify you, and to complete His Favour to you that you may be thankful.\"- Qur'an, Sura 5 (Al-Mai'da), ayat 6",
    "year": "2014"
  },
  {
    "number": "957",
    "text": "The first young person to accept Islam was?",
    "options": {
      "A": "Muawiyah",
      "B": "Umar Bn Khattab",
      "C": "Ali Bn Abi Talib",
      "D": "Uthman"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65643?exam_type=jamb&type=obj&page=192",
    "correct_answer": "D",
    "explanation": "The second period of Ali's life began in 610 when he declared Islam at age 10 and ended with the Hijra of Muhammad to Medina in 622.[1] When Muhammad reported that he had received a divine revelation, Ali, then only about ten years old, believed him and professed to Islam.",
    "year": "2014"
  },
  {
    "number": "961",
    "text": "In which Surah of the Qu'ran does this verse occur \"Fasalli il-rabbika wani har\"",
    "options": {
      "A": "lahb",
      "B": "fathiah",
      "C": "Kawthar",
      "D": "Nas"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65647?exam_type=jamb&type=obj&page=193",
    "correct_answer": "C",
    "explanation": "Al-Kawthar or Al-AHQAFINA (Arabic: ْاَلْكَوْثَر‎, \"Abundance\") is the 108th and shortest chapter (sūrah) of the Quran. There are several different opinions as the timing and contextual background of its supposed revelation (asbāb al-nuzūl). According to Ibn Ishaq, it is an earlier \"Meccan surah\", which is believed to have been revealed in Mecca, sometime before the Isra and Mi'raj.",
    "year": "2014"
  },
  {
    "number": "974",
    "text": "Which of the following is not a quality of the Prophet (SAW)",
    "options": {
      "A": "Forgetfulness",
      "B": "Kindness",
      "C": "Patience",
      "D": "Forgiveness"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65660?exam_type=jamb&type=obj&page=195",
    "correct_answer": "A",
    "explanation": "The 68:4 verse of the Quran says: 'And you [Muhammad] are surely on exalted quality of character'. Consequently, to the Muslims, his life and character are an excellent example to be emulated both at social and spiritual levels. The virtues that characterize him are modesty and humility, forgiveness and generosity, honesty, justice, patience, and, self-denial.",
    "year": "2014"
  },
  {
    "number": "975",
    "text": "The first woman to accept Islam was _____",
    "options": {
      "A": "Aminah",
      "B": "Khadijah",
      "C": "Ruqayah",
      "D": "Aisha"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65661?exam_type=jamb&type=obj&page=195",
    "correct_answer": "B",
    "explanation": "Khadijah bint Khuwaylid (Arabic: خَدِيجَة ٱبْنَت خُوَيْلِد‎, Khadījah ibnat Khuwaylid, born AD 555- 22 November AD 619), commonly known as Khadija, was the first wife and first female follower of the Islamic prophet Muhammad.Khadijah is often referred to by Muslims as \"Mother of the Believers\". She and her daughter Fatimah are two of the most important female figures in Islam. Muhammad was monogamously married to her for 25 years.",
    "year": "2014"
  },
  {
    "number": "976",
    "text": "The following are considered good for water ablution except___",
    "options": {
      "A": "well water",
      "B": "Pond water",
      "C": "river water",
      "D": "rain water"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65662?exam_type=jamb&type=obj&page=196",
    "correct_answer": "B",
    "explanation": "Permitted water types-Spring, sea or river water-Water of melting snow or hail-Water of a big tank-Well waterProhibited water type;-Unclean or impure water-Water extracted from fruit and trees-Water that has changed its colour, taste and smell and has become thick because something was soaked in it-Small quantity of water in which something unclean has fallen, e.g. urine, blood, stool or wine or some animal had died after falling into it-Water left over after drinking by haram animals (e.g. pigs or predatory animals)-Used water of wuḍūʾ or ghusl",
    "year": "2014"
  },
  {
    "number": "977",
    "text": "The authenticity of a hadīth may be faulted if",
    "options": {
      "A": "it is no longer than a verse of the Qur''ān",
      "B": "its wording is too close to the text of the Qur''ān",
      "C": "its narrator was not from Makkah",
      "D": "it contradicts a Qur''ānic injuction"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65663?exam_type=jamb&type=obj&page=196",
    "correct_answer": "D",
    "explanation": ": Maliki Sunnis, was an Arab Muslim jurist, theologian, and hadith traditionist.Born in the city of Medina, Malik rose to become the premier scholar of prophetic traditions in his day,which he sought to apply to \"the whole legal life\" in order to create a systematic method of Muslim jurisprudence which would only further expand with the passage of time",
    "year": "2014"
  },
  {
    "number": "978",
    "text": "The first young person to accept Islam was?",
    "options": {
      "A": "Ali Bn Abi Talib",
      "B": "Tarifa",
      "C": "Umar Bn Khattab",
      "D": "Muawiyah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65664?exam_type=jamb&type=obj&page=196",
    "correct_answer": "A",
    "explanation": "The second period of Ali's life began in 610 when he declared Islam at age 10 and ended with the Hijra of Muhammad to Medina in 622.[1] When Muhammad reported that he had received a divine revelation, Ali, then only about ten years old, believed him and professed to Islam.",
    "year": "2014"
  },
  {
    "number": "979",
    "text": "Subh prayer contains _____ obligatory ra'kahs",
    "options": {
      "A": "5",
      "B": "2",
      "C": "4",
      "D": "3"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65665?exam_type=jamb&type=obj&page=196",
    "correct_answer": "B",
    "explanation": ":'Subh' refers to the fard morning prayerFard PrayersFard is an Arabic word which means compulsory or obligatory. There are five obligatory Prayers everyday:Prayer ;No. of Rak'atFajr 2Zuhr 4'Asr 4Maghrib 3'Isha'4",
    "year": "2014"
  },
  {
    "number": "982",
    "text": "From the above, the goal of luqmān's counsel to his son:... As contained in sūrah 31:13 is to",
    "options": {
      "A": "discourage pride",
      "B": "uphold the principle",
      "C": "encourage goodness to parents",
      "D": "warn against finding partners for Allah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65668?exam_type=jamb&type=obj&page=197",
    "correct_answer": "D",
    "explanation": "Qur'an 31:13And call to mind when Luqman said to his son while exhorting him: \"My son, do not associate others with Allah in His Divinity. Surely, associating others with Allah in His Divinity is a mighty wrong.",
    "year": "2014"
  },
  {
    "number": "986",
    "text": "Fortune telling is un-Islamic",
    "options": {
      "A": "only when it is done by non-Muslims",
      "B": "only in matters relating to religious practices",
      "C": "when Islamic scriptures are not used for it",
      "D": "at all times and in all matters"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65672?exam_type=jamb&type=obj&page=198",
    "correct_answer": "D",
    "explanation": "one who seeks his horoscope comes under the ruling contained in the Prophet's statement: \"The daily prayers of whoever approaches a fortune-teller and asks him about anything will not be accepted for forty days and nights.\" [Muslim]The punishment in this Hadeeth is simply for approaching and asking the astrologist, even if one is in doubt about the truth of his statements. When one is in doubt about the truth or falsehood of astrological information, this entails that he is in doubt about whether or not others know the unseen and the future besides Allah. This is a form of Shirk, because Allah has clearly stated (what means): \"And with Him [i.e., Allah] are the keys of the unseen; none knows them except Him.\" [Quran 6:59] As well as (what means): \"Say (O Muhammad): 'None in the heavens and earth knows the unseen except Allah...'\" [Quran: 27:65]",
    "year": "2014"
  },
  {
    "number": "989",
    "text": "'Say: I am but a man like yourselves, (but) The inspiration has come to me ...' (Q.18:110) in relation to Kalimat sh-shahādah, the verse quoted above",
    "options": {
      "A": "Proves that any other prophet could take the place of Muhammed (S.W)",
      "B": "Is a summary of the content",
      "C": "Traces the origin of the expression",
      "D": "Emphasizes a part of the content"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65675?exam_type=jamb&type=obj&page=198",
    "correct_answer": "D",
    "explanation": ":(18:110) Say (O Muhammad): \"I am no more than a human being like you; one to whom revelation is made: 'Your Lord is the One and Only God.' Hence, whoever looks forward to meet his Lord, let him do righteous works, and let him associate none with the worship of his Lord.\"",
    "year": "2014"
  },
  {
    "number": "993",
    "text": "The Makkahs were opposed to Muhammad (SAW) because he preached primarily against _____",
    "options": {
      "A": "Murder and suicide",
      "B": "Drinking and smoking",
      "C": "Idolatry and exploitation",
      "D": "Music and dancing"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65679?exam_type=jamb&type=obj&page=199",
    "correct_answer": "C",
    "explanation": "Conservative opposition arose to Muhammad's speeches. According to Ibn Sad, the opposition in Mecca started when Muhammad delivered verses that \"spoke shamefully of the idols they (the Meccans) worshiped other than Himself (God) and mentioned the perdition of their fathers who died in disbelief. As the ranks of Muhammad's followers swelled, he became a threat to the local tribes and the rulers of the city, whose wealth rested upon the Kaaba, the focal point of Meccan religious life, which Muhammad threatened to overthrow",
    "year": "2014"
  },
  {
    "number": "997",
    "text": "In Sūrat al-falaq, the Qur'ān refers to an element of witchcraft and the",
    "options": {
      "A": "evils of jinns and men",
      "B": "mischief of the envious one",
      "C": "mischief of created beings",
      "D": "evils of back-biting"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65684?exam_type=jamb&type=obj&page=200",
    "correct_answer": "B",
    "explanation": "Lessons from Surah 113,Sūrat al-falaqSeek refuge in Allāh from all evil.Seek refuge in Him from the evil of the creation.Seek refuge in Him from the darkness of the night.Seek refuge in Him from the evil of the sorcerers.Seek refuge in Him from those who harbour jealousy.",
    "year": "2014"
  },
  {
    "number": "1003",
    "text": "In Sūrat al - Mā'ūn(Q.107), we learn that a good believer should not",
    "options": {
      "A": "assist in wrongdoing",
      "B": "tell lies",
      "C": "repulse the orphan",
      "D": "harm a fellow Muslim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65690?exam_type=jamb&type=obj&page=201",
    "correct_answer": "C",
    "explanation": "Qur'an 107[In the Name of Allah, the Most Beneficent, the Most Merciful.]1) أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ[Have you seen him who denies the Recompense?]2) فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ[That is he who repulses the orphan (harshly),]3) وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ[And urges not on the feeding of Al-Miskîn (the needy),]",
    "year": "2014"
  },
  {
    "number": "1006",
    "text": "Imam Mālik Ibn Anās was born in",
    "options": {
      "A": "Basra",
      "B": "al-Madīnah",
      "C": "Makkah",
      "D": "Kūfah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65693?exam_type=jamb&type=obj&page=202",
    "correct_answer": "B",
    "explanation": "Maliki Sunnis, was an Arab Muslim jurist, theologian, and hadith traditionist.Born in the city of Medina, Malik rose to become the premier scholar of prophetic traditions in his day,which he sought to apply to \"the whole legal life\" in order to create a systematic method of Muslim jurisprudence which would only further expand with the passage of time",
    "year": "2014"
  }
]