[
  {
    "number": "2166",
    "text": "A limerick has",
    "options": {
      "A": "ornate style, humour, irony and seven lines",
      "B": "formal and elaborate style and humour",
      "C": "humour,rhyme scheme and five lines",
      "D": "a stinging climax, rhyme scheme, and five lines"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67573?exam_type=jamb&type=obj&page=434",
    "correct_answer": "C",
    "explanation": "A humorous short poem with two long lines that rhyme with each other followed by two short lines that rhyme with each other and ending with a long line that rhymes with the first two. The rhyme scheme is usually aabba.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2167",
    "text": "The process of creating characters and endowing them with certain attitude is ......",
    "options": {
      "A": "Action",
      "B": "Character",
      "C": "Characterization",
      "D": "Dramatis personae"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67581?exam_type=jamb&type=obj&page=434",
    "correct_answer": "C",
    "explanation": "Characterization is the process by which the writer reveals the personality of a character. It is the method used by a writer to develop a character. This can be done directly by the author or indirectly through the actions, thoughts, and speech of the character.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2168",
    "text": "This question is based on BAT.\n\nRead the excerpt and answer the question:\n\"Bat!\nCreatures that hang themselves up like an old rag, to sleep, And disgustingly upside down.\"\n\nThe theme of this excerpt is____",
    "options": {
      "A": "All of the above",
      "B": "the poet's right to Individual choice",
      "C": "the poet's admiration of the beauty of nature",
      "D": "the poet's appalling remarks about the bird"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67594?exam_type=jamb&type=obj&page=434",
    "correct_answer": "D",
    "explanation": "The theme of the excerpt is the poet's appalling remarks about the bird. The poet describes the bat in a negative light, comparing it to an 'old rag' and expressing disgust at its sleeping habits.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2169",
    "text": "The writing convention in which the events in a narrative are scrambled as they come to the writer's mind without any attempt to arrange them in orderly sequence is called",
    "options": {
      "A": "psycho-consciousness styles",
      "B": "narrator's mind style",
      "C": "shifting style",
      "D": "stream of consciousness"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67595?exam_type=jamb&type=obj&page=434",
    "correct_answer": "D",
    "explanation": "The writing convention in which the events in a narrative are presented as they come to the writer's mind, without any attempt to arrange them in an orderly sequence, is called 'stream of consciousness'. This style seeks to depict the myriad thoughts and feelings which pass through the mind. Therefore, the option 'stream of consciousness' is correct.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2170",
    "text": "Using the name of one thing for something else with which it is closely associated in an instance is",
    "options": {
      "A": "paradox",
      "B": "parody",
      "C": "parallelism",
      "D": "metonymy"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67596?exam_type=jamb&type=obj&page=434",
    "correct_answer": "D",
    "explanation": "It is the act of using a well-known object to represent the holder or user.e.g: \"I miss my home\" *home here means \"family\"\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2171",
    "text": "Which of these is the oldest genre of literature?",
    "options": {
      "A": "Aroma",
      "B": "Poetry",
      "C": "Drama",
      "D": "Prose"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67597?exam_type=jamb&type=obj&page=435",
    "correct_answer": "B",
    "explanation": "Poetry is considered the oldest form of literature. It dates back to prehistoric times when oral storytelling was the primary method of communication. Poetry was used to tell stories, record history, express emotions, and convey ideas. It predates the written word and was used in ancient civilizations for religious rituals, songs, and storytelling. The other options, Drama and Prose, came later in the history of literature.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2172",
    "text": "The tragic character is the person whose experiences arouse pity and",
    "options": {
      "A": "sympathy",
      "B": "terror",
      "C": "horror",
      "D": "frustration"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67598?exam_type=jamb&type=obj&page=435",
    "correct_answer": "B",
    "explanation": "In literature, a tragic character is one that experiences a downfall due to their own flaw or mistake. The downfall of this character arouses feelings of pity and fear (or terror) in the audience. This is a concept known as 'catharsis', a term used by Aristotle in his work 'Poetics', to describe the feelings of pity and fear that the audience feels for the tragic hero.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2173",
    "text": "'As virtuous men pass mildly away,\nAnd whisper to their souls, to go\nWhilst some of their sad friends do say,\nThe breadth goes now, and some say, \"No\".'\nJohn Donne: A Valediction: Forbidding Mourning\n\nThe tone of this poem is generally",
    "options": {
      "A": "conversational",
      "B": "imaginative",
      "C": "serious",
      "D": "appreciative"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67599?exam_type=jamb&type=obj&page=435",
    "correct_answer": "C",
    "explanation": "Subject of death is being elucidated in the quatrain. Because death is a serious issue, the tone is serious.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2174",
    "text": "Cast in a play refers to",
    "options": {
      "A": "three of the actors",
      "B": "a few of the actors",
      "C": "an exclusive social class in the play",
      "D": "all the actors"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67602?exam_type=jamb&type=obj&page=435",
    "correct_answer": "D",
    "explanation": "Cast in a play refers to all the actors. We can as well call such actors and actresses the dramatis personae.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2175",
    "text": "A panegyric poem is composed to",
    "options": {
      "A": "condemn",
      "B": "elaborate",
      "C": "abuse",
      "D": "praise"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67617?exam_type=jamb&type=obj&page=435",
    "correct_answer": "D",
    "explanation": "The panegyric poem is composed to offer high praisre to a person or thing. It is also known as a eulogy.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2176",
    "text": "Jibunoh was simply a difficult man. He was hated by all his neighbours and deserted by his relations. He was the first and only person to beat a policeman in the entire village. He also had ten cases instituted against him for either stealing or violating the rights of others. He had no regard for deanery or normal conduct. No lover of peace or order could be his friends. It is not surprising that his death elicited jubilation rather than mourning'\n\nThe passage above reveals that Jibunoh symbolizes",
    "options": {
      "A": "insanity",
      "B": "wickedness",
      "C": "lawlessness",
      "D": "isolation"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67618?exam_type=jamb&type=obj&page=436",
    "correct_answer": "C",
    "explanation": "The passage describes Jibunoh as a man who is difficult, hated, and has no regard for law or order. He has been involved in multiple cases of theft and violation of others' rights. This description symbolizes 'lawlessness'. Lawlessness refers to a state of disorder due to a disregard of the law. In this context, Jibunoh's actions and the reactions of others towards him represent a state of lawlessness.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2177",
    "text": "The part of a play when climax approaches is known as",
    "options": {
      "A": "Catastasis",
      "B": "Catharsis",
      "C": "protasis",
      "D": "Epitasis"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67620?exam_type=jamb&type=obj&page=436",
    "correct_answer": "D",
    "explanation": "Epitasis refers to the part of the play or narrative where the action intensifies, leading toward the climax. It involves the development of the central conflict and the building of tension.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2178",
    "text": "'And so Tom awoke and we rose in the dark\nAnd got with our bags and our brushes to work\nThough the morning was cold, Tom was happy and warm;\nSo if all do their duty they need not fear harm.'\nIn the lines above, Tom is warm because he",
    "options": {
      "A": "is working indoors",
      "B": "is wearing warm clothes",
      "C": "is doing his duty",
      "D": "has just woken from sleep"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67621?exam_type=jamb&type=obj&page=436",
    "correct_answer": "C",
    "explanation": "In the lines above, Tom is warm because he is doing his duty. The last line of the poem states, 'So if all do their duty they need not fear harm.' This suggests that Tom's warmth is not a result of just waking from sleep, wearing warm clothes, or working indoors, but rather from the satisfaction and fulfillment derived from doing his duty.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2179",
    "text": "The term given to a type of incident or device which recurs frequently in Literature is",
    "options": {
      "A": "concept",
      "B": "myth",
      "C": "ritual",
      "D": "motif"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67622?exam_type=jamb&type=obj&page=436",
    "correct_answer": "D",
    "explanation": "Motif is a literary technique that consists of a repeated element that has symbolic significance to a literary work. Sometimes, a motif is a recurring image. Other times, it's a repeated word, phrase, or topic expressed in language.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2180",
    "text": "An extended fictional narrative which is realistic is known as a",
    "options": {
      "A": "short story",
      "B": "diary",
      "C": "novella",
      "D": "novel"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67627?exam_type=jamb&type=obj&page=436",
    "correct_answer": "D",
    "explanation": "A novel is a fictional narrative which is realistic and of a certain length. Diary is never fictional. Novella and short story are limitedly realistic fictions.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2181",
    "text": "A Government Driver on His Retirement is a poem of thirty-three lines divided into _______ stanzas.",
    "options": {
      "A": "six",
      "B": "four",
      "C": "three",
      "D": "five"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67631?exam_type=jamb&type=obj&page=437",
    "correct_answer": "A",
    "explanation": "A Government Driver on His Retirement is a poem of thirty-three lines divided into six stanzas. Stanzas 1, 2, 4 and 5 have four lines each while Stanzas 3 and 6 have eight and nine lines respectively.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2182",
    "text": "This question is based on THE JOURNEY OF THE MAGI.\n\nRead the excerpt and answer question\n\"And running away, and wanting their liquor and women,\nAnd the night-fires going out, and the lack of shelters,\nAnd the cities hostile and the towns unfriendly\"\n\nThe dominant device in this excerpt is ___",
    "options": {
      "A": "metaphor",
      "B": "synecdoche",
      "C": "simile",
      "D": "paradox"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67633?exam_type=jamb&type=obj&page=437",
    "correct_answer": "B",
    "explanation": "The dominant device in the excerpt from 'The Journey of the Magi' is synecdoche. Synecdoche is a figure of speech in which a part is made to represent the whole or vice versa. In this case, 'night-fires going out' and 'lack of shelters' are used to represent the overall hardships and difficulties of the journey. The device is not paradox, metaphor, or simile, as there is no contradiction, comparison, or likeness being expressed.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2183",
    "text": "The sides of a stage are called",
    "options": {
      "A": "both sides",
      "B": "the ways",
      "C": "the wings",
      "D": "the pits"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67635?exam_type=jamb&type=obj&page=437",
    "correct_answer": "C",
    "explanation": "In theatre terminology, the sides of a stage are referred to as 'the wings'. This is where actors prepare to enter the stage and where props may be stored ready for use.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2184",
    "text": "Be him English\n\nBe him African\n\nBe him Nigerian\n\nThe lines above are an example of",
    "options": {
      "A": "epigram",
      "B": "anaphora",
      "C": "epitaph",
      "D": "tautology"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67637?exam_type=jamb&type=obj&page=437",
    "correct_answer": "B",
    "explanation": "Anaphora refers to the repetition of certain words or phrase at the begining of each sentence or line in a poem\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2185",
    "text": "When he gave me the bottle, and I opened it,\nI was shocked by the odour that hit my nose:\nI immediately corked it again, and spat on the floor..\nIsidore Okpewho, The Last Duty.\n\nThe reaction in the passage above is that of",
    "options": {
      "A": "anger",
      "B": "protest",
      "C": "rejection",
      "D": "nausea"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67643?exam_type=jamb&type=obj&page=437",
    "correct_answer": "D",
    "explanation": "The reaction in the passage above is that of nausea. The character is shocked by the odour that hits his nose when he opens the bottle, and he immediately corks it again and spits on the floor. This reaction is indicative of a feeling of nausea, which is a sensation of unease and discomfort in the upper stomach with an involuntary urge to vomit.",
    "year": "2023"
  },
  {
    "number": "2186",
    "text": "A formal dignified speech or writing praising a person or a thing for past or present deeds is",
    "options": {
      "A": "lampoon",
      "B": "eulogy",
      "C": "premiere",
      "D": "anthology"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67644?exam_type=jamb&type=obj&page=438",
    "correct_answer": "B",
    "explanation": "A eulogy is a formal speech or piece of writing that praises someone or something highly, typically someone who has just died. Therefore, the correct answer is 'eulogy'. An anthology is a published collection of poems or other pieces of writing. A lampoon is a speech or text criticizing someone or something humorously. A premiere is the first performance of a play or the first showing of a movie.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2187",
    "text": "A character that is always against the interest of the protagonist is",
    "options": {
      "A": "opposition",
      "B": "heroine",
      "C": "villain",
      "D": "hero"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67646?exam_type=jamb&type=obj&page=438",
    "correct_answer": "C",
    "explanation": "In literature, a character that is always against the interest of the protagonist is referred to as a villain. A villain is a character whose evil actions or motives are important to the plot.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2188",
    "text": "\"...Rage is Chief\nRage drags rags after you, of Charity\nLaughter, sweetness and light, Rage is thief\nEnemy of equanimity\"\n\nThe figure of speech dominant in these lines is _____",
    "options": {
      "A": "apostrophe",
      "B": "personification",
      "C": "metaphor",
      "D": "simile"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67647?exam_type=jamb&type=obj&page=438",
    "correct_answer": "B",
    "explanation": "Writers use personification to give human characteristics, such as emotions and behaviors, to non-human things, animals, and ideas.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2189",
    "text": "'... Not a few of us ended our application letter like this: 'if you are kind enough to accomodate this humble application, Sir/Madam, I shall do my uttermost best to rendered you the greatest services which it is at my desposition to your best satisfactory. Yours obediently servant...' yet without English, you had no education fit for a white collar job\nCameron Daodu: The Gab Boys\n\nThe tone of the passage above is",
    "options": {
      "A": "Melancholic",
      "B": "Ironic",
      "C": "Harsh",
      "D": "Derisive"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67649?exam_type=jamb&type=obj&page=438",
    "correct_answer": "D",
    "explanation": "The tone of the passage from Cameron Daodu's The Gab Boys is derisive. The author is mocking the overly formal and somewhat incorrect English used in the application letter. Derisive tone is used to ridicule or mock, often with sarcasm or satire.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2190",
    "text": "A trilogy is the",
    "options": {
      "A": "set of three one-act drama written by related authors",
      "B": "series of related stories divided into three equal parts",
      "C": "sequence of three plays written by the same author",
      "D": "collection of three poems of equal length"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67651?exam_type=jamb&type=obj&page=438",
    "correct_answer": "C",
    "explanation": "A trilogy is a set of three works of literature, films, or plays that are connected and can be seen either as a single work or as three individual works. They are usually written by the same author. Therefore, a trilogy is a sequence of three plays written by the same author.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2191",
    "text": "Dramatis personae in a play refers to",
    "options": {
      "A": "cast list",
      "B": "list of characters",
      "C": "portagonist and antagonist",
      "D": "order of appearance"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67653?exam_type=jamb&type=obj&page=439",
    "correct_answer": "B",
    "explanation": "Dramatis personae in a play refers to the list of characters. It is a Latin phrase meaning 'the characters of the play'. It is usually used at the beginning of a script for a play, before the action begins, to present the characters and their relationships to one another.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2192",
    "text": "This question is based on SECOND CLASS CITIZEN.\n\n\"She swallowed it all, just like a nasty pill.\" The literary device employed here is",
    "options": {
      "A": "alliteration",
      "B": "metaphor",
      "C": "simile",
      "D": "apostrophe"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67655?exam_type=jamb&type=obj&page=439",
    "correct_answer": "C",
    "explanation": "The phrase 'She swallowed it all, just like a nasty pill' employs the literary device of simile. A simile is a figure of speech that makes a comparison between two different things using the words 'like' or 'as'. In this case, the author compares the act of swallowing a nasty pill to accepting a difficult situation.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2193",
    "text": "'My heart is a quiet drum, sometimes it flares like a parched thunder cracking through a damask sky it lifts me in its fired spectacle.'\n-Cynthia James; Drumology\n\nThe imagery in the excerpt above is largely",
    "options": {
      "A": "olfactory and visual",
      "B": "auditory and visual",
      "C": "tactile and auditory",
      "D": "olfactory and tactile"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67656?exam_type=jamb&type=obj&page=439",
    "correct_answer": "B",
    "explanation": "The excerpt from Cynthia James' Drumology uses auditory and visual imagery. The auditory imagery is evident in phrases like 'quiet drum' and 'parched thunder cracking', which appeal to the sense of hearing. The visual imagery is seen in phrases like 'flares like a parched thunder' and 'cracking through a damask sky', which appeal to the sense of sight.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2194",
    "text": "\"She wanted to split herself. But she checked herself. 'Get dressed,' she said earnestly. 'Get dressed and let's go. You know I have a lot of things to do. And if we are going to meet again like this... 'She slapped the bed, 'then it won't be here. It will be at the Samson and Delilah.'\" -\nFestus Iyayi; Violence\n\nIn the passage above, the speaker can be described as",
    "options": {
      "A": "hungry",
      "B": "domineering",
      "C": "friendly",
      "D": "treacherous"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67657?exam_type=jamb&type=obj&page=439",
    "correct_answer": "B",
    "explanation": "In the passage, the speaker is commanding another person to get dressed and stating that if they are to meet again, it will be at a location of her choosing. This suggests that the speaker is in control of the situation and is making decisions for both herself and the other person, which is characteristic of a domineering personality. The other options (treacherous, friendly, hungry) do not accurately describe the speaker's behavior in this passage.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2195",
    "text": "This question is based on THE LION AND THE JEWEL.\n\nThe indication that Soyinka's \"The Lion and the Jewel\" is culturally set is its use of_____",
    "options": {
      "A": "dance and songs",
      "B": "flashback.",
      "C": "foreshadowing",
      "D": "irony"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67659?exam_type=jamb&type=obj&page=439",
    "correct_answer": "A",
    "explanation": "The cultural setting of Wole Soyinka's 'The Lion and the Jewel' is indicated by its use of dance and songs. These elements are integral parts of Yoruba culture, which is the cultural background of the play.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2196",
    "text": "This question is based on THE LEADER AND THE LED.\n\n\" The hyena says the crown is made for him\" in the above excerpt, the use of the word \"crown \" is a good deployment of ____",
    "options": {
      "A": "oxymoron",
      "B": "imagery",
      "C": "personification",
      "D": "synedoche"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67664?exam_type=jamb&type=obj&page=440",
    "correct_answer": "D",
    "explanation": "Synecdocheis a literary device where a part of something represents the whole, or vice versa. In the phrase\"the crown is made for him,\"the wordcrowndoes not literally refer to an actual crown but symbolizesleadership, authority, or kingship.",
    "year": "2023"
  },
  {
    "number": "2197",
    "text": "The exclusive right given to authors to protect their works from unlawful production is",
    "options": {
      "A": "an authority to write",
      "B": "a copyright",
      "C": "an author's right",
      "D": "a constitutional provision"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67666?exam_type=jamb&type=obj&page=440",
    "correct_answer": "B",
    "explanation": "A copyright prevents other people from producing an intellectual work without the permission of the author.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2198",
    "text": "The narrative style in which the hero tells his own story directly is the",
    "options": {
      "A": "objective",
      "B": "first-person",
      "C": "subjective",
      "D": "third-person"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67681?exam_type=jamb&type=obj&page=440",
    "correct_answer": "B",
    "explanation": "This is a style of writing where the narrator is a character in the novel and uses 'I', 'We','Me', 'ourselves', 'myself'.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2199",
    "text": "Lineation refers to",
    "options": {
      "A": "the arrangement of lines in verse form",
      "B": "the grouping together of a number of units of rhythm",
      "C": "the unit in the rhythmic structure of verse",
      "D": "tracing family descent of poeple in verse"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67682?exam_type=jamb&type=obj&page=440",
    "correct_answer": "A",
    "explanation": "Lineation in poetry is how lines are divided and where they end in relation to a clause or thought. Having a line break at the end of a phrase or complete thought is a regular and expected pattern in poetry.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2200",
    "text": "The subject matter of a literary work is the",
    "options": {
      "A": "theme",
      "B": "plot",
      "C": "structure",
      "D": "setting"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67683?exam_type=jamb&type=obj&page=440",
    "correct_answer": "A",
    "explanation": "The subject matter of a literary work refers to the main topic or the essence of the work, which is also known as the theme. The theme is the central idea or message that the writer wants to communicate to the reader. It is different from the plot, setting, and structure. The plot refers to the sequence of events in the story, the setting refers to the time and place where the story takes place, and the structure refers to how the story is organized.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2201",
    "text": "A structural arrangement of unit of composition by which one element of equal importance with another is similarly placed is called",
    "options": {
      "A": "repetition",
      "B": "paradox",
      "C": "refrain",
      "D": "parallelism"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67684?exam_type=jamb&type=obj&page=441",
    "correct_answer": "D",
    "explanation": "Parallelism is a rhetorical device where parts of a sentence or a series of sentences are constructed similarly to convey equal importance. This structural arrangement ensures balance and symmetry in the expression of ideas. The elements that are parallel often have a similar grammatical structure, making the writing more clear, effective, and aesthetically pleasing.\nFor example:- Not Parallel: He came, saw and conquered.- Parallel: I came, I saw, I conquered.\nIn the context of the question, the structural arrangement described is characterized by placing elements of equal importance similarly.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2202",
    "text": "This question is based on CAGED BIRD.\n\"for the caged bird/sings of freedom.\",\nThe poetic device used in this expression is____",
    "options": {
      "A": "metaphor",
      "B": "irony",
      "C": "hyperbole",
      "D": "paradox"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67685?exam_type=jamb&type=obj&page=441",
    "correct_answer": "B",
    "explanation": "The poetic device used in the expression 'for the caged bird sings of freedom' is irony. Irony is a figure of speech in which the intended meaning is the opposite of the literal meaning. In this case, the irony lies in the fact that the caged bird, despite being confined, sings of freedom.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2203",
    "text": "'Will college make you a better Olokun priest?\nWill it make you serve our ancestors better?\nLook at me. An able-bodied, strong-hearted priest of Olokun.\nDid I go to college?\nGracy Osifo:Dizzy Angel\n\nThe literary device used in the passage above is",
    "options": {
      "A": "onomatopoeia",
      "B": "parallelism",
      "C": "metaphor",
      "D": "simile"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67687?exam_type=jamb&type=obj&page=441",
    "correct_answer": "B",
    "explanation": "Parallelism is a literary device that uses the same grammatical structure in all parts of a sentence. In the passage, the speaker asks a series of questions that follow the same structure, which is a clear example of parallelism. Onomatopoeia refers to words that imitate the natural sounds of a thing. Metaphor is a figure of speech that makes an implicit, implied, or hidden comparison between two things that are unrelated, but share some common characteristics. Simile is a figure of speech that makes a comparison, showing similarities between two different things.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2204",
    "text": "This question is based on RAIDER OF THE TREASURE TROVE.\n\n\"To fly flags of joy\" Two figures of speech used here are",
    "options": {
      "A": "alliteration and personification",
      "B": "onomatopoeia and simile",
      "C": "metaphor and alliteration",
      "D": "simile and personification"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67688?exam_type=jamb&type=obj&page=441",
    "correct_answer": "C",
    "explanation": "The phrase 'To fly flags of joy' contains two figures of speech: metaphor and alliteration. 'To fly flags' is a metaphor for expressing joy, while 'flags of joy' is an example of alliteration due to the repetition of the 'f' sound.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2205",
    "text": "This question is based on THE SONG OF THE WOMEN OF MY LAND.\n\nUse the excerpt to answer this question\n\n\"they sang in the forlorn fields\nabout their lives; songs\nof how they ploughed the terrain of their landscape\nfor memories of lyrics lost in the vast void of time,\nin those days when a song beheld their lives;\nwhen servitude cuffed the ankles of their soul,\nand dereliction decapitated the epic of their lives.\"\n\nThe theme of this excerpt is____",
    "options": {
      "A": "All of the above",
      "B": "the oppression of women",
      "C": "Joys of motherhood",
      "D": "colonization"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67689?exam_type=jamb&type=obj&page=441",
    "correct_answer": "B",
    "explanation": "The theme of the excerpt is the oppression of women. The excerpt talks about how the women sang about their lives, how they worked hard (ploughed the terrain of their landscape), and how they were in servitude (servitude cuffed the ankles of their soul). This suggests that they were oppressed.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2206",
    "text": "Jose Palacios, his oldest servant, found him floating naked with his eyes open in the purifying waters of his bath and thought he had drowned. He knew this was, one of the many ways the General meditated, but the ecstasy in which he lay drifting seemed that of a man no longer of this world.\nGabriel Garcia Marquez, The General in His Labyrinth\n\nThe master in the passage above is obviously in a state of",
    "options": {
      "A": "trance",
      "B": "drowning",
      "C": "forgetfulness",
      "D": "labyrinth"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67690?exam_type=jamb&type=obj&page=442",
    "correct_answer": "A",
    "explanation": "The man was in trance. His oldest servant \"...found him floating naked with his eyes open in the purifying waters of his bath and thought he had drowned. For the fact that he lay drifting in addition to a man no longer of this world portends getting into a situation that was not planned or controlled.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2207",
    "text": "A metrical pause occurring in the middle of a line in a poem is called",
    "options": {
      "A": "tetrametre",
      "B": "rhythm",
      "C": "caesura",
      "D": "assonance"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67691?exam_type=jamb&type=obj&page=442",
    "correct_answer": "C",
    "explanation": "A caesura is a pause in a line of poetry that is formed by the rhythms of natural speech rather than by metrics.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2208",
    "text": "'The fair breeze blew\nThe white foam flew\nThe furrow followed free\nWe were the first that ever burst\nInto that silent sea.'\n\nThe dominant figure of speech in the above passage is",
    "options": {
      "A": "repitition",
      "B": "alliteration",
      "C": "paradox",
      "D": "rhyme scheme"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67693?exam_type=jamb&type=obj&page=442",
    "correct_answer": "B",
    "explanation": "Alliteration is the repetition of initial consonant sounds in a line of poetry. The repetition of the sounds /f/, /b/, /w/, and /s/ in the verse above signifies the use of alliteration.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2209",
    "text": "Careened',\nThese oily tears\nDripping down the tears on your depressed face,\nWill one day be staunched, I swear!\nIbiwari Ikiriko, Oily Tears.\n\nThe tone of the poet is",
    "options": {
      "A": "supplicatory",
      "B": "optimistic",
      "C": "sympathetic",
      "D": "piteous"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67696?exam_type=jamb&type=obj&page=442",
    "correct_answer": "B",
    "explanation": "The tone is optimistic because it predicts an end to the shedding of tears. The phrase oily tears is a metonymy for oil spill being a cause of sorrow (i.e. tears) to the addressee,and the poet being of a strong hope that oil spilling and attendant suffering will become a past tense matter (staunched)sooner than later, is clearly optimistic.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2210",
    "text": "CYCLIST gets down and begins to prop his bicycle.\nCYCLIST: All right. If you're sure it won't take long.\nBARBER: I am known for my lightning clippers. Even the soldiers know me. I can shave the head of an entire battalion between one coup and the next. Sit down and relax your back. Cycling is not easy\nwhen you've abandoned it for some time.\nWole Soyinka, The Beautification of Area Boy.\n\nThe literary devices in the dialogue above are",
    "options": {
      "A": "hyperbole and allusion",
      "B": "irony and parody",
      "C": "allusion and paradox",
      "D": "humour and irony"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67698?exam_type=jamb&type=obj&page=442",
    "correct_answer": "A",
    "explanation": "The excerpt smacks of plenteous exaggerations(hyperbole), and a once-upon-a time reference (allusions).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2211",
    "text": "\"I had not taken the first step in knowledge, I had not learnt to let go with the hands\".The above lines is an example of a",
    "options": {
      "A": "Alliteration",
      "B": "Apostrophe",
      "C": "Repetition",
      "D": "Assonance"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67699?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "The given lines are an example of 'Repetition'. Repetition is a literary device that repeats the same words or phrases a few times to make an idea clearer and more memorable. In the given lines, the phrase 'I had not' is repeated, which emphasizes the speaker's lack of action or progress.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2212",
    "text": "This question is based on CAGED BIRD.\n\nRead this excerpt from the poem and answer questions .\n\n\"The free bird thinks of another\nbreeze / and the trade winds\nsoft through the sighing trees\"\n\nWhat is the effect of the trees sighing in this verse?",
    "options": {
      "A": "It shows where the bird sleeps",
      "B": "It shows the tree is sleeping",
      "C": "It indicates that the bird is carefree",
      "D": "It indicates that it is still early in the day"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67702?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "In the given excerpt, the 'sighing trees' is a poetic device used to create a peaceful and carefree atmosphere. The free bird is thinking of another breeze and the trade winds soft through the sighing trees, which suggests a sense of freedom and lack of worries. Therefore, the best answer is 'It indicates that the bird is carefree.'\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2213",
    "text": "Don't panic. Be calm. If you are somehow upset...try to regain your composure.\n\nThe speaker in the excerpt above is",
    "options": {
      "A": "hopeless",
      "B": "afraid",
      "C": "confident",
      "D": "uncertain"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67704?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "The speaker in the excerpt is confident. This is inferred from the speaker's advice to not panic, be calm, and regain composure if upset. These are words of reassurance and guidance, indicating that the speaker is confident in their understanding of how to handle the situation.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2214",
    "text": "This question is based on A GOVERNMENT DRIVER ON HIS RETIREMENT.\n\n\"I shall booze and zoom\" contains a device called",
    "options": {
      "A": "alliteration",
      "B": "imagery",
      "C": "onomatopoeia",
      "D": "hyperbole"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67705?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "This device involves words that imitate or resemble the sound that they describe. In this case, \"zoom\" is an example of onomatopoeia because it echoes the sound associated with rapid movement or acceleration, like the sound a vehicle makes.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2215",
    "text": "\"The sun used to smile in my hut\".\n\nThe line is an example of",
    "options": {
      "A": "Apostrophe",
      "B": "personification",
      "C": "Rhetorical Question",
      "D": "Zeugma"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67709?exam_type=jamb&type=obj&page=443",
    "correct_answer": "B",
    "explanation": "The line 'The sun used to smile in my hut' is an example of 'Personification'. Personification is a figure of speech in which a thing, an idea or an animal is given human attributes. The non-human objects are portrayed in such a way that we feel they have the ability to act like human beings. In this case, the sun is given the human attribute of smiling. The other options do not fit the context of the question. 'Rhetorical Question' is a question asked in order to create a dramatic effect or to make a point rather than to get an answer. 'Zeugma' is a figure of speech in which a word applies to two others in different senses. 'Apostrophe' is a figure of speech in which the speaker directly addresses an absent or imaginary person, or some abstraction.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2216",
    "text": "The use of two contrasting words that are placed side by side is called",
    "options": {
      "A": "oxymoron",
      "B": "euphemism",
      "C": "pun",
      "D": "antithesis"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67711?exam_type=jamb&type=obj&page=444",
    "correct_answer": "A",
    "explanation": "Oxymoron is a rhetorical term that describes words or phrases that, when placed together, create paradoxes or contradictions. These contradictions seem foolish but, when we think about them a bit, often turn out to be sharp observations about our world.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2217",
    "text": "The combination of two or more metaphors is called",
    "options": {
      "A": "Monometaphor",
      "B": "Dymetaphor",
      "C": "Mixed metaphor",
      "D": "Combined metaphor"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67712?exam_type=jamb&type=obj&page=444",
    "correct_answer": "C",
    "explanation": "The combination of two or more unrelated and sometimes conflicting metaphors in a single expression is called a mixed metaphor. The metaphors are 'mixed' in the sense that they are incongruous or illogical when combined. Therefore, the correct answer is 'Mixed metaphor'.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2218",
    "text": "________ are generally regarded as brief but purposeful references, within a literary text, to a person, place, event, or to another work of literature.",
    "options": {
      "A": "Referrals",
      "B": "Chiasmus",
      "C": "Metonymy",
      "D": "Allusions"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67716?exam_type=jamb&type=obj&page=444",
    "correct_answer": "D",
    "explanation": "Allusions are used as stylistic devices to help contextualize a story by referencing a well-known person, place, event, or another literary work. These references do not have to be explicitly explained; more often than not, writers choose to let readers fill in the blanks.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2219",
    "text": "An action in a play that stimulates the audience to pity a character is",
    "options": {
      "A": "props",
      "B": "parody",
      "C": "pyrrhic",
      "D": "pathos"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67717?exam_type=jamb&type=obj&page=444",
    "correct_answer": "D",
    "explanation": "Pathos, or the appeal to emotion, means to persuade an audience by purposely evoking certain emotions to make them feel the way the author wants them to feel. Authors make deliberate word choices, use meaningful language, and use examples and stories that evoke emotion.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2220",
    "text": "This question is based on BAT.\n\nUse the excerpt to answer this question.\n\"Where light pushes through;\nA sudden turning upon itself of a thing in the air.\nA dip to the water.\nAnd you think:\n\"The swallows are flying so late!\"\nSwallows?\"\n\nThe dominant poetic device in the excerpt is___",
    "options": {
      "A": "Rhetorical question",
      "B": "imagery",
      "C": "Alliteration",
      "D": "Paradox"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67721?exam_type=jamb&type=obj&page=444",
    "correct_answer": "B",
    "explanation": "The dominant poetic device in the excerpt is imagery. Imagery is a literary device that uses descriptive language to create mental images and stimulate the senses. In this excerpt, the poet uses imagery to describe the scene of the bat flying and dipping to the water.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2221",
    "text": "When an object is invested with a meaning beyond its immediate reference, it becomes",
    "options": {
      "A": "a symbol",
      "B": "an irony",
      "C": "a subject",
      "D": "an epigram"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67723?exam_type=jamb&type=obj&page=445",
    "correct_answer": "A",
    "explanation": "In literature, a 'symbol' is an object, person, or situation that has another meaning other than its literal meaning. The metaphoric or figurative meaning is deeper and represents something significant. Therefore, when an object is invested with a meaning beyond its immediate reference, it becomes a symbol.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2222",
    "text": "A story with elements that have both literal and figurative meanings is",
    "options": {
      "A": "allegory",
      "B": "novella",
      "C": "fable",
      "D": "epistle"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67724?exam_type=jamb&type=obj&page=445",
    "correct_answer": "A",
    "explanation": "Allegory is a narration or description in which events, actions, characters, settings or objects represent specific abstractions or ideas. Allegory generally operates on two levels as a literary device. The overt or surface narrative/description is meant to have enough literary elements to be a standalone work that is interesting and/or entertaining by itself. However, the emphasis of allegory is typically placed on the abstract ideals represented or symbolized by the work's literary elements. In other words, the meaning behind the surface narrative has even greater value as a literary work. Though many allegories are intended to be didactic in providing a moral, ethical, or religious lesson, not all allegories set out to achieve this goal.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2223",
    "text": "A tragic hero, according to the Aristotelian precept, must be a",
    "options": {
      "A": "central character after whom the play is named",
      "B": "king with deep affection for his subjects",
      "C": "noble character with hubris",
      "D": "lowly character who suddenly stumbles on some fortunes"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67726?exam_type=jamb&type=obj&page=445",
    "correct_answer": "C",
    "explanation": "Aristotle holds that a tragic hero should be a noble character with hubris. A tragic hero often falls because of his unrepentant nature and being proud.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2224",
    "text": "This question is based on RAIDER OF THE TREASURE TROVE.\n\nThe poetic device in the expression \"Rage is chief\" is ___",
    "options": {
      "A": "oxymoron",
      "B": "simile",
      "C": "metaphor",
      "D": "hyperbole"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67728?exam_type=jamb&type=obj&page=445",
    "correct_answer": "C",
    "explanation": "The phrase 'Rage is chief' is an example of a metaphor. A metaphor is a figure of speech that makes a comparison between two things that are basically dissimilar but have something in common. In this case, 'rage' is being compared to a 'chief', implying that rage is dominant or in control.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2225",
    "text": "*For seven days it rained that June;\nA storm half out to sea kept turning around like a dog trying to settle himself on a rug; We were the fleas that\ncomplained in his hair.\nJohn Updike, Wash\n\nThe image set in the lines above are of",
    "options": {
      "A": "rain and flood in June",
      "B": "discomfort and likely destruction",
      "C": "the days of Noah",
      "D": "an animal insects and fun"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67730?exam_type=jamb&type=obj&page=445",
    "correct_answer": "B",
    "explanation": "The dominant image painted by the words is that of discomfort, that is, the incessant rain is one that is not welcome because it can instigate destruction.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2226",
    "text": "The overwhelming pride that destroys the tragic hero is called",
    "options": {
      "A": "nemesis",
      "B": "catharsis",
      "C": "hubris",
      "D": "tragedy"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67732?exam_type=jamb&type=obj&page=446",
    "correct_answer": "C",
    "explanation": "Hubris is the uncontrollable pride that causes the downfall of a hero. An action of the past (nemesis), or tragedy as a drama form, or catharsis (powerful or violent emotional development), are not synonymous with pride inherent of tragic flaws.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2227",
    "text": "'Fierce harmattan sun on innocent tendrils; torrential downpour on leaking thatch roofs; painful comfort of helpless eunuchs; thorny beauty of modern witches; the falcon's call on day-old-chicks, ours is a tragicomic dialogue:... mute echoes of pains' .\n\nThe sonority and rhythmical structure of the lines above are achieved through a pause- pattern called",
    "options": {
      "A": "scansion",
      "B": "enjambment",
      "C": "caesura",
      "D": "apostrophe"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67734?exam_type=jamb&type=obj&page=446",
    "correct_answer": "C",
    "explanation": "This is a pause-pattern for enhancing movement from one major idea to another or from one major point to another.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2228",
    "text": "This question is based on BLACK WOMAN.\n\n\"fruit with firm flesh\" illustrates the use of ____",
    "options": {
      "A": "onomatopoeia",
      "B": "consonance",
      "C": "assonance",
      "D": "alliteration"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67735?exam_type=jamb&type=obj&page=446",
    "correct_answer": "D",
    "explanation": "The phrase 'fruit with firm flesh' is an example of alliteration. Alliteration is a literary device where the first consonant sounds in several closely connected words are the same.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2229",
    "text": "'Senhor Jose got cold during the night. After having uttered those redundant useless words, here she is, he wasn't sure what else he should do. It was true that, after long and arduous labours, he had managed, at last, to find the unknown woman, or rather, the place where she lay, a good six feet beneath an earth that still sustained him' \nJose Saramago: All the Names\n\nWhat happens to the unknown woman in the passage above?",
    "options": {
      "A": "She falls asleep",
      "B": "She is dead",
      "C": "She is awake",
      "D": "She runs away"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67737?exam_type=jamb&type=obj&page=446",
    "correct_answer": "B",
    "explanation": "The passage implies that the unknown woman is dead. The phrase 'the place where she lay, a good six feet beneath an earth that still sustained him' is a common euphemism for being buried, which typically implies death. Therefore, the unknown woman is dead, not awake, asleep, or has run away.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2230",
    "text": "This question is based on THE GOOD MORROW.\nUse this excerpt to answer question\n\n\"If ever any beauty I did see,\nWhich I desired, and got, 'twas but a dream of thee.\"\n\nThe excerpt above evokes the use of ____",
    "options": {
      "A": "Olfactory imagery",
      "B": "Tactile",
      "C": "Auditory imagery",
      "D": "Visual imagery"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67738?exam_type=jamb&type=obj&page=446",
    "correct_answer": "D",
    "explanation": "The excerpt uses visual imagery. Imagery is a literary device that uses descriptive language to create mental images and stimulate the senses. In this case, the speaker is creating a visual image of the beauty he has seen and desired, which is a 'dream' of the person he is addressing.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2231",
    "text": "The moment of recognition of truth when ignorance gives way to knowledge is known as",
    "options": {
      "A": "Anamnesis",
      "B": "Anagnorisis",
      "C": "Hamartia",
      "D": "Hubris"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67739?exam_type=jamb&type=obj&page=447",
    "correct_answer": "B",
    "explanation": "Anagnorisis is a moment in a play or other work when a character makes a critical discovery. It originally meant recognition in its Greek context, not only of a person but also of what that person stood for. It is the transition from ignorance to knowledge.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2232",
    "text": "A long story narrating a series of complicated events is called a",
    "options": {
      "A": "harrangue",
      "B": "discourse",
      "C": "monologue",
      "D": "saga"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67740?exam_type=jamb&type=obj&page=447",
    "correct_answer": "D",
    "explanation": "A saga is a long story, often a narrative, that recounts the deeds and adventures of heroic or legendary figures or the history of a nation. It is a term used in literature to describe a long narrative, often in prose, that tells of the adventures and heroic exploits of a group of characters. The other options do not fit the definition of a long story narrating a series of complicated events.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2233",
    "text": "This question is based on A GOVERNMENT DRIVER ON HIS RETIREMENT.\n\n\"Many years on wheels\" The reference to \"wheels\" exemplifies the use of ___ in the poem.",
    "options": {
      "A": "climax",
      "B": "personification",
      "C": "metonymy",
      "D": "synecdoche"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67741?exam_type=jamb&type=obj&page=447",
    "correct_answer": "D",
    "explanation": "Synecdoche is a figure of speech in which a part of something is used to represent the whole, or vice versa. This is because the term \"wheels\" is used to represent the entire vehicle. The wheels are a part of the car, and by using \"wheels,\" the speaker is referring to the broader experience of driving and spending time in a car.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2234",
    "text": "A novel that features spiritual apparitions as major character is",
    "options": {
      "A": "Epistolary",
      "B": "Historical",
      "C": "Sociological",
      "D": "Gothic"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/67742?exam_type=jamb&type=obj&page=447",
    "correct_answer": "D",
    "explanation": "Much of Gothic literature's allure comes from the genre's suggestion of supernatural or inexplicable events, such as inanimate objects coming to life, ghosts, spirits, and vampires. An epistolary is a novel written in form of a letter. An historial novel retells history while a sociological novel relates with issues that affect our society\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2235",
    "text": "This question is based on SECOND CLASS CITIZEN.\nThe novel is set after which major war?",
    "options": {
      "A": "First World War (1914-1918)",
      "B": "Aba Women Riot (1929)",
      "C": "Second World War (1939-1945)",
      "D": "The Nigerian Civil War (1967-1970)"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68588?exam_type=jamb&type=obj&page=447",
    "correct_answer": "C",
    "explanation": "The novel 'Second Class Citizen' is set after the Second World War (1939-1945). The aftermath of the war had a significant impact on the socio-economic conditions of the time, which is reflected in the novel.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2236",
    "text": "This question is based on LOOK BACK IN ANGER.\nWhat were the other businesses Jimmy porter had tried apart from the sweet stall business?",
    "options": {
      "A": "farming, teaching and advertising",
      "B": "Teaching, painting and trumpeting",
      "C": "Journalism, faming and teaching.",
      "D": "Journalism, advertising, and vacuum cleaning"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68589?exam_type=jamb&type=obj&page=448",
    "correct_answer": "D",
    "explanation": "In the play 'Look Back in Anger', Jimmy Porter had tried several businesses apart from the sweet stall business. These include journalism, advertising, and vacuum cleaning. Therefore, the correct answer is option 1.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2237",
    "text": "This question is based on THE LION AND THE JEWEL.\nThe use of language in the play is written in both___ and ___ forms.",
    "options": {
      "A": "vague and prosaic.",
      "B": "prosaic and poetic.",
      "C": "archaic and vague.",
      "D": "ambiguous and lyrical"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68590?exam_type=jamb&type=obj&page=448",
    "correct_answer": "B",
    "explanation": "The use of language in 'The Lion and the Jewel' is written in both prosaic and poetic forms. Prosaic language is straightforward and factual, while poetic language is more expressive and uses figurative language. The play uses both to convey its themes and messages.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2238",
    "text": "This question is based on UNEXPECTED JOY AT DAWN.\nWhich of these characters is at the center of the impact of the xenophobic attack in the novel?",
    "options": {
      "A": "Nii Tackie",
      "B": "Ezla",
      "C": "Massa",
      "D": "Aaron Tsuru"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68591?exam_type=jamb&type=obj&page=448",
    "correct_answer": "A",
    "explanation": "In the novel 'Unexpected Joy at Dawn', the character at the center of the impact of the xenophobic attack is Nii Tackie. He experiences firsthand the hostility and violence of the xenophobic attacks, which significantly affects his life and the course of the story.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2239",
    "text": "This question is based on THE LION AND THE JEWEL.\nSidi insisted on the payment of her bride-price because it indicates that she_____",
    "options": {
      "A": "is a virgin",
      "B": "has a wealthy family",
      "C": "is of marriageable age",
      "D": "is free from her family"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68592?exam_type=jamb&type=obj&page=448",
    "correct_answer": "A",
    "explanation": "Sidi's insistence on the payment of her bride price is linked to the traditional significance attached to the bride price in many African cultures. The payment of the bride price is a customary practice that symbolizes various things, one of which is the virginity of the bride.\nSidi, in Act 1 of the play, reminds Lakunle that she'd be happy to marry him any day, provided he pays the bride price for her. When Lakunle doesn't agree with this, she asks him if he wants the village to think she wasn't a virgin and had to shamefully marry him without a price. By emphasizing the importance of the bride price and ensuring that it is paid before marriage, Sidi is asserting her purity and honour. In traditional societies, the payment of the bride price is often seen as a way to validate the virginity and purity of the bride, ensuring that she enters into marriage with her honour intact.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2240",
    "text": "This question is based on THE LION AND THE JEWEL.\nIn the play, the jewel of Ilujinle is____",
    "options": {
      "A": "Sadiku",
      "B": "Baroka",
      "C": "Lakunle",
      "D": "Sidi"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68593?exam_type=jamb&type=obj&page=448",
    "correct_answer": "D",
    "explanation": "In the play 'The Lion and the Jewel' by Wole Soyinka, the 'jewel' of Ilujinle is Sidi. She is a beautiful woman who is the object of desire for both the village chief (the 'Lion') and the schoolteacher, Lakunle.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2241",
    "text": "This question is based on UNEXPECTED JOY AT DAWN.\nHow did Mama Orojo meet Tom Monday.",
    "options": {
      "A": "she met him on her trip to Ghana",
      "B": "she met him on an evangelism trip",
      "C": "she met him during the religious riot",
      "D": "she met him at the restaurant"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68594?exam_type=jamb&type=obj&page=449",
    "correct_answer": "B",
    "explanation": "In the novel 'Unexpected Joy at Dawn', Mama Orojo meets Tom Monday on an evangelism trip. This meeting is significant as it leads to a deep and meaningful relationship between the two characters.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2242",
    "text": "This question is based on LOOK BACK IN ANGER.\nWho was the first-person Alison informed about her pregnancy?",
    "options": {
      "A": "her parents",
      "B": "Jimmy",
      "C": "Helena",
      "D": "Cliff"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68595?exam_type=jamb&type=obj&page=449",
    "correct_answer": "D",
    "explanation": "In the play 'Look Back in Anger', Alison first informs Cliff about her pregnancy. She reveals this to him in Act 1 of the play after she gets burned by the iron during a rough play between Jimmy and Cliff. She had ordered Jimmy to get out of the house. As Cliff was treating her wound, she reveals this to him.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2243",
    "text": "PROSE: AFRICAN: UNEXPECTED JOY AT DAWN\n\nWhat distinguishes Nii Tackie from every other Ghanaian?",
    "options": {
      "A": "His accent",
      "B": "His face",
      "C": "His tribal mark",
      "D": "His skin"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68596?exam_type=jamb&type=obj&page=449",
    "correct_answer": "C",
    "explanation": "Nii Tackie was born and bred in Ghana. He's given a Ghanaian name, particularly of Ga origin. He has lived his all his life in Ghana. He is like every other Ghanaian but what distinguish him from every other Ghanaian are his tribal marks. Nothing can change that; not even his Ghanaian accent and mannerisms.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2244",
    "text": "This question is based on WUTHERING HEIGHT.\nWhat gift did Mr. Earnshaw promise to bring Nelly Dean from Liverpool?",
    "options": {
      "A": "A bridle for her horse",
      "B": "A fiddle",
      "C": "Fruit",
      "D": "A set of paints"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68597?exam_type=jamb&type=obj&page=449",
    "correct_answer": "C",
    "explanation": "Mr Earnshaw asked the children what they wanted when he was going on a journey, Hindley requested a fiddle, Miss Cathy, a horsewhip. Nelly is the Earnshaws' servant but he does not forget her. He promises to get her apples and pears(fruits).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2245",
    "text": "This question is based on SECOND CLASS CITIZEN.\nWho is Mr Cole?",
    "options": {
      "A": "a black tenant at the first apartment at England",
      "B": "Adah's colleague at the Consulate",
      "C": "Adah's nephew she's forced to live with after Pa's death",
      "D": "Adah's elementary school teacher"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68598?exam_type=jamb&type=obj&page=449",
    "correct_answer": "D",
    "explanation": "In the novel SECOND CLASS CITIZEN, Mr Cole is Adah's elementary teacher. He is a teacher at the local Methodist School. It is his class that Adah searches for when she enters the school compound. When she enters the class, Mr Cole welcomes her with a reassuring smile. He is described as a handsome and huge person. After school, he takes her back home.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2246",
    "text": "This question is based on THE LION AND THE JEWEL.\nThe opening act in the plays takes place at______",
    "options": {
      "A": "the village market",
      "B": "the roadside to the farm",
      "C": "the baale's room",
      "D": "by the village stream"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68599?exam_type=jamb&type=obj&page=450",
    "correct_answer": "A",
    "explanation": "The opening act of the play 'The Lion and the Jewel' takes place at the village market by a large 'odan' tree at the centre of Ilujinle village. This is where Sidi is seen carrying a pail of water on her head, and Lakunle, who is in love with her, approaches her with his modern ideas.",
    "year": "2023"
  },
  {
    "number": "2247",
    "text": "This question is based on WUTHERING HEIGHT.\nWhich of the following characters dies last?",
    "options": {
      "A": "Catherine",
      "B": "Heathcliff",
      "C": "Linton",
      "D": "Mr. Linton"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68600?exam_type=jamb&type=obj&page=450",
    "correct_answer": "B",
    "explanation": "Heathcliff is the last major character to die in the novel. Catherine, Edgar Linton and Linton Heathcliff all die before him. His death occurs towards the end of the story and marks the conclusion of the narrative.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2248",
    "text": "This question is based on THE LION AND THE JEWEL.\nWhich character may be an allegory of Nigeria itself?",
    "options": {
      "A": "Baroka",
      "B": "Sadiku",
      "C": "lakunle",
      "D": "Sidi"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68601?exam_type=jamb&type=obj&page=450",
    "correct_answer": "A",
    "explanation": "In the play 'The Lion and the Jewel', Baroka may be seen as an allegory of Nigeria itself. He represents the traditional values and customs of Nigeria, and his struggle with Lakunle over Sidi can be seen as a metaphor for the struggle between tradition and modernity in Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2249",
    "text": "This question is based on WUTHERING HEIGHT.\nWhat destination does the young Catherine have in mind when she leaves Thrushcross Grange for the first time?",
    "options": {
      "A": "Wuthering Heights",
      "B": "The nearby village",
      "C": "The fairy caves at Penistone Crags",
      "D": "London, where her cousin Linton lives"
    },
    "answer_url": "https://myschool.ng/classroom/literature-in-english/68602?exam_type=jamb&type=obj&page=450",
    "correct_answer": "C",
    "explanation": "In the novel, when young Catherine leaves Thrushcross Grange for the first time, she has the fairy caves at Penistone Crags as her destination. Penistone Crags is a rocky outcrop that is supposed to be near Wuthering Heights.\nThere is an explanation video availablebelow.",
    "year": "2023"
  }
]