[
  {
    "number": "418",
    "text": "What is the primary purpose of farm surveying in agriculture?",
    "options": {
      "A": "Mapping land boundaries",
      "B": "Determining soil fertility",
      "C": "Assessing crop yield",
      "D": "Identifying pest infestations"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67869?exam_type=jamb&type=obj&page=84",
    "correct_answer": "A",
    "explanation": "The primary purpose of farm surveying in agriculture is to accurately map the land boundaries of a farm. Farm surveying involves the measurement and mapping of land to establish property lines, determine field sizes and shapes, and demarcate boundaries between different land parcels.",
    "year": "2023"
  },
  {
    "number": "419",
    "text": "Which of the following is an example of a farm implement used for soil preparation in agriculture?",
    "options": {
      "A": "Seeder",
      "B": "Sprayer",
      "C": "Harvester",
      "D": "Plow"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67870?exam_type=jamb&type=obj&page=84",
    "correct_answer": "D",
    "explanation": "A plow is an example of a farm implement used for soil preparation in agriculture. A plow is a tool or implement that is pulled or attached to a tractor or draft animals and is used to break up, loosen, and turn over the soil. It helps in preparing the soil for planting crops by creating furrows or ridges and incorporating organic matter or fertilizer into the soil.",
    "year": "2023"
  },
  {
    "number": "420",
    "text": "What is the importance of agriculture?",
    "options": {
      "A": "Agriculture has no significant impact on the economy or global trade",
      "B": "Agriculture is essential for food production and food security",
      "C": "Agriculture provides employment opportunities only in rural areas",
      "D": "Agriculture is primarily focused on the production of cash crops for export"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67871?exam_type=jamb&type=obj&page=84",
    "correct_answer": "B",
    "explanation": "Agriculture plays a crucial role in providing food for the growing global population and ensuring food security. It involves the cultivation of crops, rearing of livestock, and production of food products.",
    "year": "2023"
  },
  {
    "number": "421",
    "text": "What is rock weathering and how does it affect agriculture?",
    "options": {
      "A": "Rock weathering is the process of rocks eroding and washing away from agricultural fields",
      "B": "Rock weathering is the process of breaking down rocks into smaller fragments",
      "C": "Rock weathering is the process of rocks decomposing and releasing nutrients into the soil",
      "D": "Rock weathering is the process of rocks absorbing water and expanding in size"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67872?exam_type=jamb&type=obj&page=85",
    "correct_answer": "B",
    "explanation": "Rock weathering refers to the natural process by which rocks are broken down into smaller fragments over time. This process is influenced by various factors such as temperature, moisture, wind, and the presence of organisms. There are different types of rock weathering, including physical weathering, chemical weathering, and biological weathering.",
    "year": "2023"
  },
  {
    "number": "422",
    "text": "What are biotic factors in an agricultural ecosystem?",
    "options": {
      "A": "Factors related to the climate and weather",
      "B": "Factors related to the living organisms",
      "C": "Factors related to the physical environment",
      "D": "Factors related to the availability of nutrients"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67873?exam_type=jamb&type=obj&page=85",
    "correct_answer": "B",
    "explanation": "Biotic factors in an agricultural ecosystem refer to the living organisms that influence the ecosystem dynamics and processes. These organisms can directly or indirectly impact agricultural productivity and sustainability.",
    "year": "2023"
  },
  {
    "number": "423",
    "text": "What is the process of removing the horns of cattle called?",
    "options": {
      "A": "Mating",
      "B": "Dipping",
      "C": "Dehorning",
      "D": "Castration"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67874?exam_type=jamb&type=obj&page=85",
    "correct_answer": "C",
    "explanation": "Dehorning is the process of removing the horns of livestock. Cattle, sheep, and goats are sometimes dehorned for economic and safety reasons.",
    "year": "2023"
  },
  {
    "number": "424",
    "text": "What is crop science?",
    "options": {
      "A": "The study of agricultural machinery and equipment",
      "B": "The study of weather patterns and their impact on crop growth",
      "C": "The study of soil fertility and nutrient management",
      "D": "The study of plant genetics and breeding"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67875?exam_type=jamb&type=obj&page=85",
    "correct_answer": "D",
    "explanation": "Crop science is the branch of agriculture that focuses on the scientific study of crops, particularly their genetics, breeding, and improvement. It involves the application of scientific principles and techniques to enhance the productivity, quality, and resilience of crop plants.",
    "year": "2023"
  },
  {
    "number": "425",
    "text": "What are abiotic factors in an agricultural ecosystem?",
    "options": {
      "A": "Factors related to the living organisms",
      "B": "Factors related to the availability of nutrients",
      "C": "Factors related to the climate and weather",
      "D": "Factors related to the physical environment"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67876?exam_type=jamb&type=obj&page=85",
    "correct_answer": "D",
    "explanation": "Abiotic factors in an agricultural ecosystem are the non-living components of the environment that influence the ecosystem and agricultural productivity.",
    "year": "2023"
  },
  {
    "number": "426",
    "text": "The N'dama breed of cattle is primarily raised for",
    "options": {
      "A": "Fiber production",
      "B": "Meat production",
      "C": "Milk production",
      "D": "Draft power"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67878?exam_type=jamb&type=obj&page=86",
    "correct_answer": "B",
    "explanation": "The N'dama breed of cattle is primarily raised for meat production. N'dama is a breed of cattle indigenous to Africa, and it is well known for its resistance to trypanosomiasis or sleeping sickness. While they can be used for milk production, their primary use is for meat production.",
    "year": "2023"
  },
  {
    "number": "427",
    "text": "Which breed of sheep is commonly found in Nigeria and known for its meat production?",
    "options": {
      "A": "West African Dwarf",
      "B": "Barbados Blackbelly",
      "C": "Uda",
      "D": "Dorper"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67879?exam_type=jamb&type=obj&page=86",
    "correct_answer": "A",
    "explanation": "The breed of sheep commonly found in Nigeria and known for its meat production is the West African Dwarf. This breed is small but has a high resistance to trypanosomiasis and other diseases, making it ideal for meat production in the region.",
    "year": "2023"
  },
  {
    "number": "428",
    "text": "Which of the following is a hand tool commonly used in agriculture for cutting grass or crops?",
    "options": {
      "A": "Harrow",
      "B": "Plow",
      "C": "Scythe",
      "D": "Seeder"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67880?exam_type=jamb&type=obj&page=86",
    "correct_answer": "C",
    "explanation": "A scythe is a hand tool commonly used in agriculture for cutting grass or crops. It consists of a long, curved blade attached to a handle, and it is used by swinging the blade in a rhythmic motion to cut vegetation close to the ground.",
    "year": "2023"
  },
  {
    "number": "429",
    "text": "What are the important properties of soil in agriculture?",
    "options": {
      "A": "pH, organic matter content, and water-holding capacity",
      "B": "Drainage, cation exchange capacity, and soil depth.",
      "C": "All of the above",
      "D": "Texture, structure, and fertility"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67881?exam_type=jamb&type=obj&page=86",
    "correct_answer": "C",
    "explanation": "Soil properties play a critical role in agricultural practices and the successful cultivation of crops.",
    "year": "2023"
  },
  {
    "number": "430",
    "text": "Which of the following is NOT a principle of agronomy?",
    "options": {
      "A": "Controlling pests and diseases",
      "B": "Managing soil fertility",
      "C": "Promoting biodiversity conservation",
      "D": "Maximizing crop yield"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67882?exam_type=jamb&type=obj&page=86",
    "correct_answer": "C",
    "explanation": "Agronomy is a branch of agricultural science that focuses on crop production and soil management. It involves the application of scientific principles and techniques to maximize crop yield and ensure sustainable agricultural practices.",
    "year": "2023"
  },
  {
    "number": "431",
    "text": "Which of the following is an objective of agricultural development programs?",
    "options": {
      "A": "Maximizing profits for individual farmers",
      "B": "Increasing dependency on external inputs",
      "C": "Enhancing sustainable agricultural practices",
      "D": "Expanding land holdings for large-scale farms"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67884?exam_type=jamb&type=obj&page=87",
    "correct_answer": "C",
    "explanation": "One of the primary objectives of agricultural development programs is to enhance sustainable agricultural practices. These programs aim to promote environmentally friendly and socially responsible farming methods that conserve natural resources, minimize negative impacts on ecosystems, and ensure long-term agricultural productivity.",
    "year": "2023"
  },
  {
    "number": "432",
    "text": "What is agronomy?",
    "options": {
      "A": "The study of crop production and soil management",
      "B": "The study of animal breeding and genetics",
      "C": "The study of agricultural machinery and equipment",
      "D": "The study of plant diseases and pest control"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67885?exam_type=jamb&type=obj&page=87",
    "correct_answer": "A",
    "explanation": "Agronomy is a branch of agriculture that focuses on the science and technology of crop production and soil management. It involves the study of various aspects related to the growth, development, and management of agricultural crops.",
    "year": "2023"
  },
  {
    "number": "433",
    "text": "Which of the following is NOT a component of agronomy?",
    "options": {
      "A": "Pest management",
      "B": "Crop production",
      "C": "Soil management",
      "D": "Animal husbandry"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67886?exam_type=jamb&type=obj&page=87",
    "correct_answer": "D",
    "explanation": "Agronomy is a branch of agriculture that focuses on crop production and the management of agricultural systems. It involves various aspects related to growing and cultivating crops. The main components of agronomy include crop production, soil management, and pest management.",
    "year": "2023"
  },
  {
    "number": "434",
    "text": "Which of the following is an example of agricultural technology?",
    "options": {
      "A": "Crop rotation",
      "B": "Irrigation",
      "C": "Organic farming",
      "D": "Composting"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67887?exam_type=jamb&type=obj&page=87",
    "correct_answer": "B",
    "explanation": "Irrigation is an example of agricultural technology. It involves the artificial application of water to agricultural fields to supplement natural rainfall. Irrigation systems can range from simple methods like surface irrigation to more advanced techniques like drip irrigation or sprinkler systems.",
    "year": "2023"
  },
  {
    "number": "435",
    "text": "Which of the following is NOT an agent of pollination in plants?",
    "options": {
      "A": "Bees",
      "B": "Wind",
      "C": "Water",
      "D": "Fungi"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67888?exam_type=jamb&type=obj&page=87",
    "correct_answer": "D",
    "explanation": "Pollination is the process by which pollen grains are transferred from the male reproductive organs to the female reproductive organs of a plant, enabling fertilization and seed production. Various agents can facilitate pollination, including animals, wind, and water.",
    "year": "2023"
  },
  {
    "number": "436",
    "text": "Which of the following is an example of a biotic factor in an agricultural ecosystem?",
    "options": {
      "A": "Rainfall",
      "B": "Soil pH",
      "C": "Temperature",
      "D": "Crop pests"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67889?exam_type=jamb&type=obj&page=88",
    "correct_answer": "D",
    "explanation": "Biotic factors in an agricultural ecosystem refer to the living organisms or biological components that influence the dynamics of the ecosystem. These factors can include plants, animals, microorganisms, and other living organisms that interact with agricultural crops. Crop pests, such as insects, rodents, and pathogens, are examples of biotic factors that can have a significant impact on agricultural systems.",
    "year": "2023"
  },
  {
    "number": "437",
    "text": "What factors influence soil fertility in agriculture?",
    "options": {
      "A": "pH and soil structure",
      "B": "Organic matter content and nutrient availability",
      "C": "Soil texture and drainage",
      "D": "All of the above"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67890?exam_type=jamb&type=obj&page=88",
    "correct_answer": "D",
    "explanation": "Soil fertility is influenced by a variety of factors including organic matter content, nutrient availability, pH, soil structure, soil texture, and drainage. Organic matter content and nutrient availability provide the necessary nutrients for plant growth. pH affects the availability of nutrients in the soil. Soil structure affects the soil's ability to hold and supply water, air, and nutrients to plants. Soil texture affects the soil's physical properties and its ability to hold and supply water, air, and nutrients to plants. Drainage affects the soil's ability to supply sufficient water to plants without waterlogging the roots.",
    "year": "2023"
  },
  {
    "number": "438",
    "text": "Which of the following is an example of a monogastric animal?",
    "options": {
      "A": "Goat",
      "B": "Cow",
      "C": "Chicken",
      "D": "Sheep"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67891?exam_type=jamb&type=obj&page=88",
    "correct_answer": "C",
    "explanation": "A monogastric is an animal with a single-compartmented stomach. Examples of monogastrics include humans, poultry, pigs, horses, rabbits, dogs and cats. Most monogastrics are generally unable to digest much cellulose food materials such as grasses.",
    "year": "2023"
  },
  {
    "number": "439",
    "text": "The Sokoto Gudali is a breed of",
    "options": {
      "A": "Chicken",
      "B": "Cattle",
      "C": "Horse",
      "D": "Goat"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67892?exam_type=jamb&type=obj&page=88",
    "correct_answer": "B",
    "explanation": "The Sokoto Gudali is a breed of cattle. It is one of the largest breeds of cattle in Nigeria and is used for both milk and meat production",
    "year": "2023"
  },
  {
    "number": "440",
    "text": "Which of the following is a method of plant propagation that involves the use of plant parts?",
    "options": {
      "A": "Seed propagation",
      "B": "Tissue culture",
      "C": "Layering",
      "D": "Grafting"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67894?exam_type=jamb&type=obj&page=88",
    "correct_answer": "D",
    "explanation": "Grafting is a method of plant propagation that involves the use of plant parts. It is a horticultural technique whereby tissues of plants are joined so as to continue their growth together. The upper part of the combined plant is called the scion while the lower part is called the rootstock. The success of this joining requires that the vascular tissues grow together and such joining is called inosculation.",
    "year": "2023"
  },
  {
    "number": "441",
    "text": "Which of the following is not a branch of agriculture?",
    "options": {
      "A": "Horticulture",
      "B": "Forestry",
      "C": "Agronomy",
      "D": "Zoology"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67895?exam_type=jamb&type=obj&page=89",
    "correct_answer": "D",
    "explanation": "Zoology is the branch of biology that deals with the study of animals, their behavior, physiology, classification, and distribution. While the study of animals is important in understanding their interactions with agricultural systems, it is not considered a direct branch of agriculture.",
    "year": "2023"
  },
  {
    "number": "442",
    "text": "The Balami is a breed of",
    "options": {
      "A": "Pig",
      "B": "Sheep",
      "C": "Goat",
      "D": "Cattle"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67896?exam_type=jamb&type=obj&page=89",
    "correct_answer": "B",
    "explanation": "The Balami is a breed of sheep. It is one of the domestic sheep found in Africa, particularly in Nigeria. Therefore, the correct answer is 'Sheep'.",
    "year": "2023"
  },
  {
    "number": "443",
    "text": "What are the main components of soil?",
    "options": {
      "A": "Water, nutrients, and microorganisms",
      "B": "Organic matter, minerals, and air",
      "C": "Sand, silt, and clay",
      "D": "All of the above"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67897?exam_type=jamb&type=obj&page=89",
    "correct_answer": "D",
    "explanation": "Soil is a complex mixture of different components that collectively contribute to its properties and fertility. The main components of soil include sand, silt, clay, organic matter, minerals, water, nutrients, and microorganisms.",
    "year": "2023"
  },
  {
    "number": "444",
    "text": "Which of the following is a common problem in agricultural economics and extension?",
    "options": {
      "A": "Inadequate market infrastructure",
      "B": "Excessive government regulations",
      "C": "Overreliance on chemical inputs",
      "D": "Lack of access to modern technology"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67898?exam_type=jamb&type=obj&page=89",
    "correct_answer": "D",
    "explanation": "Agricultural economics and extension deal with the application of economic methods to optimizing the decisions made by agricultural producers. A common problem in this field is the lack of access to modern technology. This can hinder the efficiency and productivity of agricultural practices. Excessive government regulations, overreliance on chemical inputs, and inadequate market infrastructure can also be challenges in agriculture, but they are not specific to agricultural economics and extension.",
    "year": "2023"
  },
  {
    "number": "445",
    "text": "Which of the following best describes agricultural marketing?",
    "options": {
      "A": "The process of producing agricultural goods",
      "B": "The transportation of agricultural products to consumers",
      "C": "The storage and preservation of agricultural goods",
      "D": "The promotion and selling of agricultural products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67899?exam_type=jamb&type=obj&page=89",
    "correct_answer": "D",
    "explanation": "Agricultural marketing refers to the activities involved in the promotion and selling of agricultural products. It encompasses various processes, such as market research, product promotion, pricing, distribution, and sales.",
    "year": "2023"
  },
  {
    "number": "446",
    "text": "What is subsistence agriculture?",
    "options": {
      "A": "Export-oriented agricultural production",
      "B": "Intensive farming using advanced technology",
      "C": "Farming for self-sufficiency and survival",
      "D": "Large-scale commercial farming"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67900?exam_type=jamb&type=obj&page=90",
    "correct_answer": "C",
    "explanation": "Subsistence agriculture refers to a type of farming where the primary purpose is to meet the food and basic needs of a family or community. It is characterized by small-scale farming practices with limited use of modern technology and resources. The produce from subsistence agriculture is primarily consumed by the farmer and their family, with little or no surplus for sale.",
    "year": "2023"
  },
  {
    "number": "447",
    "text": "What is soil conservation, and why is it important in agriculture?",
    "options": {
      "A": "Soil conservation involves the removal of topsoil for agricultural purposes",
      "B": "Soil conservation refers to the preservation and sustainable management of soil resources",
      "C": "Soil conservation aims to maximize crop yields through intensive farming practices",
      "D": "Soil conservation focuses on increasing soil fertility through the use of chemical fertilizers"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67901?exam_type=jamb&type=obj&page=90",
    "correct_answer": "B",
    "explanation": "Soil conservation is the practice of protecting and managing the soil to prevent erosion, degradation, and loss of fertility. It involves implementing various techniques and practices to ensure the long-term sustainability and productivity of agricultural lands.",
    "year": "2023"
  },
  {
    "number": "448",
    "text": "What are the main differences between monocot and dicot plants?",
    "options": {
      "A": "Monocots have parallel leaf veins, while dicots have branched leaf veins",
      "B": "Monocots have flower parts in multiples of three, while dicots have flower parts in multiples of four or five",
      "C": "All of the above",
      "D": "Monocots have fibrous root systems, while dicots have taproot systems"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67902?exam_type=jamb&type=obj&page=90",
    "correct_answer": "C",
    "explanation": "Monocots and dicots are differentiated by several characteristics. Monocots have parallel leaf veins, while dicots have branched leaf veins. This is due to the different growth patterns of the two types of plants. Monocots have flower parts in multiples of three, while dicots have flower parts in multiples of four or five. This is due to the different evolutionary paths of the two types of plants. Monocots have fibrous root systems, while dicots have taproot systems. This is due to the different needs of the two types of plants, with monocots typically being grasses and cereals that benefit from a fibrous root system, and dicots being broad-leaved plants that benefit from a taproot system.",
    "year": "2023"
  },
  {
    "number": "449",
    "text": "What is agricultural ecology?",
    "options": {
      "A": "The study of genetics and breeding techniques used in agriculture",
      "B": "The study of climate change and its effects on agricultural productivity",
      "C": "The study of ecological processes in agricultural systems and their interactions",
      "D": "The study of agricultural practices and their economic impact on farmers"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67903?exam_type=jamb&type=obj&page=90",
    "correct_answer": "C",
    "explanation": "Agricultural ecology is a branch of science that focuses on understanding the ecological processes and interactions within agricultural systems. It involves studying the relationships between crops, livestock, pests, beneficial organisms, soil, water, and the surrounding environment.",
    "year": "2023"
  },
  {
    "number": "450",
    "text": "What is a soil profile, and what information does it provide in agricultural practices?",
    "options": {
      "A": "A soil profile is an analysis of soil microorganisms and their activities",
      "B": "A soil profile is an assessment of soil compaction and drainage",
      "C": "A soil profile is a vertical section of the soil that reveals its layers or horizons",
      "D": "A soil profile is a measurement of soil pH and nutrient levels"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67904?exam_type=jamb&type=obj&page=90",
    "correct_answer": "C",
    "explanation": "A soil profile refers to a vertical section of the soil that displays the different layers or horizons of the soil. It provides valuable information about the composition, structure, and properties of the soil, which is crucial in agricultural practices.",
    "year": "2023"
  },
  {
    "number": "451",
    "text": "What is the primary purpose of farmstead planning in agriculture?",
    "options": {
      "A": "Maximizing crop yields",
      "B": "Optimizing livestock management",
      "C": "Efficient utilization of available space",
      "D": "Ensuring efficient water usage"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67905?exam_type=jamb&type=obj&page=91",
    "correct_answer": "C",
    "explanation": "The primary purpose of farmstead planning in agriculture is to ensure the efficient utilization of available space. Farmstead planning involves designing and organizing the physical layout of the farm, including buildings, structures, roads, and other facilities, in a manner that optimizes space usage.",
    "year": "2023"
  },
  {
    "number": "452",
    "text": "What is animal production in agriculture?",
    "options": {
      "A": "The management and care of livestock for various purposes",
      "B": "The breeding and genetic improvement of animals for specific traits",
      "C": "The production of animal-based products such as milk and eggs",
      "D": "The cultivation of crops for animal consumption"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67906?exam_type=jamb&type=obj&page=91",
    "correct_answer": "A",
    "explanation": "Animal production in agriculture refers to the practice of managing and caring for livestock for various purposes.",
    "year": "2023"
  },
  {
    "number": "453",
    "text": "What is pollination in plants?",
    "options": {
      "A": "The dispersal of seeds by wind or animals",
      "B": "The transfer of pollen from the anther to the stigma of a flower",
      "C": "The process of seed formation after fertilization",
      "D": "The production of flowers by a plant"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67907?exam_type=jamb&type=obj&page=91",
    "correct_answer": "B",
    "explanation": "Pollination is the process by which pollen grains from the male reproductive organ of a flower (anther) are transferred to the female reproductive organ (stigma) of the same or a different flower.",
    "year": "2023"
  },
  {
    "number": "454",
    "text": "What is commercial agriculture?",
    "options": {
      "A": "Large-scale farming for profit and market-oriented production",
      "B": "Farming for self-sufficiency and survival",
      "C": "Small-scale farming with limited use of modern technology",
      "D": "Intensive farming using advanced technology"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67908?exam_type=jamb&type=obj&page=91",
    "correct_answer": "A",
    "explanation": "Commercial agriculture refers to farming practices that are primarily focused on generating profit through the sale of agricultural products in the market. It involves large-scale cultivation of crops or raising of livestock with the aim of maximizing productivity and economic returns.",
    "year": "2023"
  },
  {
    "number": "455",
    "text": "Which of the following is an example of an agricultural extension method used to disseminate information to farmers?",
    "options": {
      "A": "Crop rotation",
      "B": "Irrigation systems",
      "C": "Farmer field schools",
      "D": "Soil testing"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67909?exam_type=jamb&type=obj&page=91",
    "correct_answer": "C",
    "explanation": "Farmer field schools are an example of an agricultural extension method used to disseminate information to farmers. Farmer field schools are structured learning programs where farmers actively participate in hands-on training and field demonstrations.",
    "year": "2023"
  },
  {
    "number": "456",
    "text": "Which of the following are branches of agriculture?",
    "options": {
      "A": "Economics and Mathematics",
      "B": "Agronomy and Horticulture",
      "C": "Biology and Chemistry",
      "D": "Botany and Zoology"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67910?exam_type=jamb&type=obj&page=92",
    "correct_answer": "B",
    "explanation": "Agriculture is a broad field that encompasses various branches or disciplines focused on different aspects of plant and animal production. Among the given options, Agronomy and Horticulture are the branches of agriculture.",
    "year": "2023"
  },
  {
    "number": "457",
    "text": "What is the primary goal of agricultural extension services in the field of agricultural economics?",
    "options": {
      "A": "Promoting sustainable farming practices",
      "B": "Maximizing crop yields",
      "C": "Enhancing market access for farmers",
      "D": "Increasing farm profits"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67911?exam_type=jamb&type=obj&page=92",
    "correct_answer": "C",
    "explanation": "The primary goal of agricultural extension services in the field of agricultural economics is to enhance market access for farmers. Agricultural extension services provide farmers with information, training, and support to improve their understanding of market dynamics, marketing strategies, and value chain development.",
    "year": "2023"
  },
  {
    "number": "458",
    "text": "What is the primary characteristic of weeds in agriculture?",
    "options": {
      "A": "They are beneficial for crop growth",
      "B": "They compete with crops for resources",
      "C": "They are cultivated intentionally by farmers",
      "D": "They do not require any maintenance"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67933?exam_type=jamb&type=obj&page=92",
    "correct_answer": "B",
    "explanation": "The primary characteristic of weeds in agriculture is that they compete with crops for resources. Weeds are unwanted plants that grow in agricultural fields and compete with cultivated crops for sunlight, water, nutrients, and space. They can reduce crop yields by depriving crops of essential resources and sometimes release chemicals that inhibit crop growth.",
    "year": "2023"
  },
  {
    "number": "459",
    "text": "Which of the following is a potential disadvantage of agricultural extension?",
    "options": {
      "A": "Lack of access to extension services in remote areas",
      "B": "Increased farmer knowledge and skills",
      "C": "Strengthened farmer-government relationships",
      "D": "Enhanced adoption of improved farming practices"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67934?exam_type=jamb&type=obj&page=92",
    "correct_answer": "A",
    "explanation": "One of the potential disadvantages of agricultural extension is the lack of access to extension services in remote areas. Agricultural extension services aim to provide information, education, and support to farmers, enabling them to adopt improved farming practices and enhance their productivity. However, in remote or geographically isolated regions, the availability of extension services may be limited or non-existent.",
    "year": "2023"
  },
  {
    "number": "460",
    "text": "What is the primary purpose of mixed cropping in agriculture?",
    "options": {
      "A": "Maximizing the yield of a single crop",
      "B": "Simplifying farm management practices",
      "C": "Enhancing soil fertility through crop rotation",
      "D": "Reducing the risk of crop failure"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67936?exam_type=jamb&type=obj&page=92",
    "correct_answer": "D",
    "explanation": "he primary purpose of mixed cropping in agriculture is to reduce the risk of crop failure. Mixed cropping involves growing two or more different crops together in the same field. This practice helps farmers mitigate the potential negative impacts of pests, diseases, adverse weather conditions, and market fluctuations that can affect a single crop.",
    "year": "2023"
  },
  {
    "number": "461",
    "text": "Which of the following is a form of land ownership in which an individual holds complete ownership and control over a piece of land?",
    "options": {
      "A": "Tenancy",
      "B": "Freehold",
      "C": "Leasehold",
      "D": "Commonhold"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67941?exam_type=jamb&type=obj&page=93",
    "correct_answer": "B",
    "explanation": "Freehold is a form of land ownership in which an individual holds complete ownership and control over a piece of land. The individual has the right to use, sell, or transfer the land as they wish, subject to legal regulations. This form of ownership is often associated with privately owned properties, where the land is owned outright and not subject to any time-limited agreements.",
    "year": "2023"
  },
  {
    "number": "462",
    "text": "What is the primary purpose of a pasture in agriculture?",
    "options": {
      "A": "Grazing animals for forage",
      "B": "Providing shade for livestock",
      "C": "Growing cash crops",
      "D": "Fostering wildlife habitat"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67944?exam_type=jamb&type=obj&page=93",
    "correct_answer": "A",
    "explanation": "The primary purpose of a pasture in agriculture is to provide grazing animals with forage. A pasture is an area of land specifically designated for the purpose of growing and providing vegetation for livestock to graze on. It consists of various grasses, legumes, and other suitable plants that are palatable and nutritious for animals.",
    "year": "2023"
  },
  {
    "number": "463",
    "text": "How are farm animals classified based on their feeding habits?",
    "options": {
      "A": "By their reproductive strategies",
      "B": "By their feeding preferences",
      "C": "By their geographical distribution",
      "D": "By their size and weight"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67945?exam_type=jamb&type=obj&page=93",
    "correct_answer": "B",
    "explanation": "Farm animals are commonly classified based on their feeding preferences. This classification categorizes animals into different groups based on their dietary habits and the type of feed they consume.",
    "year": "2023"
  },
  {
    "number": "464",
    "text": "Which of the following is a branch of agriculture that focuses on the cultivation of fruits, vegetables, and ornamental plants?",
    "options": {
      "A": "Apiculture",
      "B": "Aquaculture",
      "C": "Sericulture",
      "D": "Horticulture"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67947?exam_type=jamb&type=obj&page=93",
    "correct_answer": "D",
    "explanation": "Horticulture is a branch of agriculture that focuses on the cultivation, management, and production of fruits, vegetables, and ornamental plants. It includes practices related to the growing, harvesting, processing, and marketing of horticultural crops. Horticulturists may specialize in areas such as fruit production, vegetable farming, floriculture (ornamental plants and flowers), or nursery operations.",
    "year": "2023"
  },
  {
    "number": "465",
    "text": "Which of the following is an example of farm machinery used for planting seeds?",
    "options": {
      "A": "Combine harvester",
      "B": "Harrow",
      "C": "Tractor",
      "D": "Seed drill"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67965?exam_type=jamb&type=obj&page=93",
    "correct_answer": "D",
    "explanation": "A seed drill is an example of farm machinery used for planting seeds. It is a device or implement designed to precisely sow seeds at a consistent depth and spacing.",
    "year": "2023"
  },
  {
    "number": "466",
    "text": "What does the scale of preference represent in agricultural decision-making?",
    "options": {
      "A": "The ranking of available choices based on personal preference",
      "B": "The availability of resources for agricultural production",
      "C": "The total cost of implementing different agricultural practices",
      "D": "The market demand for agricultural products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/67967?exam_type=jamb&type=obj&page=94",
    "correct_answer": "A",
    "explanation": "The scale of preference represents the ranking of available choices based on personal preference in agricultural decision-making. When making choices in agriculture, farmers and agricultural stakeholders evaluate different options and rank them according to their preferences and goals.",
    "year": "2023"
  },
  {
    "number": "467",
    "text": "Which of the following is a primary function of the digestive system?",
    "options": {
      "A": "Regulation of body temperature",
      "B": "Oxygen transport",
      "C": "Production of hormones",
      "D": "Absorption of nutrients"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68010?exam_type=jamb&type=obj&page=94",
    "correct_answer": "D",
    "explanation": "The primary function of the digestive system is the absorption of nutrients. The digestive system breaks down food into smaller molecules through processes such as mechanical digestion (chewing) and chemical digestion (enzymes breaking down food).",
    "year": "2023"
  },
  {
    "number": "468",
    "text": "What is the primary goal of crop improvement in agriculture?",
    "options": {
      "A": "Reducing pest and disease resistance",
      "B": "Expanding crop cultivation areas",
      "C": "Increasing crop diversity",
      "D": "Enhancing crop yield and quality"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68085?exam_type=jamb&type=obj&page=94",
    "correct_answer": "D",
    "explanation": "The primary goal of crop improvement in agriculture is to enhance crop yield and quality. Crop improvement involves various techniques, such as plant breeding, genetic engineering, and selection of superior traits, to develop new varieties or cultivars with improved characteristics. These characteristics may include higher yields, improved nutritional content, resistance to pests and diseases, tolerance to environmental stresses, and better adaptation to specific growing conditions.",
    "year": "2023"
  },
  {
    "number": "469",
    "text": "Which of the following is a common method of disseminating information to farmers?",
    "options": {
      "A": "All of the above",
      "B": "Social media campaigns",
      "C": "Radio broadcasts",
      "D": "Field demonstrations"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68086?exam_type=jamb&type=obj&page=94",
    "correct_answer": "A",
    "explanation": "Disseminating information to farmers involves utilizing various methods to reach them effectively. Social media campaigns, such as through platforms like Facebook, Twitter, and WhatsApp, have become increasingly popular for sharing agricultural knowledge, news, and updates. Radio broadcasts, especially in rural areas, serve as an important means of reaching farmers with relevant agricultural information.",
    "year": "2023"
  },
  {
    "number": "470",
    "text": "Which of the following periods marked the beginning of agricultural practices by early human societies?",
    "options": {
      "A": "Paleolithic Age",
      "B": "Information Age",
      "C": "Renaissance Era",
      "D": "Industrial Revolution"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68087?exam_type=jamb&type=obj&page=94",
    "correct_answer": "A",
    "explanation": "The Paleolithic Age, also known as the Stone Age, marked the beginning of agricultural practices by early human societies. During this period, which began around 2.6 million years ago and lasted until around 10,000 BCE, humans transitioned from being solely hunter-gatherers to engaging in early forms of agriculture.",
    "year": "2023"
  },
  {
    "number": "471",
    "text": "What is the role of agricultural extension officers in the field of agriculture?",
    "options": {
      "A": "Providing financial assistance to farmers",
      "B": "Marketing agricultural products to consumers",
      "C": "Conducting research on new farming techniques",
      "D": "Delivering agricultural education and training to farmers"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68088?exam_type=jamb&type=obj&page=95",
    "correct_answer": "D",
    "explanation": "The role of agricultural extension officers in the field of agriculture is primarily to deliver agricultural education and training to farmers. Agricultural extension officers work closely with farmers, providing them with information, knowledge, and technical expertise to improve their farming practices. They facilitate the transfer of scientific research and technology to farmers, helping them adopt modern and sustainable agricultural practices.",
    "year": "2023"
  },
  {
    "number": "472",
    "text": "What is the primary function of the reproductive system in farm animals?",
    "options": {
      "A": "Digestion of food",
      "B": "Reproduction and propagation of the species",
      "C": "Production of milk for offspring",
      "D": "Maintenance of body temperature"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68089?exam_type=jamb&type=obj&page=95",
    "correct_answer": "B",
    "explanation": "The primary function of the reproductive system in farm animals is the reproduction and propagation of the species. The reproductive system in farm animals, including cows, sheep, pigs, and poultry, is responsible for the production of gametes (sperm and eggs) and facilitating the process of fertilization. It involves the functioning of reproductive organs, such as the ovaries, testes, uterus, and oviducts, as well as hormone regulation.",
    "year": "2023"
  },
  {
    "number": "473",
    "text": "What is the primary function of the reproductive system in farm animals?",
    "options": {
      "A": "Digestion of food",
      "B": "Reproduction and propagation of the species",
      "C": "Production of milk for offspring",
      "D": "Maintenance of body temperature"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68090?exam_type=jamb&type=obj&page=95",
    "correct_answer": "B",
    "explanation": "The primary function of the reproductive system in farm animals is the reproduction and propagation of the species. The reproductive system in farm animals, including cows, sheep, pigs, and poultry, is responsible for the production of gametes (sperm and eggs) and facilitating the process of fertilization. It involves the functioning of reproductive organs, such as the ovaries, testes, uterus, and oviducts, as well as hormone regulation.",
    "year": "2023"
  },
  {
    "number": "474",
    "text": "What does the concept of demand and supply refer to in agriculture?",
    "options": {
      "A": "The government's role in regulating agricultural prices",
      "B": "The distribution of agricultural resources among different regions",
      "C": "The quantity of agricultural products produced and consumed",
      "D": "The interaction between buyers and sellers in agricultural markets"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68091?exam_type=jamb&type=obj&page=95",
    "correct_answer": "D",
    "explanation": "The concept of demand and supply in agriculture refers to the interaction between buyers and sellers in agricultural markets. It is based on the principle that the quantity of agricultural products demanded by consumers and the quantity supplied by producers determine the equilibrium price and quantity in the market.",
    "year": "2023"
  },
  {
    "number": "475",
    "text": "What is the primary goal of genetic engineering in agriculture?",
    "options": {
      "A": "Creating genetically modified organisms (GMOs) with desirable traits",
      "B": "Preserving traditional farming practices and crop varieties",
      "C": "Eliminating the use of pesticides and fertilizers in farming",
      "D": "Enhancing crop yields through traditional breeding methods"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68092?exam_type=jamb&type=obj&page=95",
    "correct_answer": "A",
    "explanation": "The primary goal of genetic engineering in agriculture is to create genetically modified organisms (GMOs) with desirable traits. Genetic engineering involves manipulating the genetic material of organisms, such as plants, to introduce specific genes from other organisms.",
    "year": "2023"
  },
  {
    "number": "476",
    "text": "Farm animals can be classified into three main categories based on their primary purpose. Which of the following is NOT one of those categories?",
    "options": {
      "A": "Poultry",
      "B": "Aquatic animals",
      "C": "Companion animals",
      "D": "Livestock animals"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68093?exam_type=jamb&type=obj&page=96",
    "correct_answer": "B",
    "explanation": "Farm animals can be classified into three main categories based on their primary purpose: livestock animals, poultry, and companion animals. Livestock animals include cattle, sheep, goats, pigs, and other large mammals primarily raised for meat, milk, or fiber production. Poultry refers to birds such as chickens, turkeys, ducks, and geese, which are raised for meat and egg production. Companion animals encompass animals such as horses, dogs, and cats that are primarily kept for companionship, recreation, or other non-agricultural purposes.",
    "year": "2023"
  },
  {
    "number": "477",
    "text": "What is the term used to describe the deliberate modification of an organism's genetic material using biotechnology techniques?",
    "options": {
      "A": "Mutation",
      "B": "Cloning",
      "C": "Genetic engineering",
      "D": "Hybridization"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68094?exam_type=jamb&type=obj&page=96",
    "correct_answer": "C",
    "explanation": "Genetic engineering is the term used to describe the deliberate modification of an organism's genetic material using biotechnology techniques. It involves the manipulation of an organism's DNA to introduce or alter specific traits. Genetic engineering techniques include gene insertion, deletion, or modification to achieve desired characteristics in plants, animals, or microorganisms.",
    "year": "2023"
  },
  {
    "number": "478",
    "text": "What is the primary focus of agronomy in agriculture?",
    "options": {
      "A": "Management of soil and crops",
      "B": "Breeding and genetics of crops",
      "C": "Study of climate and weather patterns",
      "D": "Marketing and selling of agricultural products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68095?exam_type=jamb&type=obj&page=96",
    "correct_answer": "A",
    "explanation": "The primary focus of agronomy in agriculture is the management of soil and crops. Agronomy is a branch of agricultural science that deals with the principles and practices of soil and crop management.",
    "year": "2023"
  },
  {
    "number": "479",
    "text": "What happens to the price of a agricultural product when demand exceeds supply?",
    "options": {
      "A": "The price fluctuates randomly",
      "B": "The price decreases",
      "C": "The price remains unchanged",
      "D": "The price increases"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68096?exam_type=jamb&type=obj&page=96",
    "correct_answer": "D",
    "explanation": "In economics, when demand exceeds supply, it creates a shortage. The price of the product will increase until the quantity demanded is equal to the quantity supplied, a state known as equilibrium. This is because the high demand and low supply create a competitive market where buyers are willing to pay more to secure the product.",
    "year": "2023"
  },
  {
    "number": "480",
    "text": "What does the term \"recombinant DNA\" refer to in biotechnology?",
    "options": {
      "A": "DNA synthesized in a laboratory",
      "B": "DNA replicated using polymerase chain reaction (PCR)",
      "C": "DNA extracted from ancient fossils",
      "D": "DNA modified to contain genes from different organisms"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68097?exam_type=jamb&type=obj&page=96",
    "correct_answer": "D",
    "explanation": "The term \"recombinant DNA\" in biotechnology refers to DNA that has been modified or engineered to contain genes from different organisms. This process involves the insertion of specific genes or gene segments into the DNA of an organism, resulting in the creation of a new DNA sequence with combined genetic information.",
    "year": "2023"
  },
  {
    "number": "481",
    "text": "What is the process of introducing foreign genetic material into an organism called?",
    "options": {
      "A": "Transcription",
      "B": "Transformation",
      "C": "Translocation",
      "D": "Translation"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68098?exam_type=jamb&type=obj&page=97",
    "correct_answer": "B",
    "explanation": "The process of introducing foreign genetic material into an organism is called transformation. In biotechnology, transformation involves the insertion of specific genes or DNA sequences into the genome of an organism, resulting in the expression of new traits or characteristics.",
    "year": "2023"
  },
  {
    "number": "482",
    "text": "What is the primary focus of animal husbandry in agriculture?",
    "options": {
      "A": "Veterinary care for domestic pets",
      "B": "Protection of wildlife habitats",
      "C": "Breeding and management of farm animals",
      "D": "Crop cultivation for livestock feed"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68099?exam_type=jamb&type=obj&page=97",
    "correct_answer": "C",
    "explanation": "The primary focus of animal husbandry in agriculture is the breeding and management of farm animals. Animal husbandry involves various practices related to the care, breeding, and rearing of domesticated animals for agricultural purposes.",
    "year": "2023"
  },
  {
    "number": "483",
    "text": "Which of the following is an important aspect of livestock management in agriculture?",
    "options": {
      "A": "Irrigation scheduling",
      "B": "Fertilizer application rates",
      "C": "Animal health and welfare",
      "D": "Crop rotation techniques"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68100?exam_type=jamb&type=obj&page=97",
    "correct_answer": "C",
    "explanation": "Animal health and welfare is an important aspect of livestock management in agriculture. Livestock managers and farmers are responsible for ensuring the well-being of the animals under their care. This includes providing proper nutrition, appropriate housing and shelter, disease prevention and control measures, and veterinary care.",
    "year": "2023"
  },
  {
    "number": "484",
    "text": "What is the primary objective of agricultural research?",
    "options": {
      "A": "Developing new farming technologies",
      "B": "Increasing crop diversity",
      "C": "Promoting organic farming practices",
      "D": "Enhancing agricultural productivity and sustainability"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68101?exam_type=jamb&type=obj&page=97",
    "correct_answer": "D",
    "explanation": "The primary objective of agricultural research is to enhance agricultural productivity and sustainability. Agricultural researchers work to develop innovative techniques, technologies, and practices that improve crop yields, reduce environmental impact, and ensure the long-term viability of agricultural systems.",
    "year": "2023"
  },
  {
    "number": "485",
    "text": "What is the primary purpose of storage facilities in agriculture?",
    "options": {
      "A": "Offering a workspace for farm laborers",
      "B": "Storing and preserving harvested crops",
      "C": "Providing shelter for farm animals",
      "D": "Housing agricultural machinery and equipment"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68102?exam_type=jamb&type=obj&page=97",
    "correct_answer": "B",
    "explanation": "The primary purpose of storage facilities in agriculture is to store and preserve harvested crops. These facilities, such as warehouses, silos, or cold storage units, are designed to protect harvested crops from environmental factors, pests, and diseases. They provide a controlled environment that helps maintain the quality, nutritional value, and market value of the stored crops.",
    "year": "2023"
  },
  {
    "number": "486",
    "text": "What is the purpose of using a scale of preference in agricultural decision-making?",
    "options": {
      "A": "To evaluate the environmental impact of farming practices",
      "B": "To determine the most profitable crops to cultivate",
      "C": "To allocate resources effectively among different activities",
      "D": "To prioritize agricultural tasks based on urgency"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68103?exam_type=jamb&type=obj&page=98",
    "correct_answer": "C",
    "explanation": "The purpose of using a scale of preference in agricultural decision-making is to allocate resources effectively among different activities. A scale of preference is a tool used to prioritize and rank various options or choices based on their relative importance or value. In agriculture, farmers often face limited resources such as land, labor, capital, and time.",
    "year": "2023"
  },
  {
    "number": "487",
    "text": "Which of the following is a common by-product of farm animals?",
    "options": {
      "A": "All of the above",
      "B": "Wool",
      "C": "Fertilizer",
      "D": "Milk"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68104?exam_type=jamb&type=obj&page=98",
    "correct_answer": "A",
    "explanation": "Farm animals often produce various valuable by-products. Milk is a common by-product of dairy animals such as cows, goats, and sheep. It is a significant source of nutrition for humans and is used to produce dairy products such as cheese, butter, and yogurt. Fertilizer is another by-product that can be obtained from farm animals, specifically from their manure.",
    "year": "2023"
  },
  {
    "number": "488",
    "text": "Which part of a tractor is responsible for providing power to the attached implements or machinery?",
    "options": {
      "A": "Steering system",
      "B": "Transmission",
      "C": "Engine",
      "D": "Hydraulic system"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68105?exam_type=jamb&type=obj&page=98",
    "correct_answer": "D",
    "explanation": "The hydraulic system of a tractor is responsible for providing power to the attached implements or machinery. It uses a fluid under pressure to transmit power from the tractor to the implements for various functions. The engine is the power source of the tractor, but it is the hydraulic system that transmits this power to the implements.",
    "year": "2023"
  },
  {
    "number": "489",
    "text": "What is the primary purpose of agricultural mechanization?",
    "options": {
      "A": "Promoting sustainable irrigation techniques",
      "B": "Increasing crop diversity in farming systems",
      "C": "Reducing labor requirements in agriculture",
      "D": "Enhancing organic farming practices"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68106?exam_type=jamb&type=obj&page=98",
    "correct_answer": "C",
    "explanation": "The primary purpose of agricultural mechanization is to reduce labor requirements in agriculture. Agricultural mechanization involves the use of machinery, equipment, and technology to automate and streamline various farming operations. By employing mechanized tools such as tractors, harvesters, planters, and irrigation systems, farmers can increase efficiency, save time, and reduce the physical labor needed for tasks like land preparation, planting, harvesting, and irrigation.",
    "year": "2023"
  },
  {
    "number": "490",
    "text": "What are some advantages of agricultural extension?",
    "options": {
      "A": "All of the above",
      "B": "Increased access to modern agricultural technologies",
      "C": "Improved farm productivity and profitability",
      "D": "Enhanced knowledge and skills of farmers"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68107?exam_type=jamb&type=obj&page=98",
    "correct_answer": "A",
    "explanation": "Agricultural extension services provide numerous advantages to farmers and the agricultural sector. Through agricultural extension, farmers gain increased access to modern agricultural technologies, such as improved crop varieties, efficient irrigation methods, and mechanized farming equipment. This leads to improved farm productivity and profitability.",
    "year": "2023"
  },
  {
    "number": "491",
    "text": "What is the role of agricultural extension officers in relation to farmers?",
    "options": {
      "A": "To provide financial support to farmers",
      "B": "To sell agricultural products to farmers",
      "C": "To offer technical advice and assistance to farmers",
      "D": "To regulate agricultural practices on farms"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68108?exam_type=jamb&type=obj&page=99",
    "correct_answer": "C",
    "explanation": "The primary role of agricultural extension officers is to offer technical advice and assistance to farmers. Agricultural extension officers are professionals who work closely with farmers to provide them with the necessary knowledge, information, and resources to improve their agricultural practices and increase productivity. They act as intermediaries between agricultural research institutions and farmers, translating scientific knowledge into practical guidance for farmers.",
    "year": "2023"
  },
  {
    "number": "492",
    "text": "What is the relationship between demand and supply in agriculture?",
    "options": {
      "A": "Demand in agriculture is independent of supply",
      "B": "Demand and supply in agriculture are interdependent",
      "C": "Supply in agriculture is determined solely by demand",
      "D": "Demand and supply in agriculture are unrelated"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68109?exam_type=jamb&type=obj&page=99",
    "correct_answer": "B",
    "explanation": "In agriculture, demand and supply are interdependent factors. Demand refers to the quantity of agricultural products that consumers are willing and able to purchase at a given price. Supply, on the other hand, refers to the quantity of agricultural products that producers are willing and able to offer for sale at a given price. The relationship between demand and supply is often represented by the concept of market equilibrium.",
    "year": "2023"
  },
  {
    "number": "493",
    "text": "What is the primary purpose of an agricultural extension service?",
    "options": {
      "A": "Providing financial assistance to farmers",
      "B": "Offering training and advisory services to farmers",
      "C": "Conducting research on agricultural practices",
      "D": "Marketing and selling agricultural products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68110?exam_type=jamb&type=obj&page=99",
    "correct_answer": "B",
    "explanation": "The primary purpose of an agricultural extension service is to offer training and advisory services to farmers. Agricultural extension services provide education, information, and support to farmers and rural communities to enhance their agricultural practices, productivity, and livelihoods. They offer training programs, workshops, demonstrations, and on-farm advisory services to help farmers adopt new technologies, improve their farming techniques, manage pests and diseases, and enhance sustainable agricultural practices.",
    "year": "2023"
  },
  {
    "number": "494",
    "text": "What is a potential disadvantage of mass media for farmers?",
    "options": {
      "A": "Lack of credibility in agricultural news",
      "B": "Insufficient coverage of farming practices",
      "C": "Limited access to information",
      "D": "Increased cost of agricultural inputs"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68111?exam_type=jamb&type=obj&page=99",
    "correct_answer": "C",
    "explanation": "A potential disadvantage of mass media for farmers is limited access to information. This is particularly true in rural areas where access to the internet and other forms of mass media may be limited. While mass media can be a powerful tool for disseminating information, it is not always accessible or relevant to all farmers, particularly those in remote or underserved areas.",
    "year": "2023"
  },
  {
    "number": "495",
    "text": "Which of the following is an example of a pasture commonly used in agriculture?",
    "options": {
      "A": "Corn plantation",
      "B": "Orange orchard",
      "C": "Cattle pasture",
      "D": "Wheat field"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68112?exam_type=jamb&type=obj&page=99",
    "correct_answer": "C",
    "explanation": "A cattle pasture is an example of a pasture commonly used in agriculture. It is an area of land specifically designated for grazing cattle. Cattle pastures consist of various grasses and forage crops that provide the necessary nutrition for the cattle to graze on.",
    "year": "2023"
  },
  {
    "number": "496",
    "text": "Which of the following is NOT a component of soil?",
    "options": {
      "A": "Organic matter",
      "B": "Water",
      "C": "rubber",
      "D": "Minerals"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68113?exam_type=jamb&type=obj&page=100",
    "correct_answer": "C",
    "explanation": "Rubber is not considered a component of soil. Soil is composed of mineral particles, organic matter, water, and air spaces. The mineral particles include sand, silt, and clay, which provide the physical structure of the soil.",
    "year": "2023"
  },
  {
    "number": "497",
    "text": "What are the primary benefits of agricultural extension services?",
    "options": {
      "A": "Preservation of traditional farming practices",
      "B": "Enhanced knowledge and skills of farmers",
      "C": "Increased crop diversity and yield",
      "D": "Improved market access for agricultural products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68114?exam_type=jamb&type=obj&page=100",
    "correct_answer": "B",
    "explanation": "Agricultural extension services are primarily designed to enhance farmers' knowledge and skills through education and training. These services offer valuable information on best practices, innovative technologies, and sustainable farming methods, enabling farmers to boost productivity and refine their overall practices. Although the other options may represent additional benefits, the main objective of extension services is to empower farmers with improved knowledge and capabilities.",
    "year": "2023"
  },
  {
    "number": "498",
    "text": "What is the primary purpose of processing facilities in agriculture?",
    "options": {
      "A": "To process raw agricultural materials into value-added products",
      "B": "To provide shelter and housing for livestock",
      "C": "To package and label agricultural products",
      "D": "To store and preserve harvested crops"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/68115?exam_type=jamb&type=obj&page=100",
    "correct_answer": "A",
    "explanation": "The primary purpose of processing facilities in agriculture is to process raw agricultural materials into value-added products. Processing facilities are equipped with machinery and technology to transform harvested crops and other agricultural products into processed goods. This may include activities such as sorting, cleaning, grinding, milling, refining, canning, freezing, drying, and packaging.",
    "year": "2023"
  }
]