[
  {
    "number": "1551",
    "text": "Which of the following is NOT part of Pre-Sales Service/ice?",
    "options": {
      "A": "granting of credit or hire purchase sales facilities",
      "B": "assisting the prospective buyer to set up facilities for storage",
      "C": "dispatching of quotation and price list",
      "D": "providing detailed information about goods to be purchased"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70924?exam_type=jamb&type=obj&page=311",
    "correct_answer": "A",
    "explanation": "Pre-sales services are the activities and support provided to potential buyers before the actual sale takes place. These services aim to assist customers in making informed purchasing decisions and to facilitate a smooth sales process. They typically include activities such as providing information about the products, answering inquiries, and assisting with product selection. However, granting credit or hire purchase sales facilities is not typically considered a pre-sales service.",
    "year": "2024"
  },
  {
    "number": "1552",
    "text": "Which of the following does a seller send in reply to a letter of inquiry?",
    "options": {
      "A": "quotation",
      "B": "credit note",
      "C": "debit note",
      "D": "delivery note"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70925?exam_type=jamb&type=obj&page=311",
    "correct_answer": "A",
    "explanation": "A letter of inquiry is a communication from a potential buyer to a seller, expressing interest in obtaining information about a specific product, service, or pricing. In response to this inquiry, the seller would usually provide a quotation. A quotation is a formal document that outlines the details of the products or services requested by the buyer, including prices, quantities, terms and conditions, and any other relevant information.",
    "year": "2024"
  },
  {
    "number": "1553",
    "text": "The sum which the insured pays periodically to his insurance company is called",
    "options": {
      "A": "a commission",
      "B": "an indemnity",
      "C": "a policy",
      "D": "a premium"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70926?exam_type=jamb&type=obj&page=311",
    "correct_answer": "D",
    "explanation": "A premium is the amount of money that an individual or entity pays to an insurance company in exchange for insurance coverage. It is typically paid periodically, such as monthly, quarterly, or annually, depending on the terms of the insurance policy. The premium is determined based on various factors, including the type of insurance, the coverage amount, the risk profile of the insured, and other relevant factors. By paying the premium, the insured obtains the benefits and protection outlined in the insurance policy.",
    "year": "2024"
  },
  {
    "number": "1554",
    "text": "The main objective of nationalization of industries is to",
    "options": {
      "A": "prevent existing firms from liquidation",
      "B": "Make more profit for the government",
      "C": "prevent all aliens from taking part in the business activities of a country",
      "D": "bring an Industry under state ownership and control"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70927?exam_type=jamb&type=obj&page=311",
    "correct_answer": "D",
    "explanation": "Nationalization refers to the process by which the government takes ownership and control of private industries or assets. The primary objective of nationalization is to transfer the ownership and control of key industries from private entities to the government. This allows the government to exercise influence over the industry's operations, strategic decision-making, and resource allocation. Nationalization is often driven by the government's desire to safeguard national interests, promote public welfare, ensure economic stability, or pursue specific policy objectives.",
    "year": "2024"
  },
  {
    "number": "1555",
    "text": "Closing stock is also known as",
    "options": {
      "A": "stock at close",
      "B": "balance brought forward",
      "C": "opening inventory",
      "D": "stock at beginning"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70928?exam_type=jamb&type=obj&page=311",
    "correct_answer": "A",
    "explanation": "Closing stock refers to the value of inventory or goods that are still available for sale at the end of an accounting period. It represents the stock that remains unsold and is carried forward to the next accounting period. The term \"closing stock\" is used because it is the final inventory balance recorded at the close or end of the period.",
    "year": "2024"
  },
  {
    "number": "1556",
    "text": "The first Nigerian enterprises promotion decree was promulgated in",
    "options": {
      "A": "1972",
      "B": "1973",
      "C": "1974",
      "D": "1977"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70929?exam_type=jamb&type=obj&page=312",
    "correct_answer": "B",
    "explanation": "The Nigerian Enterprises Promotion Decree of 1973, also known as the Indigenization Decree, was a significant policy implemented by the Nigerian government aimed at promoting indigenous participation and ownership in the country's economy. The decree outlined provisions for the transfer of ownership and control of certain businesses from foreign owners to Nigerian citizens.",
    "year": "2024"
  },
  {
    "number": "1557",
    "text": "An agreement that is enforceable in law is called",
    "options": {
      "A": "an offer",
      "B": "a decree",
      "C": "a contract",
      "D": "a declaration"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70930?exam_type=jamb&type=obj&page=312",
    "correct_answer": "C",
    "explanation": "A contract is a legally binding agreement between two or more parties that creates obligations that are enforceable by law. For a contract to be valid, it typically requires an offer, acceptance, consideration (something of value exchanged between the parties), legal capacity of the parties, and a lawful purpose. Once all the necessary elements are present, a contract is formed, and the parties involved are legally obligated to fulfill their respective obligations as outlined in the agreement.",
    "year": "2024"
  },
  {
    "number": "1558",
    "text": "A tax paid on goods manufactured and consumed in your country is called",
    "options": {
      "A": "excise duty",
      "B": "goods tax",
      "C": "income tax",
      "D": "custom duty"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70931?exam_type=jamb&type=obj&page=312",
    "correct_answer": "A",
    "explanation": "Excise duty is a type of tax levied on specific goods produced or consumed within a country. It is typically imposed on goods such as alcohol, tobacco, petroleum products, and certain luxury items. Excise duty is usually included in the price of the goods and is paid by the manufacturer or producer, who then passes on the cost to the consumer.",
    "year": "2024"
  },
  {
    "number": "1559",
    "text": "Which of the following is NOT an aim of advertising?",
    "options": {
      "A": "inspiring public confidence in the goods",
      "B": "arousing the interest of the public",
      "C": "reducing the cost of the goods produced",
      "D": "attracting the attention of the public"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70932?exam_type=jamb&type=obj&page=312",
    "correct_answer": "C",
    "explanation": "Advertising is a promotional activity aimed at reaching a target audience and influencing their behavior or perception. I serves various purposes and aims to achieve specific goals.",
    "year": "2024"
  },
  {
    "number": "1560",
    "text": "Prospectus in relation to a public limited inability company means",
    "options": {
      "A": "a document stating the types or shares",
      "B": "an invitation to the public to collect dividends",
      "C": "an invitation to the public to buy shares",
      "D": "a document where the names of shareholders are written"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70933?exam_type=jamb&type=obj&page=312",
    "correct_answer": "C",
    "explanation": "A prospectus is a formal document issued by a company seeking to raise capital through the sale of shares to the public. It provides detailed information about the company, its operations, financial, risks, and the terms of the offering. The prospectus serves as an invitation to potential investors to buy shares in the company.",
    "year": "2024"
  },
  {
    "number": "1561",
    "text": "An allowance made to a customer for prompt payment is known as",
    "options": {
      "A": "bulk discount",
      "B": "commission",
      "C": "cash discount",
      "D": "allowance"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70934?exam_type=jamb&type=obj&page=313",
    "correct_answer": "C",
    "explanation": "A cash discount refers to a reduction in the price or amount owed by a customer for making prompt payment. It is a financial incentive offered by the seller to encourage customers to pay their invoices or bills within a specified time frame. By offering a cash discount, the seller aims to improve cash flow and reduce the risk of late or non-payment.",
    "year": "2024"
  },
  {
    "number": "1562",
    "text": "A person who runs a business on his own account is called a",
    "options": {
      "A": "customer",
      "B": "sole trader",
      "C": "director",
      "D": "partner"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70935?exam_type=jamb&type=obj&page=313",
    "correct_answer": "B",
    "explanation": "A sole trader, also known as a sole proprietor or sole proprietorship, is an individual who owns and operates a business independently. As a sole trader, the person is solely responsible for the business's profits, losses, and liabilities. They hav full control over the business's operations and make all decisions independently.",
    "year": "2024"
  },
  {
    "number": "1563",
    "text": "All the following are principles of insurance EXCEPT",
    "options": {
      "A": "insurable interest",
      "B": "particular average",
      "C": "utmost good faith",
      "D": "subrogation"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70936?exam_type=jamb&type=obj&page=313",
    "correct_answer": "B",
    "explanation": "Particular average is not one of the principles of insurance. It refers to a type of partial loss that occurs when a specific item or interest is damaged or lost, and the loss is borne by the owner of that particular item or interest, rather than being spread across all parties insured.",
    "year": "2024"
  },
  {
    "number": "1564",
    "text": "One of the following does NOT fit into the group.",
    "options": {
      "A": "agriculture",
      "B": "carpentry",
      "C": "fishing",
      "D": "mining"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70937?exam_type=jamb&type=obj&page=313",
    "correct_answer": "B",
    "explanation": "Carpentry is a skilled trade or craft that involves working with wood to construct, install, or repair structures or objects While carpentry may involve using materials derived from natural resources, it is not directly related to the primary extraction or production of those resources. Therefore, carpentry does not fit into the group of industries related to agriculture, fishing, mining, and quarrying.",
    "year": "2024"
  },
  {
    "number": "1565",
    "text": "A public limited liability company is owned by",
    "options": {
      "A": "government",
      "B": "shareholders",
      "C": "general public",
      "D": "debenture holders"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70938?exam_type=jamb&type=obj&page=313",
    "correct_answer": "B",
    "explanation": "In a public limited liability company, ownership is held by the shareholders. Shareholders are individuals or entities that hold shares or ownership interests in the company. They are the owners of the company and have rights and privileges associated with their shareholdings, such as voting rights, dividend entitlement, and the ability to participate in decision making processes.",
    "year": "2024"
  },
  {
    "number": "1566",
    "text": "An instruction to an agent abroad restricting him to buy from a named manufacturer is known as",
    "options": {
      "A": "pro forma invoice",
      "B": "an open indent",
      "C": "a closed indent",
      "D": "an order"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70939?exam_type=jamb&type=obj&page=314",
    "correct_answer": "C",
    "explanation": "A closed indent refers to an instruction given to an agent or representative abroad, specifying that they are restricted to purchasing goods only from a particular named manufacturer or supplier. This instruction limits the agent's options and requires them to adhere to a specific source for procurement.",
    "year": "2024"
  },
  {
    "number": "1567",
    "text": "Which of the following can be used to establish an importer's title to goods?",
    "options": {
      "A": "cargo receipt",
      "B": "way bill",
      "C": "bill of lading",
      "D": "import license"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70940?exam_type=jamb&type=obj&page=314",
    "correct_answer": "C",
    "explanation": "A bill of lading is a document issued by a carrier or shipping company to acknowledge the receipt of goods for shipment It serves as evidence of the contract of carriage and provides details such as the description of the goods, the names of the shipper and the consignee, the destination, and the terms of shipment. A bill of lading acts as a receipt for the goods and also serves as a document of title, which means it can be used to establish the importer's ownership or right to possess the goods.",
    "year": "2024"
  },
  {
    "number": "1568",
    "text": "Fishing is an example of",
    "options": {
      "A": "direct services",
      "B": "manufacturing industry",
      "C": "extractive industry",
      "D": "construction industry"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70941?exam_type=jamb&type=obj&page=314",
    "correct_answer": "C",
    "explanation": "The extractive industry involves the extraction or removal of natural resources from the earth or sea. Fishing is a primary example of an extractive industry as it involves the harvesting of fish and other seafood from natural water sources such as oceans, rivers, and lakes.",
    "year": "2024"
  },
  {
    "number": "1569",
    "text": "Which of the following CANNOT be sold through a vending machine?",
    "options": {
      "A": "shoes",
      "B": "tickets",
      "C": "snacks",
      "D": "tea"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70942?exam_type=jamb&type=obj&page=314",
    "correct_answer": "A",
    "explanation": "Vending machines are automated machines that dispense a variety of products to customers. They are commonly used t sell snacks, beverages, and other small items that are pre-packaged and can be easily dispensed.",
    "year": "2024"
  },
  {
    "number": "1570",
    "text": "The rights of the consumers does NOT include",
    "options": {
      "A": "the right to a healthy environment",
      "B": "the right to be informed",
      "C": "the right to fix prices",
      "D": "the right to choose"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70943?exam_type=jamb&type=obj&page=314",
    "correct_answer": "C",
    "explanation": "The rights of consumers are a set of principles and protections that aim to ensure fair treatment and satisfactory experiences in the marketplace. These rights are recognized and promoted by consumer protection laws and organizations.",
    "year": "2024"
  },
  {
    "number": "1571",
    "text": "Banks issue cheque books to customers holding ___________ accounts.",
    "options": {
      "A": "foreign",
      "B": "current",
      "C": "deposit",
      "D": "fixed deposit"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70944?exam_type=jamb&type=obj&page=315",
    "correct_answer": "B",
    "explanation": "A current account, also known as a checking account, is a type of bank account that allows frequent transactions, including writing cheques. Cheque books are commonly provided to customers with current accounts to facilitate payments and withdrawals.",
    "year": "2024"
  },
  {
    "number": "1572",
    "text": "A bill of exchange sold for less than its face value before maturity is said to be",
    "options": {
      "A": "protested",
      "B": "cleared",
      "C": "dishonored",
      "D": "discounted"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70945?exam_type=jamb&type=obj&page=315",
    "correct_answer": "D",
    "explanation": "When a bill of exchange is sold for less than its face value before its maturity date, it is referred to as being discounted. This discount represents the difference between the face value of the bill and the amount received by the holder of the bill when selling it before maturity. The discounted amount is usually determined based on the remaining time to maturity and prevailing interest rates.",
    "year": "2024"
  },
  {
    "number": "1573",
    "text": "A multiple shop has many stores which sell",
    "options": {
      "A": "manufactured goods",
      "B": "locally produced goods",
      "C": "perishable goods",
      "D": "similar goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70946?exam_type=jamb&type=obj&page=315",
    "correct_answer": "D",
    "explanation": "A multiple shop, also known as a chain store or a retail chain, is a business that operates multiple retail stores under the same brand or company. These stores typically sell similar goods or products across different locations. The purpose of multiple shop is to provide consistent offerings and branding to customers across various outlets.",
    "year": "2024"
  },
  {
    "number": "1574",
    "text": "The relationship between a country's visible imports and exports in a trading year is known as",
    "options": {
      "A": "balance of trade",
      "B": "counter trade",
      "C": "international trade",
      "D": "balance of payment"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70947?exam_type=jamb&type=obj&page=315",
    "correct_answer": "A",
    "explanation": "The balance of trade is a measure of the difference between the value of a country's visible exports (goods and services sold to other countries) and visible imports (goods and services purchased from other countries) over a specific period, usually a trading year. It provides insight into the economic relationship between a country and its trading partners.The balance of trade can be positive (surplus) if the value of exports exceeds imports, indicating that a country is exporting more than it is importing. Conversely, it can be negative (deficit) if imports exceed exports, indicating that a country is importing more than it is exporting.",
    "year": "2024"
  },
  {
    "number": "1575",
    "text": "Which of the following warehouse is generally found near a port?",
    "options": {
      "A": "producer's warehouse",
      "B": "bonded warehouse",
      "C": "distributor's warehouse",
      "D": "manufacturer's warehouse"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70948?exam_type=jamb&type=obj&page=315",
    "correct_answer": "B",
    "explanation": "A bonded warehouse is a type of warehouse that is located near a port or customs entry point. It is specifically designed and authorized by the government to store imported goods before they are cleared by customs and released for distribution or sale in the local market. Bonded warehouses provide storage facilities for goods on which customs duties and taxes have not yet been paid.",
    "year": "2024"
  },
  {
    "number": "1576",
    "text": "The service rendered by NIPOST in which letters are addressed to any post office to await collection by the addressee is known as",
    "options": {
      "A": "business reply service",
      "B": "cash on delivery service",
      "C": "free post service",
      "D": "express mail service"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70949?exam_type=jamb&type=obj&page=316",
    "correct_answer": "C",
    "explanation": "The Free post service allows individuals to send letters or parcels to any post office without the need to pay for postage upfront. The addressee can then collect the item from the designated post office upon presentation of proper identification.",
    "year": "2024"
  },
  {
    "number": "1577",
    "text": "Which area of law is NOT related to business?",
    "options": {
      "A": "agency",
      "B": "hire purchase",
      "C": "possession",
      "D": "contract"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70950?exam_type=jamb&type=obj&page=316",
    "correct_answer": "C",
    "explanation": "Possession, as a standalone term, is not a specific area of law commonly associated with business law. Possession generally refers to the physical control or ownership of property or assets, but it is not a distinct legal area in the same way as agency, contract, hire purchase, or sale of goods.",
    "year": "2024"
  },
  {
    "number": "1578",
    "text": "A holding company is one which holds shares in another company up to",
    "options": {
      "A": "51%",
      "B": "41%",
      "C": "33%",
      "D": "25%"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70951?exam_type=jamb&type=obj&page=316",
    "correct_answer": "A",
    "explanation": "A holding company is a company that owns a significant portion of the voting shares or equity of another company, known as its subsidiary. To be considered a holding company, it typically needs to hold a majority of the voting rights or shares of the subsidiary, which is generally defined as owning more than 51% of the subsidiary's shares.",
    "year": "2024"
  },
  {
    "number": "1579",
    "text": "The breaking down of work into different processes is known as",
    "options": {
      "A": "production",
      "B": "division of labour",
      "C": "specialization",
      "D": "exchange"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70952?exam_type=jamb&type=obj&page=316",
    "correct_answer": "B",
    "explanation": "Division of labour refers to the practice of breaking down a complex task or job into smaller, specialized tasks or processes. Each individual or group focuses on performing a specific task or process, which leads to increased efficiency and productivity. This concept was popularized by the economist Adam Smith in his book \"The Wealth of Nations\" and i widely used in various industries and organizations.",
    "year": "2024"
  },
  {
    "number": "1580",
    "text": "Which of the following is NOT regarded as a welfare service in an organization?",
    "options": {
      "A": "training",
      "B": "medical facilities",
      "C": "transportation",
      "D": "recreational facilities"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70953?exam_type=jamb&type=obj&page=316",
    "correct_answer": "A",
    "explanation": "Welfare services in an organization typically refer to the initiatives and benefits provided to employees to enhance their well-being and quality of life. They are designed to support employees beyond their regular compensation and foster a positive work environment.",
    "year": "2024"
  },
  {
    "number": "1581",
    "text": "The policy designed to accelerate the greater participation of Nigerians in the ownership and management of business enterprises in Nigeria is called",
    "options": {
      "A": "nationalisation",
      "B": "indigenity",
      "C": "commercialization",
      "D": "industrialization"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70954?exam_type=jamb&type=obj&page=317",
    "correct_answer": "B",
    "explanation": "Indigenization refers to a policy or set of measures aimed at promoting and increasing the participation of indigenous people, in this case, Nigerians, in the ownership and management of businesses within their country. It involves creating opportunities, providing incentives, and implementing regulations to ensure that a significant portion of the economy is controlled by Nigerian citizens.",
    "year": "2024"
  },
  {
    "number": "1582",
    "text": "Which of these is used in calculating working capital?",
    "options": {
      "A": "furniture and fittings",
      "B": "stock of raw material",
      "C": "machinery",
      "D": "office equipment"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70955?exam_type=jamb&type=obj&page=317",
    "correct_answer": "B",
    "explanation": "Working capital is the measure of a company's short-term liquidity and its ability to cover its day-to-day operational expenses. It is calculated by subtracting current liabilities from current assets. Current assets include items that are expected to be converted into cash within one year or the operating cycle of the business, whichever is longer.",
    "year": "2024"
  },
  {
    "number": "1583",
    "text": "Obi received a cheque for #1000 from Mr. Ade and this cheque was stolen. He must",
    "options": {
      "A": "inform Mr. Ade to tell his bank to stop payment",
      "B": "inform his bank to stop payment",
      "C": "simply ask Mr. Ade for another cheque",
      "D": "tell his bank to add the amount to his bank balance"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70956?exam_type=jamb&type=obj&page=317",
    "correct_answer": "B",
    "explanation": "When a cheque is stolen, it is crucial to take immediate action to prevent any unauthorized transactions. By informing his bank to stop payment on the stolen cheque, Obi can protect himself from any potential financial loss or fraudulent activity. The bank can then put a stop payment order on the cheque, ensuring that it cannot be cashed or processed.",
    "year": "2024"
  },
  {
    "number": "1584",
    "text": "A contract in which all parties to the contract have carried out their obligation is said to be terminated by",
    "options": {
      "A": "performance",
      "B": "breach of contract",
      "C": "operation of the law",
      "D": "frustration"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70958?exam_type=jamb&type=obj&page=317",
    "correct_answer": "A",
    "explanation": "When all parties to a contract have fulfilled their obligations as stated in the contract, the contract is considered to be terminated by performance. Performance refers to the complete and satisfactory fulfillment of the terms, conditions, an obligations outlined in the contract by all parties involved. Once performance is achieved, the contract is considered to be fully executed and no longer in effect.",
    "year": "2024"
  },
  {
    "number": "1585",
    "text": "The deliberate throwing of some goods into the sea to prevent the ship from sinking is an example of",
    "options": {
      "A": "constructive total loss",
      "B": "an actual total loss",
      "C": "a general average loss",
      "D": "a partial loss"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70959?exam_type=jamb&type=obj&page=317",
    "correct_answer": "C",
    "explanation": "In maritime law, a general average loss refers to a situation where sacrifices or expenses are intentionally incurred to preserve the common maritime adventure. When a ship is in peril, and goods or cargo are thrown overboard as a deliberate act to save the ship and the remaining cargo, it is considered a general average loss. The loss or damage is shared proportionally among the shipowner, cargo owners, and other parties involved in the maritime venture.",
    "year": "2024"
  },
  {
    "number": "1586",
    "text": "Which of the following is NOT part of the marketing mix?",
    "options": {
      "A": "place",
      "B": "promotion",
      "C": "price",
      "D": "personnel"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70961?exam_type=jamb&type=obj&page=318",
    "correct_answer": "D",
    "explanation": "Personnel, which refers to the individuals or employees involved in the marketing and sales process, is not typically considered one of the elements of the marketing mix. While personnel play a crucial role in delivering the marketing message and providing customer service, they are not one of the core components of the marketing mix concept.The marketing mix are: price, place, product and place which are also known as the 4P's of marketing.",
    "year": "2024"
  },
  {
    "number": "1587",
    "text": "Shares are said to be sold at a discount when they are sold",
    "options": {
      "A": "below par",
      "B": "to the public",
      "C": "at par",
      "D": "above par"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70962?exam_type=jamb&type=obj&page=318",
    "correct_answer": "A",
    "explanation": "When shares are sold at a discount, it means that the selling price of the shares is lower than their par value. The par value is the nominal value assigned to each share by the company at the time of its incorporation. Selling shares below par value can happen for various reasons, such as market conditions, financial considerations, or to attract investors.",
    "year": "2024"
  },
  {
    "number": "1588",
    "text": "When the price quoted includes all the cost to the actual destination, that is, from the seller's warehouse to the buyer's warehouse. it is called",
    "options": {
      "A": "loco price",
      "B": "franco",
      "C": "carriage paid",
      "D": "cash on delivery"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70964?exam_type=jamb&type=obj&page=318",
    "correct_answer": "B",
    "explanation": "The term \"franco\" or \"franco destination\" indicates that the seller is responsible for all shipping and delivery costs associated with transporting the goods from their warehouse to the buyer's warehouse. It means that the price quoted includes the cost of carriage, insurance, and any other charges required to deliver the goods to the specified destination.",
    "year": "2024"
  },
  {
    "number": "1589",
    "text": "The body charged with the responsibility monitoring the quality of goods supplied is the",
    "options": {
      "A": "manufacturers' association",
      "B": "chamber of commerce",
      "C": "Nigerian standards organization",
      "D": "consumers' association"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70965?exam_type=jamb&type=obj&page=318",
    "correct_answer": "C",
    "explanation": "The Nigerian Standards Organization, also known as the Standards Organization of Nigeria (SON), is the body in Nigeria that is responsible for the development and enforcement of standards for goods, products, and services. It ensures that the quality of goods supplied in Nigeria meets the required standards and specifications.",
    "year": "2024"
  },
  {
    "number": "1590",
    "text": "The difference between the higher prices and the lower prices quoted for shares and stocks at the stock exchange is known as",
    "options": {
      "A": "commission",
      "B": "brokerage",
      "C": "interest",
      "D": "jobbers turn"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70968?exam_type=jamb&type=obj&page=318",
    "correct_answer": "D",
    "explanation": "This represented the profit a jobber earned by buying from a seller at a lower price (bid) and then selling to a buyer at a higher price (ask). This spread compensated the jobber for taking on the risk of holding inventory (shares) and facilitating trades.",
    "year": "2024"
  },
  {
    "number": "1591",
    "text": "Stock exchange quoted the shares of ABC Plc at #0.75K for #1.25K per share. This means the shares were sold at a",
    "options": {
      "A": "par value",
      "B": "premium",
      "C": "gain",
      "D": "loss"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/70999?exam_type=jamb&type=obj&page=319",
    "correct_answer": "B",
    "explanation": "When shares are quoted at a price higher than their par value or initial offering price, it is considered a premium. In this case, the quoted price of #1.25K per share is higher than the par value or the original offering price, which indicates that the shares were sold at a premium",
    "year": "2024"
  },
  {
    "number": "1592",
    "text": "The components of a balance of payments account are",
    "options": {
      "A": "capital, current and fixed deposit",
      "B": "current, capital and monetary movement",
      "C": "capital, savings and fixed deposit",
      "D": "current, savings and monetary movement"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71000?exam_type=jamb&type=obj&page=319",
    "correct_answer": "B",
    "explanation": "The balance of payments (BOP) is a record of all economic transactions between residents of one country and residents of other countries over a specific period. It is divided into three main components, which are: Current, Capital and Monetary movement (financial) account.",
    "year": "2024"
  },
  {
    "number": "1593",
    "text": "Ships that pick up cargo from any port and travels anytime are called",
    "options": {
      "A": "ferries",
      "B": "tankers",
      "C": "tramps",
      "D": "steamers"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71001?exam_type=jamb&type=obj&page=319",
    "correct_answer": "C",
    "explanation": "Tramp ships, also known as tramp steamers, are cargo vessels that do not have fixed schedules or routes. They operate o an \"as-needed\" basis, picking up cargo from any port where there is a demand and traveling at any time as required. Tramp ships are flexible in terms of their destinations and timing, allowing them to transport cargo to various locations based on market conditions and specific shipping requirements.",
    "year": "2024"
  },
  {
    "number": "1594",
    "text": "Which of the following advertising media preselects its readership through the nature of its content?",
    "options": {
      "A": "Magazine",
      "B": "Billboard",
      "C": "Hand bill",
      "D": "Newspaper"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71003?exam_type=jamb&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "Magazines are a form of advertising media that preselects its readership through the nature of its content. Magazines typically cater to specific interests, hobbies, industries, or demographics. They offer specialized content that attracts a particular target audience. Advertisers often choose to place their ads in magazines that align with their target market t ensure their message reaches the desired audience. By selecting magazines with content relevant to their products or services, advertisers can effectively reach a preselected readership likely to have an interest in their offerings.",
    "year": "2024"
  },
  {
    "number": "1595",
    "text": "Branding is the assigning of trade marks to goods for the purpose of......... by the public.",
    "options": {
      "A": "demand",
      "B": "replacement",
      "C": "stabilization",
      "D": "identification"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71005?exam_type=jamb&type=obj&page=319",
    "correct_answer": "D",
    "explanation": "Branding involves the creation and application of distinctive trade marks (such as logos, names, symbols, or slogans) to goods or services. The primary purpose of branding is to enable the identification and differentiation of products or services from competitors in the marketplace. By associating specific trade marks with goods, branding helps consumer identify and recognize a particular product or service, thereby distinguishing it from others. Effective branding can create a unique and recognizable identity for a product or company, contributing to brand loyalty and influencing consumer purchasing decisions.",
    "year": "2024"
  },
  {
    "number": "1596",
    "text": "Which of the following services is NOT rendered by NITEL?",
    "options": {
      "A": "Data Transmission",
      "B": "Recorded Delivery",
      "C": "Satellite",
      "D": "Telex"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71006?exam_type=jamb&type=obj&page=320",
    "correct_answer": "B",
    "explanation": "NITEL was the national telecommunications company of Nigeria. While it provided various telecommunications services, including telephone services, data transmission, satellite communications, and telex services, it did not offer recorded delivery services.",
    "year": "2024"
  },
  {
    "number": "1597",
    "text": "The act of being on one job for expertise is called",
    "options": {
      "A": "separation of power",
      "B": "immobility",
      "C": "independence",
      "D": "specialization"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71008?exam_type=jamb&type=obj&page=320",
    "correct_answer": "D",
    "explanation": "Specialization refers to the process where individuals or organizations focus on a specific area of expertise or a particular task. It involves dedicating time, effort, and resources to develop specialized skills and knowledge in a particular field or job. By specializing, individuals or organizations aim to become more efficient and productive in their chosen area, as they can focus on developing expertise and improving their performance in that specific domain.",
    "year": "2024"
  },
  {
    "number": "1598",
    "text": "Which type of advertisement induces consumer to purchase the goods he does not need?",
    "options": {
      "A": "Specific",
      "B": "Informative",
      "C": "Persuasive",
      "D": "Descriptive"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71009?exam_type=jamb&type=obj&page=320",
    "correct_answer": "C",
    "explanation": "Persuasive advertisements are designed to influence consumer behavior and persuade individuals to make a purchase. They often employ various techniques, such as emotional appeals, attractive visuals, catchy slogans, endorsements, and exaggerated claims, to create a desire for a product or service. In some cases, persuasive advertisements may convince consumers to buy goods they do not necessarily need or had not considered before.",
    "year": "2024"
  },
  {
    "number": "1599",
    "text": "Tariff can be defined as a compulsory levy on",
    "options": {
      "A": "import and export",
      "B": "foreign exchange earnings",
      "C": "imported goods only",
      "D": "foreigners working in Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71011?exam_type=jamb&type=obj&page=320",
    "correct_answer": "C",
    "explanation": "A tariff is a tax or duty imposed by a government on goods that are imported into a country. It is a form of trade barrier that increases the cost of imported products, making them less competitive compared to domestically produced goods. Tariffs are typically levied on specific goods or categories of goods and are collected at the border when the goods enter the country.",
    "year": "2024"
  },
  {
    "number": "1600",
    "text": "Which of the following is NOT a credit instrument?",
    "options": {
      "A": "Bill of Exchange",
      "B": "Bank Notes",
      "C": "Cheques",
      "D": "Bill of Lading"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71014?exam_type=jamb&type=obj&page=320",
    "correct_answer": "D",
    "explanation": "A bill of lading is a document issued by a carrier (such as a shipping company) to acknowledge the receipt of goods and provide evidence of the contract of carriage. It serves as a receipt for the goods being transported and contains information about the shipment, such as the type of goods, quantity, and destination. However, a bill of lading is not considered a credit instrument.",
    "year": "2024"
  },
  {
    "number": "1601",
    "text": "Transfer of ownership of goods sold under Hire Purchase System takes place when",
    "options": {
      "A": "two instalment have been",
      "B": "a quarter of the total price is",
      "C": "half of the total price is paid",
      "D": "the final instalment is paid"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71015?exam_type=jamb&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "In a Hire Purchase System, the buyer agrees to make a series of payments or installments over a specified period to the seller or financing entity. The buyer has possession of the goods during the payment period but does not have legal ownership until the final payment is made. Once the final installment is paid, the ownership of the goods is transferred t the buyer, and they become the legal owner.",
    "year": "2024"
  },
  {
    "number": "1602",
    "text": "The document which gives complete information about the goods sold is the",
    "options": {
      "A": "invoice",
      "B": "order form",
      "C": "delivery note",
      "D": "bill of exchange"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71016?exam_type=jamb&type=obj&page=321",
    "correct_answer": "A",
    "explanation": "An invoice is a document provided by a seller to a buyer that outlines the details of a transaction, including the goods or services sold, quantities, prices, payment terms, and any applicable taxes or fees. It serves as a formal request for payment and provides complete information about the goods or services purchased. The invoice is typically sent to the buyer after the goods have been delivered or the services have been rendered.",
    "year": "2024"
  },
  {
    "number": "1603",
    "text": "A typical example of an event covered by an Assurance Policy is",
    "options": {
      "A": "accident",
      "B": "death",
      "C": "burglary",
      "D": "fire"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71017?exam_type=jamb&type=obj&page=321",
    "correct_answer": "B",
    "explanation": "Assurance policies, commonly known as life insurance policies, provide financial protection to the policyholder's beneficiaries in the event of their death. Upon the death of the insured person, the policy pays out a predetermined sum of money to the designated beneficiaries. This payout is intended to provide financial support to the family or dependents of the deceased.",
    "year": "2024"
  },
  {
    "number": "1604",
    "text": "The functions of public corporations include the following EXCEPT",
    "options": {
      "A": "providing essential services to the public",
      "B": "maximizing profits for the board members",
      "C": "providing even development",
      "D": "providing employment opportunities"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71018?exam_type=jamb&type=obj&page=321",
    "correct_answer": "B",
    "explanation": "Public corporations are government-owned entities established to undertake specific activities or provide certain services on behalf of the public. Their primary objectives differ from those of private corporations, as they are generally not focused on maximizing profits for board members or shareholders. Instead, public corporations are typically driven by public interest and the provision of essential services.",
    "year": "2024"
  },
  {
    "number": "1605",
    "text": "Which of the following forms part of a company's Article of Association?",
    "options": {
      "A": "Nature and object of the business",
      "B": "Registered office",
      "C": "Goodwill and status of shareholders",
      "D": "Name of the company"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71019?exam_type=jamb&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "The name of the company is an essential component of the Articles of Association. It specifies the legal name under which the company operates and is registered.",
    "year": "2024"
  },
  {
    "number": "1606",
    "text": "A wholesaler who acts as an agent on behalf of the owner of the goods in buying or selling for a commission proportionate to the value of the transaction is called a",
    "options": {
      "A": "commissioned agent",
      "B": "del-credere agent",
      "C": "factor",
      "D": "speculator"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71020?exam_type=jamb&type=obj&page=322",
    "correct_answer": "C",
    "explanation": "A factor is a type of wholesaler or intermediary who acts as an agent on behalf of the owner of the goods. The factor assists in the buying and selling of goods, typically in large quantities, and earns a commission based on the value of the transaction. Factors primarily operate in the field of financing and trade, providing services such as inventory management, credit assessment, and collection of accounts receivable.",
    "year": "2024"
  },
  {
    "number": "1607",
    "text": "The coming together of two or more firms with each of them losing its identity is known as",
    "options": {
      "A": "holding",
      "B": "consortium",
      "C": "cartel",
      "D": "amalgamation"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71021?exam_type=jamb&type=obj&page=322",
    "correct_answer": "D",
    "explanation": "Amalgamation refers to the process of combining two or more companies into a single entity, where the individual firms lose their separate identities and form a new entity. In an amalgamation, the combining firms merge their assets, liabilities, and operations to create a new company. This new company assumes the rights and obligations of the merged entities, and the original companies cease to exist as independent entities.",
    "year": "2024"
  },
  {
    "number": "1608",
    "text": "Use the information below to answer this question.\nAisha sold her wristwatch to Halima for #2,000.00 and she paid. The sum of #2,000.00 is the",
    "options": {
      "A": "entitlement",
      "B": "consideration",
      "C": "money",
      "D": "fees"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71022?exam_type=jamb&type=obj&page=322",
    "correct_answer": "B",
    "explanation": "Consideration refers to something of value that is given in exchange for a product, service, or promise. In this case, the # 2,000.00 paid by Halima to Aisha represents the consideration for the purchase of the wristwatch. It is the price or payment that is given by the buyer in exchange for the item being sold.",
    "year": "2024"
  },
  {
    "number": "1609",
    "text": "The term \"consumer sovereignty\" means that the consumer is a",
    "options": {
      "A": "promoter",
      "B": "king",
      "C": "manager",
      "D": "director"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71023?exam_type=jamb&type=obj&page=322",
    "correct_answer": "B",
    "explanation": "Consumer sovereignty is an economic concept that emphasizes the power and authority of consumers in determining what goods and services are produced and offered in the market. It implies that consumer preferences and choices ultimately dictate the production and availability of products. In a market economy, producers and businesses respond t consumer demand and strive to satisfy consumer preferences to maximize their own profits.By referring to the consumer as a \"king,\" the term highlights the idea that consumers have the power to make decisions and influence the market. It suggests that consumers have the freedom to choose among various products and services, and their preferences and purchasing decisions have a significant impact on the success or failure of businesses.",
    "year": "2024"
  },
  {
    "number": "1610",
    "text": "The activities concerned with changing of raw materials into finished products belong to __occupation.",
    "options": {
      "A": "commercial",
      "B": "extractive",
      "C": "constructive",
      "D": "manufacturing"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71025?exam_type=jamb&type=obj&page=322",
    "correct_answer": "D",
    "explanation": "Manufacturing refers to the process of transforming raw materials or components into finished goods through various production activities such as processing, assembling, fabricating, or refining. It involves the conversion of inputs into tangible products or goods that are ready for distribution and sale.",
    "year": "2024"
  },
  {
    "number": "1611",
    "text": "The following are functions of marketing EXCEPT",
    "options": {
      "A": "packaging",
      "B": "distribution",
      "C": "insurance",
      "D": "advertising"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71030?exam_type=jamb&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "Marketing involves various activities aimed at promoting and selling products or services to customers. It encompasses a wide range of functions and processes to create, communicate, and deliver value to customers. However, insurance is not typically considered a direct function of marketing. Insurance is a separate industry that provides risk management and financial protection services, which are not directly related to the core functions of marketing.",
    "year": "2024"
  },
  {
    "number": "1612",
    "text": "The documents sent by the suppliers of good to a prospective buyer, informing him of what to pay if he buys the good is",
    "options": {
      "A": "credit note",
      "B": "advice note",
      "C": "invoice",
      "D": "debt note"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71031?exam_type=jamb&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "An invoice is a document sent by a supplier to a buyer that provides detailed information about a sale transaction. It includes the quantity, description, and price of the goods or services being sold, as well as any applicable taxes, discount or additional charges. An invoice serves as a request for payment from the buyer and provides the buyer with the necessary information to make a payment for the goods or services received or to be received.",
    "year": "2024"
  },
  {
    "number": "1613",
    "text": "Departmental store, supermarket and chain store are examples of",
    "options": {
      "A": "small scale retailers",
      "B": "medium scale producers",
      "C": "large scale retailers",
      "D": "large scale whole-salers"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71032?exam_type=jamb&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "Large-scale retailers are businesses that engage in the sale of goods directly to consumers in significant quantities. They typically operate multiple outlets or stores, have a wide range of products, and offer various services to customers. Departmental stores, supermarkets, and chain stores are all examples of large-scale retailers that serve a significant customer base and offer a diverse selection of products in a retail setting.",
    "year": "2024"
  },
  {
    "number": "1614",
    "text": "The rules and regulations guiding the conduct of business transactions are known as law",
    "options": {
      "A": "criminal",
      "B": "common",
      "C": "contract",
      "D": "commercial"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71033?exam_type=jamb&type=obj&page=323",
    "correct_answer": "D",
    "explanation": "Commercial law, also referred to as business law or mercantile law, encompasses the legal principles and regulations tha govern business and commercial transactions. It provides a framework for conducting business activities, regulating contracts, resolving disputes, and ensuring fair practices in the business environment.",
    "year": "2024"
  },
  {
    "number": "1615",
    "text": "The principle of insurance which ensures that an individual is restored to his former position after suffering a loss is",
    "options": {
      "A": "utmost good faith",
      "B": "insurable interest",
      "C": "indemnity",
      "D": "subrogation"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71035?exam_type=jamb&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "The principle of indemnity in insurance states that the insured should be compensated for the actual financial loss suffered due to an insured event, up to the extent of the policy coverage. The purpose of indemnity is to place the insure in the same financial position as they were before the loss occurred, without making a profit from the insurance claim. With indemnity, the insured is not allowed to gain financially from the insurance policy but is entitled to receive compensation that helps restore them to their pre-loss condition. The compensation is typically based on the actual value of the loss or the cost of replacing or repairing the damaged property.",
    "year": "2024"
  },
  {
    "number": "1616",
    "text": "The aid to trade which enables producer and consumer to transact business without physical contact is known as",
    "options": {
      "A": "tourism",
      "B": "communication",
      "C": "advertising",
      "D": "insurance"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71036?exam_type=jamb&type=obj&page=324",
    "correct_answer": "B",
    "explanation": "Communication plays a vital role in enabling producers and consumers to interact, exchange information, and conduct business without the need for physical contact. Through various means of communication, such as telephone, email, online platforms, and other digital channels, producers and consumers can communicate and engage in business transactions remotely.",
    "year": "2024"
  },
  {
    "number": "1617",
    "text": "The association that encourages savings for the benefit of its members is known as",
    "options": {
      "A": "Consumer association",
      "B": "Credit and thrift co-operative society",
      "C": "Consumer co-operative society",
      "D": "Producer co-operative society"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71037?exam_type=jamb&type=obj&page=324",
    "correct_answer": "B",
    "explanation": "A credit and thrift co-operative society is an organization that promotes savings and provides credit facilities to its members. It operates on the principle of pooling members' savings and using those funds to offer loans and other financial services to the members. The primary objective of a credit and thrift co-operative society is to encourage thrift and savings among its members and provide them access to affordable credit.",
    "year": "2024"
  },
  {
    "number": "1618",
    "text": "Bonded warehouse is controlled and supervised by",
    "options": {
      "A": "customs",
      "B": "navy",
      "C": "immigration",
      "D": "police"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71038?exam_type=jamb&type=obj&page=324",
    "correct_answer": "A",
    "explanation": "A bonded warehouse is a secured facility where goods are stored under the supervision and control of customs authorities. It is a facility authorized by the government where imported goods can be stored before they are cleared through customs and released into the local market. The purpose of a bonded warehouse is to provide a secure storage location for goods while customs duties, taxes, or other regulatory requirements are being addressed.",
    "year": "2024"
  },
  {
    "number": "1619",
    "text": "The advertising medium which uses electric current in bulbs is referred to as",
    "options": {
      "A": "posters",
      "B": "television",
      "C": "neon signs",
      "D": "bill boards"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71039?exam_type=jamb&type=obj&page=324",
    "correct_answer": "C",
    "explanation": "Neon signs are advertising signs that use electric current in bulbs filled with neon gas or other gases to create bright anċ vibrant displays. The electric current passes through the gas-filled tubes, causing them to emit light of various colors. Neon signs are commonly used for outdoor advertising on buildings, storefronts, and billboards to attract attention and promote businesses or products.",
    "year": "2024"
  },
  {
    "number": "1620",
    "text": "Which of these is NOT a governments legislation to protect the consumer?",
    "options": {
      "A": "Foods and drugs",
      "B": "Weight and measure",
      "C": "Privatization and commercialization",
      "D": "Trade description"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71040?exam_type=jamb&type=obj&page=324",
    "correct_answer": "C",
    "explanation": "Privatization and commercialization are not specific legislation enacted by governments to protect consumers. Instead, they are policies or strategies related to the ownership and operation of industries and services. Privatization involves transferring ownership or control of government-owned assets or enterprises to private entities, while commercialization refers to making an activity or service more commercial or profit-oriented.",
    "year": "2024"
  },
  {
    "number": "1621",
    "text": "A ship which has no fixed schedule and travels wherever it can find cargoes to carry is a",
    "options": {
      "A": "liner",
      "B": "tanker",
      "C": "tramp",
      "D": "ferry"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71041?exam_type=jamb&type=obj&page=325",
    "correct_answer": "C",
    "explanation": "A tramp ship is a type of cargo ship that operates on the tramp trade. Tramp ships do not have fixed routes or schedules like liners. Instead, they move from port to port based on market demand and available cargoes. Tramp ships are typically chartered by cargo owners or shipping agents for transporting goods on an ad-hoc basis. They provide flexible transportation options for various types of cargo and destinations.",
    "year": "2024"
  },
  {
    "number": "1622",
    "text": "The Nigeria Enterprises promotion Decree brought about policy",
    "options": {
      "A": "nationalization",
      "B": "industrialization",
      "C": "indigenization",
      "D": "privatization"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71042?exam_type=jamb&type=obj&page=325",
    "correct_answer": "C",
    "explanation": "The Nigeria Enterprises Promotion Decree, also known as the Nigerian Indigenization Decree, was enacted in 1972. It aimed to promote the participation and ownership of Nigerians in the country's economic activities by requiring a minimum level of Nigerian equity participation in certain industries and businesses. This policy was implemented as part of Nigeria's broader efforts towards indigenization, which sought to increase local control and ownership of businesses and reduce the dominance of foreign-owned companies.",
    "year": "2024"
  },
  {
    "number": "1623",
    "text": "In the event of winding up of a company, who among the following is paid last?",
    "options": {
      "A": "Preference Shareholders",
      "B": "Ordinary shareholders",
      "C": "Cumulative preference shareholders",
      "D": "Debenture holders"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71043?exam_type=jamb&type=obj&page=325",
    "correct_answer": "B",
    "explanation": "Ordinary shareholders have the lowest priority in the distribution of assets during the winding up of a company. They ar entitled to receive any remaining assets after all the other creditors and obligations have been satisfied. Preference shareholders, debenture holders, and trade creditors would typically have higher priority for payment than ordinary shareholders",
    "year": "2024"
  },
  {
    "number": "1624",
    "text": "Gross profit can be calculated as",
    "options": {
      "A": "Sales minus purchases",
      "B": "Sales minus cost of good sold",
      "C": "cost of goods available for sales minus sale",
      "D": "Cost of good sold minus cost of goods available for sale"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71044?exam_type=jamb&type=obj&page=325",
    "correct_answer": "B",
    "explanation": "Gross profit represents the difference between sales revenue and the direct cost of producing or acquiring the goods solc during a specific period. To calculate gross profit, subtract the cost of goods sold (COGS) from the sales revenue. This calculation provides a measure of the profitability of a company's core operations before considering other expenses such as operating expenses, taxes, and interest.",
    "year": "2024"
  },
  {
    "number": "1625",
    "text": "One of the easiest means of transporting petroleum product is by",
    "options": {
      "A": "pipeline",
      "B": "air",
      "C": "road",
      "D": "rail"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71045?exam_type=jamb&type=obj&page=325",
    "correct_answer": "A",
    "explanation": "Transporting petroleum products through pipelines is a common and efficient method. Pipelines provide a reliable and cost-effective means of transporting large volumes of petroleum products over long distances. They are designed to transport liquids, including crude oil and refined petroleum products, through a network of interconnected pipes. Pipelines offer advantages such as high capacity, continuous flow, reduced handling, and lower transportation costs compared to other means of transportation.",
    "year": "2024"
  },
  {
    "number": "1626",
    "text": "A dealer who buys securities at low prices in anticipation of reselling them at higher prices is called a",
    "options": {
      "A": "jobber",
      "B": "bull",
      "C": "broker",
      "D": "bear"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71046?exam_type=jamb&type=obj&page=326",
    "correct_answer": "B",
    "explanation": "A speculator who buys securities with the intention of reselling them at a high price. If the price falls, he loses and has the option to carry forward the transaction to the next settlement by paying a charge termed \"Contango\".",
    "year": "2024"
  },
  {
    "number": "1627",
    "text": "The term \"caveat emptor\" implies that",
    "options": {
      "A": "goods have been transferred to the buyer",
      "B": "let the buyer beware",
      "C": "let the seller beware",
      "D": "goods are still with the seller"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71048?exam_type=jamb&type=obj&page=326",
    "correct_answer": "B",
    "explanation": "\"Caveat emptor\" is a Latin phrase that translates to \"let the buyer beware\" in English. It represents the principle that places the responsibility on the buyer to carefully examine and assess the quality, condition, and suitability of a product or service before making a purchase. It suggests that the buyer should be cautious and aware of any potential risks or defects associated with the product, as the seller may not be obligated to disclose all relevant information.",
    "year": "2024"
  },
  {
    "number": "1628",
    "text": "Which of the following types of insurance is usually excluded from the principle of indemnity?",
    "options": {
      "A": "Fire",
      "B": "Fidelity Guarantee",
      "C": "Marine",
      "D": "Life"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71049?exam_type=jamb&type=obj&page=326",
    "correct_answer": "D",
    "explanation": "The principle of indemnity in insurance refers to the principle that an insured party should be compensated for the actual financial loss suffered, up to the limit of the policy coverage. The purpose is to restore the insured to the same financial position they were in before the loss occurred.While most types of insurance, including fidelity guarantee, fire, marine, and motor vehicle insurance, typically operate based on the principle of indemnity, life insurance is an exception. Life insurance is not based on indemnity because it involves the payment of a predetermined sum (death benefit) upon the insured's death, rather than compensating for a financial loss directly. Life insurance provides financial protection to the beneficiaries of the insured, and the amount paid out is not necessarily related to the actual financial loss suffered.",
    "year": "2024"
  },
  {
    "number": "1629",
    "text": "A type of partnership in which all partners have unlimited liability and jointly manage the business is known as partnership.",
    "options": {
      "A": "ordinary",
      "B": "nominal",
      "C": "unlimited",
      "D": "Limited"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71050?exam_type=jamb&type=obj&page=326",
    "correct_answer": "C",
    "explanation": "In an unlimited partnership, all partners have unlimited personal liability for the debts and obligations of the partnership. This means that if the partnership is unable to meet its financial obligations, the partners' personal assets can be used to satisfy those debts. Additionally, in an unlimited partnership, all partners have an equal say in the management and decision-making of the business.",
    "year": "2024"
  },
  {
    "number": "1630",
    "text": "An agent held responsible for non-payment of goods bought by the customer he introduced to his principal is called agent",
    "options": {
      "A": "general",
      "B": "special",
      "C": "sales",
      "D": "del-credere"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/71051?exam_type=jamb&type=obj&page=326",
    "correct_answer": "D",
    "explanation": "A del-credere agent is a type of agent who guarantees or assumes responsibility for the payment of goods or services by customers to the principal. In other words, if the customer fails to pay for the goods purchased, the del-credere agent becomes liable for the payment to the principal. This additional liability is typically compensated by the del-credere agent through a higher commission or fee.",
    "year": "2024"
  }
]