[
  {
    "number": "887",
    "text": "The number of Muslims in the battle of Badr was 313 while that of Makkan force was_",
    "options": {
      "A": "1,000",
      "B": "2,000",
      "C": "100,000",
      "D": "300"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65548?exam_type=jamb&type=obj&page=178",
    "correct_answer": "A",
    "explanation": "All of the clans of the Quraish except the Banu 'Adi quickly assembled an excited army of around 1300 men, 100 horses and a large number of camels. Moving swiftly towards Badr, they passed the valleys of 'Usfan, Qadid and al-Juhfah. At al-Juhfah, another messenger from Abu Sufyan informed them of the safety of their merchandise and wealth. Upon receiving this message, the Makkan army expressed delight and showed a desire to return home. Abu Jahl was not interested in returning and insisted on proceeding to Badr, and holding a feast there to show the Muslims and the surrounding tribes that they were superior. Despite Abu Jahl's threat and insistence, the Banu Zahrah, numbering around 300, broke away from the army and returned to Makkah, on the advice of Al-Akhnas ibn Shurayq",
    "year": "2012"
  },
  {
    "number": "888",
    "text": "The number one pillar of Islam is ______",
    "options": {
      "A": "Iman",
      "B": "Ihsan",
      "C": "Imanan",
      "D": "Sa'afih"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65549?exam_type=jamb&type=obj&page=178",
    "correct_answer": "A",
    "explanation": "The first pillar of Islam is the Shahada, the assertion of faith, combining the themes of unity and mercy that are found in the Quran. Iman (إِيمَان ʾīmān, faith or belief) in Islamic theology denotes a believer's faith in the metaphysical aspects of Islam. Its most simple definition is the belief in the six articles of faith, known as arkān al-īmān.",
    "year": "2012"
  },
  {
    "number": "889",
    "text": "The Holy Book given to Prophet Muhammed (SAW) was _____",
    "options": {
      "A": "Injil",
      "B": "Zaburah",
      "C": "Tawrah",
      "D": "Al - Quran"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65551?exam_type=jamb&type=obj&page=178",
    "correct_answer": "D",
    "explanation": "The Holy Quran is a compilation of the verbal revelations given to the Holy Prophet Muhammad(sa) over a period of twenty three years. The Holy Quran is the Holy Book or the Scriptures of the Muslims. It lays down for them the law and commandments, codes for their social and moral behaviour, and contains a comprehensive religious philosophy. The language of the Quran is Arabic.",
    "year": "2012"
  },
  {
    "number": "890",
    "text": "Magic is originated from _____",
    "options": {
      "A": "Nas",
      "B": "Shaytan",
      "C": "Allah",
      "D": "Angel"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65553?exam_type=jamb&type=obj&page=178",
    "correct_answer": "B",
    "explanation": "According to Quran 15:16-18 shayatin rise against heaven in attempt to steal its secrets, but are chased by meteorites, however, unlike the jinn, may partly succeed, snapping some information. Q. 2:102 mentions the shayatin as the teachers of sorcery. Quran 37:62-68 describes the fruits of Zaqqum, the tree of hell, as heads of shayatin. Surah 6:112 mentions shayatin among Ins (humans) and jinn (jinn). According to some exegetes, the term is used as an epithet to describe rebellious men and jinn, but to others, referring to shayatin who tempt among the jinn, and whose, who tempt among humans.",
    "year": "2012"
  },
  {
    "number": "891",
    "text": "A pilgrim circumnutates around the Ha'abah _____",
    "options": {
      "A": "Three times",
      "B": "Six times",
      "C": "Seven times",
      "D": "Eight times"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65554?exam_type=jamb&type=obj&page=179",
    "correct_answer": "C",
    "explanation": "Ṭavaf (Arabic: طَوَاف‎') is one of the Islamic rituals of pilgrimage in Mecca, the Hejaz, Saudi Arabia. During the Hajj and Umrah, Muslims are to go around the Kaaba (the most sacred site in Islam) seven times, in a counterclockwise direction; the first three circuits at a hurried pace on the outer part of the crowd, followed by four times closer to the Kaaba at a leisurely pace. The circling demonstrate the unity of the believers in the worship of the One God, as they move in harmony together around the Kaaba, while supplicating to God",
    "year": "2012"
  },
  {
    "number": "892",
    "text": "The Prophet (SAW) died in which year?",
    "options": {
      "A": "632 C.E",
      "B": "610 C.E",
      "C": "519 E",
      "D": "517 C.E"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65556?exam_type=jamb&type=obj&page=179",
    "correct_answer": "A",
    "explanation": "Prophet Muhammad(SAW) (born c. 570, Mecca, Arabia [now in Saudi Arabia]-died June 8, 632, Medina), the founder of Islam and the proclaimer of the Qurʾān. Muhammad is traditionally said to have been born in 570 in Mecca and to have died in 632 in Medina, where he had been forced to emigrate to with his adherents in 622.",
    "year": "2012"
  },
  {
    "number": "893",
    "text": "The shortest surah in the Qu'ran is",
    "options": {
      "A": "suratul nas",
      "B": "Suratul Kawthar",
      "C": "Suratul ikhlas",
      "D": "Suratul Falaq"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65557?exam_type=jamb&type=obj&page=179",
    "correct_answer": "B",
    "explanation": "A surah ( Arabic: سُورَة‎) is a chapter of the Quran. There are 114 surahs in the Quran, each divided into ayahs (verses).The chapters or surahs are of unequal length; the shortest chapter (Al-Kawthar) has only three verses while the longest (Al-Baqara) contains 286 verses.",
    "year": "2012"
  },
  {
    "number": "894",
    "text": "Khulafahar Rashidun means ___",
    "options": {
      "A": "A Muslim community",
      "B": "A Muslim Ummah",
      "C": "The Faithful",
      "D": "The rightly guided Khalifa"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65558?exam_type=jamb&type=obj&page=179",
    "correct_answer": "D",
    "explanation": "The Rashidun Caliphs (Rightly Guided Caliphs; Arabic: الخلفاء الراشدون‎ al-Khulafāʾu ar-Rāshidūn), often simply called, collectively, \"the Rashidun\", is a term used in Sunni Islam to refer to the 30-year reign of the first four caliphs (successors) following the death of the Islamic prophet Muhammad, namely: Abu Bakr, Umar, Uthman ibn Affan, and Ali of the Rashidun Caliphate, the first caliphate. The caliphate of Hasan ibn Ali is sometimes also considered to be Rashidun as well but since it was merely a six month period it is not mentioned categorically.",
    "year": "2012"
  },
  {
    "number": "895",
    "text": "Khadija's greatest contribution to the life of Mohammed in Makkah was that she",
    "options": {
      "A": "made him her salesman",
      "B": "made him very rich",
      "C": "gave him moral and financial support",
      "D": "wanted to make him king"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65559?exam_type=jamb&type=obj&page=179",
    "correct_answer": "C",
    "explanation": "Khadījah provided instrumental support in Muhammad's early prophethood. Her wealth allowed him the leisure to meditate, and she reassured him of the authenticity of his first revelations. She is thus often considered the first person to have believed in Muhammad's message. Moreover, she consulted her relative Waraqah ibn Nawfal, who is said to have likened Muhammad's revelations to those of Moses, further providing Muhammad confidence in his revelations.",
    "year": "2012"
  },
  {
    "number": "896",
    "text": "Taharah in Shari'ah is observed in all the following forms except",
    "options": {
      "A": "Wudu",
      "B": "Tayammum",
      "C": "Istijanah",
      "D": "Ihraan496"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65561?exam_type=jamb&type=obj&page=180",
    "correct_answer": "C",
    "explanation": "sa'at al istijabah (a time when du'a is answered).All you have to do is make dua before Maghrib! Note: It's NOT 'Salat' (prayer), it's Sa'at (time) of istijabah (response).",
    "year": "2012"
  },
  {
    "number": "897",
    "text": "As-salam is one of the attributes of Allah which means the _____",
    "options": {
      "A": "Bestowed",
      "B": "Honoured",
      "C": "Source of peace",
      "D": "Fashion"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65562?exam_type=jamb&type=obj&page=180",
    "correct_answer": "C",
    "explanation": "(Q. 59:23) He is Allah: there is no god but He: the King, the Holy, the All-Peace, the Giver of security, the Overseer, the Most Mighty, the Overpowering, the All-Great.Exalted be He from whatever they associate with Him",
    "year": "2012"
  },
  {
    "number": "898",
    "text": "Suratul Quraysh is known as Qu'ran chapter",
    "options": {
      "A": "102",
      "B": "106",
      "C": "104",
      "D": "108"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65564?exam_type=jamb&type=obj&page=180",
    "correct_answer": "B",
    "explanation": "Sūrat Quraysh (Arabic: سورة قريش‎, \"The Quraysh\") is the 106th chapter of the Qur'an consisting of 4 ayat. The surah was titled after the word \"Quraysh\" in the first verse.It urges the Quraysh tribe who dominated Mecca to serve God, who had protected them, for the sake of their own future. It is one of two suras containing 4 ayat; the other is Al-Ikhlas. It forms a pair with the preceding sura, al-Fil, reminding the Quraysh of the favors that Allah had bestowed upon them.",
    "year": "2012"
  },
  {
    "number": "899",
    "text": "A muslim man that hits his left leg against a stone on his way to the market and turns back saying he is unlucky, according to Islamic law, he believes in___",
    "options": {
      "A": "Magic",
      "B": "Allah",
      "C": "Superstition",
      "D": "Witchcraft499"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65565?exam_type=jamb&type=obj&page=180",
    "correct_answer": "C",
    "explanation": "The reality is that amulets, or charms, are not useful and helpful means; they are mere superstition. The Shariah [Islamic law] does not prohibit using worldly means while also acknowledging that core trust and reliance should be placed in God Almighty above any other means. After trust has been placed in God, worldly means can be used but not amulets, bad omens or superstition.It is clear from the Holy Quran that the disbelievers are those who take bad omens:اِنَّا تَطَیَّرْنَا بِکُمْ(They [disbelievers] said, 'Surely we augur evil fortune from you...\")",
    "year": "2012"
  },
  {
    "number": "900",
    "text": "Four revealed books mentioned in the Qu'ran are",
    "options": {
      "A": "Injil, Tawrah, Zaburah, Kitab",
      "B": "Injil, Furqan, Zaburah, Qu'ran",
      "C": "Tawrah, Furqan, Zaburah Injil",
      "D": "Injil, Tawrah, Zaburah, Qu'ran"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65566?exam_type=jamb&type=obj&page=180",
    "correct_answer": "D",
    "explanation": "Among the books considered to be revealed, the four mentioned by name in the Quran shareef are the Tawrat (Torah or the Law) revealed to Musa (Moses), the Zabur (Psalms) revealed to Dawud (David), the Injil (the Gospel) revealed to Isa (Jesus).",
    "year": "2012"
  },
  {
    "number": "901",
    "text": "The place where the prophet started receiving the revelations of the Qu'ran is referred to as",
    "options": {
      "A": "Jabal Nur",
      "B": "Makkah",
      "C": "Cave Hirah",
      "D": "Cave thawr476"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65567?exam_type=jamb&type=obj&page=181",
    "correct_answer": "C",
    "explanation": "A cave in Mount Hira (near Mecca) is the location where the Prophet Muhammad (peace be upon him) received his revelations from Allah SWT through the angel Gabriel. Prophet Muhammad (p.b.u.h) lived in this cave while he received messages from God and therefore refrained from leaving for prolonged periods of time. Prophet Muhammad (p.b.u.h) resided here to meditate and contemplate his life and the world around him. He was 40 years old. At this period of his life, solitude became dear to him, and he used to withdraw into seclusion into the cave of Mount Hira and there apply himself to ardent devotions consisting of long vigils and prayers. One night during the last third of the month of Ramadan, the archangel Gabriel revealed on Allah's command the first revelation of the Qur'an.",
    "year": "2012"
  },
  {
    "number": "902",
    "text": "Members of the Prophet's family that embraced Islam the first day did so, on the basis of his",
    "options": {
      "A": "truthfulness and uprightness",
      "B": "wealth and influence",
      "C": "love for them",
      "D": "family relation477"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65569?exam_type=jamb&type=obj&page=181",
    "correct_answer": "A",
    "explanation": "After Muhammad began preaching the message of Islam, members of the other Qurayshite clans increasingly came to feel threatened by Muḥammad. In attempts to quiet him, they pressured Abū Ṭālib to silence his nephew or control him. Despite these pressures, Abu Talib maintained his support of Muḥammad, defending him from the other leaders of the Quraysh. Leaders of the Quraysh directly confronted Abu Talib several times. Abu Talib brushed them off and continued to support Muhammad even when it put a rift between him and the Quraysh",
    "year": "2012"
  },
  {
    "number": "903",
    "text": "The teachings of Uthman b. Fodio are remembered today as it relates to",
    "options": {
      "A": "idol worshiping",
      "B": "marrying more than four wives",
      "C": "all form of syncretism",
      "D": "taxing of farm produce"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65570?exam_type=jamb&type=obj&page=181",
    "correct_answer": "C",
    "explanation": "Dan Fodio wrote more than a hundred books concerning religion, government, culture, and society. He developed a critique of existing African Muslim elites for what he saw as their greed, paganism, violation of the standards of Sharia law, and use of heavy taxation. He encouraged literacy and scholarship, for women as well as men, and several of his daughters emerged as scholars and writers. His writings and sayings continue to be much quoted today, and are often affectionately referred to as Shehu in Nigeria",
    "year": "2012"
  },
  {
    "number": "904",
    "text": "The ruler who instituted Friday prayers in Mali was",
    "options": {
      "A": "Mansa Musa",
      "B": "Mansa Suleiman",
      "C": "Mansa Ule",
      "D": "Mansa Abubakar"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65571?exam_type=jamb&type=obj&page=181",
    "correct_answer": "A",
    "explanation": "Mansa Musa I was the ruler of the Mali Empire in West Africa from 1312 to 1337 CE. Controlling territories rich in gold and copper, as well as monopolising trade between the north and interior of the continent, the Mali elite grew extremely wealthy. A Muslim like his royal predecessors, Mansa Musa brought back architects and scholars from his pilgrimage to Mecca who would build mosques and universities that made such cities as Timbuktu internationally famous.",
    "year": "2012"
  },
  {
    "number": "905",
    "text": "In which Surah is making show in worship condemned",
    "options": {
      "A": "Suratul Fil",
      "B": "Kafirun",
      "C": "Lahab",
      "D": "Ma'un"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65572?exam_type=jamb&type=obj&page=181",
    "correct_answer": "D",
    "explanation": "بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيمِ[In the Name of Allah, the Most Beneficent, the Most Merciful.]1) أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ[Have you seen him who denies the Recompense?]2) فَذَ‌ٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ[That is he who repulses the orphan (harshly),]3) وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ[And urges not on the feeding of Al-Miskîn (the needy),]4) فَوَيْلٌ لِّلْمُصَلِّينَ[So, woe to those performers of Salât (prayers),]5) الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ[Those who delay their Salât (prayer)(from their stated fixed times).]6) الَّذِينَ هُمْ يُرَاءُونَ[Those who do good deeds only to be seen (of men),]7) وَيَمْنَعُونَ الْمَاعُونَ[And withhold Al-Mâ'ûn (small kindnesses).]",
    "year": "2012"
  },
  {
    "number": "906",
    "text": "The revelation of the Qu'ran took a period of ____years.",
    "options": {
      "A": "43",
      "B": "32",
      "C": "21",
      "D": "23"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65573?exam_type=jamb&type=obj&page=182",
    "correct_answer": "D",
    "explanation": "During the 23 years of Muhammad's time as a prophet, the verses of the Quran were memorized as they were revealed, and about 42 scribes wrote the verses on different materials such as paper, cloth, bone fragments and leather.In ancient times, literacy was a skill that few people had and Muhammad himself did not know how to read or write.",
    "year": "2012"
  },
  {
    "number": "907",
    "text": "Mas'uliyyah as a principle of the the Islamic political system is a measure to check",
    "options": {
      "A": "Indiscipline",
      "B": "Rigging",
      "C": "Nepotism",
      "D": "Misappropriation"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65574?exam_type=jamb&type=obj&page=182",
    "correct_answer": "D",
    "explanation": "Mas'uliyyah means a mechanism based on which public affairs are checked with a view to preventing them from misappropriating the resources put in their care.The elements of al-amanah and al-mas'uliyyah refer to something that are granted to a person to be performed or properly cared for and he will be held responsible for errors or treacherous. These elements will help individuals by preventing them from doing something against the attributes of human's character such as treacherous and the like",
    "year": "2012"
  },
  {
    "number": "908",
    "text": "Allah commands Muslims to observe and fulfill agreements with the non-Muslims, if the later do not",
    "options": {
      "A": "infringe on the right of women",
      "B": "observe the five daily prayers",
      "C": "change the language employed",
      "D": "violate the terms of the agreement"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65575?exam_type=jamb&type=obj&page=182",
    "correct_answer": "D",
    "explanation": "According to Quran and Hadith promise keeping has a significant importance and Muslims are ordered to keep their promises. Promises will be asked on the Day of Judgment. Every person or group keeps promises and make agreements at some point in their life which need to be fulfill and not to be break.In Surah Isra' Verse 34 it is mentioned,\"And keep the covenant. Lo! Of the covenant it will be asked.\"",
    "year": "2012"
  },
  {
    "number": "909",
    "text": "During the Jihiliyya era, the Ka'aba was the center of poetic contest at the annual festival called",
    "options": {
      "A": "ijāz",
      "B": "Ukāz",
      "C": "Manāt",
      "D": "ushrah474"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65576?exam_type=jamb&type=obj&page=182",
    "correct_answer": "B",
    "explanation": "Marketplace and site of pre-Islamic fairs and poetry contests in Mecca. Location was tied to the pilgrimage season in pre-Islamic times and served as a place where warring tribes could come together peacefully to worship and trade together. A similar practice was adopted by Muslims on the hajj.",
    "year": "2012"
  },
  {
    "number": "910",
    "text": "In Pre-Islamic Arabia, the Arabs killed their daughters because they",
    "options": {
      "A": "were the weaker sex",
      "B": "were afraid of incest",
      "C": "feared the females would outnumber males",
      "D": "did not participate in wars"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65577?exam_type=jamb&type=obj&page=182",
    "correct_answer": "D",
    "explanation": "When news is brought to one of them, of [the birth of] a female [child], his face darkens, and he is filled with inward grief! With shame does he hide himself from his people, because of the bad news he has received! Shall he keep this [child] despite the contempt [which he feels for it] or shall he bury it in the dust? Oh, evil is indeed whatever they decide!\" - The Quran (16:58-59)",
    "year": "2012"
  },
  {
    "number": "911",
    "text": "The first person who recognized signs of Prophethood on Muhammad (SAW) was a",
    "options": {
      "A": "Christian Monk",
      "B": "Jewish Rabbi",
      "C": "Buddhist Monk",
      "D": "Soothsayer.466"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65579?exam_type=jamb&type=obj&page=183",
    "correct_answer": "A",
    "explanation": "When Muhammad (ﷺ) was about 12 years old, he accompanied his uncle Abu Talib on a trade journey to Syria. In a place called Busra a very interesting incident took place, which caused Abu Talib to return Muhammad to Makkah.On their trade journey they met a Christian monk by the name of Bahira, who lived a simple life in a monastery which contained ancient sacred texts that were not available anywhere else. Bahira had very simple provisions and lived a harsh life, surviving on the bare essentials. His diet was very simple and the clothes he wore were also coarse and well worn. He was looking outside and caught sight of a caravan approaching. His residence was on the main caravan route and he regularly saw caravans passing by, carrying different goods destined to be sold in the great markets of Syria.He noticed that this caravan was different; there was something special about it. He decided to invite the people to a meal and find out more. Bahira sent a message to the caravan that his hospitality was extended to all the members of the caravan. The caravan traders accepted the invitation and arrived at the monk's place.",
    "year": "2012"
  },
  {
    "number": "912",
    "text": "The minimum number of witnesses in an Islamic marriage is",
    "options": {
      "A": "Four males",
      "B": "Three males",
      "C": "Two males",
      "D": "One male"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65581?exam_type=jamb&type=obj&page=183",
    "correct_answer": "C",
    "explanation": "For marriage a minimum of two witnesses is required. These witnesses are not for the bride or for the groom, but they are the witnesses for the marriage of the couple for whom they accept to be the witnesses.Nikah(marriage ceremony) is both a legal ceremony and a public ceremony. According to the Shari`ah, there should be two witnesses for all important legal contracts.Nikahas a public ceremony should also be done in the presence of many people (or at least two as the minimum), so that more people know that this man and this woman have come together as a legally married couple.",
    "year": "2012"
  },
  {
    "number": "913",
    "text": "The term, Shari'ah refers to",
    "options": {
      "A": "A path",
      "B": "Wisdom",
      "C": "Passion",
      "D": "An Idea"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65583?exam_type=jamb&type=obj&page=183",
    "correct_answer": "A",
    "explanation": "Sharia (also known as \"Shariah\" or \"Shari'a\") is an Islamic religious law that governs not only religious rituals but also aspects of day-to-day life in Islam. Sharia, literally translated, means \"the way.\"In the Quran, šarīʿah and its cognate širʿah occur once each, with the meaning \"way\" or \"path\".[25] The word šarīʿah was widely used by Arabic-speaking Jews during the Middle Ages, being the most common translation for the word torah in the 10th-century Arabic translation of the Torah by Saʿadya Gaon.",
    "year": "2012"
  },
  {
    "number": "914",
    "text": "One of the scholars reported to have been imprisoned by his non compromising stance was",
    "options": {
      "A": "Shafi'i",
      "B": "Abu-Hanifah.",
      "C": "Hambali",
      "D": "Māliki b. Anas."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65584?exam_type=jamb&type=obj&page=183",
    "correct_answer": "B",
    "explanation": "In 763, al-Mansur, the Abbasid monarch offered Abu Hanifa the post of Chief Judge of the State, but he declined the offer, choosing to remain independent. His student Abu Yusuf was later appointed Qadi Al-Qudat (Chief Judge of the State) by the Caliph Harun al-Rashid.In his reply to al-Mansur, Abū Ḥanīfah said that he was not fit for the post. Al-Mansur, who had his own ideas and reasons for offering the post, lost his temper and accused Abū Ḥanīfah of lying.\"If I am lying,\" Abū Ḥanīfah said, \"then my statement is doubly correct. How can you appoint a liar to the exalted post of a Chief Qadi (Judge)?\" Incensed by this reply, the ruler had Abū Ḥanīfah arrested, locked in prison and tortured. He was never fed nor cared for. Even there, the jurist continued to teach those who were permitted to come to him.On the 15 Rajab 150(August 15, 767), Abū Ḥanīfah died in prison",
    "year": "2012"
  },
  {
    "number": "915",
    "text": "The entrenchment of an Islamic economic system is aimed at",
    "options": {
      "A": "controlling the world funds .",
      "B": "restricting the unlawful acquisition of wealth",
      "C": "restricting men to particular occupations",
      "D": "promoting equitable distribution of wealth"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65585?exam_type=jamb&type=obj&page=183",
    "correct_answer": "D",
    "explanation": "Because al-adl (justice and fairness) is a basic value of the Islamic economic order, distributive justice is a major concern of the system. Equitable distribution of income and wealth is therefore an objective by itself. Operationally, this is accomplished through certain institutions which form the backbone of the social security in Islam. Examples are a bound.",
    "year": "2012"
  },
  {
    "number": "916",
    "text": "One of the major consequences of ribā is that, it makes people",
    "options": {
      "A": "Wealthy",
      "B": "Lazy",
      "C": "Smart",
      "D": "Parasitic"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65587?exam_type=jamb&type=obj&page=184",
    "correct_answer": "B",
    "explanation": "Riba is forbidden because of the harmful effects that result from it, such as: Economic effects, e.g., keeping money idle and unproductive, and swelling the ranks of the poor; Social effects, e.g., cutting ties, creating enmity and hatred between the poor and the rich, and spreading corruption and promiscuity caused by need; Psychological and spiritual effects, e.g., arrogance, looking down on others, hard-heartedness and exploiting the needs of the poor.The above describes the effects of Riba on the individual level. On the state level, countries are weakened, their resources fall under the control of others, they end up following their enemies' desires, they are robbed of their natural wealth and their problems get even worse. This is what we see happening in reality. We ask Allaah to keep us safe and sound.",
    "year": "2012"
  },
  {
    "number": "917",
    "text": "In Islam, the articles of Imān are",
    "options": {
      "A": "Six",
      "B": "Five",
      "C": "Four",
      "D": "Three"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65589?exam_type=jamb&type=obj&page=184",
    "correct_answer": "A",
    "explanation": "Iman (إِيمَان ʾīmān, faith or belief) in Islamic theology denotes a believer's faith in the metaphysical aspects of Islam. Its most simple definition is the belief in the six articles of faith, known as arkān al-īmān.Faith (iman) breaks down into six axioms:1.Belief in the existence and oneness of God (Allah).2.Belief in the existence of angels.3.Belief in the existence of the books of which God is the author: the Quran (revealed to Muhammad), the Gospel (revealed to Jesus), the Torah (revealed to Moses), and Psalms (revealed to David).4.Belief in the existence of all Prophets: Muhammad being the last of them, Jesus the penultimate, and others sent before them.5.Belief in the existence of the Day of Judgment: in that day, humanity will be divided into two groups: that of paradise and that of hell. These groups are themselves composed of subgroups.6.Belief in the existence of God's predestination, whether it involves good or bad.",
    "year": "2012"
  },
  {
    "number": "918",
    "text": "The presentation of Sermon is an obligation on the Imam when leading",
    "options": {
      "A": "All the prayers",
      "B": "Funeral prayers",
      "C": "Friday prayers",
      "D": "Every prayer on friday"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65591?exam_type=jamb&type=obj&page=184",
    "correct_answer": "C",
    "explanation": "In devotional matters, congregational prayer leader must be just.In politico-religious affairs, such as Friday congregational prayer, the person who delivers the sermon (khutbah) and lead the prayer must be just.",
    "year": "2012"
  },
  {
    "number": "919",
    "text": "One of the conditions that make prayer obligatory on believers is",
    "options": {
      "A": "social status",
      "B": "reciting the Qur'an with proper Tajweed",
      "C": "following pious Imam",
      "D": "attainment of maturity"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65593?exam_type=jamb&type=obj&page=184",
    "correct_answer": "D",
    "explanation": "The obligatory prayer is a primary religious obligation starting at the age of fifteen and it is the most important kind of prayer.The purpose of the obligatory prayer is to foster the development of humility and devotion.The Baháʼí writings strongly warn against neglecting the prayers or minimizing their importance. The obligatory prayers are a personal spiritual obligation, and failure to observe the law is seen to have only a spiritual penalty",
    "year": "2012"
  },
  {
    "number": "920",
    "text": "The supererogatory fasting of Āshura is observed on the",
    "options": {
      "A": "8th of al-muharram",
      "B": "9th of al-Muharram",
      "C": "10th of al-Muharram",
      "D": "11th of al-Muharram"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65596?exam_type=jamb&type=obj&page=184",
    "correct_answer": "C",
    "explanation": "Fasting on 'Ashura'Ashura (10th day of Muharram)This is the tenth day of Muharram, the month of Allah Almighty.This is because the Prophet said: \"And as for fasting on the day of 'Ashura, I expect that Allah Almighty shall forgive the sins of the year prior to it.\" [ Source: Muslim.]The reason for fasting on this day is in accordance with what was related from the authority of 'Abdullah ibn 'Abbas, who said: \"When the Prophet ﷺ arrived at Madinah, he found the Jews fasting on 'Ashura. Then he inquired why (do they fast on that day)? They answered, 'This a good day, the day Allah Almighty saved the children of Israel from their enemy, and as such Prophet Musa (peace be upon him) fasted thereafter (on that day).' Then the Prophet said: 'I have more right to Musa than you.' Then he fasted and ordered the Muslims to fast on that day.",
    "year": "2012"
  },
  {
    "number": "921",
    "text": "At-tashriq are the days of",
    "options": {
      "A": "buying and selling",
      "B": "visits and caring",
      "C": "singing and dancing",
      "D": "eating and drinking."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65598?exam_type=jamb&type=obj&page=185",
    "correct_answer": "D",
    "explanation": "When it is recommended to fastThe Prophet (peace and blessings be upon him) recommended that we fast the three \"white days\" of every lunar month, the day of 'Arafa, 'Ashura (10th of Muharram) and either the day preceding or following it, and the six days from the month of Shawwal, promising a great reward for the person who fasts on any of these days.When it is unlawful to fastIt is unlawful to fast on the following:- 'Eid ul-Fitr.- 'Eid ul-Adha.- Ayam al-Tashreeq (the three days following 'Eid ul-Adha).Ayam al-TashreeqThe Prophet (peace and blessings be upon him) called these the days of food and drink.",
    "year": "2012"
  },
  {
    "number": "922",
    "text": "Islam encourages every Muslim to seek a lawful livelihood through",
    "options": {
      "A": "equitable distribution of wealth",
      "B": "dignity of labour",
      "C": "family inheritance",
      "D": "shared responsibility"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65600?exam_type=jamb&type=obj&page=185",
    "correct_answer": "B",
    "explanation": ":(Qur'an 62:10)But when the Prayer is ended, disperse in the land and seek Allah's Bounty,16 and remember Allah much so that you may prosper.(Qur'an 78:11)and made the day to seek livelihood",
    "year": "2012"
  },
  {
    "number": "923",
    "text": "Islam as a monotheistic religion expects that every faithful follower should",
    "options": {
      "A": "not tell lies",
      "B": "serve Allah without associates",
      "D": "performSalat"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65602?exam_type=jamb&type=obj&page=185",
    "correct_answer": "B",
    "explanation": "Monotheism is perhaps the most important tenet of Islam and is, arguably, the fundamental concept of the religion. In Arabic, monotheism is also known as tawheed, and refers to the uniqueness and supremacy of God, or Allah. In Islam, Allah is the singular master and creator of the universe. Tawheed means specifically that there is no other being or deity worthy of worship except Allah. According to the Qur'an, Allah is a universal God, meaning that different local or tribal gods simply don't exist.",
    "year": "2012"
  },
  {
    "number": "924",
    "text": "Seeking assistance from the fortune tellers is forbidden because",
    "options": {
      "A": "it gives one an insight of what tomorrow holds",
      "B": "it creates animosity amongst people",
      "C": "it leads to ascribing absolute power to a fellow being",
      "D": "it's proceed is unlawful"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65604?exam_type=jamb&type=obj&page=185",
    "correct_answer": "C",
    "explanation": "Qur'an 37 :6-10(37:6) We have adorned the lower heaven with the adornment of the stars (37:7) and have protected it from every rebellious satan. (37:8) These satans cannot listen to what transpires in the High Council for they are pelted away from every side (37:9) and are repelled. Theirs is an unceasing chastisement. (37:10) And if any is able to snatch a fragment, he is pursued by a piercing flame.",
    "year": "2012"
  },
  {
    "number": "925",
    "text": "It is shirk in Islam to",
    "options": {
      "A": "Dance",
      "B": "Sing religious song",
      "C": "Undergo plastic surgery",
      "D": "Masquerade"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65606?exam_type=jamb&type=obj&page=185",
    "correct_answer": "D",
    "explanation": "In Islam, shirk (Arabic: شرك‎ širk) is the sin of idolatry or polytheism (i.e., the deification or worship of anyone or anything besides Allah). It means ascribing to, or the establishment of, partners placed beside Allah. It is termed Tawhid (monotheism). Mušrikūn مشركون (pl. of mušrik مشرك) are those who practice shirk, which literally means \"association\" and refers to accepting other gods and divinities alongside God (as God's \"associates\").",
    "year": "2012"
  },
  {
    "number": "926",
    "text": "Suhf was revealed to",
    "options": {
      "A": "Prophet Haruna (AS)",
      "B": "Prophet IIyas(AS)",
      "C": "Prophet Ibrahim(AS)",
      "D": "Prophet Muhammd(SAW)"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65607?exam_type=jamb&type=obj&page=186",
    "correct_answer": "C",
    "explanation": "Ṣuḥuf (Arabic: صُحُف, literally, the Scriptures) refers to any written work containing divine teachings, rulings and signs. In the Qur'an and hadiths, suhuf refers to the books of the prophets (a) in general and some certain books such as the Qur'an and the book of Prophet Abraham (a). Suhuf is also used to refer to the record of deeds.",
    "year": "2012"
  }
]