[
  {
    "number": "1919",
    "text": "When did the Israelites say 'All that the Lord has spoken we will do?\"",
    "options": {
      "A": "After Joshua’s farewell speech",
      "B": "At mount Sinai",
      "C": "When Moses spoke to them before his death",
      "D": "After the incident of the golden calf"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47228?exam_type=jamb&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1920",
    "text": "Saul was rejected as king over Israel because he disobeyed God's command to utterly destroy the___________",
    "options": {
      "A": "Assyrians",
      "B": "Philistines",
      "C": "Amalekites",
      "D": "Ammonites"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47230?exam_type=jamb&type=obj&page=384",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1921",
    "text": "God commanded man to eat of every tree of the garden but not of the tree of knowledge of good and evil because of His____________",
    "options": {
      "A": "Love for man",
      "B": "Sympathy for man",
      "C": "Lordship and authority over man",
      "D": "Understanding of the nature of man"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47233?exam_type=jamb&type=obj&page=385",
    "correct_answer": "C",
    "explanation": "InGenesis 2:16-17, God gives Adam the command to eat from every tree in the garden except for thetree of the knowledge of good and evil:\n\"And the Lord God commanded the man, saying, 'You may surely eat of every tree of the garden, but of the tree of the knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die.'\"\nThis command is given by God not out ofsympathyorlove(though those attributes are certainly present), but to demonstrate Hislordshipandauthorityover creation. By giving a command, God establishes His rightful authority over man, providing a test of obedience and a clear boundary. The command underscores the relationship between Creator and created being, where man is expected to follow God's directives.",
    "year": "2018"
  },
  {
    "number": "1922",
    "text": "\"Hear this word, you cows of Bashan... who oppress the poor, who crush the needy...\" cows of Bashan in the statement above refer to the____________",
    "options": {
      "A": "wicked kings",
      "B": "false prophets",
      "C": "women of Samaria",
      "D": "judges in Israel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47236?exam_type=jamb&type=obj&page=385",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1923",
    "text": "In Thessalonians, Paul advises believers awaiting the coming of the Lord to put on the________________",
    "options": {
      "A": "armour of hope",
      "B": "helmet of righteousness",
      "C": "breast plate of faith",
      "D": "breast plate of salvation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47239?exam_type=jamb&type=obj&page=385",
    "correct_answer": "C",
    "explanation": "7For those who sleep, sleep at night; and those who get drunk, get drunk at night.8But since we belong to the day, let us be sober, putting on the breastplate of faith and love, and the helmet of our hope of salvation.",
    "year": "2018"
  },
  {
    "number": "1924",
    "text": "A promise made by king Saul to anyone that could face and defeat Goliath was______________",
    "options": {
      "A": "making the person his second in command in Israel",
      "B": "giving his daughter in marriage to the person",
      "C": "giving the person part of his land",
      "D": "making the person captain of his army"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47242?exam_type=jamb&type=obj&page=385",
    "correct_answer": "B",
    "explanation": "I Samuel 17 vs 1-58…..25”Look at him!” they said to each other. “listen to his challenge! King Saul has promised to give a big reward to the man who kills him (Goliath) the king will also give him his daughter to marry and will not require his father’s family to pay taxes",
    "year": "2018"
  },
  {
    "number": "1925",
    "text": "In order that Benjamin might be brought to Egypt Joseph detained__________________",
    "options": {
      "A": "Reuben",
      "B": "Levi",
      "C": "Zebulun",
      "D": "Simeon"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47244?exam_type=jamb&type=obj&page=385",
    "correct_answer": "D",
    "explanation": "Genesis 42vs24……And he turned himself again from them and wept. Then he returned to them again, and talked with them. And he took Simeon from them and bound him before their eyes.",
    "year": "2018"
  },
  {
    "number": "1926",
    "text": "In answer to the Syrophenician woman's request to cast the demon out of her daughter, Jesus first said_____________",
    "options": {
      "A": "do not give dogs what is holy",
      "B": "It is not right to take the children’s bread and throw it to the dogs",
      "C": "truly, I say to you, not even in Israel have I found such faith",
      "D": "O woman, great is your faith! Be it done for you as you desire"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47246?exam_type=jamb&type=obj&page=386",
    "correct_answer": "B",
    "explanation": "Mark 7 vs 27",
    "year": "2018"
  },
  {
    "number": "1927",
    "text": "God's pardon of the people of Nineveh teaches a lesson on the benefits of____________",
    "options": {
      "A": "repentance",
      "B": "forgiveness",
      "C": "Justice",
      "D": "Tolerance"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47248?exam_type=jamb&type=obj&page=386",
    "correct_answer": "A",
    "explanation": "Jonah 3vs10……Then God saw their works, that they tuned from their evil ways; and God relented from the disaster that He had said He would bring upon them, and He did not do it.",
    "year": "2018"
  },
  {
    "number": "1928",
    "text": "During the giving of the law at Mount Sinai, the Israelites wanted Moses to speak to them instead of God because_____________",
    "options": {
      "A": "they thought they will die",
      "B": "they did not consecrate themselves",
      "C": "the people were afraid and trembled",
      "D": "Moses was their spokesman"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47251?exam_type=jamb&type=obj&page=386",
    "correct_answer": "A",
    "explanation": "During the giving of the Law atMount Sinai(Exodus 20:18-19, RSV), the Israelites witnessedthunder, lightning, the sound of the trumpet, and smokecovering the mountain. They asked Moses to speak to them instead of God, lest they die.\nBiblical Reference (Exodus 20:18-19, RSV):\n\"Now when all the people perceived the thunder and the lightning and the sound of the trumpet and the mountain smoking, the people were afraid and trembled; and they stood afar off, and said to Moses, ‘You speak to us, and we will hear; but let not God speak to us, lest we die.’”",
    "year": "2018"
  },
  {
    "number": "1929",
    "text": "\"Go from your country and your kindred and your father's house to the land that I will show you...\" Where Was Abram when this command was given?",
    "options": {
      "A": "Ur",
      "B": "Haran",
      "C": "Bethel",
      "D": "Shechem"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47252?exam_type=jamb&type=obj&page=386",
    "correct_answer": "B",
    "explanation": "Genesis 12 vs 1-4……So Abram departed as the Lord had spoken to him, and Lot went with him. And Abram was seventy-five years when he departed from Haran.",
    "year": "2018"
  },
  {
    "number": "1930",
    "text": "The conditions for justification according to Paul is_______________",
    "options": {
      "A": "merit and favour",
      "B": "ability to keep God's commandments",
      "C": "possession of spiritual gifts",
      "D": "faith in Christ crucified"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47254?exam_type=jamb&type=obj&page=386",
    "correct_answer": "D",
    "explanation": "\"We [who are] Jews by nature, and not sinners of the Gentiles,Knowing that a man is not justified by the works of the law, but by the faith of Jesus Christ, even we have believed in Jesus Christ, that we might be justified by the faith of Christ, and not by the works of the law: for by the works of the law shall no flesh be justified\". (Galatians 2:15-21)",
    "year": "2018"
  },
  {
    "number": "1931",
    "text": "When the glory of God appeared to Moses and Aaron in the wilderness of Zin, the Lord sad they should___________________-",
    "options": {
      "A": "strike the rock with rod to bring out water",
      "B": "fetch water for the people",
      "C": "tell the people to round the rock",
      "D": "tell the rock before their eyes to yield its Water"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47255?exam_type=jamb&type=obj&page=387",
    "correct_answer": "D",
    "explanation": "Numbers 20:8-13….. Then the LORD spoke to Moses, saying,8 “Take the rod; you and your brother Aaron gather the congregation together. Speak to the rock before their eyes, and it will yield its water; thus you shall bring water for them out of the rock, and give drink to the congregation and their animals.” 9 So Moses took the rod from before the LORD as He commanded him.\n10 And Moses and Aaron gathered the assembly together before the rock; and he said to them, “Hear now, you rebels! Must we bring water for you out of this rock?” 11 Then Moses lifted his hand and struck the rock twice with his rod; and water came out abundantly, and the congregation and their animals drank.\n12 Then the LORD spoke to Moses and Aaron, “Because you did not believe Me, to hallow Me in the eyes of the children of Israel, therefore you shall not bring this assembly into the land which I have given them.”\n13 This was the water of Meribah, because the children of Israel contended with the LORD, and hand he was hallowed among them.",
    "year": "2018"
  },
  {
    "number": "1932",
    "text": "The main reason why peter and John were arrested by the officers of the temple after they had cured the lame man at the gate called beautiful was that they___________",
    "options": {
      "A": "proclaimed in Jesus the resurrection",
      "B": "disapproved of worship in the temple",
      "C": "incited the people to revolt",
      "D": "healed the sick"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47256?exam_type=jamb&type=obj&page=387",
    "correct_answer": "A",
    "explanation": "Acts 4 vs 1-3…….. Now as they spoke to the people, the priests, the captain of the temple, and the Sadducees came upon them, 2 being greatly disturbed that they taught the people and preached in Jesus the resurrection from the dead. 3 And they laid hands on them, and put them in custody until the next day, for it was already evening.",
    "year": "2018"
  },
  {
    "number": "1933",
    "text": "My father Chastised you with whips, but I will chastise you with scorpion. Who said this?",
    "options": {
      "A": "Rehoboam",
      "B": "Solomon",
      "C": "Absalom",
      "D": "Jeroboam"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47257?exam_type=jamb&type=obj&page=387",
    "correct_answer": "A",
    "explanation": "\"And Rehoboam went to Shechem: for all Israel were come to Shechem to make him king........And Jeroboam and all the congregation of Israel came, and spake unto Rehoboam, saying, Thy father made our yoke grievous: now therefore make thou the grievous service of thy father, and his heavy yoke which he put upon us, lighter, and we will serve thee. And he said unto them, Depart yet [for] three days, then come again to me. And the people departed.........Andking Rehoboamconsulted with the old men, that stood before Solomon his father while he yet lived, and said, How do ye advise that I may answer this people? ..........So Jeroboam and all the people came toRehoboamthe third day, as the king had appointed, saying, Come to me again the third day. And the king answered the people roughly, and forsook the old men's counsel that they gave him; And spake to them after the counsel of the young men, saying, My father made your yoke heavy, and I will add to your yoke: my father [also] chastised you with whips, but I will chastise you with scorpions.\" (1 kings 12:1-33)",
    "year": "2018"
  },
  {
    "number": "1934",
    "text": "The disciples were for the first time called Christians in____________",
    "options": {
      "A": "Jerusalem",
      "B": "Judea",
      "C": "Tarsus",
      "D": "Antioch"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47258?exam_type=jamb&type=obj&page=387",
    "correct_answer": "D",
    "explanation": "Acts 11:26…….. And when he had found him, he brought him to Antioch. So it was that for a whole year they assembled with the church and taught a great many people. And the disciples were first called Christians in Antioch.",
    "year": "2018"
  },
  {
    "number": "1935",
    "text": "\"I have no silver and gold, but I give you what I have; in the name of Jesus Christ of Nazareth, walk\". This was said by Peter to a lame man______________",
    "options": {
      "A": "carried by four friends",
      "B": "who was also blind",
      "C": "at the gate called Beautiful",
      "D": "at the pool called Bethesda"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47259?exam_type=jamb&type=obj&page=387",
    "correct_answer": "C",
    "explanation": "\"Now Peter and John went up together into the temple at the hour of prayer, [being] the ninth [hour]. And a certain man lame from his mother's womb was carried, whom they laid daily at thegate of the temple which is called Beautiful, to ask alms of them that entered into the temple; ...........Then Peter said,Silver and gold have I none; but such as I have give I thee: In the name of Jesus Christ of Nazareth rise up and walk.\" (Act 3:1-10)",
    "year": "2018"
  },
  {
    "number": "1936",
    "text": "What did Zacchaeus do in order to see Jesus?",
    "options": {
      "A": "he invited Jesus to his house",
      "B": "He climbed up into a sycamore tree",
      "C": "He ran among the crowd",
      "D": "He stood on a table as Jesus preached"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47260?exam_type=jamb&type=obj&page=388",
    "correct_answer": "B",
    "explanation": "\"And [Jesus] entered and passed through Jericho. And, behold, [there was] a man named Zacchaeus, which was the chief among the publicans, and he was rich. And he sought to see Jesus who he was; and could not for the press, because he was little of stature. And he ran before, andclimbed up into a sycomore tree to see him: for he was to pass that [way].\" (Luke 19:1-10)",
    "year": "2018"
  },
  {
    "number": "1937",
    "text": "Abraham is portrayed in the Bible as____________?",
    "options": {
      "A": "The giver of the law",
      "B": "The father of the Faithful",
      "C": "The Mighty Prophet of Jehovah",
      "D": "The Lion of Judah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47261?exam_type=jamb&type=obj&page=388",
    "correct_answer": "B",
    "explanation": "He was tested by God and proved faithful (Genesis 22)",
    "year": "2018"
  },
  {
    "number": "1938",
    "text": "In the letter to the Galatians, Christians are encouraged to bear one another’s burden in order to___________",
    "options": {
      "A": "fulfill the law of Christ",
      "B": "be rewarded in heaven",
      "C": "enter the kingdom of God",
      "D": "be the children of God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47262?exam_type=jamb&type=obj&page=388",
    "correct_answer": "A",
    "explanation": "Bear one another’s burdens, and so fulfil the law of Christ. (Galatians 6:2)",
    "year": "2018"
  },
  {
    "number": "1939",
    "text": "Rahab the harlot assisted the Israelites spies as they prepare to attack_______________",
    "options": {
      "A": "The five Kings of the Amorites",
      "B": "Gibeon",
      "C": "Jericho",
      "D": "Ai"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47263?exam_type=jamb&type=obj&page=388",
    "correct_answer": "C",
    "explanation": "Joshua 2:1-3 Now Joshua the son of Nun sent out two men from Acacia Grove to spy secretly, saying, “Go, view the land, especially Jericho.” So they went, and came to the house of a harlot named Rahab, and lodged there. 2 And it was told the king of Jericho, saying, “Behold, men have come here tonight from the children of Israel to search out the country.”\n3 So the king of Jericho sent to Rahab, saying, “Bring out the men who have come to you, who have entered your house, for they have come to search out all the country.”",
    "year": "2018"
  },
  {
    "number": "1940",
    "text": "When prophet Isaiah saw the Lord of hosts in the Temple he______________",
    "options": {
      "A": "condemned himself and his people",
      "B": "was ashamed of himself and his people",
      "C": "praised his glory",
      "D": "prayed fervently"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47264?exam_type=jamb&type=obj&page=388",
    "correct_answer": "A",
    "explanation": "\"In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple. .....Then said I, Woe [is] me! for I am undone; because I [am] a man of unclean lips, and I dwell in the midst of a people of unclean lips: for mine eyes have seen the King, the LORD of hosts.\" (Isaiah 6:1-7)",
    "year": "2018"
  },
  {
    "number": "1941",
    "text": "Naaman's Leprosy was transferred to Gehazi because Gehazi was_________________",
    "options": {
      "A": "ambitious",
      "B": "anxious",
      "C": "contemptuous",
      "D": "covetous"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47265?exam_type=jamb&type=obj&page=389",
    "correct_answer": "D",
    "explanation": ": II Kings 5:20-27 But Gehazi, the servant of Elisha the man of God, said, “Look, my master has spared Naaman this Syrian, while not receiving from his hands what he brought; but as the LORD lives, I will run after him and take something from him.” 21 So Gehazi pursued Naaman. When Naaman saw him running after him, he got down from the chariot to meet him, and said, “Is all well?”\n22 And he said, “All is well. My master has sent me, saying, ‘Indeed, just now two young men of the sons of the prophets have come to me from the mountains of Ephraim. Please give them a talent of silver and two changes of garments.’”\n23 So Naaman said, “Please, take two talents.” And he urged him, and bound two talents of silver in two bags, with two changes of garments, and handed them to two of his servants; and they carried them on ahead of him. 24 When he came to the citadel, he took them from their hand, and stored them away in the house; then he let the men go, and they departed. 25 Now he went in and stood before his master. Elisha said to him, “Where did you go, Gehazi?”\nAnd he said, “Your servant did not go anywhere.”\n26 Then he said to him, “Did not my heart go with you when the man turned back from his chariot to meet you? Is It time to receive money and to receive clothing, olive groves and vineyards, sheep and oxen, male and female servants? 27 Therefore the leprosy of Naaman shall cling to you and your descendants forever.” And he went out from his presence leprous, as white as snow.",
    "year": "2018"
  },
  {
    "number": "1942",
    "text": "The elders at Jerusalem advised Paul on his arrival in the city to____________",
    "options": {
      "A": "avoid the Jewish Christians",
      "B": "purify himself along the with the men under vows",
      "C": "join in the temple for prayer and fasting",
      "D": "preach the good news"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47266?exam_type=jamb&type=obj&page=389",
    "correct_answer": "B",
    "explanation": "Acts 21:23-25 Therefore do what we tell you: We have four men who have taken a vow.24 Take them and be purified with them, and pay their expenses so that they may shave their heads, and that all may know that those things of which they were informed concerning you are nothing, but that you yourself also walk orderly and keep the law. 25 But concerning the Gentiles who believe, we have written and decided that they should observe no such thing, except that they should keep themselves from things offered to idols, from blood, from things strangled, and from sexual immorality",
    "year": "2018"
  },
  {
    "number": "1943",
    "text": "Saul learnt from Samuel's spirit that the lord would_____________",
    "options": {
      "A": "become his enemy",
      "B": "afflict him with sickness",
      "C": "give the philistines into his hands",
      "D": "pardon his iniquity"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47267?exam_type=jamb&type=obj&page=389",
    "correct_answer": "A",
    "explanation": "\"Then said Samuel, Wherefore then dost thou ask of me, seeing the LORD is departed from thee,and is become thine enemy? And the LORD hath done to him, as he spake by me: for the LORD hath rent the kingdom out of thine hand, and given it to thy neighbour, [even] to David: Because thou obeyedst not the voice of the LORD, nor executedst his fierce wrath upon Amalek, therefore hath the LORD done this thing unto thee this day. Moreover the LORD will also deliver Israel with thee into the hand of the Philistines: and to morrow [shalt] thou and thy sons [be] with me: the LORD also shall deliver the host of Israel into the hand of the Philistines.\" (1 Samuel 28:7-25)",
    "year": "2018"
  },
  {
    "number": "1944",
    "text": "\"What have you to do with us O son of God\"? Have you come here to torment us before the time? This statement reveals that the demoniacs in the country of Gadarenes_________",
    "options": {
      "A": "wanted to question Jesus's authority",
      "B": "were threatened by the power of Jesus",
      "C": "did not expect Jesus to come to them at that time",
      "D": "recognized the supreme power of Jesus"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47268?exam_type=jamb&type=obj&page=389",
    "correct_answer": "D",
    "explanation": "\"And when he was come to the other side into the country of the Gergesenes, there met him two possessed with devils, coming out of the tombs, exceeding fierce, so that no man might pass by that way. And, behold, they cried out, saying, What have we to do with thee, Jesus, thou Son of God? art thou come hither to torment us before the time? And there was a good way off from them an herd of many swine feeding. So the devils besought him, saying, If thou cast us out, suffer us to go away into the herd of swine. And he said unto them, Go. And when they were come out, they went into the herd of swine: and, behold, the whole herd of swine ran violently down a steep place into the sea, and perished in the waters.\" (Matthew 8:28-34)The demons recognized that Jesus had supreme power over them and could destroy them if He so wished.",
    "year": "2018"
  },
  {
    "number": "1945",
    "text": "... Do not weep for me, but weep for yourselves and for your children...\" These words were addressed by Jesus to the___________-",
    "options": {
      "A": "Men of Bethlehem",
      "B": "Sons of Jerusalem",
      "C": "Daughters of Jerusalem",
      "D": "Women of Bethlehem"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47269?exam_type=jamb&type=obj&page=389",
    "correct_answer": "C",
    "explanation": "But Jesus turning to them said, “Daughters of Jerusalem, do not weep for me, but weep for yourselves and for your children. (Luke 23:28)",
    "year": "2018"
  },
  {
    "number": "1946",
    "text": "According to Paul, he who loves his neighbour has________________-",
    "options": {
      "A": "fulfilled the law",
      "B": "eternal life",
      "C": "peace with God",
      "D": "overcome all evils"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47270?exam_type=jamb&type=obj&page=390",
    "correct_answer": "A",
    "explanation": "If you really fulfil the royal law, according to the scripture, “You shall love your neighbor as yourself,” you do well. (James 2:8)",
    "year": "2018"
  },
  {
    "number": "1947",
    "text": "\"I called to the Lord, out of my distress, and he answered me, out of the belly of shoel I cried and thou didst hear my voice ...\" Jonah's statement above implies that God_________",
    "options": {
      "A": "hears and answers prayers in times of distress",
      "B": "is happy when His servants are humble",
      "C": "expects total loyalty from His servants",
      "D": "expects conviction of sin from His servants"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47272?exam_type=jamb&type=obj&page=390",
    "correct_answer": "A",
    "explanation": "Jonah 2:2 Then Jonah prayed to the LORD his God from the fish’s belly. 2 And he said: “I cried out to the LORD because of my affliction, And He answered me. “Out of the belly of Sheol I cried, And You heard my voice.",
    "year": "2018"
  },
  {
    "number": "1948",
    "text": "When the man with an unclean spirit in the region of the Gadarenes saw Jesus, he_______",
    "options": {
      "A": "pleaded to be cast into the abyss",
      "B": "requested to follow Him as a disciple",
      "C": "acknowledged Him as the Son of the Most High God",
      "D": "pleaded that a miracle be performed to cleanse him"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47273?exam_type=jamb&type=obj&page=390",
    "correct_answer": "C",
    "explanation": "And when he saw Jesus from afar, he ran and worshiped him; and crying out with a loud voice, he said, “What have you to do with me, Jesus, Son of the Most High God? I adjure you by God, do not torment me.” (Mark 5:6-7)",
    "year": "2018"
  },
  {
    "number": "1949",
    "text": "The exiles returned to Jerusalem in the reign of________",
    "options": {
      "A": "Nebuchadnezzar",
      "B": "Cyrus",
      "C": "Zerubbabel",
      "D": "Huldah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47274?exam_type=jamb&type=obj&page=390",
    "correct_answer": "B",
    "explanation": "\"Now in the first year ofCyrus king of Persia, that the word of the LORD by the mouth of Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus king of Persia, that he made a proclamation throughout all his kingdom, and [put it] also in writing, saying, Thus saith Cyrus king of Persia, The LORD God of heaven hath given me all the kingdoms of the earth; and he hath charged me to build him an house at Jerusalem, which [is] in Judah. Who [is there] among you of all his people? his God be with him, and let him go up to Jerusalem, which [is] in Judah, and build the house of the LORD God of Israel, (he [is] the God, ) which [is] in Jerusalem. ................ Also Cyrus the king brought forth the vessels of the house of the LORD, which Nebuchadnezzar had brought forth out of Jerusalem, and had put them in the house of his gods; 8Even those did Cyrus king of Persia bring forth by the hand of Mithredath the treasurer, and numbered them unto Sheshbazzar,......... All the vessels of gold and of silver [were] five thousand and four hundred.All [these] did Sheshbazzar bring up with [them of] the captivity that were brought up from Babylon unto Jerusalem.\" (Ezra 1:1-11)",
    "year": "2018"
  },
  {
    "number": "1950",
    "text": "....... was the instrument used by God to destroy Babylon and in setting the children of Israel free from the Babylonian exile",
    "options": {
      "A": "Cyrus the Persian",
      "B": "Moses",
      "C": "Prophet Jeremiah",
      "D": "Gedaliah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47275?exam_type=jamb&type=obj&page=390",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1951",
    "text": "Why did the accusers of Jesus stay behind while he was led to the Praetorium?",
    "options": {
      "A": "It was forbidden to follow the accused",
      "B": "They were prevented from entering",
      "C": "It was a Sabbath",
      "D": "They did not want to be defiled"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47276?exam_type=jamb&type=obj&page=391",
    "correct_answer": "D",
    "explanation": "Then they led Jesus from the house of Ca′iaphas to the praetorium. It was early. They themselves did not enter the praetorium, so that they might not be defiled, but might eat the passover. (john 18:28)",
    "year": "2018"
  },
  {
    "number": "1952",
    "text": "The angel of the Lord told Zachariah that a son be born to him and that the son would_____________",
    "options": {
      "A": "make the disobedient repent of their sins",
      "B": "turn the heart of their children to their fathers",
      "C": "turn many of the sons and daughters of Israel to God",
      "D": "go before God in the spirit and power of Elijah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47277?exam_type=jamb&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "InLuke 1:16-17(RSV), the angel says to Zachariah:\n\"And he will turn many of the sons of Israel to the Lord their God, and he will go before him in the spirit and power of Elijah, to turn the hearts of the fathers to the children, and the disobedient to the wisdom of the just, to make ready for the Lord a people prepared.\"\nIn this passage, the angel explains that John's mission is to:\nTurn many of the sons of Israel to God(Luke 1:16).Go before God in the spirit and power of Elijah(Luke 1:17), preparing the way for the Lord.\nWhile bothCandDreflect aspects of John's mission,Cis themore specificpart of the angel's message that answers what John will achieve directly—turning people to God.Drefers to John'smethod or manner(going in the spirit and power of Elijah), but it does not focus on the end result of his mission, which isturning people to God.",
    "year": "2018"
  },
  {
    "number": "1953",
    "text": "Uriah did not wish to go down to his house because_______",
    "options": {
      "A": "his wife was pregnant",
      "B": "Joab would set him in the forefront of the battle",
      "C": "he Ark was in the battle field",
      "D": "David lay with his wife"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47278?exam_type=jamb&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "\"So David sent this word to Joab: \"Send me Uriah the Hittite.\" And Joab sent him to David. 7When Uriah came to him, David asked him ....... But Uriah slept at the entrance to the palace with all his master’s servants and did not go down to his house. David was told, \"Uriah did not go home.\" So he asked Uriah, \"Haven’t you just come from a military campaign? Why didn’t you go home?\"Uriah said to David, \"The ark and Israel and Judah are staying in tents, a and my commander Joab and my lord's men are camped in the open country. How could I go to my house to eat and drink and make love to my wife? As surely as you live, I will not do such a thing!\" \" (2 Samuel 11:6-11)",
    "year": "2018"
  },
  {
    "number": "1954",
    "text": "\"The harvest is plentiful, but the labourers are few ....\" Jesus made the statement above during the_________",
    "options": {
      "A": "commissioning of the seventy others",
      "B": "mission of the twelve",
      "C": "sermon on the mount",
      "D": "triumphant entry"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47279?exam_type=jamb&type=obj&page=391",
    "correct_answer": "A",
    "explanation": "\"After this the Lord appointed seventy-two others and sent them two by two ahead of him to every town and place where he was about to go. He told them, \"The harvest is plentiful, but the workers are few. Ask the Lord of the harvest, therefore, to send out workers into his harvest field. Go! I am sending you out like lambs among wolves. Do not take a purse or bag or sandals; and do not greet anyone on the road.\" (Luke 10:1-4)",
    "year": "2018"
  },
  {
    "number": "1955",
    "text": "The punishment for Adam and Eve's sin was that they______",
    "options": {
      "A": "would be naked forever",
      "B": "would never fellowship with God",
      "C": "were driven out of the garden",
      "D": "would be enemies of crawling animals"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47280?exam_type=jamb&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "Genesis 3:22-24 Then the LORD God said, “Behold, the man has become like one of Us, to know good and evil. And now, lest he put out his hand and take also of the tree of life, and eat, and live forever”— 23 therefore the LORD God sent him out of the garden of Eden to till the ground from which he was taken. 24 So He drove out the man; and He placed cherubim at the east of the garden of Eden, and a flaming sword which turned every way, to guard the way to the tree of life.",
    "year": "2018"
  },
  {
    "number": "1956",
    "text": "According to the letter of Paul to the Romans, sin reigned in death, while grace reigned through righteousness to_______________",
    "options": {
      "A": "Salvation",
      "B": "Eternal Life",
      "C": "Eternal Peace",
      "D": "Eternal Joy"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47281?exam_type=jamb&type=obj&page=392",
    "correct_answer": "B",
    "explanation": "Romans 5:21 That as sin hath reigned unto death, even so might grace reign through righteousness unto eternal life by Jesus Christ our Lord.",
    "year": "2018"
  },
  {
    "number": "1957",
    "text": "With regards to giving, Paul admonishes the Romans to do so with_______________",
    "options": {
      "A": "Joy",
      "B": "Love",
      "C": "Liberality",
      "D": "Zeal"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47282?exam_type=jamb&type=obj&page=392",
    "correct_answer": "C",
    "explanation": "Romans 12:8 \"8 he who exhorts, in his exhortation; he who contributes, in liberality; he who gives aid, with zeal; he who does acts of mercy, with cheerfulness.\"",
    "year": "2018"
  },
  {
    "number": "1958",
    "text": "\"I called to the Lord, out of my distress, and he answered me, out of the belly of shoel I cried and thou didst hear my voice ...\" Jonah's statement above implies that God_____",
    "options": {
      "A": "hears and answers prayers in times of distress",
      "B": "is happy when His servants are humble",
      "C": "expects total loyalty from His servants",
      "D": "expects conviction of sin from His servants"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47283?exam_type=jamb&type=obj&page=392",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1959",
    "text": "According to the Book of Romans, they that are in the flesh cannot …………?",
    "options": {
      "A": "see God",
      "B": "worship God",
      "C": "please God",
      "D": "be forgiven"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47602?exam_type=jamb&type=obj&page=392",
    "correct_answer": "C",
    "explanation": "Romans 8:8 says, So then, those who are in the flesh cannot please God.",
    "year": "2018"
  },
  {
    "number": "1960",
    "text": "Who hid the two spies in Jericho?",
    "options": {
      "A": "Bathsheba",
      "B": "Deborah",
      "C": "Rahab",
      "D": "Zipporah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47603?exam_type=jamb&type=obj&page=392",
    "correct_answer": "C",
    "explanation": "Rahab was the prostitute who hid the two spies. Joshua 2 vs 1-2 Now Joshua the son of Nun sent out two men Acacia Grove to spy secretly…………..so they went, and came to the house of a harlot named Rahab, and lodged there…….",
    "year": "2018"
  },
  {
    "number": "1961",
    "text": "King ______reigned in Israel immediately after Saul’s death",
    "options": {
      "A": "Solomon",
      "B": "David",
      "C": "Ish-bosheth",
      "D": "Jeroboam"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47605?exam_type=jamb&type=obj&page=393",
    "correct_answer": "C",
    "explanation": "Ish-bosheth – II Sam 2:8-11……………Ish-bosheth was the son of Saul. He was crowned King after his Father’s death.",
    "year": "2018"
  },
  {
    "number": "1962",
    "text": "Upon Arrival at Mount Sinai, what did God tell Moses to say to the Israelites?",
    "options": {
      "A": "If you obey my voice and keep my commandment, you will be a special treasure to me above all people for all the is mine………",
      "B": "Weep no more, behold the Lion of the Tribe of Judah",
      "C": "I shall reject you and your household………",
      "D": "Ye shall be conquered and thy enemies shall overthrow thee"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47606?exam_type=jamb&type=obj&page=393",
    "correct_answer": "A",
    "explanation": "Exodus 19:1-5",
    "year": "2018"
  },
  {
    "number": "1963",
    "text": "What does justification in the bible mean?",
    "options": {
      "A": "Act of removing the guilt and penalty of sin while making a sinner righteous through Christ atoning sacrifice",
      "B": "The crescendo of the symphony of Gods glory in a Christian life",
      "C": "Continual process of being made more holy",
      "D": "Work of grace through faith"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47607?exam_type=jamb&type=obj&page=393",
    "correct_answer": "A",
    "explanation": "Romans 3 : 21, “But now a righteousness from God, apart from Law and the prophets testify. This righteousness from God comes through faith in Christ Jesus to all who believe. There is no difference, for all have sinned and fall short of the Glory of God and are justified freely by His grace through the redemption that came by Christ Jesus.",
    "year": "2018"
  },
  {
    "number": "1964",
    "text": "Who was Aaron to Moses in the bible?",
    "options": {
      "A": "His servant",
      "B": "His Prophet",
      "C": "His brother",
      "D": "His in-law"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47608?exam_type=jamb&type=obj&page=393",
    "correct_answer": "C",
    "explanation": "Exodus 6 vs 20 “Now Amram took for himself Jochebed, his father’s sister, as wife; and she bore him Aaron and Moses",
    "year": "2018"
  },
  {
    "number": "1965",
    "text": "Who wrote the book of Genesis?",
    "options": {
      "A": "David",
      "B": "Moses",
      "C": "Samuel",
      "D": "Abraham"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47609?exam_type=jamb&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "Moses – The first five books of the Bible – Genesis, Exodus Leviticus, Numbers and Deuteronomy – are traditionally known as the Books of Moses, and he is quoted as the author of the last four. (Exodus 17:14, Numbers 33:2, Deuteronomy 31:9, 22, 24)",
    "year": "2018"
  },
  {
    "number": "1966",
    "text": "According to James, when we meet various trials in life we should_________",
    "options": {
      "A": "Rejoice because the Lord is good",
      "B": "Bless God's name",
      "C": "Count it all Joy",
      "D": "Call upon the name of the Lord"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47610?exam_type=jamb&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "James 1:2-4 My brethren, count it all joy when you fall into various trials, 3 knowing that the testing of your faith produces patience. 4 But let patience have its perfect work, that you may be perfect and complete, lacking nothing.",
    "year": "2018"
  },
  {
    "number": "1967",
    "text": "In Antioch, what were the disciples called?",
    "options": {
      "A": "Believers",
      "B": "Followers",
      "C": "Christians",
      "D": "Disciples"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47611?exam_type=jamb&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "Acts 11 vs 26…….and the disciple were first called Christians ins Antioch",
    "year": "2018"
  },
  {
    "number": "1968",
    "text": "What have you to do with us O Son of God? Have you come here to torment us before the time?. This statement reveals that they demoniacs in the country of gardarenes",
    "options": {
      "A": "Wanted to question Jesus Authority",
      "B": "Were threatened by the power of Jesus",
      "C": "Did not.expect Jesus to come to then at that time. ",
      "D": "Recognized the supreme power of Jesus."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47612?exam_type=jamb&type=obj&page=394",
    "correct_answer": "D",
    "explanation": "matthew 8;28-29\n''Whatdoyouwantwithus,SonofGod?\" they shouted. \"Haveyoucomeheretotortureusbeforetheappointedtime?\"\naccording to the above bible portion, jesus was travelling with his disciples on the ship to the other side into the country of the Gergesenes, when he met two people possessed with devils coming out of the tomb. when they saw jesus, the devils in them recognized the power and authority in jesus and begged him to rather cast them into the herds of swines feeding close by the fields.",
    "year": "2018"
  },
  {
    "number": "1969",
    "text": "Why did God punish David and Bathsheba’s innocent child with Death?",
    "options": {
      "A": "David’s marriage to Bathsheba",
      "B": "David’s sin with Bathsheba",
      "C": "Uriah’s disobedience to David",
      "D": "Bathsheba’s disobedience to Uriah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47613?exam_type=jamb&type=obj&page=394",
    "correct_answer": "B",
    "explanation": "David lustfully looked at Bathsheba (Uriah’s wife) while she was bathing and later slept with her which led to their punishment II Sam. 11: 2-27",
    "year": "2018"
  },
  {
    "number": "1970",
    "text": "What are we to put on after casting “off the works of darkness, because the night is far spent, and the day is at hand”?",
    "options": {
      "A": "The Power of God",
      "B": "Light",
      "C": "Armour of Light",
      "D": "Breastplate of Armour"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47614?exam_type=jamb&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "We are to put on the Armour of Light (Romans 13 vs 12)",
    "year": "2018"
  },
  {
    "number": "1971",
    "text": "What are the names of the men who healed the lame man at the beautiful gate?",
    "options": {
      "A": "James and John",
      "B": "Andrew and John",
      "C": "John and Philip",
      "D": "Peter and John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47615?exam_type=jamb&type=obj&page=395",
    "correct_answer": "D",
    "explanation": "Peter and John on their way to the Temple for the hour of prayer at three in the afternoon healed a man born lame while passing by the beautiful gate (Acts 3:1-11)",
    "year": "2018"
  },
  {
    "number": "1972",
    "text": "How old was Joseph when he was taken to Egypt?",
    "options": {
      "A": "18 years old",
      "B": "17 years old",
      "C": "16 years old",
      "D": "15 years old"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47616?exam_type=jamb&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "According to Genesis 37:1, when he had a dream before he was sold out, He was 17 years old",
    "year": "2018"
  },
  {
    "number": "1973",
    "text": "God’s slaying of Ananias and Sapphira was a result of them",
    "options": {
      "A": "Loving each other",
      "B": "Lying to the Holy Spirit",
      "C": "Selling land and houses",
      "D": "Giving profits to the apostles"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47617?exam_type=jamb&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "Acts 5 vs 1-11 Ananias and Sapphira were struck dead by God because they lied and also because of their selfish spirit.",
    "year": "2018"
  },
  {
    "number": "1974",
    "text": "What was the first Bird Noah sent out?",
    "options": {
      "A": "Dove",
      "B": "Falcon",
      "C": "Raven",
      "D": "Swallow"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47618?exam_type=jamb&type=obj&page=395",
    "correct_answer": "C",
    "explanation": "A Raven was the first bird Noah sent out of the Ark (Genesis 8 vs 6-12",
    "year": "2018"
  },
  {
    "number": "1975",
    "text": "Who was Nathan in the Bible?",
    "options": {
      "A": "David’s servant",
      "B": "One of David’s soldiers",
      "C": "A prophet who lived during the reign of King David in Israel",
      "D": "David’s Butler"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47619?exam_type=jamb&type=obj&page=395",
    "correct_answer": "C",
    "explanation": "Nathan was prophet in the bible who lived during the reign of King David in Israel. God spoke to David through Nathan on several Occasions. He was a member of David’s royal court and one of his closest advisor (II Samuel 12).",
    "year": "2018"
  },
  {
    "number": "1976",
    "text": "God put the tree of knowledge of good and evil in the garden of Eden?",
    "options": {
      "A": "Because it contained some beneficial fibre",
      "B": "For consumption of its sweet fruit",
      "C": "To give Adam and Eve a choice to obey him or disobey Him",
      "D": "To reveal to them their nakedness"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47620?exam_type=jamb&type=obj&page=396",
    "correct_answer": "C",
    "explanation": "God put the tree of knowledge of good and evil in the Garden of Eden to give Adam and Eve were free to do anything they wanted, except eat from the tree of knowledge.",
    "year": "2018"
  },
  {
    "number": "1977",
    "text": "According to the Bible, who was Zacchaeus?",
    "options": {
      "A": "A Fisherman",
      "B": "A Teacher",
      "C": "Money changer",
      "D": "Chief Tax Collector"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47621?exam_type=jamb&type=obj&page=396",
    "correct_answer": "D",
    "explanation": "Luke 19:1 clearly states that he was a Chief Tax Collector and was also Rich",
    "year": "2018"
  },
  {
    "number": "1978",
    "text": "When prophet Isaiah saw the lord of host in the temple he_______",
    "options": {
      "A": "Condemned himself and his people",
      "B": "Was ashamed of himself and his people",
      "C": "Praised His Glory",
      "D": "Prayer fervently"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47622?exam_type=jamb&type=obj&page=396",
    "correct_answer": "A",
    "explanation": "Isaiah 6:5 So I said: “Woe is me, for I am undone! Because I am a man of unclean lips, And I dwell in the midst of a people of unclean lips; For my eyes have seen the King, The LORD of hosts.”",
    "year": "2018"
  },
  {
    "number": "1979",
    "text": "What is not listed as one of the fruits of the Spirit in Galatians?",
    "options": {
      "A": "Cheerfulness",
      "B": "Kindness",
      "C": "Longsuffering",
      "D": "Love"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47623?exam_type=jamb&type=obj&page=396",
    "correct_answer": "A",
    "explanation": "The Fruit of the Holy Spirit is a biblical term that sums up nine attributes of a person or community living in accord with the Holy Spirit.\nGalatians 5:22-23, \"But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control.",
    "year": "2018"
  },
  {
    "number": "1980",
    "text": "With regards to giving, Paul admonishes the Romans to do so with___________",
    "options": {
      "A": "Joy",
      "B": "Love",
      "C": "Liberality",
      "D": "Zeal"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47624?exam_type=jamb&type=obj&page=396",
    "correct_answer": "C",
    "explanation": "Romans 12 vs 8……..he who exhorts, in exhortation; he who gives, with liberality; he who leads, with diligence; he who shows mercy, with cheerfulness",
    "year": "2018"
  },
  {
    "number": "1981",
    "text": "What did the demons in the region of the Gadarenes do when they saw Jesus?",
    "options": {
      "A": "They Pleaded for Jesus to send them to the herds of pigs",
      "B": "They Requested to follow him as a disciple",
      "C": "They Acknowledged him as the son of the Most High God D",
      "D": "They Pleaded that a miracle be performed to cleanse him"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47625?exam_type=jamb&type=obj&page=397",
    "correct_answer": "A",
    "explanation": "Matthew 8:28-34 says, “When he arrived at the other side in the region of the Gadarenes, two demon-possessed men coming from the tombs met him. They were so violent that no one could pass that way. ‘What do you want with us, Son of God?’ they shouted. Have you come to torture us before the appointed time?…………if you drive us out, send us into the herds of pigs”",
    "year": "2018"
  },
  {
    "number": "1982",
    "text": "According to James, we must consider trials in our lives as what?",
    "options": {
      "A": "Joy",
      "B": "Testing",
      "C": "Blessing",
      "D": "Longsuffering"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47626?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "Testing – James 1 vs 2-3 …………… My brethren, count it all joy when you fall into various trials, 3. knowing that the testing of your faith produces patience",
    "year": "2018"
  },
  {
    "number": "1983",
    "text": "Who had leprosy in the bible?",
    "options": {
      "A": "Elisha",
      "B": "Naaman",
      "C": "Joab",
      "D": "Dan"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/47627?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "2 Kings 5 tells how Naaman, commander of the army of the King of Aram was healed of his Leprosy through Elisha the man of God.",
    "year": "2018"
  },
  {
    "number": "1984",
    "text": "According to Luke, when Moses and Elijah appeared during the Transfiguration, they spoke of Jesus'",
    "options": {
      "A": "departure",
      "B": "second coming",
      "C": "resurrection",
      "D": "trials"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48216?exam_type=jamb&type=obj&page=397",
    "correct_answer": "A",
    "explanation": "Luke9:30-3130Two men, Moses and Elijah, appeared in glorious splendor, talking with Jesus.31They spoke about his departure, which he was about to bring to fulfillment at Jerusalem.",
    "year": "2018"
  },
  {
    "number": "1985",
    "text": "Following the death of Stephen, the only group of believers not scattered by the great persecution was the",
    "options": {
      "A": "deacons",
      "B": "apostles",
      "C": "prophets",
      "D": "disciples"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48217?exam_type=jamb&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "Acts 8:1\nFollowing Stephen’s death in 35AD, the more radical members of the young church in Jerusalem were persecuted by the staunchly traditional Jewish hierarchy. Most of theGreek-speaking believers were scattered throughout Judaea and Samaria, while the twelve apostles – who were more traditionalHebrewandAramaic-speaking Jews – were able to remain in Jerusalem.",
    "year": "2018"
  },
  {
    "number": "1986",
    "text": "\"Can anyone forbid water for baptising these people who have received the Holy Spirit just as we have?\" The statement above was made by Peter at the conversion  of",
    "options": {
      "A": "Herod",
      "B": "Lydia",
      "C": "Saul",
      "D": "Cornelius"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48218?exam_type=jamb&type=obj&page=398",
    "correct_answer": "D",
    "explanation": "Acts 10: 30-4747Can any man forbid water, that these should not be baptized, which have received the Holy Ghost as well as we?",
    "year": "2018"
  },
  {
    "number": "1987",
    "text": "The disciple who replaced Judas Iscariot was",
    "options": {
      "A": "Justus",
      "B": "Stephen",
      "C": "Matthias",
      "D": "Luke"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48219?exam_type=jamb&type=obj&page=398",
    "correct_answer": "C",
    "explanation": "Acts 1:15-26 says specifically that Judas Iscariot's space was not occupied, but instead that anewslot was added to bring the number back to twelve.\nIn the days following, Peter proposed that the assembled disciples, who numbered about 120, nominate two men toreplace Judas. They chose Joseph called Barsabas (whose surname was Justus) and Matthias. votes were casted to see who would be 'the thirteenth,' so to speak, electing Matthias.",
    "year": "2018"
  },
  {
    "number": "1988",
    "text": "The sin of the sons of Eli was that they treated the offering of the Lord with",
    "options": {
      "A": "suspicion",
      "B": "contempt",
      "C": "disgust",
      "D": "jealousy"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48220?exam_type=jamb&type=obj&page=398",
    "correct_answer": "B",
    "explanation": "1 Samuel 2:12-36\nThe sons of Eli were scoundrels. They paid no attention to the LORD or to the regulations concerning what the priests could demand from the people. Instead, when anyone was offering a sacrifice, the priest's servant would come with a three-pronged fork. While the meat was still cooking, he would stick the fork into the cooking pot, and whatever the fork brought out belonged to the priest. All the Israelites who came to Shiloh to offer sacrifices were treated like this. In addition, even before the fat was taken off and burnt, the priest's servant would come and say to the one offering the sacrifice, “Give me some meat for the priest to roast; he won't accept boiled meat from you, only raw meat.” If the person answered, “Let us do what is right and burn the fat first; then take what you want,” the priest's servant would say, “No! Give it to me now! If you don't, I will have to take it by force!” This sin of the sons of Eli was extremely serious in the LORD's sight, because they treated the offerings to the LORD with such disrespect.",
    "year": "2018"
  },
  {
    "number": "1989",
    "text": "David's behaviour after Prophet Nathan accused him of murder and adultery showed his",
    "options": {
      "A": "justification",
      "B": "repentance",
      "C": "greed",
      "D": "righteousness"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48221?exam_type=jamb&type=obj&page=398",
    "correct_answer": "B",
    "explanation": "2 Samuel 12 and13",
    "year": "2018"
  },
  {
    "number": "1990",
    "text": "\"Depart from me, for I am a sinful man, O Lord.\" This statement was uttered by Peter at the",
    "options": {
      "A": "Last Supper",
      "B": "garden of Gethsemane",
      "C": "call of the disciples",
      "D": "transfiguration"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48222?exam_type=jamb&type=obj&page=398",
    "correct_answer": "C",
    "explanation": "Luke 5:1-86When they had done so, they caught such a large number of fish that their nets began to break.7So they signaled their partners in the other boat to come and help them, and they came and filled both boats so full that they began to sink.8When Simon Peter saw this, he fell at Jesus' knees and said, \"Go away from me, Lord; I am a sinful man!\"",
    "year": "2018"
  },
  {
    "number": "1991",
    "text": "The sign of God's covenant with Abraham was",
    "options": {
      "A": "a change of name",
      "B": "circumcision",
      "C": "the rainbow",
      "D": "the appearance of the Holy Spirit"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48223?exam_type=jamb&type=obj&page=399",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1992",
    "text": "\"Behold, the days are coming... When I will send a famine on the land...\" Famine in this statement means",
    "options": {
      "A": "lack of food",
      "B": "unavailability of the word of God",
      "C": "failure of the farms to produce",
      "D": "lack of water"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48224?exam_type=jamb&type=obj&page=399",
    "correct_answer": "B",
    "explanation": "Behold, the days are coming, when I will send a famine on the land, not a famine of bread, nor a thirst for water, but of hearing the words of Jehovah.Amos 8:11-12.",
    "year": "2018"
  },
  {
    "number": "1993",
    "text": "When the Babylonians captured king Zedekiah, they",
    "options": {
      "A": "killed him immediately",
      "B": "assaulted his wives in his presence",
      "C": "pulled out his eyes",
      "D": "took his sons to Babylon"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48225?exam_type=jamb&type=obj&page=399",
    "correct_answer": "C",
    "explanation": "jerehiah 52;9and he was captured. He was taken to the king of Babylon at Riblah in the land of Hamath, where he pronounced sentence on him.\n10There at Riblah the king of Babylon slaughtered the sons of Zedekiah before his eyes; he also killed all the officials of Judah.\n11Then he put out Zedekiah's eyes, bound him with bronze shackles and took him to Babylon, where he put him in prison till the day of his death.",
    "year": "2018"
  },
  {
    "number": "1994",
    "text": "What did Saul do after his defeat of the Amalekites?",
    "options": {
      "A": "He set up a monument for himself",
      "B": "He returned to Shiloh",
      "C": "He offered sacrifices to God",
      "D": "He repented of his sins"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48226?exam_type=jamb&type=obj&page=399",
    "correct_answer": "A",
    "explanation": "1 samuel 15:12And Samuel rose early to meet Saul in the morning; and it was told Samuel, “Saul came to Carmel, and behold, he set up a monument for himself and turned, and passed on, and went down to Gilgal.",
    "year": "2018"
  },
  {
    "number": "1995",
    "text": "\"Is David not hiding himself on the hill of Hachilah, which is on the east of Jeshimon?\" This report was made to King Saul by the",
    "options": {
      "A": "Amalekites",
      "B": "Philistines",
      "C": "Hittites",
      "D": "Ziphites"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48227?exam_type=jamb&type=obj&page=399",
    "correct_answer": "D",
    "explanation": "1samuel 23:19Then came up the Ziphites to Saul to Gibeah, saying, Doth not David hide himself with us in strong holds in the wood, in the hill of Hachilah, whichison the south of Jeshimon?",
    "year": "2018"
  },
  {
    "number": "1996",
    "text": "According to John, the accusation the Jews levelled against Jesus before Pilate was that He was",
    "options": {
      "A": "a blasphemer",
      "B": "an evil doer",
      "C": "an impostor",
      "D": "perverted"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48228?exam_type=jamb&type=obj&page=400",
    "correct_answer": "A",
    "explanation": "The accusation against Jesus as a blasphemer can be found John 19:7 (Revised Standard Version), during Jesus' trial before Pilate, the Jews accused Him of blasphemy:\n\"The Jews answered him, 'We have a law, and by that law he ought to die, because he has made himself the Son of God.\"",
    "year": "2018"
  },
  {
    "number": "1997",
    "text": "What did God create on the fourth day?",
    "options": {
      "A": "The Firmament",
      "B": "Waters under the heavens",
      "C": "The two great lights",
      "D": "Sea creatures"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48229?exam_type=jamb&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "the fourth day - the Sun, Moon and stars were created.\nGenesis 1 :17-19AndGodset them in the firmament of the heaven to give light upon the earth, 18 and to rule over thedayand over the night, and to divide the light from the darkness; andGodsaw that it was good. 19 And there was evening and there was morning, afourth day.",
    "year": "2018"
  },
  {
    "number": "1998",
    "text": "Amaziah the priest of Bethel accused Amos, before Jeroboam the King of Israel of",
    "options": {
      "A": "rebellion",
      "B": "conspiracy",
      "C": "sabotage",
      "D": "libel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48230?exam_type=jamb&type=obj&page=400",
    "correct_answer": "B",
    "explanation": "Amos 7:10Then Amaziah the priest of Bethel sent to Jeroboam king of Israel, saying, Amos hath conspired against thee in the midst of the house of Israel: the land is not able to bear all his words.",
    "year": "2018"
  },
  {
    "number": "1999",
    "text": "What did King Josiah do the idolatrous priests of Judah?",
    "options": {
      "A": "He killed all of them",
      "B": "He sent all of them on exile",
      "C": "He deposed all of them",
      "D": "He demoted all of them"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48231?exam_type=jamb&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "2 kings 23:5Josiahalso got rid of the paganpriestsat the local shrines inJudahand around Jerusalem.",
    "year": "2018"
  },
  {
    "number": "2000",
    "text": "When David's son died, his servants refused to tell him because they feared that he might",
    "options": {
      "A": "fall and die",
      "B": "harm himself",
      "C": "push them",
      "D": "curse God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48232?exam_type=jamb&type=obj&page=400",
    "correct_answer": "B",
    "explanation": "2 samual 12:18He maydo himself some harm.”",
    "year": "2018"
  },
  {
    "number": "2001",
    "text": "The four people that left Ur of the Chaldeans for Canaan were",
    "options": {
      "A": "Nahor, Abram, Haran and Lot",
      "B": "Terah, Abram, Lot and Sarai",
      "C": "Abram, Sarai, Lot and Haran",
      "D": "Terah, Abram, Lot and Nabor"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48233?exam_type=jamb&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "Genesis 11:31Terah took his son Abram, his grandson Lot son of Haran, and his daughter-in-law Sarai, the wife of his son Abram, and together they set out from Ur of the Chaldeans to go to Canaan. But when they came to Harran, they settled there.",
    "year": "2018"
  },
  {
    "number": "2002",
    "text": "The scroll given to Ezekiel to eat at his call contained",
    "options": {
      "A": "words of lamentation and mourning",
      "B": "both praises and condemnation",
      "C": "the expected type of sacrifice",
      "D": "prescription for temple worship"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48235?exam_type=jamb&type=obj&page=401",
    "correct_answer": "A",
    "explanation": "Ezekiel 2:1-3, 3Ezekiel saw a hand stretched toward him. In the hand was a scroll which unrolled before him. There was writing on both sides of the scroll. Written on the scroll were words of lament, mourning, and woe.\nThe figure said, “Eat this scroll and fill your stomach with it.”\nEzekiel ate the scroll – and it tasted as sweet as honey",
    "year": "2018"
  },
  {
    "number": "2003",
    "text": "According to Amos, what did the Israelites do after God smote them with blight and mildew?",
    "options": {
      "A": "They fasted and prayed for healing",
      "B": "They still did not return to Him",
      "C": "They repented of their sins",
      "D": "They cried unto the Lord"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48236?exam_type=jamb&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "Amos 4;9\"Many times I struck your gardens and vineyards, destroying them with blight and mildew. Locusts devoured your fig and olive trees, yet you have not returned to me,\" declares the LORD.",
    "year": "2018"
  },
  {
    "number": "2004",
    "text": "Angel Gabriel told Zachariah that he would become dumb until John was born because he",
    "options": {
      "A": "looked down on the angel",
      "B": "was advanced in age",
      "C": "disagreed with Elizabeth, his wife",
      "D": "did not believe God's words"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48237?exam_type=jamb&type=obj&page=401",
    "correct_answer": "D",
    "explanation": "The Gospel of Luke states that whileZechariahministered at the altar of incense, anangelof the Lord appeared and announced tohimthat his wife would give birth to a son, whom he was to name John, and that this son would be the forerunner of the Lord (Luke 1:12–17)\nCiting their advanced age, Zechariah asked with disbelief for a sign whereby he would know the truth of this prophecy. In reply, the angel identified himself as Gabriel, sent especially by God to make this announcement, and added that because of Zechariah's doubt he would be struck dumb and \"not able to speak, until the day that these things shall be performed\".",
    "year": "2018"
  },
  {
    "number": "2005",
    "text": "\"Deal gently for my sake with the young man Absalom.\"\nDavid's statement exhibited his?",
    "options": {
      "A": "indulgent love for his son",
      "B": "willingness to forgive his competitors",
      "C": "desire to punish Absalom himself",
      "D": "high level of parental control"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48238?exam_type=jamb&type=obj&page=401",
    "correct_answer": "A",
    "explanation": "2samuel 18:5And the king commanded Joab and Abishai and Ittai, saying,Dealgently for my sake with the young man,evenwith Absalom. And all the people heard when the king gave all the captains charge concerning Absalom.\nDavid's statement, \"Deal gently for my sake with the young man Absalom,\" exhibited his indulgent love for his son. Despite Absalom's rebellion against him, David still expressed care and concern for his son's well-being, showing a fatherly love that prioritized kindness and forgiveness over harsh punishment or control.",
    "year": "2018"
  },
  {
    "number": "2006",
    "text": "The man of God whose word was ignored by Kings Ahab and Jehoshaphat was",
    "options": {
      "A": "Elijah",
      "B": "Zedekiah",
      "C": "Malakiah",
      "D": "Micaiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48239?exam_type=jamb&type=obj&page=402",
    "correct_answer": "D",
    "explanation": "2kings 22:8And the king of Israel said unto Jehoshaphat,There isyet one man,Micaiahthe son of Imlah, by whom we may inquire of the LORD: but I hate him; for he doth not prophesy good concerning me, but evil. And Jehoshaphat said, Let not the king say so.",
    "year": "2018"
  },
  {
    "number": "2007",
    "text": "\"Arise, be gone.\" This statement was made by Amnon when",
    "options": {
      "A": "he had captured Absalom",
      "B": "he had raped Tamar",
      "C": "Absalom invited him to a feast",
      "D": "he sent his servant to David"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48240?exam_type=jamb&type=obj&page=402",
    "correct_answer": "B",
    "explanation": "2sam 13:14-15Howbeit he would not hearken unto her voice: but, being stronger than she, forced her, and lay with her.Then Amnon hated her exceedingly; so that the hatred wherewith he hated herwasgreater than the love wherewith he had loved her. And Amnon said unto her, Arise, be gone.",
    "year": "2018"
  },
  {
    "number": "2008",
    "text": "According to James, the prayer of a righteous man is",
    "options": {
      "A": "powerful and effective",
      "B": "important and powerful",
      "C": "effective and acceptable",
      "D": "valuable and effective"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48242?exam_type=jamb&type=obj&page=402",
    "correct_answer": "A",
    "explanation": "James 5:16Theprayer of a righteous person ispowerful and effective.",
    "year": "2018"
  },
  {
    "number": "2009",
    "text": "In Thessalonia, believers are taught that at the second coming, the dead in Christ will",
    "options": {
      "A": "rise first",
      "B": "rise last",
      "C": "be judged first",
      "D": "be judged last"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48243?exam_type=jamb&type=obj&page=402",
    "correct_answer": "A",
    "explanation": "Paul teaches the Thessalonians that when Jesus comes, there will be a resurrection of all saints who have died, then a rapture of all saints together, those raised from the dead and those remaining alive.",
    "year": "2018"
  },
  {
    "number": "2010",
    "text": "According to james, judgment is without mercy to one who shows no mercy, yet mercy triumphs over",
    "options": {
      "A": "tribulation",
      "B": "the law",
      "C": "judgement",
      "D": "punishment"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48246?exam_type=jamb&type=obj&page=402",
    "correct_answer": "C",
    "explanation": "James 2:13because judgment without mercy will be shown to anyone who has not been merciful. Mercy triumphs over judgment.",
    "year": "2018"
  },
  {
    "number": "2011",
    "text": "\"As each has received a gift, employ it for one another, as good stewards of God's varied grace...\" In this statement, Peter teaches believers the virtue of",
    "options": {
      "A": "hospitality",
      "B": "giving",
      "C": "communion",
      "D": "fellowship"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48247?exam_type=jamb&type=obj&page=403",
    "correct_answer": "A",
    "explanation": "1Peter 4:10 (RSV)\n9 Practicehospitalityungrudgingly to one another. 10 As each has received a gift, employ it for one another, as good stewards of God’s varied grace: 11 whoever speaks, as one who utters oracles of God; whoever renders service, as one who renders it by the strength which God supplies; in order that in everything God may be glorified through Jesus Christ. To him belong glory and dominion for ever and ever. Amen.",
    "year": "2018"
  },
  {
    "number": "2012",
    "text": "According to Paul in his letter to Philemon, forgiveness should not be by compulsion but by",
    "options": {
      "A": "justification",
      "B": "faith",
      "C": "free will",
      "D": "his grace"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48248?exam_type=jamb&type=obj&page=403",
    "correct_answer": "C",
    "explanation": "Philemon 1:13-1413 whom I wished to keep with me, that in your behalf he might minister to me in my imprisonment for the gospel;14 but without your consent I did not want to do anything, that your goodness should not be as it were by compulsion, but of your own free will.",
    "year": "2018"
  },
  {
    "number": "2013",
    "text": "When Christians give freely, God will supply",
    "options": {
      "A": "only for those that give",
      "B": "their needs according to His riches in glory",
      "C": "their needs according to the measure they give",
      "D": "their needs day by day"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48250?exam_type=jamb&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "Giving freely, voluntarily, generously, joyfully, and sacrificially is worship God accepts. This type of worship pleases God. What a joy. What an opportunity. when we give freely with no grudges or regrets, Philippians 4:19 is our portion\nPhilippians 4:19But my God shall supply all your need according to his riches in glory by Christ Jesus.",
    "year": "2018"
  },
  {
    "number": "2014",
    "text": "The Last Supper took place during the passover on the first day of",
    "options": {
      "A": "the week",
      "B": "unleavened bread",
      "C": "abstinence from blood",
      "D": "the month"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48251?exam_type=jamb&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "All Gospels agree that Jesus held aLast Supperwith his disciples prior to dying on a Fridayator just before the time ofPassover\nAnd indeed, according to the Gospel of Mark 14:12, Jesus prepared for the Last Supper on the “first day of Unleavened Bread",
    "year": "2018"
  },
  {
    "number": "2015",
    "text": "In Mark, Jesus said that the unclean spirit can only be cast out through",
    "options": {
      "A": "faith",
      "B": "fasting",
      "C": "prayer",
      "D": "The Holy Spirit"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48252?exam_type=jamb&type=obj&page=403",
    "correct_answer": "C",
    "explanation": "InMark 9:29(Revised Standard Version), Jesus said that certain unclean spirits can only be cast out byprayer(and in some translations, prayer and fasting). The verse highlights the importance ofspiritual preparation and dependence on Godthrough prayer when dealing with evil spirits. While fasting is mentioned in some manuscripts, the most consistent and widely accepted answer isprayer.",
    "year": "2018"
  },
  {
    "number": "2016",
    "text": "\"The Lord opened her heart to give heed to what was said by Paul.\"\nThe person who gave heed to the words of Paul was",
    "options": {
      "A": "Priscilla",
      "B": "Sapphira",
      "C": "Lydia",
      "D": "Dorcas"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48253?exam_type=jamb&type=obj&page=404",
    "correct_answer": "C",
    "explanation": "Acts 16:14And a certain woman, by name Lydia, a seller of purple, of the city of Thyatira, who worshipped God, heard; whose heart the Lord opened to attend to the things spoken by Paul.",
    "year": "2018"
  },
  {
    "number": "2017",
    "text": "In his exhortation on interpersonal relationship, Peter commends that the elders should",
    "options": {
      "A": "have a cheerful spirit",
      "B": "have the willingness to give",
      "C": "live exemplary lives",
      "D": "give no room for wine"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48254?exam_type=jamb&type=obj&page=404",
    "correct_answer": "C",
    "explanation": "Peter advised elders tolook after God’s flock with tender care. They should work not as being underany external constraint, but willingly; not with the desire to make materialgains, but with the eagerness that comes from the heart; not with apresumptuous and domineering spirit but as examples to be copied by the flock,so that at the appropriate time, they might attain the crown of glory",
    "year": "2018"
  },
  {
    "number": "2018",
    "text": "Two Christian virtues to be learned in the story of the good Samaritan are",
    "options": {
      "A": "justice and humility",
      "B": "compassion and mercy",
      "C": "kindness and fairness",
      "D": "compassion and humility"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48256?exam_type=jamb&type=obj&page=404",
    "correct_answer": "B",
    "explanation": "In the story of the Good Samaritan, compassion and mercy are demonstrated through the Samaritan's actions. When he sees the injured man on the road, he shows compassion by stopping to help him despite the risks and inconveniences involved. He also shows mercy by taking care of the man's immediate needs and ensuring that he receives further assistance at an inn.\nThese virtues are central to the teachings of Jesus, emphasizing the importance of caring for others, especially those in need, and showing kindness and empathy without expecting anything in return.",
    "year": "2018"
  },
  {
    "number": "2019",
    "text": "\"Take heart, it is I, fear not.\" This statement was made by Jesus when",
    "options": {
      "A": "He appeared to two disciples on the way to Emmaus",
      "B": "He was walking on the sea in the night",
      "C": "Mary Magdalene saw Him at the sepulchre",
      "D": "the woman saw Him after resurrection"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48257?exam_type=jamb&type=obj&page=404",
    "correct_answer": "B",
    "explanation": "Mark 6:49-50but when they saw him walking on the sea they thought it was a ghost, and cried out,because they all saw him and were terrified. Immediately he spoke to them and said, \"Take courage! It is I. Don't be afraid.",
    "year": "2018"
  },
  {
    "number": "2020",
    "text": "According to Matthew, true wisdom is",
    "options": {
      "A": "to beware of false prophets and teachings",
      "B": "obeying fully the ten commandments",
      "C": "seeking God's kingdom and His righteousness",
      "D": "knowing the truth and doing it all the time"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48259?exam_type=jamb&type=obj&page=404",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "2021",
    "text": "According to Peter, believers who are reproached for the name of Christ are blessed because the spirit of",
    "options": {
      "A": "love of God rests upon them",
      "B": "Hope of God rests upon them",
      "C": "glory of God rests upon them",
      "D": "Patience of God rests upon them"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48260?exam_type=jamb&type=obj&page=405",
    "correct_answer": "C",
    "explanation": "1peter 4;14If you arereproached for the name of Christ, you areblessed,because the spiritof glory and of God rests upon you.",
    "year": "2018"
  },
  {
    "number": "2022",
    "text": "Jesus said anyone who put his hand to the plough and look back would not be",
    "options": {
      "A": "rich on earth",
      "B": "a good teacher",
      "C": "fit for the kingdom of God",
      "D": "able to perform miracles"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/48261?exam_type=jamb&type=obj&page=405",
    "correct_answer": "C",
    "explanation": "Luke 9; 62ButJesus toldhim, “Anyonewhoputs a handto theplowand thenlooks back is notfit for the Kingdom of God.",
    "year": "2018"
  }
]