[
  {
    "number": "2249",
    "text": "Which of the following is an example of a microorganism in action as a disease vector?",
    "options": {
      "A": "Fungi decomposing dead plant material",
      "B": "Mosquito transmitting malaria",
      "C": "Bacteria causing food poisoning",
      "D": "Algae producing oxygen through photosynthesis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68012?exam_type=jamb&type=obj&page=450",
    "correct_answer": "B",
    "explanation": "A disease vector is an organism that transmits disease-causing pathogens from one host to another. Female Anopheles mosquitoes can carry and transmit the Plasmodium parasite, which causes malaria. When an infected mosquito bites a person, it injects the parasite into the bloodstream, leading to the transmission of the disease.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2250",
    "text": "Which of the following is a characteristic of cells related to irritability?",
    "options": {
      "A": "Ability to respond to stimuli",
      "B": "Ability to synthesize proteins",
      "C": "Ability to generate energy",
      "D": "Ability to replicate DNA"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68013?exam_type=jamb&type=obj&page=450",
    "correct_answer": "A",
    "explanation": "Irritability, also known as responsiveness or excitability, refers to the ability of cells to detect and respond to various stimuli or changes in their environment.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2251",
    "text": "The membrane around the vacuole is known as",
    "options": {
      "A": "Elaioplast",
      "B": "Amyloplast",
      "C": "Tonoplast",
      "D": "Cytoplast"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68014?exam_type=jamb&type=obj&page=451",
    "correct_answer": "C",
    "explanation": "The membrane around the vacuole is known as Tonoplast. The tonoplast is the cytoplasmic membrane surrounding a vacuole, separating the vacuolar contents from the cell's cytoplasm. It is also known as Vacuolar membrane.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2252",
    "text": "Which of the following is evidence of evolution?",
    "options": {
      "A": "All of the above.",
      "B": "Similarities in embryonic development",
      "C": "Fossils of extinct organisms",
      "D": "Homologous structures in different species"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68015?exam_type=jamb&type=obj&page=451",
    "correct_answer": "A",
    "explanation": "All the options provided are evidence of evolution, which supports the idea that species have evolved and changed over time.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2253",
    "text": "Which of the following is an example of an adaptation for survival in social insects?",
    "options": {
      "A": "Migration to warmer climates",
      "B": "Production of venom for defense",
      "C": "Formation of complex caste systems",
      "D": "Hibernation during winter months"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68016?exam_type=jamb&type=obj&page=451",
    "correct_answer": "C",
    "explanation": "Social insects, such as ants, bees, wasps, and termites, exhibit complex social structures and behaviors that contribute to their survival and success as a colony. ocial insects organize themselves into specialized groups or castes, each with specific roles and functions. These castes can include workers, soldiers, drones, and queens. This division of labor and specialization enhances the efficiency of tasks within the colony, promoting survival and reproductive success.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2254",
    "text": "Which of the following is NOT a part of the alimentary canal?",
    "options": {
      "A": "Oesophagus",
      "B": "Large intestine",
      "C": "Liver",
      "D": "Small intestine"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68017?exam_type=jamb&type=obj&page=451",
    "correct_answer": "C",
    "explanation": "The alimentary canal, also known as the digestive tract, is a long tube that extends from the mouth to the anus and is responsible for the digestion and absorption of food. The organs that are part of the alimentary canal include the mouth, esophagus, stomach, small intestine, and large intestine. The liver produces bile, which aids in the digestion and absorption of fats, but its location is outside of the alimentary canal.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2255",
    "text": "Which of the following is an evolutionary trend commonly observed in organisms?",
    "options": {
      "A": "Decreased complexity over time",
      "B": "Increased dependence on external resources",
      "C": "Increased genetic diversity within populations",
      "D": "Decreased adaptation to the environment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68018?exam_type=jamb&type=obj&page=451",
    "correct_answer": "C",
    "explanation": "Evolutionary trends generally involve changes that occur over time in a population or species. One commonly observed trend is an increase in genetic diversity within populations. Genetic diversity refers to the variety of genetic traits and variations present within a population. Increased genetic diversity can provide a population with a greater potential to adapt to changes in the environment, as it provides a wider range of genetic material for natural selection to act upon.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2256",
    "text": "Which of the following is a characteristic feature of Kingdom Plantae?",
    "options": {
      "A": "Presence of chloroplasts",
      "B": "Ability to perform photosynthesis",
      "C": "Lack of cell walls",
      "D": "Heterotrophic mode of nutrition"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68019?exam_type=jamb&type=obj&page=452",
    "correct_answer": "A",
    "explanation": "Kingdom Plantae is characterized by the presence of chloroplasts. Chloroplasts are the site of photosynthesis in plant cells, where light energy is converted into chemical energy. This is not to say that all organisms with chloroplasts belong to the Plantae kingdom, but it is a common feature of this kingdom.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2257",
    "text": "A biome characterized by hot summer, warm winter and treeless vegetation is",
    "options": {
      "A": "Steppe grasslands",
      "B": "Temperate deserts",
      "C": "Savannah grassland",
      "D": "Tropical deserts"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68020?exam_type=jamb&type=obj&page=452",
    "correct_answer": "A",
    "explanation": "A biome characterized by hot summer, warm winter and treeless vegetation is the Steppe grassland. Steppe grasslands are characterized by grassy plains without trees apart from those near rivers and lakes. The summers can be hot, sometimes 40 °C (104 °F) or more, but winters are cold, with temperatures often falling below freezing.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2258",
    "text": "Which of the following is an example of physiological variation in organisms?",
    "options": {
      "A": "Variation in blood pressure among individuals",
      "B": "Variation in beak shape among finches",
      "C": "Differences in fur color in rabbits",
      "D": "Variation in leaf shape in plants"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68021?exam_type=jamb&type=obj&page=452",
    "correct_answer": "A",
    "explanation": "Physiological variation refers to differences in physiological traits or functions among individuals within a species. Blood pressure is a physiological parameter that can vary among individuals based on factors such as genetics, health conditions, lifestyle, and environmental influences. Physiological variation encompasses variations in functions, processes, and internal characteristics of organisms, such as metabolic rates, hormone levels, enzyme activities, blood parameters, and other physiological traits.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2259",
    "text": "Which of the following are components of the skeletal system in humans?",
    "options": {
      "A": "Cartilage and blood vessels",
      "B": "Ligaments and tendons",
      "C": "Muscles and nerves",
      "D": "Bones and joints"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68022?exam_type=jamb&type=obj&page=452",
    "correct_answer": "D",
    "explanation": "The skeletal system in humans is composed of bones and joints. Bones and joints are the primary components of the human skeletal system.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2260",
    "text": "Which of the following represents an example of ecological management and conservation through a biological association?",
    "options": {
      "A": "Construction of a dam for hydroelectric power",
      "B": "Introduction of an invasive species for pest control",
      "C": "Clear-cutting of a forest for timber extraction",
      "D": "Establishment of marine protected areas"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68023?exam_type=jamb&type=obj&page=452",
    "correct_answer": "D",
    "explanation": "Ecological management and conservation involve strategies and practices aimed at preserving and protecting natural ecosystems and their biodiversity. Among the options provided, the establishment of marine protected areas is an example of such management and conservation through a biological association.\nEstablishing Marine Protected Areas (MPAs) is a vital tool for ecological management and conservation, particularly through the principles of biological association. MPAs help to safeguard marine ecosystems by controlling human activities, promoting the recovery of overexploited species, and conserving or restoring habitats and food webs. By protecting areas where species interact and depend on each other, MPAs contribute to the overall health and resilience of marine ecosystems.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2261",
    "text": "The term cell was given by",
    "options": {
      "A": "Robert Hooke",
      "B": "Schwann",
      "C": "De Bary",
      "D": "Tatum"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68024?exam_type=jamb&type=obj&page=453",
    "correct_answer": "A",
    "explanation": "The term cell was given by Robert Hooke. The term cell was coined by Robert Hooke. Robert Hooke observed a honeycomb-like structure under the microscope while cutting a thin section of cork, hence he named the structure as a cell.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2262",
    "text": "Which of the following is the primary organ involved in gas exchange during respiration in humans?",
    "options": {
      "A": "Diaphragm",
      "B": "Bronchi",
      "C": "Lungs",
      "D": "Trachea"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68025?exam_type=jamb&type=obj&page=453",
    "correct_answer": "C",
    "explanation": "The primary organ involved in gas exchange during respiration in humans is the lungs. The lungs are a pair of respiratory organs located in the chest cavity. They are responsible for the exchange of oxygen and carbon dioxide between the air and the bloodstream.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2263",
    "text": "Which gland is responsible for producing the hormone insulin?",
    "options": {
      "A": "Thyroid gland",
      "B": "Pituitary gland",
      "C": "Pancreas",
      "D": "Adrenal gland"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68026?exam_type=jamb&type=obj&page=453",
    "correct_answer": "C",
    "explanation": "The pancreas is an organ located in the abdomen, and it serves both digestive and endocrine functions. In terms of hormone production, the pancreas is responsible for producing insulin. Insulin plays a crucial role in regulating blood sugar levels by facilitating the uptake of glucose into cells.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2264",
    "text": "Most fishes do not sink in water because of the presences of:\nI. swim bladder\nII. air bladder\nIII. air sacs\nIV. air in spongy bones",
    "options": {
      "A": "II and III are correct",
      "B": "I and II are correct",
      "C": "I, II, III and IV are correct",
      "D": "III and IV are correct"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68027?exam_type=jamb&type=obj&page=453",
    "correct_answer": "B",
    "explanation": "Fishes have a swim bladder or air bladder which helps them to remain buoyant without sinking in water. They are present in the body cavity.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2265",
    "text": "In monohybrid inheritance, if an organism carries two different alleles for a particular gene, it is called:",
    "options": {
      "A": "Homozygous",
      "B": "Dominant",
      "C": "Heterozygous",
      "D": "Recessive"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68028?exam_type=jamb&type=obj&page=453",
    "correct_answer": "C",
    "explanation": "In monohybrid inheritance, the inheritance of a single gene is considered. An organism that carries two different alleles for a particular gene is referred to as heterozygous. The alleles may have different versions or variations of the gene. Heterozygous individuals carry two different alleles, with one being dominant and the other recessive.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2266",
    "text": "What is the tissue responsible for transporting water and minerals from the roots to the rest of the plant?",
    "options": {
      "A": "Xylem",
      "B": "Epidermis",
      "C": "Parenchyma",
      "D": "Phloem"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68029?exam_type=jamb&type=obj&page=454",
    "correct_answer": "A",
    "explanation": "The tissue responsible for transporting water and minerals from the roots to the rest of the plant is called xylem. Xylem is a complex tissue composed of specialized cells, such as tracheids and vessel elements, which form long, interconnected tubes. These tubes facilitate the upward movement of water and minerals through the plant. Xylem also provides mechanical support to the plant.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2267",
    "text": "Which of the following is an example of an abiotic ecological factor?",
    "options": {
      "A": "Temperature",
      "B": "Competition",
      "C": "Predation",
      "D": "Symbiosis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68030?exam_type=jamb&type=obj&page=454",
    "correct_answer": "A",
    "explanation": "Abiotic ecological factors are non-living factors that influence an ecosystem. They include physical and chemical factors such as temperature, sunlight, water availability, soil composition, and air quality.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2268",
    "text": "Which of the following processes is involved in the reproduction of developing organisms?",
    "options": {
      "A": "Budding",
      "B": "Germination",
      "C": "Fertilization",
      "D": "Pollination"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68031?exam_type=jamb&type=obj&page=454",
    "correct_answer": "C",
    "explanation": "Fertilization is the process by which the male and female gametes (reproductive cells) fuse to initiate the development of a new organism.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2269",
    "text": "Behavioral adaptation for dealing with a hot climate could include",
    "options": {
      "A": "Hibernating during the hottest part of the day",
      "B": "Large scales on the back of a lizard",
      "C": "Feeding during the hottest part of the day",
      "D": "A small kidney to conserve water"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68032?exam_type=jamb&type=obj&page=454",
    "correct_answer": "A",
    "explanation": "Estivation: Certain animals enter a state of estivation, which is similar to hibernation but occurs in response to hot and dry conditions. They become inactive, conserve energy, and reduce water loss during the hottest parts of the day or during extended periods of high temperatures.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2270",
    "text": "The natural place of an organism or community is known as",
    "options": {
      "A": "Niche",
      "B": "Habit",
      "C": "Biome",
      "D": "Habitat"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68033?exam_type=jamb&type=obj&page=454",
    "correct_answer": "D",
    "explanation": "The natural place of an organism or community is known as its habitat. A habitat is an ecological or environmental area that is inhabited by a particular species of animal, plant, or other type of organism. It is the natural environment in which an organism lives, or the physical environment that surrounds a species population.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2271",
    "text": "Which process in the nutrient cycle converts atmospheric nitrogen into a form that plants can utilize?",
    "options": {
      "A": "Denitrification",
      "B": "Nitrogen fixation",
      "C": "Ammonification",
      "D": "Nitrification"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68034?exam_type=jamb&type=obj&page=455",
    "correct_answer": "B",
    "explanation": "Nitrogen fixation is the process in the nutrient cycle that converts atmospheric nitrogen (N2) into a form that plants can utilize, typically ammonium (NH4+) or nitrate (NO3-). This process is carried out by nitrogen-fixing bacteria, which can either be free-living in the soil or form mutualistic relationships with certain plants, such as legumes.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2272",
    "text": "Which of the following functions is performed by the skin to help maintain homeostasis in the human body?",
    "options": {
      "A": "Regulation of body temperature",
      "B": "Filtration of blood",
      "C": "Production of hormones",
      "D": "Digestion of food"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68035?exam_type=jamb&type=obj&page=455",
    "correct_answer": "A",
    "explanation": "The skin plays a vital role in maintaining homeostasis by regulating body temperature. When the body becomes too hot, the skin helps to cool it down through processes like sweating and vasodilation.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2273",
    "text": "Which of the following soil types becomes less fertile due to the intense leaching caused by tropical rains?",
    "options": {
      "A": "Yellow soil",
      "B": "Laterite soil",
      "C": "Red soils",
      "D": "Black soil"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68036?exam_type=jamb&type=obj&page=455",
    "correct_answer": "B",
    "explanation": "Laterite soil becomes less fertile due to intense leaching caused by tropical rains. Leaching is the process by which nutrients are washed out of the soil by rainfall. In the case of laterite soils, which are common in tropical regions, the heavy rainfall can cause intense leaching, leading to a loss of fertility.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2274",
    "text": "Which type of reproduction involves the fusion of gametes from two parents?",
    "options": {
      "A": "Sexual reproduction",
      "B": "Asexual reproduction",
      "C": "Binary fission",
      "D": "Budding"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68037?exam_type=jamb&type=obj&page=455",
    "correct_answer": "A",
    "explanation": "Sexual reproduction involves the fusion of gametes from two parents, typically a male and a female. In this process, specialized cells called gametes (sperm and egg) are produced through meiosis. The fusion of these gametes during fertilization leads to the formation of a zygote, which develops into a new individual with a combination of genetic traits from both parents.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2275",
    "text": "Which processes are involved in nutrient cycling in a functioning ecosystem?",
    "options": {
      "A": "Erosion, weathering, and sedimentation",
      "B": "Decomposition, evaporation, and precipitation",
      "C": "Nitrogen fixation, denitrification, and ammonification",
      "D": "Respiration, photosynthesis, and transpiration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68038?exam_type=jamb&type=obj&page=455",
    "correct_answer": "C",
    "explanation": "Nitrogen fixation: This process involves the conversion of atmospheric nitrogen gas (N2) into a usable form, such as ammonium (NH4+), by nitrogen-fixing bacteria or through lightning. This makes nitrogen available for plants and other organisms.Denitrification: Denitrifying bacteria convert nitrates (NO3-) back into atmospheric nitrogen gas (N2), completing the nitrogen cycle. Denitrification occurs under anaerobic conditions, such as in waterlogged soils or sediments.Ammonification: Ammonification is the process by which decomposers, like bacteria and fungi, break down organic nitrogen compounds from dead organisms and waste products into ammonium (NH4+). This ammonium can then be used by plants and other organisms.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2276",
    "text": "What is autotrophic nutrition?",
    "options": {
      "A": "Nutrition in which organisms obtain food by breaking down complex organic compounds.",
      "B": "Nutrition in which organisms obtain food from other organisms",
      "C": "Nutrition in which organisms obtain food by consuming both plants and animals",
      "D": "Nutrition in which organisms produce their own food using energy from the sun or inorganic substances"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68039?exam_type=jamb&type=obj&page=456",
    "correct_answer": "D",
    "explanation": "Autotrophic nutrition refers to the ability of organisms to synthesize their own food molecules from simple inorganic substances such as carbon dioxide and water.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2277",
    "text": "The theory of evolution can be defined as",
    "options": {
      "A": "The belief that all species were created in their current form",
      "B": "The hypothesis that organisms strive to improve themselves over generations",
      "C": "The idea that species change over time through natural processes",
      "D": "The concept that evolution occurs through a series of sudden and dramatic changes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68040?exam_type=jamb&type=obj&page=456",
    "correct_answer": "C",
    "explanation": "The theory of evolution is a scientific explanation for the diversity of life on Earth. It states that species change over time through a process known as natural selection. This theory, proposed by Charles Darwin and Alfred Russel Wallace in the 19th century, suggests that populations of organisms evolve over generations in response to changes in their environment.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2278",
    "text": "Which of the following is a male reproductive organ in humans?",
    "options": {
      "A": "Uterus",
      "B": "Ovary",
      "C": "Testis",
      "D": "Fallopian tube"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68041?exam_type=jamb&type=obj&page=456",
    "correct_answer": "C",
    "explanation": "The testis is a male reproductive organ in humans. It is responsible for producing sperm cells and secreting the male sex hormone testosterone. The testes are located within the scrotum, outside the abdominal cavity.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2279",
    "text": "Which of the following is an example of a behavioral adaptation for survival in animals?",
    "options": {
      "A": "Sharp teeth",
      "B": "Migration",
      "C": "Wings",
      "D": "Camouflage"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68042?exam_type=jamb&type=obj&page=456",
    "correct_answer": "B",
    "explanation": "Migration is an example of a behavioral adaptation for survival in animals. Migration refers to the regular movement of animals from one place to another, often over long distances. Animals may migrate to find better food sources, suitable breeding grounds, or more favorable climates.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2280",
    "text": "Which of the following traits is not visible in a person with Down syndrome?",
    "options": {
      "A": "Short neck",
      "B": "High muscle tone",
      "C": "Small stature",
      "D": "Slant eyes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68043?exam_type=jamb&type=obj&page=456",
    "correct_answer": "B",
    "explanation": "People with Down syndrome always have intellectual or physical disabilities. High muscle tone is not visible in a person with Down syndrome\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2281",
    "text": "What is the definition of population ecology?",
    "options": {
      "A": "The study of interactions between organisms and their physical environment",
      "B": "The study of evolutionary processes and their effects on populations",
      "C": "The study of interactions between different populations in an ecosystem",
      "D": "The study of the distribution and abundance of individuals within a species"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68044?exam_type=jamb&type=obj&page=457",
    "correct_answer": "D",
    "explanation": "Population ecology is a branch of ecology that focuses on the study of populations of organisms belonging to the same species. t involves examining how populations are distributed across different habitats and how their numbers change over time.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2282",
    "text": "What is the term used to describe the maximum number of individuals of a species that an environment can support indefinitely?",
    "options": {
      "A": "Ecological niche",
      "B": "Limiting factor",
      "C": "Carrying capacity",
      "D": "Density-dependent factor"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68045?exam_type=jamb&type=obj&page=457",
    "correct_answer": "C",
    "explanation": "Carrying capacity refers to the maximum number of individuals of a species that a particular environment can sustain over a prolonged period of time. It represents the balance between the available resources in the environment and the population's demand for those resources.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2283",
    "text": "Which of the following statements about the heart is true?",
    "options": {
      "A": "The heart is responsible for the production of red blood cells",
      "B": "The heart pumps oxygenated blood to the lungs",
      "C": "The heart receives blood from the kidneys and filters waste products",
      "D": "The heart is a muscular organ that contracts to circulate blood throughout the body"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68046?exam_type=jamb&type=obj&page=457",
    "correct_answer": "D",
    "explanation": "The heart is a vital organ in the circulatory system responsible for pumping and circulating blood throughout the body.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2284",
    "text": "What is the primary source of variation in a population?",
    "options": {
      "A": "Gene flow",
      "B": "Mutation",
      "C": "Natural selection",
      "D": "Genetic drift"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68047?exam_type=jamb&type=obj&page=457",
    "correct_answer": "B",
    "explanation": "The primary source of variation in a population is mutation. Mutation is a spontaneous change in the DNA sequence of an organism's genome. It introduces new genetic variations by altering the existing genetic information.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2285",
    "text": "Which component of blood is responsible for carrying oxygen to the body tissues?",
    "options": {
      "A": "Platelets",
      "B": "White blood cells",
      "C": "Red blood cells",
      "D": "Plasma"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68049?exam_type=jamb&type=obj&page=457",
    "correct_answer": "C",
    "explanation": "Red blood cells, also known as erythrocytes, are responsible for carrying oxygen to the body tissues. They contain a protein called hemoglobin, which binds to oxygen in the lungs and transports it to other parts of the body.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2286",
    "text": "What are the primary products of photosynthesis?",
    "options": {
      "A": "Carbon dioxide and water",
      "B": "Glucose and oxygen",
      "C": "Glucose and carbon dioxide",
      "D": "Oxygen and water"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68050?exam_type=jamb&type=obj&page=458",
    "correct_answer": "B",
    "explanation": "The primary products of photosynthesis are glucose and oxygen. During photosynthesis, plants use sunlight, water, and carbon dioxide to produce glucose, a simple sugar that serves as the main source of energy for the plant. Oxygen is also produced as a byproduct of photosynthesis and is released into the atmosphere.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2287",
    "text": "The alternate form of a gene is",
    "options": {
      "A": "Alternate type",
      "B": "Dominant character",
      "C": "Recessive character",
      "D": "Allele"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68051?exam_type=jamb&type=obj&page=458",
    "correct_answer": "D",
    "explanation": "In genetics, an allele is one of two or more versions of a gene that are found at the same place on a chromosome. Alleles can come in different versions, with each version bringing about different phenotypic traits. For example, a gene for flower color may have one allele that produces red flowers and another allele that produces white flowers. Therefore, the alternate form of a gene is an allele.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2288",
    "text": "Which organs are part of the alimentary canal in the human digestive system?",
    "options": {
      "A": "Salivary glands, tongue, and pharynx",
      "B": "Large intestine, appendix, and rectum",
      "C": "Stomach, liver, and gallbladder",
      "D": "Oesophagus, pancreas, and small intestine"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68052?exam_type=jamb&type=obj&page=458",
    "correct_answer": "B",
    "explanation": "The alimentary canal, also known as the gastrointestinal tract, is a long, continuous tube that extends from the mouth to the anus. It is responsible for the digestion and absorption of nutrients.Oesophagus: The esophagus is a muscular tube that connects the mouth to the stomach.Small intestine: The small intestine is the longest part of the alimentary canal and is divided into three sections: duodenum, jejunum, and ileum.\nAlimentary Canal: This includes the organs that form a continuous passage from the mouth to the anus, such as: Mouth, Oesophagus, Stomach, Small intestine, Large intestine, Appendix, Rectum, and Anus",
    "year": "2023"
  },
  {
    "number": "2289",
    "text": "Which of the following characteristics is typical of the phylum Arthropoda?",
    "options": {
      "A": "Radial symmetry",
      "B": "Closed circulatory system",
      "C": "Endoskeleton made of bones",
      "D": "Presence of a segmented body"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68181?exam_type=jamb&type=obj&page=458",
    "correct_answer": "D",
    "explanation": "Arthropods are characterized by the presence of a segmented body. This is a key characteristic of the phylum Arthropoda, which includes insects, spiders, and crustaceans. The other options are incorrect. Arthropods do not exhibit radial symmetry, they have an open circulatory system, and their exoskeleton is made of chitin, not bones.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2290",
    "text": "Which of the following is an example of conserving resources in an ecosystem",
    "options": {
      "A": "Excessive use of chemical fertilizers in agriculture",
      "B": "Introducing invasive species to an ecosystem",
      "C": "Implementing sustainable fishing practices",
      "D": "Cutting down trees for timber production"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68182?exam_type=jamb&type=obj&page=458",
    "correct_answer": "C",
    "explanation": "Implementing sustainable fishing practices is an example of conserving resources in an ecosystem. It identifies a practice that helps in preserving and maintaining the fish populations and the overall health of aquatic ecosystems.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2291",
    "text": "Which of the following represents the correct hierarchical organization of life from the smallest to the largest scale?",
    "options": {
      "A": "Organs, tissues, cells, organisms, populations, communities, ecosystems",
      "B": "Cells, organs, tissues, organisms, populations, communities, ecosystems",
      "C": "Tissues, organs, cells, organisms, populations, communities, ecosystems",
      "D": "Cells, tissues, organs, organisms, populations, communities, ecosystems"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68183?exam_type=jamb&type=obj&page=459",
    "correct_answer": "D",
    "explanation": "The correct hierarchical organization of life from the smallest to the largest scale is as follows: cells, tissues, organs, organisms, populations, communities, ecosystems.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2292",
    "text": "Which of the following blood vessels carries oxygenated blood away from the heart?",
    "options": {
      "A": "Arteries",
      "B": "Venules",
      "C": "Capillaries",
      "D": "Veins"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68185?exam_type=jamb&type=obj&page=459",
    "correct_answer": "A",
    "explanation": "Arteries are blood vessels that carry oxygenated blood away from the heart to various parts of the body.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2293",
    "text": "Which of the following factors primarily affects the distribution of organisms in an ecosystem",
    "options": {
      "A": "Wind speed",
      "B": "Soil pH",
      "C": "Temperature",
      "D": "Day length"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68188?exam_type=jamb&type=obj&page=459",
    "correct_answer": "C",
    "explanation": "Temperature primarily affects the distribution of organisms in an ecosystem. Temperature is a crucial factor that influences the survival, growth, and reproductive capabilities of organisms. Different species have specific temperature requirements and tolerance ranges.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2294",
    "text": "Which of the following is NOT a method of reproduction in animals?",
    "options": {
      "A": "Asexual reproduction",
      "B": "Budding",
      "C": "Sexual reproduction",
      "D": "Sporulation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68189?exam_type=jamb&type=obj&page=459",
    "correct_answer": "D",
    "explanation": "Sporulation is a method of reproduction observed in some groups of organisms, such as fungi and certain types of protists. It involves the formation and release of spores, which are specialized reproductive structures that can develop into new individuals under suitable conditions. Sporulation is not a method of reproduction in animals.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2295",
    "text": "Which of the following statements is true about the kingdom Fungi?",
    "options": {
      "A": "Fungi obtain nutrients by absorbing organic matter",
      "B": "Fungi are photosynthetic organisms",
      "C": "Fungi are multicellular organisms",
      "D": "Fungi reproduce through the formation of seeds"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68190?exam_type=jamb&type=obj&page=459",
    "correct_answer": "A",
    "explanation": "The correct statement about the kingdom Fungi is that fungi obtain nutrients by absorbing organic matter. Fungi are heterotrophic organisms, meaning they cannot synthesize their own organic compounds. Instead, they secrete enzymes to break down organic matter in their surroundings, such as decaying plants or dead animals, and absorb the resulting nutrients.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2296",
    "text": "Viviparity refers to the reproductive strategy in which",
    "options": {
      "A": "Offspring are produced by internal fertilization",
      "B": "Offspring are produced by external fertilization",
      "C": "Offspring develop and are nourished inside the female's body",
      "D": "Offspring develop and are nourished outside the female's body"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68191?exam_type=jamb&type=obj&page=460",
    "correct_answer": "C",
    "explanation": "Viviparity is a reproductive strategy in which offspring develop and are nourished inside the female's body until they are ready to be born. Viviparity is commonly observed in various organisms, including mammals, some reptiles, and certain fish species. In viviparous species, the developing offspring receive nutrients and oxygen directly from the mother through specialized structures such as a placenta or other nutrient-transfer organs.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2297",
    "text": "Which of the following is the most inclusive level of classification in the Linnaean system?",
    "options": {
      "A": "Kingdom",
      "B": "Phylum",
      "C": "Domain",
      "D": "Class"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68193?exam_type=jamb&type=obj&page=460",
    "correct_answer": "A",
    "explanation": "The most inclusive level of classification in the Linnaean system is the kingdom.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2298",
    "text": "Which of the following describes the inheritance of traits from parents to offspring?",
    "options": {
      "A": "Adaptation",
      "B": "Evolution",
      "C": "Natural selection",
      "D": "Genetics"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68412?exam_type=jamb&type=obj&page=460",
    "correct_answer": "D",
    "explanation": "Genetics is the field of biology that studies the inheritance of traits from parents to offspring. Genetics encompasses various concepts and principles, including the study of genes, DNA, chromosomes, genetic inheritance patterns, genetic mutations, and genetic variations.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2299",
    "text": "Which of the following statements best describes the role of competition in the process of adaptation?",
    "options": {
      "A": "Competition leads to the selection of individuals with favorable traits for survival and reproduction",
      "B": "Competition ensures equal distribution of resources among individuals in a population",
      "C": "Competition leads to the development of new traits and adaptations in a population",
      "D": "Competition reduces the need for adaptations as individuals coexist peacefully"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68414?exam_type=jamb&type=obj&page=460",
    "correct_answer": "A",
    "explanation": "When individuals within a population compete for limited resources such as food, water, or mates, those individuals with favorable traits that enhance their ability to acquire resources are more likely to survive and reproduce.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2300",
    "text": "Which of the following statements is true regarding sex-linked traits?",
    "options": {
      "A": "Sex-linked traits are located on the sex chromosomes",
      "B": "Sex-linked traits are inherited only from the mother",
      "C": "Sex-linked traits are more commonly observed in females",
      "D": "Sex-linked traits are not influenced by hormonal factors"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68415?exam_type=jamb&type=obj&page=460",
    "correct_answer": "A",
    "explanation": "Sex-linked traits are traits that are determined by genes located on the sex chromosomes (X and Y chromosomes in humans).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2301",
    "text": "Which of the following is a plant hormone responsible for promoting cell elongation and growth?",
    "options": {
      "A": "Abscisic acid",
      "B": "Gibberellins",
      "C": "Ethylene",
      "D": "Cytokinins"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68416?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "Gibberellins are plant hormones that play a significant role in promoting cell elongation and growth.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2302",
    "text": "Which of the following is a primary source of pollution in aquatic ecosystems?",
    "options": {
      "A": "Soil erosion",
      "B": "Industrial discharge",
      "C": "Air pollution",
      "D": "Deforestation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68417?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "Industrial discharge refers to the release of pollutants, such as chemicals, heavy metals, and wastewater, from industrial activities into water bodies. This is a primary source of pollution in aquatic ecosystems. Industries generate various pollutants that are often released into nearby water bodies, leading to water pollution and adverse effects on aquatic organisms and ecosystems.",
    "year": "2023"
  },
  {
    "number": "2303",
    "text": "Which of the following mechanisms is responsible for providing support in plants?",
    "options": {
      "A": "Muscles and bones",
      "B": "Exoskeleton",
      "C": "Endocrine system",
      "D": "Cell walls and turgor pressure"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68418?exam_type=jamb&type=obj&page=461",
    "correct_answer": "D",
    "explanation": "The mechanism responsible for providing support in plants is the combination of cell walls and turgor pressure. In plants, the cell walls, composed of cellulose, provide structural support to the cells and tissues. They give rigidity and strength to plant cells, enabling them to maintain their shape and resist external forces. Additionally, turgor pressure, which is the pressure exerted by the cell contents against the cell walls, helps maintain the overall rigidity and upright form of plants.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2304",
    "text": "Metamorphosis is a biological process that involves",
    "options": {
      "A": "The growth and development of an organism from a zygote to an adult",
      "B": "The change in form and structure during the life cycle of certain organisms",
      "C": "The regeneration of lost body parts in an organism",
      "D": "The transformation of an organism from an adult stage to a larval stage"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68419?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "Metamorphosis is commonly observed in certain animal groups, such as insects (e.g., butterflies, beetles) and amphibians (e.g., frogs, salamanders). It involves a dramatic change in body form and structure as an organism progresses through distinct stages of its life cycle. These stages may include egg, larval, pupal, and adult phases.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2305",
    "text": "Which of the following organs is primarily responsible for excretion in humans?",
    "options": {
      "A": "Liver",
      "B": "Pancreas",
      "C": "Kidneys",
      "D": "Lungs"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68420?exam_type=jamb&type=obj&page=461",
    "correct_answer": "C",
    "explanation": "The kidneys are primarily responsible for excretion in humans. The kidneys are the major excretory organs in humans. They filter waste products, excess ions, and water from the blood to produce urine, which is then eliminated from the body.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2306",
    "text": "Which of the following is the correct classification of carbohydrates?",
    "options": {
      "A": "Lipid",
      "B": "Phytonutrient",
      "C": "Macronutrient",
      "D": "Micronutrient"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68421?exam_type=jamb&type=obj&page=462",
    "correct_answer": "C",
    "explanation": "Carbohydrates are classified as macronutrients. Macronutrient, as carbohydrates are a major source of energy in the diet and are classified as such.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2307",
    "text": "Which of the following eye defects is caused by the inability of the eye to focus light on the retina?",
    "options": {
      "A": "Glaucoma",
      "B": "Myopia",
      "C": "Cataracts",
      "D": "Astigmatism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68422?exam_type=jamb&type=obj&page=462",
    "correct_answer": "B",
    "explanation": "Myopia, also known as nearsightedness, is an eye defect characterized by the inability of the eye to focus light on the retina. Myopia is characterized by the ability to see nearby objects clearly while distant objects appear blurred. It occurs when the eyeball is elongated or the cornea is too curved, causing the incoming light to focus in front of the retina instead of directly on it.\nBoth astigmatism and myopia (nearsightedness) are eye defects caused by the inability of the eye to focus light properly on the retina, but they manifest differently: astigmatism causes blurred or distorted vision due to an irregularly shaped cornea or lens, while myopia causes blurry vision at a distance because the eye focuses light in front of the retina.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2308",
    "text": "Germination is the process in which a seed",
    "options": {
      "A": "Begins to photosynthesize",
      "B": "Develops into a mature plant",
      "C": "Absorbs nutrients from the soil",
      "D": "Breaks dormancy and starts to grow"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68423?exam_type=jamb&type=obj&page=462",
    "correct_answer": "D",
    "explanation": "Germination refers to the process by which a seed breaks dormancy and starts to grow into a new plant. Germination occurs when a seed is exposed to favorable environmental conditions, including proper moisture, oxygen availability, and suitable temperature.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2309",
    "text": "Which of the following statements is true regarding sexual reproduction in organisms?",
    "options": {
      "A": "It involves the fusion of gametes from two parents, resulting in offspring with genetic variation",
      "B": "It involves the production of offspring through a single parent, resulting in genetically identical offspring",
      "C": "It is a form of asexual reproduction where offspring are produced without the involvement of gametes",
      "D": "It does not involve the formation of gametes or the fusion of reproductive cells"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68424?exam_type=jamb&type=obj&page=462",
    "correct_answer": "A",
    "explanation": "The statement that is true regarding sexual reproduction in organisms is that it involves the fusion of gametes from two parents, resulting in offspring with genetic variation. Sexual reproduction involves the production of haploid gametes (sperm and eggs) by two parents, which then fuse during fertilization to form a genetically diverse offspring.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2310",
    "text": "Which of the following is a method of asexual reproduction in plants?",
    "options": {
      "A": "Pollination",
      "B": "Vegetative propagation",
      "C": "Seed dispersal",
      "D": "Fertilization"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68425?exam_type=jamb&type=obj&page=462",
    "correct_answer": "B",
    "explanation": "Vegetative propagation is a method of asexual reproduction in plants. It refers to the production of new plants from vegetative structures, such as stems, leaves, or roots, without the involvement of seeds or spores. This method allows plants to produce genetically identical offspring to the parent plant.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2311",
    "text": "Which of the following plant tissues is responsible for transporting water and nutrients from the roots to the rest of the plant?",
    "options": {
      "A": "Mesophyll",
      "B": "Xylem",
      "C": "Epidermis",
      "D": "Phloem"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68426?exam_type=jamb&type=obj&page=463",
    "correct_answer": "B",
    "explanation": "Xylem is the plant tissue responsible for transporting water and nutrients from the roots to the rest of the plant.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2312",
    "text": "Which of the following statements best describes courtship behaviors in animals?",
    "options": {
      "A": "Courtship behaviors are solely performed by males to establish dominance within a social group",
      "B": "Courtship behaviors involve displays and rituals performed by both males and females to attract a mate",
      "C": "Courtship behaviors are primarily performed by females to attract males for mating",
      "D": "Courtship behaviors are aggressive interactions between males competing for a female mate"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68427?exam_type=jamb&type=obj&page=463",
    "correct_answer": "B",
    "explanation": "The statement that best describes courtship behaviors in animals is that they involve displays and rituals performed by both males and females to attract a mate. Courtship behaviors play a crucial role in mate selection and reproductive success in many animal species. They involve a variety of displays, rituals, vocalizations, dances, or other behaviors that serve to communicate sexual receptivity, readiness, and attractiveness.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2313",
    "text": "Which of the following best describes physiological variation in biology?",
    "options": {
      "A": "Variations in the physiological processes and functions of organisms",
      "B": "Differences in physical characteristics and appearance within a population",
      "C": "Differences in behavior and social interactions among individuals",
      "D": "Variations in the genetic makeup of individuals within a species"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68428?exam_type=jamb&type=obj&page=463",
    "correct_answer": "A",
    "explanation": "Physiological variation in biology refers to the variations in the physiological processes and functions of organisms. Physiological variation encompasses the variations in the internal processes and functions of organisms, including metabolic processes, hormone regulation, immune responses, cellular functions, and physiological adaptations.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2314",
    "text": "Which of the following options correctly identifies excretory organs in animals?",
    "options": {
      "A": "Stomach, intestines, and bladder",
      "B": "Lungs, kidneys, and skin",
      "C": "Brain, spinal cord, and nerves",
      "D": "Heart, liver, and spleen"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68429?exam_type=jamb&type=obj&page=463",
    "correct_answer": "B",
    "explanation": "The correct identification of excretory organs in animals is lungs, kidneys, and skin.Lungs play a vital role in excretion by eliminating carbon dioxide, a waste product of cellular respiration, through exhalation.Kidneys are major excretory organs responsible for filtering blood and removing metabolic wastes, excess water, and dissolved solutes in the form of urine.Skin, although primarily a protective organ, also participates in excretion. Sweating, through sweat glands in the skin, helps regulate body temperature and eliminates small amounts of metabolic waste such as urea and salts.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2315",
    "text": "Which of the following best describes the concept of trophic levels in a functioning ecosystem?",
    "options": {
      "A": "The levels of ecological interactions within an ecosystem",
      "B": "The levels of energy flow within an ecosystem",
      "C": "The levels of nutrient cycling within an ecosystem",
      "D": "The levels of biological diversity within an ecosystem"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68431?exam_type=jamb&type=obj&page=463",
    "correct_answer": "B",
    "explanation": "The concept of trophic levels in a functioning ecosystem refers to the levels of energy flow within the ecosystem. Trophic levels represent the hierarchical structure of feeding relationships within an ecosystem, with each level representing a different position in the food chain.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2316",
    "text": "Which of the following statements best describes pollination in plants?",
    "options": {
      "A": "Pollination is the process of transferring pollen from the stigma to the anther of a flower",
      "B": "Pollination is the process of transferring pollen from the anther to the stigma of a flower",
      "C": "Pollination is the process of releasing pollen into the air for dispersal",
      "D": "Pollination is the process of seed formation within a flower"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68432?exam_type=jamb&type=obj&page=464",
    "correct_answer": "B",
    "explanation": "Pollination in plants refers to the transfer of pollen from the anther (male reproductive organ) to the stigma (female reproductive organ) of a flower.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2317",
    "text": "Which of the following best describes a natural habitat in ecology?",
    "options": {
      "A": "An area where organisms naturally live and interact with their surroundings",
      "B": "A human-created environment for wildlife conservation",
      "C": "A controlled laboratory setting for ecological experiments",
      "D": "A protected area for endangered species"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68433?exam_type=jamb&type=obj&page=464",
    "correct_answer": "A",
    "explanation": "A natural habitat in ecology refers to an area where organisms naturally live and interact with their surroundings. A natural habitat encompasses the ecological conditions, physical features, and resources that support the survival and interactions of organisms within their natural environment. It includes factors such as climate, vegetation, soil composition, and other biotic and abiotic components.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2318",
    "text": "Which of the following statements about viruses is true?",
    "options": {
      "A": "Viruses can reproduce outside of a host cell",
      "B": "Viruses require a host cell to replicate",
      "C": "Viruses possess a cellular structure",
      "D": "Viruses are living organisms"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68434?exam_type=jamb&type=obj&page=464",
    "correct_answer": "B",
    "explanation": "Viruses are considered parasitic because they require a host cell to replicate. They do this by injecting their genetic material into the host cell and using the cell's machinery to replicate.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2319",
    "text": "Which of the following statements is true regarding cell growth?",
    "options": {
      "A": "Cell growth is solely influenced by external factors",
      "B": "Cell growth is a continuous process throughout the life of a cell",
      "C": "Cell growth involves an increase in the number of organelles within a cell",
      "D": "Cell growth occurs by cell division"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68435?exam_type=jamb&type=obj&page=464",
    "correct_answer": "D",
    "explanation": "Cell growth refers to an increase in cell size or mass over time. Cell growth occurs by cell division, as cells undergo division to increase their numbers and contribute to overall growth in tissues and organisms.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2320",
    "text": "Which of the following statements is true regarding the urinary tubule in the excretory system?",
    "options": {
      "A": "The urinary tubule is responsible for the production of urine",
      "B": "The urinary tubule regulates the water and electrolyte balance in the body",
      "C": "The urinary tubule connects the kidneys to the bladder",
      "D": "The urinary tubule is the site of filtration of blood"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68436?exam_type=jamb&type=obj&page=464",
    "correct_answer": "A",
    "explanation": "The urinary tubule, a part of the nephron in the kidney, is indeed responsible for the production of urine. It does this by reabsorbing useful substances from the filtrate, such as glucose and ions, and secreting waste products into it. The modified filtrate, now called urine, is then passed on to the bladder for storage and eventual excretion.",
    "year": "2023"
  },
  {
    "number": "2321",
    "text": "What is the primary function of the liver in the human body?",
    "options": {
      "A": "Regulation of body temperature",
      "B": "Regulation of blood pressure",
      "C": "Production of hormones",
      "D": "Detoxification and metabolism of nutrients and drugs"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68437?exam_type=jamb&type=obj&page=465",
    "correct_answer": "D",
    "explanation": "The liver is a vital organ in the human body with multiple functions, but its primary function is the detoxification and metabolism of nutrients and drugs. The liver plays a crucial role in various metabolic processes. It detoxifies harmful substances, such as drugs and toxins, by breaking them down into less harmful forms that can be eliminated from the body.",
    "year": "2023"
  },
  {
    "number": "2322",
    "text": "Ecological succession refers to",
    "options": {
      "A": "The movement of organisms from one habitat to another",
      "B": "The competition among species for limited resources",
      "C": "The process of natural selection in a population",
      "D": "The gradual and predictable change in a community over time"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68438?exam_type=jamb&type=obj&page=465",
    "correct_answer": "D",
    "explanation": "Ecological succession can be primary or secondary. Primary succession occurs in areas where no previous community existed, such as on bare rock or after a volcanic eruption. Secondary succession occurs in areas where a previous community has been disturbed, such as after a forest fire or human disturbance. Throughout the succession process, the community gradually changes in terms of species composition, population sizes, and community interactions, leading to a more stable and mature ecosystem.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2323",
    "text": "Which of the following options best describes adaptation for survival in organisms?",
    "options": {
      "A": "Adaptation is the inherited trait that increases an organism's chances of survival and reproduction in its environment",
      "B": "Adaptation is the process by which organisms acquire new characteristics during their lifetime",
      "C": "Adaptation refers to the ability of an organism to change its environment to better suit its needs",
      "D": "Adaptation involves the development of new traits in response to changes in the environment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68439?exam_type=jamb&type=obj&page=465",
    "correct_answer": "D",
    "explanation": "Adaptation in biology involves the development of traits that help organisms survive and reproduce in their environment, often arising in response to environmental changes over generations through natural selection. These traits are not inherited but they are developed over time in response to changes in the environment in order to survive.",
    "year": "2023"
  },
  {
    "number": "2324",
    "text": "Digestive enzymes are responsible for",
    "options": {
      "A": "Breaking down food into smaller molecules",
      "B": "Absorbing nutrients into the bloodstream",
      "C": "Regulating the pH of the digestive tract",
      "D": "Transporting food through the digestive system"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68440?exam_type=jamb&type=obj&page=465",
    "correct_answer": "A",
    "explanation": "Digestive enzymes play a vital role in the process of digestion by breaking down food into smaller molecules that can be easily absorbed and utilized by the body. Digestive enzymes are produced by various organs in the digestive system, including the salivary glands, stomach, pancreas, and small intestine.",
    "year": "2023"
  },
  {
    "number": "2325",
    "text": "Which of the following is a difference between plant and animal cells?",
    "options": {
      "A": "Plant cells have a nucleus, while animal cells do not",
      "B": "Plant cells have a cell membrane, while animal cells have a cell wall",
      "C": "Plant cells contain chloroplasts for photosynthesis, while animal cells do not",
      "D": "Plant cells have a central vacuole, while animal cells have multiple small vacuoles"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68441?exam_type=jamb&type=obj&page=465",
    "correct_answer": "C",
    "explanation": "One of the main differences between plant and animal cells is that plant cells contain chloroplasts for photosynthesis, while animal cells do not. However, plant cells contain chloroplasts, which are organelles responsible for photosynthesis, enabling plants to convert sunlight into energy-rich molecules. Animal cells lack chloroplasts and obtain energy through other means, such as consuming organic matter.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2326",
    "text": "Which of the following structures in the ear is responsible for transmitting sound vibrations to the auditory nerve?",
    "options": {
      "A": "Eardrum",
      "B": "Ossicles",
      "C": "Cochlea",
      "D": "Auditory canal"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68442?exam_type=jamb&type=obj&page=466",
    "correct_answer": "C",
    "explanation": "The cochlea is a spiral-shaped structure in the inner ear that is filled with fluid and lined with cells with very fine hairs. These hairs move when the fluid in the cochlea moves, thereby converting sound vibrations into nerve signals that the brain can interpret. Therefore, the correct answer is 'Cochlea.' The eardrum and ossicles help to transmit sound vibrations to the cochlea, but it is the cochlea that transmits these vibrations as signals to the auditory nerve.\nThere is an explanation video availablebelow.",
    "year": "2023"
  }
]