[
  {
    "number": "529",
    "text": "Accountability is an act of worship",
    "options": {
      "A": "in matters relating to religious rites",
      "B": "because it is specifically mentioned in the Qur'ān",
      "C": "being one of the fundamental principles of Islam"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63494?exam_type=jamb&type=obj&page=106",
    "correct_answer": "B",
    "explanation": "Everyone is responsible for his/her works and he/she is accountable for that. Allah did not create us without any purpose. Among the purposes, two Qur'anic ayat reveals that we are created as the khalifa (vicegerent) [Surah al-Baqarah, 2:30] and for worshiping Allah alone. (Surah Hujurat, 49:13). Besides, our duties to our Lord, Allah, we are also responsible for others such as for our self, for other human and the creations including living and non-living creations. These are not merely our responsibility only but we are accountable for that. It means, we will be asked for each and every action we act in this worldly life",
    "year": "2015"
  },
  {
    "number": "530",
    "text": "The second hadīth in an-Nawawi's collection teaches that it is righteousness to worship Allah as if",
    "options": {
      "A": "one would die the following day",
      "B": "He would punish one on the spot",
      "C": "one was seeing Him physically",
      "D": "one would live forever"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63502?exam_type=jamb&type=obj&page=106",
    "correct_answer": "C",
    "explanation": "This second hadith is about the three main principles of Islam: Islam, Iman, and Ihsan. Islam is the five pillars, Iman is the six pillars of faith, and Ihsan pertains to worship. This is perhaps the best known and most popular of all the hadiths.He (the man) said: \"Then tell me about Ihsaan.\"He (the Prophet, sallAllaahu alayhi wa sallam) said: \"It is to worship Allaah as though you see Him, and if you do not see Him, then (knowing that) truly He sees you.\"",
    "year": "2015"
  },
  {
    "number": "531",
    "text": "At the end of his prayer, how may sitting for at-tashahud are expected of someone who misses two rak'ats in a congregational salā al- magrhib?",
    "options": {
      "A": "four",
      "B": "three",
      "C": "two",
      "D": "one"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63505?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "Praise be to Allah.Praise be to Allaah.If you join the congregation during the first tashahhud of Maghrib prayer, then you should follow the imam in the third rak'ah, and recite the tashahhud, then get up after he says the salaam to complete your prayer. You have two rak'ahs left, so pray the first one with al-Faatihah and another soorah, then recite the tashahhud, which is the first tashahhud for you, then get up for the third rak'ah, and recite al-Faatihah only, and recite the last tashahhud, then say the salaam.",
    "year": "2015"
  },
  {
    "number": "532",
    "text": "'Still less can their knowledge comprehend the hereafter ...' Q. 27:66). This verse above of the Qur'ān implies that",
    "options": {
      "A": "man's knowledge of the Hereafter can only be partial",
      "B": "most men do not believe in the Hereafter",
      "C": "man's comprehension of the expectations in the Hereafter is a always on the decrease",
      "D": "it is difficult to deceive in the Hereafter"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63506?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "Qur'an 27:66Nay, but they have lost their knowledge of the Hereafter. They are steeped in doubt and uncertainty about it: rather they are blind to it.After warning the people about their basic errors with regard to Divinity, it is being said that the reason why these people are involved in these errors is not that they have reached this conclusion after serious thought and deliberation that there also exist other beings who are Allah's associates in His Divinity, but the actual reason is that they have never considered this matter seriously. As they are unaware of the Hereafter, or are in doubt about it, or are blind to it, their heedlessness of the Hereafter has developed in them an utterly irresponsible attitude",
    "year": "2015"
  },
  {
    "number": "533",
    "text": "According to Islamic teachings, angels are",
    "options": {
      "A": "like human beings",
      "B": "of divine nature",
      "C": "a class of jinns",
      "D": "loyal servants of Allah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63508?exam_type=jamb&type=obj&page=107",
    "correct_answer": "D",
    "explanation": "In Islam, angels (Arabic: ملك malak; plural: ملاًئِكة malā'ikah)are believed to be celestial beings, created from a luminous origin by God. They have different functions, including praising God in heavens, interacting with humans ordinary life, and carrying laws of nature.",
    "year": "2015"
  },
  {
    "number": "534",
    "text": "The prophet whose wife was impious and consequently suffered the same calamity with the unbelievers was",
    "options": {
      "A": "Shu'aib",
      "B": "Yusuf",
      "C": "Musa",
      "D": "Lut"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63510?exam_type=jamb&type=obj&page=107",
    "correct_answer": "D",
    "explanation": "While at Sodom and Gomorrah, they also told him that they had been sent by God to the \"guilty people\" of Lot to destroy them with \"a shower of stones of clay\". Lot and those who believed in him, were to be spared, but his wife was to die in the destruction, with the angels stating that \"she is of those who lag behind\".The Quran also draws upon Lot's wife as an \"example for the unbelievers\" as she was married to a righteous man but refused to believe in his message and was thus condemned to Hell.",
    "year": "2015"
  },
  {
    "number": "535",
    "text": "An aspect of the Nigerian culture which may be regarded as shirk is",
    "options": {
      "A": "excessive spending at burial ceremonies",
      "B": "worship of ancestors",
      "C": "signing and dancing in public",
      "D": "ceremonies involving social interaction between boys and girls."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63512?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "Shirk (Arabic: شرك‎ širk) is the sin of idolatry or polytheism (i.e., the deification or worship of anyone or anything besides Allah). It means ascribing to, or the establishment of, partners placed beside Allah. It is termed Tawhid (monotheism) Mušrikūn مشركون are those who practice shirk, which literally means \"association\" and refers to accepting other gods and divinities alongside God (as God's \"associates\").",
    "year": "2015"
  },
  {
    "number": "536",
    "text": "According to Qur'ān 4:48, to set up partners with Allah is a great offense which Allah will not forgive",
    "options": {
      "A": "Except the prophet (S.W) intercedes",
      "B": "until He has forgiven all other sins",
      "C": "except the offender repents",
      "D": "even if He forgives all other sins."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63513?exam_type=jamb&type=obj&page=108",
    "correct_answer": "D",
    "explanation": "English Transliteration:Innaalleaha lea yaagfiru an yushraaka bihee va yaagfiru mea doona zealika li man yasheau va man yushrik billeahi fa kaadiftarea isman aazeemea(aazeeman).Verily, Allah does not forgive to be associated partners with Him. And forgives what is besides that for whomsoever He wills; and whoever associates anything with Allah, he has indeed slandered with a tremendous sin.",
    "year": "2015"
  },
  {
    "number": "537",
    "text": "An adult Muslim travels 300km by road during the month of Ramadān and arrives at his destination on the same day. He spends three days and returns on the fifth day.He is allowed to defer his fasting of the",
    "options": {
      "A": "first day",
      "B": "last day",
      "C": "first and last days",
      "D": "first to the last days27"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63514?exam_type=jamb&type=obj&page=108",
    "correct_answer": "C",
    "explanation": "Conditions under which travel permits a person to not fast include:1 - That the journey be lengthy, greater than 81 km.2 - That the journey be for a permissible purpose or intended for performing an act of worship and not for committing a sin.3 - A traveler must begin his journey before dawn prayer. But if he leaves after dawn, it is not permissible for him to break his fast on that day though it is permissible for him to break his fast on the following days if the fourth condition applies.4 - A traveler does not stay in the place of his destination for four days or more, not including the days of arrival and departure. If he intends to stay longer than that, it is not permissible for him to refrain from fasting except during transit. He may not refrain from fasting when he returns to his country because he is not considered a traveler but a resident.Imam Al-Shafi'i (may God be pleased with him) said in Asna Al-Mutalib: \"Whosoever approaches a country as a traveler who is not fasting, may break his fast there as long as he does not intend to stay there for more than four days.\"",
    "year": "2015"
  },
  {
    "number": "538",
    "text": "A woman in her menstrual period.",
    "options": {
      "A": "is not exempted from all forms of 'ibādah",
      "B": "is exempted from all forms of 'ibādah",
      "C": "has options to do 'ibādah .",
      "D": "can only perform the obligatory prayers"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63517?exam_type=jamb&type=obj&page=108",
    "correct_answer": "A",
    "explanation": "The ḥaiḍ (حيض menses) is the religious state of menstruation in Islam.Menstruation relates to various purity related restrictions in Islamic sexual jurisprudence.Muslim women that are going through menstrual bleeding are exempt from fasting during the Ramadan.",
    "year": "2015"
  },
  {
    "number": "539",
    "text": "Qur'ān 2:193 enjoins believers to fight unbelievers in the course of Allah if it takes that to",
    "options": {
      "A": "be recognized by the unbelievers",
      "B": "get rid of the unbelievers",
      "C": "defend themselves against transgression",
      "D": "strengthen the Muslim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63519?exam_type=jamb&type=obj&page=108",
    "correct_answer": "B",
    "explanation": "And fight (against) them until not (there) is oppression, and becomes the religion for Allah Then if they cease then (let there be) no hostility except against the oppressors.",
    "year": "2015"
  },
  {
    "number": "540",
    "text": "According to Qur'ān 6:160, while bad deeds would be rewarded in the same measure, good deeds would be rewarded",
    "options": {
      "A": "half measure",
      "B": "ten-fold",
      "C": "twenty-fold",
      "D": "uncountable fold"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63521?exam_type=jamb&type=obj&page=108",
    "correct_answer": "B",
    "explanation": "Qur'an 6:160Whoever will come to Allah with a good deed shall have ten times as much, and whoever will come to Allah with an evil deed, shall be requited with no more than the like of it. They shall not be wronged",
    "year": "2015"
  },
  {
    "number": "541",
    "text": "Which one of the following actions may be regarded as Mubāℎ?",
    "options": {
      "A": "Acquisition of knowledge",
      "B": "smoking",
      "C": "Salāt ash-shaf",
      "D": "Shaking hands while greeting37"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63523?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "It refers to an action that is not mandatory, recommended, reprehensible or forbidden, and thus involves no judgement from God.[2] Assigning acts to this legal category reflects a deliberate choice rather than an oversight on the part of jurists",
    "year": "2015"
  },
  {
    "number": "542",
    "text": "The sharīah contrasts with the common law because the former is",
    "options": {
      "A": "flexible",
      "B": "universal",
      "C": "temporal",
      "D": "immutable"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63525?exam_type=jamb&type=obj&page=109",
    "correct_answer": "B",
    "explanation": "10 Characteristics of Shariah1. From Allah; Fussilat 41:422-4. Comprehensive, encompassing,Universal and complete; An-Nahl 16:895-6. Balanced and moderate7. Release from burdens; Al-A`raf 7:1578. Synergetic; Al-Hadid 57: 259. Practical; An-Nisaa' 4:2710.Preserved Al-Hijr 15:9",
    "year": "2015"
  },
  {
    "number": "543",
    "text": "The Sunni school of thought noted for resorting frequently to the use of personal opinion was that of Imām",
    "options": {
      "A": "Mālik",
      "B": "Abū Hanīfah",
      "C": "Shafi i",
      "D": "Hambal"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63527?exam_type=jamb&type=obj&page=109",
    "correct_answer": "C",
    "explanation": "Abū ʿAbdillāh Muhammad ibn Idrīs al-Shāfiʿī (Arabic: أَبُو عَبْدِ ٱللهِ مُحَمَّدُ بْنُ إِدْرِيسَ ٱلشَّافِعِيُّ‎, 767-820 CE) was an Arab Muslim theologian, writer, and scholar, who was the first contributor of the principles of Islamic jurisprudence (Uṣūl al-fiqh). Often referred to as 'Shaykh al-Islām', al-Shāfi'ī was one of the four great Sunni Imams, whose legacy on juridical matters and teaching eventually led to the Shafi'i school of fiqh (or Madh'hab).",
    "year": "2015"
  },
  {
    "number": "544",
    "text": "In the Islamic economic system, baytuk māl is equivalent to the",
    "options": {
      "A": "commercial bank",
      "B": "public treasury",
      "C": "common market",
      "D": "community bank"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63528?exam_type=jamb&type=obj&page=109",
    "correct_answer": "B",
    "explanation": "Bayt al-Mal, known as the public treasury of Islamic state, was established by the Prophet-may peace be upon Him- and then it was further extended and expanded by Abu Bakr and Umar, who succeeded the Prophet as the Caliph of the Islamic state",
    "year": "2015"
  },
  {
    "number": "545",
    "text": "'And consult them in the affairs ...'(Qur'ān 3:159). This expression emphasizes the importance of the principle of",
    "options": {
      "A": "shūrā",
      "B": "mu'āmalah",
      "C": "Tatfīf",
      "D": "bay'ah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63530?exam_type=jamb&type=obj&page=109",
    "correct_answer": "A",
    "explanation": "Shura (Arabic: شُورَىٰ‎, shūrā) is an Arabic word for \"consultation\". The Quran and the Prophet Muhammad encourage Muslims to decide their affairs in consultation with those who will be affected by that decision.It is by the Mercy from God that you (O Muhammad) were gentle with them, for if you had been stern of heart they would have dispersed from around you.Holy Qur'ān 3:159",
    "year": "2015"
  },
  {
    "number": "546",
    "text": "The doctrine of trinity is regarded in Islam as a form of",
    "options": {
      "A": "shirk",
      "B": "kufr",
      "C": "Nifāq",
      "D": "zulm"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63531?exam_type=jamb&type=obj&page=110",
    "correct_answer": "A",
    "explanation": "Shirk (Arabic: شرك‎ širk) is the sin of idolatry or polytheism (i.e., the deification or worship of anyone or anything besides Allah). It means ascribing to, or the establishment of, partners placed beside Allah. It is termed Tawhid (monotheism) Mušrikūn مشركون are those who practice shirk, which literally means \"association\" and refers to accepting other gods and divinities alongside God (as God's \"associates\").",
    "year": "2015"
  },
  {
    "number": "547",
    "text": "The text of talbiyah in hājj emphasizes the pilgrim's",
    "options": {
      "A": "readiness to observe the rites of ℎājj to the end",
      "B": "realization of the uniqueness of the rites of ℎājj",
      "C": "recognition of Allah's absolute authority",
      "D": "aspiration for a reward"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63533?exam_type=jamb&type=obj&page=110",
    "correct_answer": "C",
    "explanation": "The Talbiyah (Arabic: ٱلتَّلبِيَة‎, at-Talbīyah) is a Muslim prayer invoked by the pilgrims as a conviction that they intend to perform the Hajj only for the glory of Allah. Talbiyah is repeatedly invoked during the Hajj, or pilgrimage, upon putting on the Ihram, so the pilgrims can purify and rid themselves of worldly concerns.\"Here I am [at your service] O God, here I am. Here I am [at your service]. You have no partners (other gods). To You alone is all praise and all excellence, and to You is all sovereignty. There is no partner to You.\"",
    "year": "2015"
  },
  {
    "number": "548",
    "text": "While polygamy is permitted in Sūraℎ 4:3, Sūraℎ 4:129",
    "options": {
      "A": "limits the practice to Imams",
      "B": "modifies it",
      "C": "highlights problems inherent in it",
      "D": "promises reward for its practice"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63536?exam_type=jamb&type=obj&page=110",
    "correct_answer": "C",
    "explanation": "Qur'an 4:129You will not be able to treat your wives with absolute justice not even when you keenly desire to do so. (It suffices in order to follow the Law of Allah that) you incline not wholly to one, leaving the other in suspense. If you act rightly and remain God-fearing, surely Allah is All-Forgiving, All-Compassionate.This means that it is not possible for a man to accord complete equality of treatment to two or more wives under all circumstances and in all respects",
    "year": "2015"
  },
  {
    "number": "549",
    "text": "The practice of comparing the back of one's wife to that of one's mother as a method of divorce was known as",
    "options": {
      "A": "faskh",
      "B": "lian",
      "C": "zihar",
      "D": "ila"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63540?exam_type=jamb&type=obj&page=110",
    "correct_answer": "C",
    "explanation": "Zihar is illegal and considered an insult in the Islamic law. It implies that the man, declaring his wife akin to his mother or sister, is guilty of the sin of forbidding the lawful things. It has been proscribed by law and the act does not ensue in divorce. It is condemned in the law.",
    "year": "2015"
  },
  {
    "number": "550",
    "text": "In Islamic law on divorce, the custody of a child aged two years or less is normally conceded to the",
    "options": {
      "A": "father",
      "B": "mother",
      "C": "aunt",
      "D": "grandmother"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63541?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "The custody of a minor child in Islam is called Hizanit, which literally means the care of the infant. As per the Shariat law that applies to Muslims, the father is considered to be the natural guardian of his children irrespective of sex, but the mother is entitled to the custody of her son till the age of 7 years and of her daughter till she attains puberty",
    "year": "2015"
  },
  {
    "number": "551",
    "text": "In Islamic law of inheritance, the brother of a deceased person who had a son is to",
    "options": {
      "A": "take a larger share of the inheritance",
      "B": "take half of the share of the son",
      "C": "get equal share with the son",
      "D": "be excluded from inheritance"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63543?exam_type=jamb&type=obj&page=111",
    "correct_answer": "D",
    "explanation": "In Islamic law, only relatives with a legitimate blood relationship to the deceased are entitled to inherit. Thus, illegitimate children and adopted children have no shares in inheritance. In general, a full brother will exclude a half-brother who shares a common father (\"consanguine brother), but not a half-brother who shares a common mother. In cases where a deceased man leaves a pregnant woman, the unborn child's share will be reserved. Also a woman during the time of waiting (ʿiddat) after divorce is considered a wife of the deceased for purposes of inheritance",
    "year": "2015"
  },
  {
    "number": "552",
    "text": "The pre-Islamic practice of shigār which was abolished by Islam meant",
    "options": {
      "A": "trade by barter",
      "B": "exchange of female slaves",
      "C": "exchange of sisters in wedlock",
      "D": "gambling"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63545?exam_type=jamb&type=obj&page=111",
    "correct_answer": "C",
    "explanation": "In pre-Islamic Arabia, a variety of different marriage practices existed. The most common and recognized types of marriage at this time consisted of: marriage by agreement, marriage by capture, marriage by mahr, marriage by inheritance and Mutah or temporary marriage.Prior to Islam, in the Arab world, women could not make decisions based on their own beliefs and had little control over their marriages. They were never bound by contract for marriage or custody of children and their consent was never sought.",
    "year": "2015"
  },
  {
    "number": "553",
    "text": "In the course of hijjat'l - widā, Muslims were taught to",
    "options": {
      "A": "shun alcohol and games of chance",
      "B": "pay zakāℎ regularly and fast annually",
      "C": "treat women and domestic servants kindly",
      "D": "promptness and impartiality in the dispensation of justice"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63549?exam_type=jamb&type=obj&page=111",
    "correct_answer": "C",
    "explanation": "But Arabia before Islam was a society where there were no rules, except that the strong dominated the weak. It seems reasonable to expect that a natural byproduct of such society would be the oppression of women. In fact, alongside the examples of strong and independent women, there are numerous reports of women having an inferior status. Female infanticide, for instance, was practiced by fathers who did not value their daughters as much as they valued their sons. In areas, such as marriage, divorce and inheritance, women were often deprived of their basic rights- to choose their husbands freely, to divorce if ill-treated or to inherit from their families",
    "year": "2015"
  },
  {
    "number": "554",
    "text": "Compared with the situation in Makkah before Hijrad, the da'wah in al-Madina was more",
    "options": {
      "A": "persecution oriented",
      "B": "of an internal affair of believers",
      "C": "far-reaching",
      "D": "intensive but less successful"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63552?exam_type=jamb&type=obj&page=111",
    "correct_answer": "C",
    "explanation": "According to Ibn Sad, one of Muhammad's companions, the opposition in Mecca started when Muhammad delivered verses that condemned idol worship and polytheism. However, the Quran maintains that it began when Muhammad started public preaching.Among the first things Muhammad did to ease the longstanding grievances among the tribes of Medina was draft a document known as the Constitution of Medina, \"establishing a kind of alliance or federation\" among the eight Medinan tribes and Muslim emigrants from Mecca. The document specified rights and duties of all citizens and the relationship of the different communities in Medina (including between the Muslim community and other communities, specifically the Jews and other \"Peoples of the Book\"). The community defined in the Constitution of Medina, Ummah, had a religious outlook, also shaped by practical considerations, and substantially preserved the legal forms of the old Arab tribes.The first group of pagan converts to Islam in Medina were the clans who had not produced great leaders for themselves but had suffered from warlike leaders from other clans. This was followed by the general acceptance of Islam by the pagan population of Medina, with some exceptions.When Muhammad was in Mecca he faded opposition but was accepted when he got to Medina making the da'wah more far-reaching.",
    "year": "2015"
  },
  {
    "number": "555",
    "text": "The Caliph who appointed the shura Council to produce a successor after his death was",
    "options": {
      "A": "Abū Bakr as-Siddīq",
      "B": "'Umar b. Khattāb",
      "C": "'Uthmān b. 'Affān",
      "D": "'Alī b. Ab ī Tālib"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63556?exam_type=jamb&type=obj&page=111",
    "correct_answer": "B",
    "explanation": "Uthman ibn Affan, the third caliph, was chosen by a council meeting in Medina, in northwestern Arabia, in AH 23 (643/644). The second caliph, Umar ibn al-Khattab, was stabbed by Piruz Nahavandi, a Persian slave. Mindful of the tumults that had occurred after the death of Muhammad (see Succession to Muhammad), on his deathbed Umar appointed a committee of six men, to choose a new leader.",
    "year": "2015"
  },
  {
    "number": "556",
    "text": "The earliest contact of Islam with Africa dates back to the period of A 'Umar b. Khattāb B. 'Uthmān b. 'Affān C . 'Alī b. Abī Tālib 'Ulūm ad-dīn is the title of a book written by",
    "options": {
      "A": "ibn Sīna",
      "B": "al-Ghazālī",
      "C": "ar-Rāzī",
      "D": "Ibn Rushd."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63564?exam_type=jamb&type=obj&page=112",
    "correct_answer": "B",
    "explanation": "Another of al-Ghazali's major works is Ihya' Ulum al-Din or Ihya'u Ulumiddin (The Revival of Religious Sciences). It covers almost all fields of Islamic sciences: fiqh (Islamic jurisprudence), kalam (theology) and sufism.It contains four major sections: Acts of worship (Rub' al-'ibadat), Norms of Daily Life (Rub' al-'adatat), The ways to Perdition (Rub' al-muhlikat) and The Ways to Salvation (Rub' al-munjiyat). The Ihya became the most frequently recited Islamic text after the Qur'an and the hadith",
    "year": "2015"
  },
  {
    "number": "557",
    "text": "One of the ways by which Islamic civilization was manifested in West Africa was",
    "options": {
      "A": "the employment of scholars of Arabic as envoys by kings and emperors",
      "B": "construction of palaces based on Arab technology",
      "C": "establishment of universities to train scientists",
      "D": "recruitment of Muslim medical personnel to man health institutions"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63567?exam_type=jamb&type=obj&page=112",
    "correct_answer": "A",
    "explanation": "Islam gained momentum during the 10th century in West Africa with the start of the Almoravid dynasty movement on the Senegal River and as rulers and kings embraced Islam. Islam then spread slowly in much of the continent through trade and preaching. During this period these Muslims from North and West Africa came to be known by Europeans at large as Moors and were depicted by Europeans as black, swarthy or tawny in skin color",
    "year": "2015"
  },
  {
    "number": "558",
    "text": "Ahmad bab, one of the early West African 'Ulamā', was based in",
    "options": {
      "A": "Sokoto",
      "B": "Borno",
      "C": "Timbuktu",
      "D": "Mali"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63568?exam_type=jamb&type=obj&page=112",
    "correct_answer": "C",
    "explanation": "Aḥmad Bābā al-Massufi al-Timbuktī , full name Abū al-Abbās Aḥmad ibn Aḥmad al-Takrūrī Al-Massufi al-Timbuktī (1556 - 1627 CE, 963 - 1036 H), was a Sanhaja Berber writer, scholar, and political provocateur in the area then known as the Western Sudan. Called Timbuktu's greatest scholar, he wrote more than 40 books.He died in 1627.",
    "year": "2015"
  },
  {
    "number": "559",
    "text": "Ignorance of religious rites and duties is not excusable in Islam because",
    "options": {
      "A": "it is obligatory on all Muslims to seek knowledge",
      "B": "most Muslims can read and write Arabic",
      "C": "books of Islamic jurisprudence have been translated into many languages",
      "D": "the Islamic system of education is highly developed all over the world."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63620?exam_type=jamb&type=obj&page=112",
    "correct_answer": "A",
    "explanation": "Ignorance is the absence of common sense and basic knowledge. Ignorance is the attribute of the arrogant, egoistic and selfish people. When people indulge in self importance only and are being arrogant, being egoistic, being selfish and just care about worldly status are good example of ignorant people. These attributes make them deaf, dumb and blind so they can not differentiate between true and false, good and bad, right and wrong and just follow whims and desires blindly.",
    "year": "2015"
  },
  {
    "number": "560",
    "text": "The revelation of the glorious Qur'an started with a",
    "options": {
      "A": "parable",
      "B": "command",
      "C": "Legislation",
      "D": "Declaration."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63634?exam_type=jamb&type=obj&page=112",
    "correct_answer": "B",
    "explanation": "\" Iqrah\" \" Read\" In a commanding tone by the Angel JibrilAccording to the Muslim belief and Islamic scholarly accounts, the revelation of the Qur'an began in 610 AD when the angel Gabriel (Arabic: جبريل, Jibrīl or جبرائيل, Jabrāʾīl) appeared to Muhammad in the cave Hira near Mecca, reciting to him the first verses of Surah Al-Alaq. Muslims believe that Muhammad continued to have revelations for the rest of life until his death in 632 AD.\"Read! in the name of your Lord who createdMan from a clinging substance.Read: Your Lord is most Generous,-He who taught by the pen-Taught man that which he knew not.\"",
    "year": "2015"
  },
  {
    "number": "561",
    "text": "Prophet Muhammad's (SAW) answer to Angel Jibril when he was asked to recite was",
    "options": {
      "A": "'I am not a scholar'",
      "B": "'I am not a jugde'",
      "C": "'I cannot read'",
      "D": "'I cannot preach'"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63645?exam_type=jamb&type=obj&page=113",
    "correct_answer": "C",
    "explanation": "According to Sunni tradition, during one such occasion while he was in contemplation, the angel Gabriel appeared before him in the year AD 610 and said, \"Read\", upon which he replied, \"I am unable to read\". Thereupon the angel caught hold of him and embraced him heavily. This happened two more times after which the angel commanded Muhammad to recite the following verses:\"Read! in the name of your Lord who createdMan from a clinging substance.Read: Your Lord is most Generous,-He who taught by the pen-Taught man that which he knew not.\"",
    "year": "2015"
  },
  {
    "number": "562",
    "text": "Angel Jibril asked the Prophet (SAW) to read during the event of the first revelation",
    "options": {
      "A": "four times",
      "B": "Three times",
      "C": "twice",
      "D": "once"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63647?exam_type=jamb&type=obj&page=113",
    "correct_answer": "C",
    "explanation": "The first Quranic revelation occurred when the angel Gabriel visited Muhammad and asked him to recite. Muhammad responded ma ana bīqāre'u, which could be translated into a number of ways: 'I do not read' or 'what am I to read/recite?' or 'I will not read/recite'. Gabriel pressed him \"until all the strength went out of me; thereupon he released me and said: 'Read!'\" This was repeated three times and upon the third, Gabriel released him and said, \"Read in the name of the Sustainer who created humankind from a clot! Read! And your Sustainer is the most Beautiful",
    "year": "2015"
  },
  {
    "number": "563",
    "text": "Divine Inspiration was employed in the",
    "options": {
      "A": "arrangement of the Glorious Qu'ran",
      "B": "compilation of the Glorious Qu'ran",
      "C": "standardization of the Glorious Quran",
      "D": "memorization of the Glorious Qu'ran"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63652?exam_type=jamb&type=obj&page=113",
    "correct_answer": "A",
    "explanation": "Due to the fact that the Quran was revealed in disjointed verses and chapters, a point came when it needed to be gathered into a coherent whole text. There are disagreements among both Muslim and non-Muslim scholars as to when the Quran was first compiled. A hadith in Sahih Bukhari states that the caliph Abu Bakr commanded Zayd ibn Thabit to compile the written Quran, relying upon both textual fragments and the memories of those who had memorized it",
    "year": "2015"
  },
  {
    "number": "564",
    "text": "How many Caliphs did the Glorious Qur'an pass through before its standardization?",
    "options": {
      "A": "six",
      "B": "four",
      "C": "three",
      "D": "two"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63655?exam_type=jamb&type=obj&page=113",
    "correct_answer": "C",
    "explanation": "Abubakar, Umar then Uthman\"As the Islamic Empire began to grow, and differing recitations were heard in far-flung areas, the Quran was recompiled for uniformity in recitation (r. 644-56). under the direction of the third caliph - Uthman ibn Affan. For this reason, the Qur'an as it exists today is also known as the Uthmanic codex.",
    "year": "2015"
  },
  {
    "number": "565",
    "text": "The core of Muhammad's (SAW) da'awah in Makkah was on",
    "options": {
      "A": "the unity of Allah",
      "B": "business transaction",
      "C": "divine punishment of wrong-doers",
      "D": "sincere brotherhood"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63658?exam_type=jamb&type=obj&page=113",
    "correct_answer": "A",
    "explanation": "Muhammad's mission involves preaching monotheism. The Qur'an demands Muhammad to proclaim and praise the name of his Lord and instructs him not to worship idols or associate other deities with God but to only worship the one God.According to the Qur'an, one of the main roles of Muhammad is to warn the unbelievers of their eschatological punishment (Qur'an 38:70, Qur'an 6:19). Sometimes the Qur'an does not explicitly refer to the Judgement Day but also provides examples from the history of some extinct communities and warns Muhammad's contemporaries of similar calamities (Qur'an 41:13)",
    "year": "2015"
  },
  {
    "number": "566",
    "text": "The battle of Badr was fought in the 2nd year after Hijrah in",
    "options": {
      "A": "622  H",
      "B": "624 A. H",
      "C": "625 A. H",
      "D": "632 A. H"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63660?exam_type=jamb&type=obj&page=114",
    "correct_answer": "B",
    "explanation": "The Battle of Badr (Arabic: غزوة بدر‎), also referred to as The Day of the Criterion (Arabic: يوم الفرقان) in the Qur'an and by Muslims, was fought on Tuesday, 13 March 624 CE (17 Ramadan, 2 AH), near the present-day city of Badr, Al Madinah Province in Saudi Arabia. Muhammad, commanding an army of his Sahaba, defeated an army of the Quraysh led by Amr ibn Hishām, who was later given the kunyah \"Abu Jahl\" by Muhammad. The battle marked the beginning of the six-year war between Muhammad and his tribe in what is now known as the Muslim-Quraish War. Prior to the battle, the Muslims and the Meccans had fought several smaller skirmishes in late 623 and early 624.",
    "year": "2015"
  },
  {
    "number": "567",
    "text": "The Arabs worshiped idols during the Jahiliyya period because",
    "options": {
      "A": "They were ignorant of God's existence",
      "B": "there were Prophets among them",
      "C": "they believed that the idols will intercede",
      "D": "there were revealed Books."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63666?exam_type=jamb&type=obj&page=114",
    "correct_answer": "C",
    "explanation": "Arabian polytheism, the dominant form of religion in pre-Islamic Arabia, was based on veneration of deities and spirits. Worship was directed to various gods and goddesses, including Hubal and the goddesses al-Lāt, al-'Uzzā, and Manāt, at local shrines and temples such as the Kaaba in Mecca. Deities were venerated and invoked through a variety of rituals, including pilgrimages and divination, as well as ritual sacrifice. Different theories have been proposed regarding the role of Allah in Meccan religion. Many of the physical descriptions of the pre-Islamic gods are traced to idols, especially near the Kaaba, which is said to have contained up to 360 of them",
    "year": "2015"
  },
  {
    "number": "568",
    "text": "The similarity between the Jihad of Uthman b. Fodio and the Prophet's hijrah in 622 C. E was the",
    "options": {
      "A": "strength of their followers",
      "B": "inspiration from Allah",
      "C": "display of bid'ah",
      "D": "envy of non-believers"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63671?exam_type=jamb&type=obj&page=114",
    "correct_answer": "B",
    "explanation": "Hijrah, (Arabic: \"Migration\" or \"Emigration\") the Prophet Muhammad's migration (622 CE) from Mecca to Yathrib (Medina) upon invitation in order to escape persecution.Uthman Dan Fodio's appeal to justice and morality rallied the outcasts of Hausa society. He found his followers among the Fulbe and Fulani. The Fulbe and Fulani were primarily cattle pastoralists. These pastoralist communities were led by the clerics living in rural communities who were Fulfude speakers and closely connected to the pastoralists. The Fulani would later hold the most important offices of the new states. Hausa peasants, runaway slaves, itinerant preachers, and others also responded to Uthman's preaching. His jihad served to integrate a number of peoples into a single religio-political movement.They were both inspired by Allah.",
    "year": "2015"
  }
]