[
  {
    "number": "569",
    "text": "In Q.17:27, the extravagant are likened to associates of",
    "options": {
      "A": "pious people",
      "B": "Pharaoh",
      "C": "Satan",
      "D": "soothsayers"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63690?exam_type=jamb&type=obj&page=114",
    "correct_answer": "C",
    "explanation": "it is writing that \"Verily the spendthrifts are brothers of the shaytan (Devil) ...\" Those who spend lavishly are the associate of Satan. A man should not reserve his earnings and his wealth exclusively for his own person. He should do his utmost to fulfill his own necessities of life in a moderate way and render the rights of his relatives, neighbors and other needy persons as well. This attitude will help create the spirit of cooperation, sympathy and justice in the collective Islamic life. Thus every relative will cooperate with the other and every rich person will help the needy in his neighborhood and a wayfarer would find himself an honorable guest among generous hosts.",
    "year": "2016"
  },
  {
    "number": "570",
    "text": "Islam decreed against begging through encouraging",
    "options": {
      "A": "collective bargaining",
      "B": "labour association",
      "C": "trade bargaining",
      "D": "dignity of labour"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63691?exam_type=jamb&type=obj&page=114",
    "correct_answer": "D",
    "explanation": "Islam preached against begging because Islam has it own obligation to let us know that we should not discriminate any job, and we should be proud of our job instead of begging.\"Whoever continues to beg people for their property in order to accumulate much property, surely asks for a piece of fire...\" (Muslim, Zakat, 105).\"It is better for one among you to bring a load of firewood on his back and give charity out of it (and satisfy his own need) and be independent of people, than that he should beg from people, whether they give him anything or refuse him (Muslim, Zakat, 107)Islam does not deem Muslims who do not work, who sit idly, make do with a morsel and a coat, and who pose burden on other Muslims as good Muslims. As is understood in the hadiths above, it is strictly forbidden to beg and to take begging as an occupation.",
    "year": "2016"
  },
  {
    "number": "571",
    "text": "'Allah begets not nor is He begotten.' The quotation above condemns",
    "options": {
      "A": "hero praising",
      "B": "the doctrine of trinity",
      "C": "worshiping of ancestors",
      "D": "idol worshiping"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63694?exam_type=jamb&type=obj&page=115",
    "correct_answer": "B",
    "explanation": ": in Suratul_Ikhlas Q.112:3 \"He neither begot any nor was He begotten\".The polytheists in every age have adopted the concept that like men, gods also belong to a species, which has many members and they also get married, beget and are begotten. They did not even regard Allah, Lord of the universe, as supreme and above this concept of ignorance, and even proposed children for Him. There are lots of Verses that dispute that like; \" Allah is only One Deity: He is far too exalted that He should have a son: whatever is in the heavens and whatever is in the earth belongs to Him. ( Surah An-Nisa, Ayat 171 ).\"\"They, in fact, invent a falsehood when they say, Allah has children. They are utter liars. ( Surah As-Saaffat, Ayats 151-152 ).\"",
    "year": "2016"
  },
  {
    "number": "572",
    "text": "What is expected of a believing Muslim when an important decision needs to be made?",
    "options": {
      "A": "Du'ā",
      "B": "Da'awah",
      "C": "Istikhāma",
      "D": "Istikhārah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63696?exam_type=jamb&type=obj&page=115",
    "correct_answer": "D",
    "explanation": ": \"If a Muslim wants to make a decision, he/she should do Istikhara\"The word Istikhara directly means , to ask Allah to guide one to the right sort of action concerning a job or deed. 'Khair' means good (asking Allah to guide you to the good or right answer). Meaning , you're not asking Allah to show you a vision, through a dream. So if you are in a difficult position, Istikhara is the best thing to do, make sure you add Khair to be specific with your prayer.",
    "year": "2016"
  },
  {
    "number": "573",
    "text": "Qadr to the majority of scholars in Islam means\n.",
    "options": {
      "A": "faith",
      "B": "Situation",
      "C": "Circumstance",
      "D": "destiny"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63700?exam_type=jamb&type=obj&page=115",
    "correct_answer": "D",
    "explanation": "Al-Ima n bil-qadr is one of the six articles of faith, \"The faith in the Destiny\"\"Allah knows what they did and what they will do\" (Al-Baqarah 255).All events that will befall humans and all information concerning their birth, death, and deeds are written in a book called al-Lawh al-Mahfuz . The pieces of information in this book are called qadar.",
    "year": "2016"
  },
  {
    "number": "574",
    "text": "Hadith 4 of An-Nawawi's collection is about the complete",
    "options": {
      "A": "nature of man's creation",
      "B": "movement of the sun in its orbit",
      "C": "nature of the creation of the earth",
      "D": "movement of the seas and oceans"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63703?exam_type=jamb&type=obj&page=115",
    "correct_answer": "A",
    "explanation": "The Messenger of Allah, sallallahu 'alayhi wasallam, the most truthful, the most trusted, told us: \"Verily the creation of any one of you takes place when he is assembled in his mother's womb; for forty days he is as a drop of fluid, then it becomes a clot for a similar period. Thereafter, it is a lump looking like it has been chewed for a similar period. Then an angel is sent to him, who breathes the ruh (spirit) into him. This Angel is commanded to write Four decrees: that he writes down his provision (rizq), his life span, his deeds, and whether he will be among the wretched or the blessed. I swear by Allah - there is no God but He - one of you may perform the deeds of the people of Paradise till there is naught but an arm's length between him and it, when that which has been written will outstrip him so that he performs the deeds of the people of the Hell Fire; one of you may perform the deeds of the people of the Hell Fire, till there is naught but an arm's length between him and it, when that which has been written will overtake him so that he performs the deeds of the people of Paradise and enters therein.\"",
    "year": "2016"
  },
  {
    "number": "575",
    "text": "The book of Hadith that contains reports on the practices of the people of Madinah apart from aℎādith is",
    "options": {
      "A": "Sahih Bukhari",
      "B": "Sahih Muslim",
      "C": "Mukhtaril aℎādith",
      "D": "Muwatta Malik."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63714?exam_type=jamb&type=obj&page=115",
    "correct_answer": "D",
    "explanation": "The Muwatta' of Malik b. Anas (d. 795 CE) is the first written treatise of Islamic law. This is the introduction to the forthcoming translation of this foundational work of Islamic law. It represents the apogee of Islamic law in its earliest phase.",
    "year": "2016"
  },
  {
    "number": "576",
    "text": "In Hadith 6 of an-Nawawi's collection, the Prophet(SAW) said the lawful and unlawful are all clear, but between them are",
    "options": {
      "A": "things prohibited",
      "B": "things permitted",
      "C": "ambiguous matters",
      "D": "lump of flesh."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63716?exam_type=jamb&type=obj&page=116",
    "correct_answer": "C",
    "explanation": "\"Verily, the lawful is clear and the unlawful is clear, and between the two of them are doubtful matters about which many people do not know. Thus, he who avoids doubtful matters clears himself in regard to his religion and his honor, and he who falls into doubtful matters will fall into the unlawful as the shepherd who pastures near a sanctuary, all but grazing therein. Verily, every king has a sanctum and the sanctum of Allah is his prohibitions. Verily, in the body is a piece of flesh which, if sound, the entire body is sound, and if corrupt, the entire body is corrupt. Truly, it is the heart. \"",
    "year": "2016"
  },
  {
    "number": "577",
    "text": "Who among the six compilers of Hadith became blind before his death?",
    "options": {
      "A": "Nasa'I",
      "B": "Abu Da'ud",
      "C": "Ibn Maja",
      "D": "Tirmidhi"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63721?exam_type=jamb&type=obj&page=116",
    "correct_answer": "D",
    "explanation": "At-Tirmidhi began the study of hadith at the age of 20. From the year 235 AH (849/850) he traveled widely in Khurasan , Iraq, and the Hijaz in order to collect hadith. He wrote many books and was one of the six compilers of Hadith.Tirmidhi was blind in the last two years of his life, according to adh-Dhahabi. His blindness is said to have been the consequence of excessive weeping, either due to fear of Allah or over the death of al-Bukhari.",
    "year": "2016"
  },
  {
    "number": "578",
    "text": "The best Ibadah according to the Prophet (SAW) after the major pillars is to",
    "options": {
      "A": "pray nawāfils",
      "B": "marry a pious woman",
      "C": "make a fellow Muslim happy",
      "D": "devote one's time on dhikr."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63724?exam_type=jamb&type=obj&page=116",
    "correct_answer": "C",
    "explanation": "There are five major pillars of ibadah namely;Declaration of faith ( shahadah), ritual prayer( salat), alms giving (zakah), fasting( sawm), pilgrimage to Mecca (hajj). But prophet (SAW) tells us that after this major pillars, that should make our fellow Muslims happy, through teaching them the word, or helping them financially, we must make our fellow Muslims happy.",
    "year": "2016"
  },
  {
    "number": "579",
    "text": "Among the obligatory steps of ablution are intention, washing the face, washing the hands to the elbow and also",
    "options": {
      "A": "rinsing the mouth",
      "B": "wiping the two ears",
      "C": "washing the feet",
      "D": "silence during the ablution"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63731?exam_type=jamb&type=obj&page=116",
    "correct_answer": "C",
    "explanation": "In Islam, ablution, or Wudhoo', is to wash one's face, hands, arms, head and feet with water. Allah, the Most High, Says (what means): \"O you who have believed! When you rise to [perform] prayer, wash your faces and your forearms to the elbows and wipe over your heads and wash your feet to the ankles...\" [Quran 5:6]Allah does not accept the prayer of one who nullified his ablution until he performs it again",
    "year": "2016"
  },
  {
    "number": "580",
    "text": "Among the Sunnah steps of ablution are wiping two ears, inhaling and exhaling from the nose and also",
    "options": {
      "A": "wiping the head again from back of the skull",
      "B": "supplication at every stage of ablution",
      "C": "brushing the teeth",
      "D": "saying the du'a aloud."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63734?exam_type=jamb&type=obj&page=116",
    "correct_answer": "A",
    "explanation": "There are steps in performing Sunnah of ablution, here are the guidelines- To intend for ritual purification.- Taking the name of Allah, the Exalted, at the start of the Wudhu .- Performing the steps of the Wudhu in [its proper] sequence.- Each step [of washing] should be performed three times. Each of the three times must be complete - for example, one cannot wash different parts of his face each of the three times such that ultimately his entire face is washed. On the contrary, one should wash his face completely thrice.- Each step should be done immediately after the previous one, such that the washed parts of the body do not dry up. This is waivered if one is forced to go get more water.- Washing the two hands before inserting them into the container [of water], [especially] after the person performing Wudhu has awaken from his sleep.- Rinsing the mouth three times; taking water to the back of the mouth unless one is fasting.- Inhaling water to the soft upper part of the nose and exhaling it three times. The right hand should be used to inhale water and the left hand should be used while exhaling it.- Washing the face thoroughly three times. All parts [of the face] must be washed, including the corners of the eyes and the various grooves on the face.- [For men,] combing the beard thoroughly with wet hands such that water reaches the skin beneath.- Wash arms up to just above the elbows, using the other hand, to rub the running water thoroughly over the arm.- Wiping the ears - the index fingers washing inside every fold of the front of the ear and the thumb wiping behind the ear.- Wiping from forelock to back of the head. Use all fingers other than index finger and thumb, as index finger and thumb are reserved for the ears.- Combing the fingers and washing in between toes with the little finger.",
    "year": "2016"
  },
  {
    "number": "581",
    "text": "In Q.5:7, Allah says, 'if ye are ill or on a journey ... and ye find no water, then perform ...'",
    "options": {
      "A": "wudū",
      "B": "al-ghusl",
      "C": "at-tayammum",
      "D": "qasr"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63737?exam_type=jamb&type=obj&page=117",
    "correct_answer": "C",
    "explanation": ": In this ayah, Allah subhanahu wa ta'ala reminds His believing servants of His bounty by legislating this glorious religion and sending them this honorable Messenger sallAllahu aalyhi wa sallam. He also reminds them of the covenant and pledges that He took from them to follow the Messenger, support and aid him, implement his Law and convey it on his behalf, while accepting it themselves.Allah subhanahu wa ta'ala said \" And you remember Allah's favour upon you and his covenant with which he bound you when you said we hear and we obey\"",
    "year": "2016"
  },
  {
    "number": "582",
    "text": "The number of takbirat performed in a rak'ah as a unit of salāh is",
    "options": {
      "A": "9",
      "B": "8",
      "C": "7",
      "D": "6"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63751?exam_type=jamb&type=obj&page=117",
    "correct_answer": "D",
    "explanation": "\"A complete rak`at is made up of 6 Takbirah\".",
    "year": "2016"
  },
  {
    "number": "583",
    "text": "Al-Kawthar in the Glorious Qur'an is otherwise called a",
    "options": {
      "A": "river in paradise",
      "B": "garden in paradise",
      "C": "light in paradise",
      "D": "fruit in paradise"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63752?exam_type=jamb&type=obj&page=117",
    "correct_answer": "A",
    "explanation": "Al-Kauthar is a river in Paradise. Prophet Muhammad (peace and blessings of Allah be upon him) witnessed this river on the night of Al-Mi'raj (ascension to the heavens). The Prophet said:\"(On the night of Al-Mi'raj) I came upon a river (in Paradise) the banks of which were made of tents of hollow pearls. I asked (Angel) Jibraîl, 'What is this (river)?' He replied, 'This is Al-Kauthar.\"Describing Al-Kauthar, the Prophet said: \"It is a river in Paradise which my Lord has given me. It is whiter than milk and sweeter than honey.\" [Narrated Prophet Muhammad will be given Al-Kauthar on the Day of Judgment to quench the thirst of his true followers. The Prophet said:\"Verily, it (Al-Kauthar) is a river that my Lord, the Mighty and Majestic, has promised me and it has abundant goodness. It is a pond where my Ummah (followers) will be brought to on the Day of Judgment. Its containers are as numerous as the stars in the sky.\"",
    "year": "2016"
  },
  {
    "number": "584",
    "text": "The significant message contained in sūrah at-Takāthur is that",
    "options": {
      "A": "passion for wealth and position may divert man's attention from worship of Allah",
      "B": "moral obligation and spiritual sacrifice should be uppermost in the minds of a true believer",
      "C": "man should avoid committing sin at all times",
      "D": "man should pray five times daily"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63753?exam_type=jamb&type=obj&page=117",
    "correct_answer": "A",
    "explanation": "As nearly most of the other Makkan surahs, surah At-Takathur reminds us of the hereafter, resurrection, and accountability before Allah the Almighty.Surah At-Takathur warns of the dangers of heedlessness of the Hereafter which results from one's deep immersion in worldly gains and the rivalry for such gains until one dies.",
    "year": "2016"
  },
  {
    "number": "625",
    "text": "'Peace descending on the righteous throughout the night' The verse above is one of the major themes in Sūrah",
    "options": {
      "A": "al-Qadr",
      "B": "al-Alaq",
      "C": "al-Kawthar",
      "D": "al-Falaq"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63892?exam_type=jamb&type=obj&page=125",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "626",
    "text": "A text of Hadith is rejected if it is",
    "options": {
      "A": "reported by an Arab",
      "B": "against natural phenomenon",
      "C": "reported twice by the same reporter",
      "D": "not reported in Madinah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63893?exam_type=jamb&type=obj&page=126",
    "correct_answer": "B",
    "explanation": "If authentic Hadiths were mixed up with the weak or fabricated Hadiths than the Muslims would be led astray. It was therefore important to verify the authenticity of the Hadiths so that Muslims could live their lives in line with the correct teachings of the Prophet. There are lots of reasons in rejecting a Hadith like if it against natural phenomenom.",
    "year": "2016"
  },
  {
    "number": "627",
    "text": "An Imam leading prayer, forgetfully rises when he is to sit, he is alerted by saying",
    "options": {
      "A": "astaghfirullah",
      "B": "Allahu Akba",
      "C": "Subhānallah",
      "D": "subhāna rabbial Azim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63894?exam_type=jamb&type=obj&page=126",
    "correct_answer": "C",
    "explanation": ": we are all human being and we make mistake, so when an imam makes a mistake rising up early, he his corrected by saying \"Subh Allah\" which means \"May Allah be raised.\" Or \"exalted his Allah above.\"",
    "year": "2016"
  },
  {
    "number": "628",
    "text": "Fasting has been prohibited on doubtful day which is",
    "options": {
      "A": "28th of Sha'aban",
      "B": "1st of Ramadan",
      "C": "30th of Ramada",
      "D": "30th of Sha'aban"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63896?exam_type=jamb&type=obj&page=126",
    "correct_answer": "D",
    "explanation": "Praise be to Allaah.Abu Dawood (3237), al-Tirmidhi (738) and Ibn Naajah (1651) narrated from Abu Hurayrah (may Allaah be pleased with him) that the Messenger of Allaah (peace and blessings of Allaah be upon him) said: \"When Sha'baan is half over, do not fast.\" Classed as saheeh by al-Albaani in Saheeh al-Tirmidhi, 590.This hadeeth indicates that it is not allowed to fast after halfway through Sha'baan, i.e., starting from the sixteenth day of the month.",
    "year": "2016"
  },
  {
    "number": "629",
    "text": "Those who are not Pilgrims are advised to fast on the day of",
    "options": {
      "A": "eid al-fitri",
      "B": "ashura",
      "C": "eid al-adha",
      "D": "Arafat"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63904?exam_type=jamb&type=obj&page=126",
    "correct_answer": "D",
    "explanation": ": \"It is recommended for Muslims who are not engaged in the right of Hajji to fast on the Day of Arafat\". Fasting on the day of Arafah for non-pilgrims is a highly recommended Sunnah which entails a great reward; Allah forgives the sins of two years. It was narrated from Abu Qatadah that Muhammad was asked about fasting on the day of 'Arafah and he replied: \"It expiate for the past and coming years.\" Prohibiting the pilgrims from fasting on these days is a great mercy for them, for fasting will exert undue hardship on the person performing the hajj. Above all, Muhammad did not fast while he stood before Allah offering supplications in Arafah. On the other hand, those who are not performing their hajj may observe fasting to gain the merits of the blessed day.",
    "year": "2016"
  },
  {
    "number": "630",
    "text": "The permission to marry up to four wives in Islam is aimed at",
    "options": {
      "A": "bearing more children",
      "B": "treating them equally",
      "C": "reducing the number of unmarried women",
      "D": "preventing adultery"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63907?exam_type=jamb&type=obj&page=126",
    "correct_answer": "D",
    "explanation": ": If ye fear that ye shall not be able to deal justly with the orphans, Marry women of your choice, Two or three or four; but if ye fear that ye shall not be able to deal justly (with them), then only one, or (a captive) that your right hands possess , that will be more suitable, to prevent you from doing injustice.- Qur'an, Sura 4 ( An-Nisa), Ayah 3",
    "year": "2016"
  },
  {
    "number": "631",
    "text": "The Prophet (SAW) said, 'Of all things lawful, divorce is the most hateful to Allah' because it exposes the parties to",
    "options": {
      "A": "reconciliation",
      "B": "provocation",
      "C": "Hardship",
      "D": "arbitration"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63911?exam_type=jamb&type=obj&page=127",
    "correct_answer": "B",
    "explanation": "Allah frowns to divorce between a wife and husband, if a marriage is on the bridge of collapsing and there is no chance for reconciliation, the two can divorce in a good manner with two witness, one from each sides. To witness the divorce process.",
    "year": "2016"
  },
  {
    "number": "632",
    "text": "The authenticity of the Glorious Qur'an has been proven by empirical evidence of",
    "options": {
      "A": "dredging sea water to dams",
      "B": "stages of growth of human embryo",
      "C": "development of nuclear technology",
      "D": "development of solar technology"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63913?exam_type=jamb&type=obj&page=127",
    "correct_answer": "B",
    "explanation": "Surat Al-Mu'minūn (The Believers) - ﺳﻮﺭﺓ ﺍﻟﻤﺆﻣﻨﻮﻥ Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones,and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah , the best of creators.",
    "year": "2016"
  },
  {
    "number": "633",
    "text": "One major peculiarity between the Makkan and Madinan Suwar of the Glorious Qur'an is that",
    "options": {
      "A": "Makkan Suwar are historical while Madinan Suwar are theoretical",
      "B": "Makkan Suwar are meant for daily rituals while Madinan Suwar are for commercial transactions",
      "C": "Makkan Suwar are purely to people of Makkan while the Madinan Suwar addresses the people of Madina",
      "D": "Makkan Suwar are short and poetic while the Madinan Suwar are longer and generic."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63915?exam_type=jamb&type=obj&page=127",
    "correct_answer": "D",
    "explanation": "The Madni Surahs ( Surah Madaniyah) or Madani chapters of the Quran are the latest 24 Surahs that, according to Islamic tradition, were revealed at Medina after Muhammad's hijrat from Mecca . Community was larger and more developed, as opposed to their minority position in Mecca .",
    "year": "2016"
  },
  {
    "number": "634",
    "text": "The copy of the Glorious Qur'an in use was standardized during the period of Caliph",
    "options": {
      "A": "Abu Bakr as Siddiq",
      "B": "Umar b. Khattab",
      "C": "Uthman b. Affan",
      "D": "Ali b. Abu Talib."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/63917?exam_type=jamb&type=obj&page=127",
    "correct_answer": "C",
    "explanation": "Uthman ibn `Affan (c. 579 - 17 July 656) was one of the companions of Islamic prophet, Muhammad. He played a major role in early Islamic history as the third Caliph. ... ` Uthman was an early convert to Islam and is said to have spent a great amount of his wealth on charity. The copy of the glorious Quarantine in use was standardized in his reign.",
    "year": "2016"
  },
  {
    "number": "675",
    "text": "The major themes that can be derived from Surah al-fatihah are",
    "options": {
      "A": "knowledge, prayer and sacrifice",
      "B": "praise, prayer and pledge",
      "C": "praise, promise and equity",
      "D": "praise, pledge and prayer"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64054?exam_type=jamb&type=obj&page=135",
    "correct_answer": "B",
    "explanation": "Surah al - Fatihah is the first chapter ( surah) of the Quran. Its seven verses (ayat) are a prayer for the guidance, lordship and mercy of God. ... Some Muslims interpret it as a reference to an implied ability of the Surah to open a person to faith in God.",
    "year": "2016"
  },
  {
    "number": "676",
    "text": "Raiding as a characteristic of the Jahilyyah Arabs led to",
    "options": {
      "A": "Holding annual political meetings",
      "B": "Staging of annual trade fair",
      "C": "Burying their female children alive",
      "D": "Fighting inter- tribal wars"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64056?exam_type=jamb&type=obj&page=136",
    "correct_answer": "D",
    "explanation": "Jahiliyyah ( Arabic : ﺟَﺎﻫِﻠِﻴَّﺔ jāhilīyah, \"ignorance\") is an Islamic concept referring to the period of time and state of affairs in Arabia before the advent of Islam in 610 CE. ... The term jahiliyyah is derived from the verbal root jahala \"to be ignorant or stupid, to act stupidly\".",
    "year": "2016"
  },
  {
    "number": "677",
    "text": "The caliph who introduced stipend for teachers was",
    "options": {
      "A": "Abu Bakr",
      "B": "'Umar",
      "C": "'Uthman",
      "D": "'Ali"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64058?exam_type=jamb&type=obj&page=136",
    "correct_answer": "B",
    "explanation": "caliph Umar was the one who introduce stipend for teacher and the army. So that they will be committed to doing the work and be able to feed themselves and their families.",
    "year": "2016"
  },
  {
    "number": "678",
    "text": "The main impact of Islamic values on social life of the people of West Africa is the",
    "options": {
      "A": "Performance of Salah by Muslims",
      "B": "Modification of polygamy in line with Islamic principles",
      "C": "Adoption of Arabic words in many languages",
      "D": "Avoidance of alcoholic drink in public places"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64059?exam_type=jamb&type=obj&page=136",
    "correct_answer": "C",
    "explanation": "Islam is an Abrahamic monotheistic religion that teaches there is only one God ( Allah), and that Muhammad is a messenger of God. In other to teach follower's the quaran they have to learn Arabic, so they Learn how to speak and understand Arabic language.",
    "year": "2016"
  },
  {
    "number": "679",
    "text": "The complete Glorious was Qur'ān taken from Lawn al-mahfuz to the lowest of the heavens known as",
    "options": {
      "A": "Bait al- Izzah",
      "B": "Bait al- Maqdis",
      "C": "Bait al-Haram",
      "D": "Bait al-Hikmah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64060?exam_type=jamb&type=obj&page=136",
    "correct_answer": "A",
    "explanation": ": It is the order in which the whole Quran (in its present order) was transferred from the Al-Lawh Al-Mahfooth (The Preserved Tablet) to the Bayt Al-'Izzah (The universal heaven) on the night of Al-Qadr (Decree).",
    "year": "2016"
  },
  {
    "number": "680",
    "text": "The most important ways of preserving the Glorious Qur'ān by Sahǻbah include",
    "options": {
      "A": "establishing schools in major cities and teaching the Glorious Qur'ān",
      "B": "teaching the application of sunnah practically",
      "C": "explaining the conduct of the prophet according to the Glorious Qur'ān",
      "D": "guiding the new converts in Islam ways of life"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64061?exam_type=jamb&type=obj&page=136",
    "correct_answer": "A",
    "explanation": ": establishing islamic schools where students can Learn and be taught more about the glorious quaran, helps in preserving the glorious quaran.",
    "year": "2016"
  },
  {
    "number": "681",
    "text": "What are the characteristics common to most Makkan Suwar?",
    "options": {
      "A": "They are short and poetic",
      "B": "They are long and rhythmic",
      "C": "They are easy and rhythmic",
      "D": "They are stylistic and summative"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64062?exam_type=jamb&type=obj&page=137",
    "correct_answer": "A",
    "explanation": ": The Meccan surahs are, according to the timing and contextual background of supposed revelation (asbāb al-nuzūl), the chronologically earlier chapters (suwar, singular sūrah) of the Qur'an that were revealed anytime before the migration of the Islamic prophet Muhammed and his followers from Mecca to Medina (Hijra). They are short and mostly poetic.",
    "year": "2016"
  },
  {
    "number": "682",
    "text": "The Glorious Qur'ān is a guidance for",
    "options": {
      "A": "The pious",
      "B": "All mankind",
      "C": "The Arab",
      "D": "The Quraish"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64064?exam_type=jamb&type=obj&page=137",
    "correct_answer": "A",
    "explanation": "The glorious quaran is meant to guide those who are pious, that means those who are devout and God fearing. They are to read it to guide them in their day to day activities in other not to go astray.",
    "year": "2016"
  },
  {
    "number": "683",
    "text": "What will happen on the Day of Judgment according to Q.101:4?",
    "options": {
      "A": "Mountains will discharge fire",
      "B": "Mountains will be like carded wool",
      "C": "Fire of Jahannam will be seen",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64072?exam_type=jamb&type=obj&page=137",
    "correct_answer": "D",
    "explanation": "Quaran describe the day as \"It is a day when humans shall be like (a cloud of densely) scattered moths ( running in every direction in their confusion as the earth disintegrates but after the earth is destroyed humans shall again appear as a dense crowd who have been thrown out of their graves which means resurrected from death back to life in the hereafter but they shall all be moving in the same direction toward their judgement\"",
    "year": "2016"
  },
  {
    "number": "684",
    "text": "The right of a husband over his wife excludes",
    "options": {
      "A": "Controlling the wife's activities",
      "B": "Taking additional wives",
      "C": "Deciding the place of residence",
      "D": "Total controlling the wife's property"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64074?exam_type=jamb&type=obj&page=137",
    "correct_answer": "D",
    "explanation": "According to Quaran, the husband has the right to be loved, obeyed, by his wife and taking care of his sexual needs and also help manage his finances and care for their children, but he does not have the right to control all his wife property.",
    "year": "2016"
  },
  {
    "number": "685",
    "text": "Talaq al bai'in technically conveys the idea of",
    "options": {
      "A": "Divorce of a new bride",
      "B": "Court annulment of marriage",
      "C": "An irrevocable divorce",
      "D": "Divorce in a state of impurity"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64076?exam_type=jamb&type=obj&page=137",
    "correct_answer": "C",
    "explanation": "JUDICIAL TRENDS. It is that form of divorce which is considered from the rehgious point of view a Biddat. It is so called because it does not command the sanction of Shariah as well of the Muslim Jurists and is considered undesirable innovation.",
    "year": "2016"
  },
  {
    "number": "686",
    "text": "Zihar occurs when a husband compares his",
    "options": {
      "A": "Wife with himself",
      "B": "Wife with his daughter",
      "C": "Daughter with her friend",
      "D": "Wife with the back of his mother."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64078?exam_type=jamb&type=obj&page=138",
    "correct_answer": "D",
    "explanation": "Wife with the back of his mother \"Zihar is husband's comparison of his wife's back with his mother\".",
    "year": "2016"
  },
  {
    "number": "687",
    "text": "Excluded from inheritance is a",
    "options": {
      "A": "Brother from the estate of his deceased brother",
      "B": "Man after the death of his wife",
      "C": "Person who kills his father for his estate",
      "D": "Woman because of her gender."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64082?exam_type=jamb&type=obj&page=138",
    "correct_answer": "C",
    "explanation": "Person who kills his father for his estate \"In a case of homicide, the person guilty of murder is barred from inheritance of the person he murdered\"",
    "year": "2016"
  }
]