[
  {
    "number": "727",
    "text": "The civil service cadre responsible for the general supervision and control of ministries is the",
    "options": {
      "A": "administrative",
      "B": "professional",
      "C": "executive",
      "D": "clerical"
    },
    "answer_url": "https://myschool.ng/classroom/government/27775?exam_type=jamb&type=obj&page=146",
    "correct_answer": "A",
    "explanation": "In a civil service system, theadministrative cadreis responsible for the overall supervision and control of ministries. These civil servants are senior officers who manage the day-to-day operations of government departments. They ensure that policies are implemented and administrative functions run smoothly. They often provide leadership and guidance to other staff in the civil service.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "728",
    "text": "A disadvantage of the one-party system is that it",
    "options": {
      "A": "makes accountability difficult",
      "B": "negates freedom of association",
      "C": "emphasizes political  differences",
      "D": "delays decision - making"
    },
    "answer_url": "https://myschool.ng/classroom/government/27777?exam_type=jamb&type=obj&page=146",
    "correct_answer": "B",
    "explanation": "Aone-party systemcan restrict or completely eliminate the ability of individuals to form or join different political parties, which diminishes the freedom of association. In such a system, opposition parties are either banned or heavily suppressed, leading to a lack of political pluralism and the stifling of political debate.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "729",
    "text": "Citizenship refers to the",
    "options": {
      "A": "indigenous member of a  state",
      "B": "social status of a person in a state",
      "C": "highest position in a state",
      "D": "legal status of a member of a state"
    },
    "answer_url": "https://myschool.ng/classroom/government/27778?exam_type=jamb&type=obj&page=146",
    "correct_answer": "D",
    "explanation": "Citizenshipis the legal relationship between an individual and a state, granting the person certain rights, responsibilities and privileges. It implies that a person is a recognised member of the state and subject to its laws, and in turn, is entitled to the protection and benefits provided by the state.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "730",
    "text": "The rule of law is a cardinal principle associated with",
    "options": {
      "A": "democratic systems",
      "B": "federal systems",
      "C": "communist systems",
      "D": "feudal systems"
    },
    "answer_url": "https://myschool.ng/classroom/government/27779?exam_type=jamb&type=obj&page=146",
    "correct_answer": "A",
    "explanation": "The rule of law is a fundamental principle associated with democratic systems. In a democratic system, the rule of law means that everyone, including government officials, is subject to and accountable under the law. This means that laws are applied consistently and fairly and ensures that individuals and institutions are governed by a set of rules rather than the arbitrary decisions of those in power. Democratic systems respect the rule of law to safeguard individual rights, promote justice and prevent the abuse of power.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "731",
    "text": "The main function of public opinion is to",
    "options": {
      "A": "change the policy of government",
      "B": "provide direction for public policy",
      "C": "support the policy of government",
      "D": "indoctrinate the people"
    },
    "answer_url": "https://myschool.ng/classroom/government/27781?exam_type=jamb&type=obj&page=147",
    "correct_answer": "B",
    "explanation": "Public opinion shapes the direction of government policies. It reflects the views, attitudes and preferences of the general population on various issues, and governments often consider public opinion when formulating policies to ensure they align with the values and interests of the people.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "732",
    "text": "A typical form of delegated legislation is",
    "options": {
      "A": "acts of parliament",
      "B": "decree",
      "C": "bye - law",
      "D": "gazette"
    },
    "answer_url": "https://myschool.ng/classroom/government/27782?exam_type=jamb&type=obj&page=147",
    "correct_answer": "C",
    "explanation": "Abye-lawis a form ofdelegated (or secondary) legislation, where the power to make laws is delegated by the legislature to a local authority or an organisation to make regulations within a certain area or for specific purposes. These laws apply to local or specific issues and are subordinate to primary legislation (acts of parliament).\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "733",
    "text": "A referendum is a device to ensure that",
    "options": {
      "A": "elections are free and fair",
      "B": "legislators vote to resolve contentious issues",
      "C": "bye - elections are held to fill vacant positions",
      "D": "decisions are effected with the consent of citzens"
    },
    "answer_url": "https://myschool.ng/classroom/government/27783?exam_type=jamb&type=obj&page=147",
    "correct_answer": "D",
    "explanation": "Areferendumis a process in which the government seeks the direct approval or disapproval of the electorate on a specific issue. Such issues may include constitutional amendments, major policy changes or other significant decisions. It ensures that decisions are made with theconsent of citizens.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "734",
    "text": "One main weakness of a unitary system of government is that",
    "options": {
      "A": "it facilitates the domination of minority groups",
      "B": "the constitution can be amended easily",
      "C": "it is run as a single entity",
      "D": "carpet - crossing and opposition are made difficult"
    },
    "answer_url": "https://myschool.ng/classroom/government/27785?exam_type=jamb&type=obj&page=147",
    "correct_answer": "A",
    "explanation": "In aunitary system of government, power is concentrated at the national level, and local governments, if they exist, have limited powers that can be revoked by the central government. This centralisation of authority can lead to thedomination of minority groups, as the central government may not fully represent the interests of all regions or minority populations, particularly those in less politically dominant areas.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "735",
    "text": "Pressure groups harmonise different individual concerns through interest",
    "options": {
      "A": "mobilization",
      "B": "aggregation",
      "C": "manipulation",
      "D": "articulation"
    },
    "answer_url": "https://myschool.ng/classroom/government/27786?exam_type=jamb&type=obj&page=147",
    "correct_answer": "B",
    "explanation": "Pressure groupsaggregateindividual concerns by bringing together various individual interests and combining them into a collective stance or platform. This allows them to present a unified position on a particular issue to influence public policy or government decisions.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "736",
    "text": "The act of removing an elected official by the electorate is referred to as",
    "options": {
      "A": "impeachment",
      "B": "consensus",
      "C": "plebiscite",
      "D": "recall"
    },
    "answer_url": "https://myschool.ng/classroom/government/27787?exam_type=jamb&type=obj&page=148",
    "correct_answer": "D",
    "explanation": "Recallis the act of removing an elected official from office before their term has ended, usually through a direct vote by the electorate. It allows citizens to hold their elected representatives accountable for their actions while in office. An impeachment, on the other hand, is the process by which the legislature removes an elected official from office if found guilty of gross misconduct.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "737",
    "text": "One of the major sources of a constitution is",
    "options": {
      "A": "judicial precedence",
      "B": "political debate",
      "C": "opinion poll",
      "D": "executive order"
    },
    "answer_url": "https://myschool.ng/classroom/government/27788?exam_type=jamb&type=obj&page=148",
    "correct_answer": "A",
    "explanation": "Judicial precedence(also known ascase laworstare decisis) is a major source of a constitution. Courts follow previous judicial decisions when making rulings on similar cases, and over time, these decisions can become part of the constitutional framework.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "738",
    "text": "A characteristic of public opinion is that it is",
    "options": {
      "A": "positive",
      "B": "static",
      "C": "dynamic",
      "D": "negative"
    },
    "answer_url": "https://myschool.ng/classroom/government/27789?exam_type=jamb&type=obj&page=148",
    "correct_answer": "C",
    "explanation": "Public opinionis considered dynamic because itchanges over timein response to various factors such as political events, social movements, economic conditions and media influence. It is not fixed or static; rather, it evolves and fluctuates as new information or issues emerge.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "739",
    "text": "Coalition government arises when",
    "options": {
      "A": "one of the parties has a majority in parliament",
      "B": "no party has a majority in parliament",
      "C": "two or more parties co - operate to pass a bill in parliament",
      "D": "the ruling party is defeated in parliament"
    },
    "answer_url": "https://myschool.ng/classroom/government/27790?exam_type=jamb&type=obj&page=148",
    "correct_answer": "B",
    "explanation": "Acoalition governmentarises whenno single political partyhas enough seats to form amajorityin parliament. In such cases, two or more parties come together to form a government by sharing power and collaborating to achieve a majority in the legislature.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "740",
    "text": "One of the central tenets of the fascist doctrine is that the leader is",
    "options": {
      "A": "supreme relative to the constitution",
      "B": "subordinate to the norms of the society",
      "C": "subordinate to the laws of the state",
      "D": "weak relative to the constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/27791?exam_type=jamb&type=obj&page=148",
    "correct_answer": "A",
    "explanation": "Infascism, the leader (often referred to as theFührerorDuce) is consideredsupremeand above the constitution, laws and norms of society. Fascist ideology emphasises the absolute authority of the leader, who is seen as the embodiment of the state and its will. This authoritarian system often disregards democratic processes, the rule of law and constitutional limits on power.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "741",
    "text": "Which of the following electoral bodies in Nigeria conducted elections from 1979 to 1983?",
    "options": {
      "A": "National Electoral Commission",
      "B": "Independent Electoral Commission",
      "C": "Federal Electoral Commission",
      "D": "National Electoral Commission of Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/government/27792?exam_type=jamb&type=obj&page=149",
    "correct_answer": "C",
    "explanation": "TheFederal Electoral Commission (FEDECO)was the electoral body responsible for conducting elections in Nigeria from1979 to 1983. FEDECO was established to oversee the electoral processes during the Second Republic, and it conducted the general elections that brought in civilian government in 1979, as well as the subsequent elections up until the military takeover in 1983.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "742",
    "text": "Constitutionalism refers to the",
    "options": {
      "A": "process of operating a constitution",
      "B": "process of drafting a constitution",
      "C": "adherence to a constitution",
      "D": "amendment of an existing constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/27794?exam_type=jamb&type=obj&page=149",
    "correct_answer": "C",
    "explanation": "Constitutionalismis the principle that government should operate within the limits and framework set by a constitution. It isadherence to the constitutionas a guiding authority. It means that the actions of the government remain within the boundaries of constitutional law.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "743",
    "text": "Under the Presidential system of government the legislature and the executive are",
    "options": {
      "A": "elected separately to a fixed term",
      "B": "elected separately to an unfixed term",
      "C": "appointed by the judiciary to a fixed term",
      "D": "appointed at the same time to an unfixed term"
    },
    "answer_url": "https://myschool.ng/classroom/government/27795?exam_type=jamb&type=obj&page=149",
    "correct_answer": "A",
    "explanation": "In aPresidential system of government, thelegislatureand theexecutive(the President) areelected independently of each other. Both branches servefixed terms: for example, in Nigeria, the President and members of the House of Assembly serve fixed terms of four years. This separation ensures that the executive and legislative branches operate independently, preventing any undue influence from one branch over the other and supporting the principle of checks and balances.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "744",
    "text": "The Supreme Court, through its interpretations of the constitution, is a",
    "options": {
      "A": "protector of the state",
      "B": "guardian of freedom",
      "C": "preserver of the status quo",
      "D": "participator in the politics of the state"
    },
    "answer_url": "https://myschool.ng/classroom/government/27796?exam_type=jamb&type=obj&page=149",
    "correct_answer": "B",
    "explanation": "TheSupreme Court, by interpreting the Constitution, acts as aguardian of freedomby protecting the rights and liberties of individuals. Through its rulings, the Court upholds constitutional principles and ensures that laws and governmental actions do not infringe on the fundamental rights and freedoms guaranteed to citizens.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "745",
    "text": "Separation of powers is a principle which enables each arm of government to",
    "options": {
      "A": "probe one another",
      "B": "overlap the functions of the other",
      "C": "carry out its constitutional functions",
      "D": "moderate the scope of the constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/27797?exam_type=jamb&type=obj&page=149",
    "correct_answer": "C",
    "explanation": "Separation of powersis a principle that allows each arm of government—the executive, the legislature, and the judiciary—to function independently and carry out its designated roles as outlined by the Constitution. This principle helps to prevent any one branch from exercising too much power by ensuring that each branch operates within its own defined responsibilities.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "746",
    "text": "The main attributes of a state are",
    "options": {
      "A": "Population, territory, government and sovereignty",
      "B": "the press, the legislature, the executive and the judiciary",
      "C": "federal, state and local governments",
      "D": "government, the police and the armed forces"
    },
    "answer_url": "https://myschool.ng/classroom/government/27798?exam_type=jamb&type=obj&page=150",
    "correct_answer": "A",
    "explanation": "These are considered thefour essential attributes of a state:\nPopulation– The people who make up the state.Territory– The defined geographical area within which the state has authority.Government– The organised institution or system through which state policies are created and enforced.Sovereignty– The supreme authority of the state to govern itself and make independent decisions without external interference.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "747",
    "text": "The General Purpose Committee of the local government functions as a",
    "options": {
      "A": "Committee for awarding contracts",
      "B": "cabinet of the local government",
      "C": "body responsible for supervising self-help projects",
      "D": "committee of the government on public relations"
    },
    "answer_url": "https://myschool.ng/classroom/government/27799?exam_type=jamb&type=obj&page=150",
    "correct_answer": "B",
    "explanation": "TheGeneral Purpose Committeein local government functions similarly to acabinetfor the local government. It is responsible for making major policy decisions and overseeing the administration's key activities. This committee typically includes the heads of departments and senior officials, who help coordinate various functions of the local government, much like a cabinet in larger governmental structures.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "748",
    "text": "Nigeria observed the principle of collective responsibility between",
    "options": {
      "A": "1993 and 1999",
      "B": "1985 and 1993",
      "C": "1979 and 1983",
      "D": "1960 and 1966"
    },
    "answer_url": "https://myschool.ng/classroom/government/27800?exam_type=jamb&type=obj&page=150",
    "correct_answer": "D",
    "explanation": "Between1960 and 1966, Nigeria operated aparliamentary system of government.In this system, the Prime minister and his cabinet are collectively responsible for the policies that are implemented. This system was later replaced by the presidential system of government in the Second Republic.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "749",
    "text": "The political party with the widest spread membership in Nigeria during the Second Republic was the",
    "options": {
      "A": "GNPP",
      "B": "NPP",
      "C": "NPN",
      "D": "UPN"
    },
    "answer_url": "https://myschool.ng/classroom/government/27801?exam_type=jamb&type=obj&page=150",
    "correct_answer": "C",
    "explanation": "During Nigeria'sSecond Republic(1979–1983), theNational Party of Nigeria (NPN)was the political party with thewidest spread of membershipacross the country. The NPN aimed to establish a national presence by appealing to diverse ethnic and regional groups, which contributed to its popularity and success in multiple regions. It was the ruling party, and it won the presidential elections in both 1979 and 1983 withShehu Shagarias its candidate.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "750",
    "text": "Military intervention in Nigeria arose from",
    "options": {
      "A": "perceived incapacity of civilians to govern",
      "B": "military corporatism and egocentrism",
      "C": "international pressures for change",
      "D": "civilian desire to give up power"
    },
    "answer_url": "https://myschool.ng/classroom/government/27802?exam_type=jamb&type=obj&page=150",
    "correct_answer": "A",
    "explanation": "In many cases of military intervention including in Nigeria, the military justifies its actions by claiming that the civilian government is unable to effectively govern or maintain order. This perception of civilian incapacity to govern often serves as a rationale for military intervention, as the military may see itself as a more capable or necessary force to address perceived problems or crises in the country.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "751",
    "text": "Federalism was introduced in Nigeria under the",
    "options": {
      "A": "Richards Constitution",
      "B": "Lyttleton constitution",
      "C": "Macpherson Constitution",
      "D": "Independence Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/27803?exam_type=jamb&type=obj&page=151",
    "correct_answer": "B",
    "explanation": "Federalismwas introduced in Nigeria under theLyttleton Constitutionof1954. This constitution formally established Nigeria as afederal stateby dividing the country into regions with distinct administrative powers. This marled a shift from a unitary system to a federal one. It also created a federal parliament with a central government and regional governments, each having its own legislature.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "752",
    "text": "Regional consciousness in Nigeria was introduced by the",
    "options": {
      "A": "Lyttleton Constitution",
      "B": "Clifford Constitution",
      "C": "Macpherson Constitution",
      "D": "Richards Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/27805?exam_type=jamb&type=obj&page=151",
    "correct_answer": "D",
    "explanation": "Regional consciousnessin Nigeria was formally introduced by theRichards Constitutionof1946. This constitution createdthree regions—theNorthern,Western, andEastern regions—which were given a degree of administrative autonomy.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "753",
    "text": "How many states were created in Nigeria in 1967?",
    "options": {
      "A": "21",
      "B": "19",
      "C": "12",
      "D": "4"
    },
    "answer_url": "https://myschool.ng/classroom/government/27806?exam_type=jamb&type=obj&page=151",
    "correct_answer": "C",
    "explanation": "On the 5th of May,1967, Nigeria's military government, led by General Yakubu Gowon, reorganised the country from its four regions (Northern, Eastern, Western and Mid-Western Regions) into12 states. This restructuring aimed to address ethnic and political tensions, particularly in response to the growing secessionist movement in the Eastern Region, which later led to the Nigerian Civil War. The 12 states created in 1967 were:\nNorth-Western StateNorth-Eastern StateKano StateKaduna StateKwara StateBenue-Plateau StateLagos StateWestern StateMid-Western StateEast-Central StateRivers StateSouth-Eastern State\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "754",
    "text": "The day-to-day operation of public corporations is the direct responsibility of the",
    "options": {
      "A": "management",
      "B": "union workers",
      "C": "supervising ministry",
      "D": "board of directors"
    },
    "answer_url": "https://myschool.ng/classroom/government/27808?exam_type=jamb&type=obj&page=151",
    "correct_answer": "A",
    "explanation": "Themanagementof a public corporation is directly responsible for its day-to-day operations. This includes overseeing the daily activities and making decisions about the corporation.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "755",
    "text": "Under the independence Constitution of Nigeria, Dr Nnamdi Azikiwe was",
    "options": {
      "A": "Head of state",
      "B": "Governor General",
      "C": "Prime Minister",
      "D": "Lieutenant Governor"
    },
    "answer_url": "https://myschool.ng/classroom/government/27809?exam_type=jamb&type=obj&page=151",
    "correct_answer": "B",
    "explanation": "Under Nigeria'sIndependence Constitutionof 1960,Dr. Nnamdi Azikiwebecame theGovernor-Generalof Nigeria. He was the ceremonial head of state, representing the British monarch (Queen Elizabeth II), as Nigeria was still a constitutional monarchy at that time.\nIn 1963, after Nigeria became a republic, Dr. Azikiwe became thefirst President of Nigeriaunder the new republican constitution, which removed the monarchy and established the office of the president as the head of state.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "756",
    "text": "Which of the following contributed greatly to the introduction of the Clifford Constitution?",
    "options": {
      "A": "Nigerian National Democratic Party",
      "B": "Lagos Youth Moverment",
      "C": "Nigerian Youth Movement",
      "D": "National Congress of British West Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/27811?exam_type=jamb&type=obj&page=152",
    "correct_answer": "D",
    "explanation": "The National Congress of British West Africa (NCBWA) was a congress formed in Accra, Ghana and consisted of Nigerian and Ghanaian delegates who were sent to London to represent Nigeria's interest in the issue of granting elective principle. Their resolution led to the granting of elective representation for Africans as stipulated in the Clifford constitution of 1922.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "757",
    "text": "In Nigeria, the Local Government Service Commission is set up by the",
    "options": {
      "A": "local government councils",
      "B": "federal government",
      "C": "state government",
      "D": "local government chairman"
    },
    "answer_url": "https://myschool.ng/classroom/government/27812?exam_type=jamb&type=obj&page=152",
    "correct_answer": "C",
    "explanation": "In Nigeria, theLocal Government Service Commission (LGSC)is established by thestate government. The commission is responsible for the recruitment, promotion and discipline of local government staff in the respective states. It ensures that local government employees are properly managed and maintained and that they are operating within the frameworks set by state governments in line with the Constitution and local government laws.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "758",
    "text": "In the 1930s, the political movement that challenged the NNDP domination of Lagos politics was the",
    "options": {
      "A": "NYM",
      "B": "AG",
      "C": "NPC",
      "D": "NCNC"
    },
    "answer_url": "https://myschool.ng/classroom/government/27813?exam_type=jamb&type=obj&page=152",
    "correct_answer": "A",
    "explanation": "In the 1930s, theNational Youth Movement (NYM)was the political movement that challenged theNNDP (Nigerian National Democratic Party)domination of Lagos politics. The NNDP, led byHerbert Macaulay, was the dominant political force in Lagos at the time, but the NYM, led byNnamdi Azikiwe, aimed to promote more nationalist and progressive political ideals. The NYM advocated for greater self-government for Nigerians and was a precursor to the formation of more significant political parties like the NCNC.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "759",
    "text": "The Nigerian Public Complaints Commission as the Ombudsman suffers most from",
    "options": {
      "A": "poor knowledge of the workings of the public service",
      "B": "manipulation by political office holders",
      "C": "too many complaints to handle effectively",
      "D": "lack of power to enforce its decisions"
    },
    "answer_url": "https://myschool.ng/classroom/government/27814?exam_type=jamb&type=obj&page=152",
    "correct_answer": "D",
    "explanation": "TheNigerian Public Complaints Commission (PCC), which functions as theOmbudsmanfor the country, faces a significant challenge in itslack of enforcement power. While the commission is tasked with investigating complaints from citizens regarding the maladministration or misconduct of public officials, it lacks the legal authority to compel government agencies or officials to implement its recommendations or decisions. This limitation severely hampers its ability to effectively address and resolve complaints.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "760",
    "text": "Residual powers in the 1979 Constitution of Nigeria were vested in the",
    "options": {
      "A": "local and state governments",
      "B": "state government",
      "C": "federal government",
      "D": "local government"
    },
    "answer_url": "https://myschool.ng/classroom/government/27816?exam_type=jamb&type=obj&page=152",
    "correct_answer": "D",
    "explanation": "In the 1979 constitution, the legislative powers were divided among the federal, state and local governments. The federal government, through the parliament, could legislate on items on the exclusive legislative list, while both the federal and state governments could legislate on items under the concurrent legislative list. The residual powers resided in the hands of the local government.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "761",
    "text": "A characteristic of most pre-colonial governments in Nigeria is that they",
    "options": {
      "A": "had no defined functions",
      "B": "performed only executive functions",
      "C": "had no clear separation of powers",
      "D": "observed independence of the judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/27817?exam_type=jamb&type=obj&page=153",
    "correct_answer": "C",
    "explanation": "Most pre-colonial governments in Nigeria, such as those of theYoruba,Igbo,Hausa-Fulani, and other ethnic groups, did not have a formal separation of powers like modern democratic systems. The rulers or leaders often held a combination of executive, legislative and judicial functions. For instance, in some societies, the king or chief not only enacted laws but also enforced them and settled disputes.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "762",
    "text": "Prior to the formation of the OAU in 1963, Nigeria identified with the",
    "options": {
      "A": "Monorovia Group",
      "B": "Casablanca Group",
      "C": "Brazzaville Group",
      "D": "Libreville Group"
    },
    "answer_url": "https://myschool.ng/classroom/government/27818?exam_type=jamb&type=obj&page=153",
    "correct_answer": "A",
    "explanation": "Prior to the formation of theOrganization of African Unity (OAU)in1963, Nigeria was aligned with theMonrovia Group. This group was composed of African nations that had a more moderate approach to African unity. They were favouring cooperation without a centralised union.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "763",
    "text": "In 1991, the African Economic Community Treaty was signed in",
    "options": {
      "A": "Addis Ababa",
      "B": "Abuja",
      "C": "Lome",
      "D": "Tripoli"
    },
    "answer_url": "https://myschool.ng/classroom/government/27819?exam_type=jamb&type=obj&page=153",
    "correct_answer": "B",
    "explanation": "TheAfrican Economic Community (AEC) Treatywas signed inAbuja, Nigeria, in1991. The treaty aimed to establish a pan-African economic community through the gradual integration of existing regional economic communities, ultimately leading to the creation of a single economic and political union across the continent.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "764",
    "text": "The first African Secretary General of the United Nations is",
    "options": {
      "A": "Kofi Annan",
      "B": "Joe Garba",
      "C": "Boutrous Boutrous Ghali",
      "D": "Ibrahim Gambari"
    },
    "answer_url": "https://myschool.ng/classroom/government/27820?exam_type=jamb&type=obj&page=153",
    "correct_answer": "C",
    "explanation": "The first African Secretary-General of the United Nations was an Egyptian politician and diplomat, Boutrous Boutrous Ghali, who served as the sixth Secretary-General of the United Nations (UN) from 1992 to 1996.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "765",
    "text": "Nigerians opposed the Defence Pact with Britain at independence because it",
    "options": {
      "A": "was forced on Nigeria, by Britian",
      "B": "was very ambiguous",
      "C": "was of no benefit to Nigeria",
      "D": "offended their pride at independence"
    },
    "answer_url": "https://myschool.ng/classroom/government/27822?exam_type=jamb&type=obj&page=153",
    "correct_answer": "D",
    "explanation": "At the time of Nigeria's independence in 1960, theDefence Pact with Britainwas viewed by many Nigerians as an affront to the country's sovereignty. The agreement allowed Britain to have a military presence in Nigeria and intervene in its affairs if necessary. For many Nigerians, this was seen as a symbol of continued colonial influence. The pact was perceived as undermining Nigeria's pride as a newly independent nation.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "766",
    "text": "The Technical Aid Corps scheme in Nigeria aims at strengthening relations with",
    "options": {
      "A": "countries in the Northern Hemisphere",
      "B": "countries in the Southern Hemisphere",
      "C": "African countries",
      "D": "West African countries"
    },
    "answer_url": "https://myschool.ng/classroom/government/27823?exam_type=jamb&type=obj&page=154",
    "correct_answer": "C",
    "explanation": "TheTechnical Aid Corps (TAC)scheme in Nigeria aims at strengthening relations with African countries. It was a scheme to develop and strengthen relations with the African, the Caribbean, and the Pacific States (ACP countries). The program sends Nigerian experts in various fields, including education, medicine, engineering and agriculture, to assist in the development of these countries.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "767",
    "text": "Nigeria's quest for a leadership role in Africa hinges principally on her",
    "options": {
      "A": "military might",
      "B": "economic strength",
      "C": "size and population",
      "D": "generosity"
    },
    "answer_url": "https://myschool.ng/classroom/government/27824?exam_type=jamb&type=obj&page=154",
    "correct_answer": "B",
    "explanation": "Nigeria's economic strength plays an important role in its pursuit of leadership in Africa. A strong economy enables Nigeria to invest in development projects, provide aid to other African nations, and engage in regional initiatives, thereby bolstering its influence and leadership position on the continent.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "768",
    "text": "Which of the following world powers was the first to come to Nigeria's aid during the civil war?",
    "options": {
      "A": "Britain",
      "B": "U S A",
      "C": "Germany",
      "D": "USSR"
    },
    "answer_url": "https://myschool.ng/classroom/government/27825?exam_type=jamb&type=obj&page=154",
    "correct_answer": "A",
    "explanation": "During the Nigerian Civil War (1967–1970), Britain was the first world power to come to Nigeria's aid. They supported the Federal Government's military efforts. This support was largely driven by political, economic, and strategic interests, including the desire to maintain relations with Nigeria as a former colony and the geopolitical situation during the Cold War.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "769",
    "text": "Nigeria's relations with African countries are underscored by its policy of",
    "options": {
      "A": "non - alignment",
      "B": "afrocentrism",
      "C": "political diplomacy",
      "D": "peaceful co-existence"
    },
    "answer_url": "https://myschool.ng/classroom/government/27826?exam_type=jamb&type=obj&page=154",
    "correct_answer": "B",
    "explanation": "Nigeria's relationship with African countries is often characterised byAfrocentrism, which emphasises the importance of Africa's unity, cultural heritage and the need for African solutions to African problems. Nigeria has consistently advocated for the promotion of African interests, peace and economic cooperation within the continent, and it has played an active role in organisations like theAfrican Union (AU)and theEconomic Community of West African States (ECOWAS).\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "770",
    "text": "The foreign policy thrust of the Babangida administration was",
    "options": {
      "A": "economic diplomacy",
      "B": "war against narcotics",
      "C": "military aggression",
      "D": "African interest"
    },
    "answer_url": "https://myschool.ng/classroom/government/27828?exam_type=jamb&type=obj&page=154",
    "correct_answer": "A",
    "explanation": "Theforeign policy thrust of the Babangida administration (1985–1993)in Nigeria waseconomic diplomacy. This approach focused on using Nigeria’s foreign policy to promoteeconomic interests, attractforeign investment, and secureinternational support for economic reforms, especially during the implementation of theStructural Adjustment Programme (SAP).\nEconomic diplomacyinvolved:\nEngaging international financial institutions like theIMFandWorld BankEncouraging foreign partnershipsPromoting exports and economic cooperation",
    "year": "2000"
  },
  {
    "number": "771",
    "text": "One of the principal objectives of the OPEC is to",
    "options": {
      "A": "harmonize the oil policies of member countries",
      "B": "discipline erring oil - producing countries",
      "C": "determine oil prices in the international market",
      "D": "Assist non -oil producing developing states"
    },
    "answer_url": "https://myschool.ng/classroom/government/27829?exam_type=jamb&type=obj&page=155",
    "correct_answer": "A",
    "explanation": "One of the principal objectives of theOrganisation of the Petroleum Exporting Countries (OPEC)is toharmoni and coordinate the oil policiesof its member countries. This helps to ensure stable oil prices and to manage the production and supply of oil in a way that benefits the economies of the member states.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "772",
    "text": "How many countries constitute the Economic Community of West African States?",
    "options": {
      "A": "16",
      "B": "15",
      "C": "13",
      "D": "11"
    },
    "answer_url": "https://myschool.ng/classroom/government/27830?exam_type=jamb&type=obj&page=155",
    "correct_answer": "B",
    "explanation": "As of now, theEconomic Community of West African States (ECOWAS)consists of15member countries. These are:\nBeninBurkina FasoCape VerdeIvory CoastGhanaGuineaGuinea-BissauLiberiaMaliNigerNigeriaSenegalSierra LeoneTogoGambia\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "773",
    "text": "The charter of the United Nations was drawn up in",
    "options": {
      "A": "New York",
      "B": "Washington DC",
      "C": "Los Angeles",
      "D": "San Francisco"
    },
    "answer_url": "https://myschool.ng/classroom/government/27831?exam_type=jamb&type=obj&page=155",
    "correct_answer": "D",
    "explanation": "TheCharter of the United Nationswas drawn up inSan Franciscoin 1945 during the United Nations Conference on International Organisation. Representatives from 50 countries gathered to create the UN's foundational document, which laid out the principles and structure of the organisation.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "774",
    "text": "The two leaders that played the most prominent roles in the formation of the ECOWAS were",
    "options": {
      "A": "Achempong and Jawara",
      "B": "Gowon and Eyadema",
      "C": "Kerekou and Tubman",
      "D": "Kounche and Senghor"
    },
    "answer_url": "https://myschool.ng/classroom/government/27832?exam_type=jamb&type=obj&page=155",
    "correct_answer": "B",
    "explanation": "Nigeria, under the leadership of General Yakubu Gowon and Togo, under President Eyadema, initiated the formation of ECOWAS. It was founded on 28th May, 1975 in Lagos, Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "775",
    "text": "The Secretary General of the OAU is appointed by the",
    "options": {
      "A": "Council upon the recommendation of the Assembly",
      "B": "Council upon the recommendation of the Secretariat",
      "C": "Assembly upon the recommendation of the council",
      "D": "Defence Commission upon the recommendation of the secretariat"
    },
    "answer_url": "https://myschool.ng/classroom/government/27833?exam_type=jamb&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "The Secretary General of the Organization of African Unity (OAU), which has since been replaced by the African Union (AU), was appointed by theAssemblyupon the recommendation of theCouncil. The Assembly is the highest decision-making body of the OAU, and the Council, which consists of foreign ministers or representatives of the member states, would recommend a candidate for the position.\nThere is an explanation video availablebelow.",
    "year": "2000"
  },
  {
    "number": "776",
    "text": "The approval of budgetary and financial matters in the United Nations is the responsibility of the",
    "options": {
      "A": "General Assembly",
      "B": "Security Council",
      "C": "Trusteeship Council",
      "D": "Economic and Social Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/27834?exam_type=jamb&type=obj&page=156",
    "correct_answer": "A",
    "explanation": "The General Assembly approves budgetary and financial matters. It approves the UN's regular budget and determines the financial contributions of each member state.\nThe Security Council deals with matters of international peace and security. The Trusteeship Council was established to oversee the administration of trust territories but has suspended its operations since all trust territories have achieved self-government. The Economic and Social Council (ECOSOC) works on economic and social issues, the final approval of the UN's financial matters is the responsibility of the General Assembly.\nThere is an explanation video availablebelow.",
    "year": "2000"
  }
]