[
  {
    "number": "728",
    "text": "Every human being, according to Sūrah al- Asr is in a state of loss, except the",
    "options": {
      "A": "Quraish tribe",
      "B": "the oppressed people",
      "C": "faithful and righteous",
      "D": "earlier generations"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64520?exam_type=jamb&type=obj&page=146",
    "correct_answer": "C",
    "explanation": "save those who have faith and do righteous deeds, and counsel each other to hold on to truth and counsel each other to be steadfast. This Surah an oath has been sworn by the Time to impress the point that man is in sheer loss and only those people are an exception from the loss who are characterized by four qualities:(1) Faith.(2) Righteous deeds.(3) Exhorting one another to truth.(4) Exhorting one another to patience",
    "year": "2017"
  },
  {
    "number": "729",
    "text": "The translation of the verse above is",
    "options": {
      "A": "'truly, man is to his lord ungrateful",
      "B": "'verily, to thy Lord is the return of all",
      "C": "'And verily the hereafter will be better for thee than present",
      "D": "'truly, he succeeds that purifies"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64521?exam_type=jamb&type=obj&page=146",
    "correct_answer": "B",
    "explanation": "Surah Al-Alaq (96:8) 'Verily, to the Lord is the return of all' .That is, whatever he might have attained in the world, which makes him behave arrogantly and rebelliously, in the end he has to return to your Lord. Then he will realize what fate awaits him in consequence of his such attitude and behavior.",
    "year": "2017"
  },
  {
    "number": "730",
    "text": "The verse that can be recited for protection against evil machinations is",
    "options": {
      "A": "Q. 2:286",
      "B": "Q. 2:285",
      "C": "Q. 2:256",
      "D": "Q. 2:255"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64522?exam_type=jamb&type=obj&page=146",
    "correct_answer": "D",
    "explanation": "Allah, the Ever-Living, the Self-Subsisting by Whom all subsist, there is no god but He. Neither slumber seizes Him, nor sleep; to Him belongs all that is in the heavens and all that is in the earth. Who is there who might intercede with Him save with His leave?He knows what lies before them and what is hidden from them, whereas they cannot attain to anything of His knowledge save what He wills them to attain. His Dominion overspreads the heavens and the earth, and their upholding wearies Him not. He is All-High, All-Glorious. Irrespective of the number of gods or objects of worship set up by ignorant people, the fact remains that godhead in its entirety, belongs exclusively to the Eternal Being, Who is indebted to no one for His existence. In fact, He is not only self-existent, but upon Him rests the entire order of the universe. He alone wields all sovereign authority over His dominion. None shares either His attributes or His power and might, and no one has the same claims against the creatures as He. Hence, if anywhere in the heavens or the earth someone sets up anything or anybody as an object of worship and service (ilah) either instead of or in addition to the One True God this amounts to declaring war on reality.",
    "year": "2017"
  },
  {
    "number": "731",
    "text": "The official compilation of Hadith was facilitated by",
    "options": {
      "A": "Caliph Umar b. al-khattab",
      "B": "Caliph Uthman b. Affan",
      "C": "Caliph Mu'awiyah b. Abi Sufyan",
      "D": "Caliph Umar b. Abdul-Aziz"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64523?exam_type=jamb&type=obj&page=147",
    "correct_answer": "D",
    "explanation": ":\"Umar bin Abdul-Azeez was the one who facilitated the compilation of the Hadith. He was a Umayyad caliph who gave an order to the scholars to collect and compile the traditions.Umar ibn Abd al-Aziz ( Arabic : ﻋﻤﺮ ﺑﻦ ﻋﺒﺪ ﺍﻟﻌﺰﻳﺰ , romanized : ʿUmar ibn ʿAbd al-ʿAzīz ; 2 November 682 - c. 5 February 720), commonly known as Umar II ( ﻋﻤﺮ ﺍﻟﺜﺎﻧﻲ ), was the eighth Umayyad caliph , ruling from 22 September 717 until his death in 720. Umar made various significant contributions and reforms to the society, and he has been described as \"the most pious and devout\" of the Umayyad rulers and was often called the first Mujaddid and the fifth righteous Caliph of Islam.Surrounded with great scholars, he is credited with having ordered the first official collection ofHadiths and encouraged education to everyone. He also sent out emissaries to China and Tibet , inviting their rulers to accept Islam.",
    "year": "2017"
  },
  {
    "number": "732",
    "text": "The science of Asma al-rijal is introduced in order to",
    "options": {
      "A": "Authenticate the chains of Hadith narrators",
      "B": "Confirms the names of Hadith books",
      "C": "Ascertain the number of a hadith",
      "D": "Explain the contents of the sunnah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64524?exam_type=jamb&type=obj&page=147",
    "correct_answer": "A",
    "explanation": "This refers to study of men and women who transmitted hadith reports. This discipline was necessary to develop as an aid to another Hadith discipline called Al-Jarh wa al-Ta`dil .",
    "year": "2017"
  },
  {
    "number": "733",
    "text": "The real name of Imam al-Bukhari is",
    "options": {
      "A": "Musa b. Muhammad",
      "B": "Muhammad b. Ahmad",
      "C": "Isma'il b. Yaqub",
      "D": "Muhammad b. Isma'il"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64525?exam_type=jamb&type=obj&page=147",
    "correct_answer": "D",
    "explanation": "His full name was Muhammad ibn Ismail ibn Ibrahim ibn al-Mughirah ibn Bardizbah al-Bukhari. He was an scholar and teacher, he had a good knowledge about Tirmidhi.",
    "year": "2017"
  },
  {
    "number": "734",
    "text": "A Hadith in which the chain of narration and text are sound is known as",
    "options": {
      "A": "Mash'hur",
      "B": "Maqtu",
      "C": "Mursa",
      "D": "Sahih"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64528?exam_type=jamb&type=obj&page=147",
    "correct_answer": "D",
    "explanation": "Ḥadīth is the Arabic word for things like speech, report, account, narrative. ... Individual hadith are classified by Muslim clerics and jurists into categories such assahih (\"authentic\"), hasan (\"good\") or da'if (\"weak\"). However, different groups and different scholars may classify ahadith differently",
    "year": "2017"
  },
  {
    "number": "735",
    "text": "Which of the following directly applies to Hadith ad-Da'if?",
    "options": {
      "A": "It can be used on certain conditions",
      "B": "Its rejection is due to its weakness all the times",
      "C": "It can be equated with al- Mauduf",
      "D": "It's legal status cannot be ascertained"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64532?exam_type=jamb&type=obj&page=147",
    "correct_answer": "A",
    "explanation": "A da'if hadith is a hadith which does not fulfil the conditions of the sahih or hassan hadith. Hadith A da'if is considered weak, so it is mostly not used, but it can be used on certain conditions, if found useful.",
    "year": "2017"
  },
  {
    "number": "736",
    "text": "The Glorious Qur'ǻn takes precedence over the Hadith in that",
    "options": {
      "A": "it can be used for prayers",
      "B": "the former is recited in prayers",
      "C": "the latter can be invoked against evil",
      "D": "the latter can be invoked against evil"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64537?exam_type=jamb&type=obj&page=148",
    "correct_answer": "C",
    "explanation": "Qu'ran is received during salat, Hadith is not to be used during salat.Qur'an and Hadith are two vital sources of the Islamic legislation. However, Qur'an is considered more important to the Hadith because of the following reasons: Qur'an is a word of the Creator; Allah (SWT) while Hadith is a saying of a man (such as the Prophet (s.a.w.a) or the Imams (AS)).",
    "year": "2017"
  },
  {
    "number": "737",
    "text": "Hadith is important to Muslims because it is",
    "options": {
      "A": "miracle of Islam",
      "B": "the most reliable sayings of the prophet (SAW)",
      "C": "the only linkage between the prophet (SAW) and the Muslim",
      "D": "the means through which the prophet's message is known"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64544?exam_type=jamb&type=obj&page=148",
    "correct_answer": "D",
    "explanation": "Hadith, Arabic Ḥadīth (\"News\" or \"Story\"), also spelled Hadīt, record of the traditions or sayings of the Prophet Muhammad, revered and received as a major source of religious law and moral guidance, second only to the authority of the Qurʾān, the holy book of Islam. Muslims read and study Hadith to be able to live a holy life that pleases Allah following the lessons container in the Hadith.",
    "year": "2017"
  },
  {
    "number": "738",
    "text": "The type of Zakah due at the end of Ramadan fast is known as",
    "options": {
      "A": "Zakah al-harth",
      "B": "Zakah al-fitr",
      "C": "Zakah al-anam"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64547?exam_type=jamb&type=obj&page=148",
    "correct_answer": "B",
    "explanation": "Zakat al-Fitr is a charity taken for the poor a few days before the end of fasting in the Islamic holy month of Ramadan. The Arabic word Fitr means the same as iftar, breaking a fast, and it comes from the same root word as Futoor which means breakfast.",
    "year": "2017"
  },
  {
    "number": "739",
    "text": "The gathering of pilgrims on the 9th day of Dhul Hijjah is known as",
    "options": {
      "A": "Da'al al- 'Arefah",
      "B": "Sajadah 'Arefah",
      "C": "Jabal 'Arefah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64550?exam_type=jamb&type=obj&page=148",
    "correct_answer": "A",
    "explanation": "The Day of Arafat falls on the second day of pilgrimage rituals. At dawn on this day, nearly 2 million Muslim pilgrims will make their way from the town of Mina to a nearby hillside and plain called Mount Arafat and the Plain of Arafat, which is located about 12.5 miles (20 kilometers) from Mecca, the final destination for the pilgrimage.Every Muslim is expected to make the pilgrimage to once during his or her lifetime. During the afternoon, from about noon until sunset, Muslim pilgrims stand in earnest supplication and devotion, praying for God's abundant forgiveness, and listening to Islamic scholars speak on issues of religious and moral importance. Tears are shed readily as those who gather make repentance and seek God's mercy, recite words of prayer and remembrance and gather together as equals before their Lord. The day closes upon the recitation of the evening prayer of Al-Maghrib.For many Muslims, the Day of Arafat proves to be the most memorable part of the hajj pilgrimage, and one that stays with them forever.",
    "year": "2017"
  },
  {
    "number": "740",
    "text": "The categories of women prohibited in marriage due to blood relations are",
    "options": {
      "A": "14",
      "B": "11",
      "C": "10",
      "D": "73"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64556?exam_type=jamb&type=obj&page=148",
    "correct_answer": "C",
    "explanation": "The categories of women prohibited in marriage due to blood relation is '10' according to the Qu'ran.",
    "year": "2017"
  },
  {
    "number": "741",
    "text": "According to Q.4:34, the main right of the husband over his wife is to",
    "options": {
      "A": "Prepare food for him",
      "B": "Have conjugal relation with her",
      "C": "Accept his leadership and obey him",
      "D": "Appreciate him for his favours"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64558?exam_type=jamb&type=obj&page=149",
    "correct_answer": "C",
    "explanation": "So good women are the obedient, guarding in secret that which Allah hath guarded. As for those from whom ye fear rebellion, admonish them and banish them to beds apart, and scourge them. Then if they obey you, seek not a way against them.",
    "year": "2017"
  },
  {
    "number": "742",
    "text": "A marriage is not valid in Islam without",
    "options": {
      "A": "At least two witnesses",
      "B": "Slaughtering an animal",
      "C": "Marriage garment",
      "D": "Deciding the place of residence"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64560?exam_type=jamb&type=obj&page=149",
    "correct_answer": "A",
    "explanation": ": In Islam according to the Qu'ran for a marriage to be valid there must be at least two witness present, one from each side and they must reach a mutual agreement, for the marriage to be valid and blessed. \"For validity of marriage, there must be at least two witnesses\"",
    "year": "2017"
  },
  {
    "number": "743",
    "text": "Which of the following is the correct order of authenticity of three of the six sound collections of the Hadith",
    "options": {
      "A": "Bukhari, Muslim and Tirmidhi",
      "B": "Ibn Majah, Muslim and Nasa'i",
      "C": "Muslim, Nasa'I and Ibn Majah",
      "D": "Abu Dawud, Tirmidhi and Bukhari"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64562?exam_type=jamb&type=obj&page=149",
    "correct_answer": "A",
    "explanation": "'Bukhari, Muslim and Tirmidhi' they are part of the six compilers and collectors of the Hadith. They were great scholars and teachers of the Hadith, filled with great knowledge of the Hadith.",
    "year": "2017"
  },
  {
    "number": "744",
    "text": "The first major written work of a hadith was",
    "options": {
      "A": "Sahih Muslim",
      "B": "Sunan Ibn Majah",
      "C": "Muwata Malik",
      "D": "Musnad Ahmad"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64583?exam_type=jamb&type=obj&page=149",
    "correct_answer": "C",
    "explanation": ":\"The Muwatta of Imam Malik bin Annab (died 179AH) is the first of its kind ..Muwatta Imam Malik. The Muwaṭṭaʾ (Arabic: ﺍﻟﻤﻮﻃﺄ , \"well-trodden path\") or Muwatta Imam Malik ‏( :Arabic ﻣﻮﻃﺄ ﺍﻹﻣﺎﻡ ﻣﺎﻟﻚ ) of Imam Malik (711-795) written in the 8th-century, is the earliest collection of hadith texts comprising the subjects of Islamic law, compiled by the Imam , Malik ibn Anas.",
    "year": "2017"
  },
  {
    "number": "745",
    "text": "The collection of Imam Muslim differs from that of Imam Bukhari in terms of",
    "options": {
      "A": "Interpretation",
      "B": "Authenticity",
      "C": "Repetition",
      "D": "Clasification"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64585?exam_type=jamb&type=obj&page=149",
    "correct_answer": "D",
    "explanation": "Imam Muslim strictly observed many principles of the science of Hadith, which had been slightly ignored by his great teacher Imam Bukhari (may Allah have mercy on both of them). Imam Muslims classified his writing genuinely and overlooked any writing that it account didn't match thoroughly.",
    "year": "2017"
  },
  {
    "number": "746",
    "text": "The collection of Imam Muslim differs from that of Imam Bukhari in terms of",
    "options": {
      "A": "Interpretation",
      "B": "Authenticity",
      "C": "Repetition",
      "D": "Clasification"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64586?exam_type=jamb&type=obj&page=150",
    "correct_answer": "D",
    "explanation": "Imam Muslim strictly observed many principles of the science of Hadith, which had been slightly ignored by his great teacher Imam Bukhari (may Allah have mercy on both of them). Imam Muslims classified his writing genuinely and overlooked any writing that it account didn't match thoroughly.",
    "year": "2017"
  },
  {
    "number": "747",
    "text": "Hadith 11 of an-Nawawi admonishes Muslims to",
    "options": {
      "A": "be certain in some acts of worship",
      "B": "avoid doubtful things",
      "C": "note that doubt and uncertainty are close to each other",
      "D": "always do things clearly"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64588?exam_type=jamb&type=obj&page=150",
    "correct_answer": "B",
    "explanation": "\"...Leave that about which you are in doubt for that about which you are in no doubt\"Al-Hasan bin Ali who said: I committed to memory from the Messenger of Allah, sallallahu alayhi wasallam, (the following words): \"Leave that about which you are in doubt for that about which you are in no doubt.\" [Al-Tirmidhi and al-Nasaii related it, and al-Tirmidhi said: It is a good and genuine Hadith]. Truth will lead to tranquility and falsehood will lead to doubt. We must all act and do what is permissible and proper.",
    "year": "2017"
  },
  {
    "number": "748",
    "text": "According to Hadith 41 of an- Nawawi, the faith of a believer is incomplete until he",
    "options": {
      "A": "Loves for his brother what he love himself",
      "B": "Hate all kinds of evil",
      "C": "Likes good things for his family",
      "D": "Follows what has been revealed unto the prophet(SAW)"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64589?exam_type=jamb&type=obj&page=150",
    "correct_answer": "D",
    "explanation": "\"None of you (truly) believes until his desire or inclination is in accordance with what I have brought or subservient to what I came with.\"\"We should love the Prophet (SAWS) wholeheartedly. So, your wishes would be in accordance with the noble sunnah. Your tendencies would always be towards the Prophet's (SAWS) orders. This is ikhlas\"sincerity\".This hadith has been interpreted this to mean that \"a person is not a Muslim unless he accepts what is in the Qur'aan and Sunnah without grudge and resistance. \"But no, by your Lord, they can have no Faith [Eemaan] until they make you (O Muhammad, Sallallaahu `alayhi wa sallam) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission\"",
    "year": "2017"
  },
  {
    "number": "749",
    "text": "The important of Salah as listed in Q. 29:45 includes",
    "options": {
      "A": "Prohibition of shameful and deeds",
      "C": "Prohibition of cheating in measures",
      "D": "Prohibition of hoarding"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64590?exam_type=jamb&type=obj&page=150",
    "correct_answer": "A",
    "explanation": "\"...Verily, As Salat prevent from al- Fahshai (i.e. great sins...) and Almunkar ... (every kind of evil wicked deed). Q. 29:45. Reciting the Salah helps Muslims in preventing them from committing great sins. Plus keeping them from evil wicked deeds.",
    "year": "2017"
  },
  {
    "number": "750",
    "text": "Which of the following vitiates Salah?",
    "options": {
      "A": "Intoxication",
      "B": "Adornment",
      "C": "Falsehood",
      "D": "yawning"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64591?exam_type=jamb&type=obj&page=150",
    "correct_answer": "A",
    "explanation": "According to Sahih Muslim you shouldn't do following things while praying:a.. Clothes having designs and markings on them are distracting and should be avoided ( refer Sahih Muslim book 4, hadith 1131-1133 )b. The Prophet commanded the believer that while praying 'he should not spit in front of him, for Allah is in front of him when he is engaged in prayer' ( refer Sahih Muslim book 4 , hadith 1116 ). According to another tradition, he 'forbade spitting on the right side or in front, but it is permissible to spit on the left side or under the left foot' ( refer Sahih Muslim book 4 , hadith 1118 ).c. To eat onion or garlic is not harm (forbidden), but Muhammad found their odors 'repugnant' (refer Sahih Muslim book 4 , hadith 1149) and therefore forbade coming to the mosque after eating them, 'for the angels are harmed by the same things as men' ( refer Sahih Muslim book 4 , hadith1145 ) .",
    "year": "2017"
  },
  {
    "number": "751",
    "text": "A major activity in Salah performed through various bodily postures is known as",
    "options": {
      "A": "Raka'at",
      "B": "Takbiratul Ihram",
      "C": "At- tashahud",
      "D": "Sujud ash-shukr"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64595?exam_type=jamb&type=obj&page=151",
    "correct_answer": "A",
    "explanation": "Raka'at \"The various bodily postures performed in Salah as a major activity is called Rakat\". A rakat, or rakʿah, consists of the prescribed movements and words followed by Muslims while offering prayers to Allah. It also refers to a single unit of Islamic prayers.",
    "year": "2017"
  },
  {
    "number": "752",
    "text": "In congregational Salah, a person who comes late is expected to",
    "options": {
      "A": "pronounce the taslim to indicate his arrival",
      "B": "say subhanallah so that the Imam can note his presence",
      "C": "recite the iqama before joining the congregation D. make takbiratul ihram and join the Imam",
      "D": "make takbiratul ihram and join the Imam"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64598?exam_type=jamb&type=obj&page=151",
    "correct_answer": "D",
    "explanation": "The person who joins the congregational prayer after the Imam has done a Rakah or more should first say the opening Takbir Takbirat Al Ihram while standing and then should move, directly to perform the act that the Imam is performing and when the Imam finishes the prayer he (the person who joined the prayer late) should complete what he has missed.",
    "year": "2017"
  },
  {
    "number": "753",
    "text": "Hajj is one of the avenues for Islamic brotherhood and",
    "options": {
      "A": "kindness",
      "B": "Fairness",
      "C": "Trust",
      "D": "Unity"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64599?exam_type=jamb&type=obj&page=151",
    "correct_answer": null,
    "explanation": "\"The Society of the Muslim Brothers ( Arabic :ﺟﻤﺎﻋﺔ ﺍﻹﺧﻮﺍﻥ ﺍﻟﻤﺴﻠﻤﻴﻦ Jamāʿat al-Ikhwān al-Muslimīn ) , better known as the Muslim Brotherhood\" it was founded in 1928. Motto: Islam is the solution.",
    "year": "2017"
  },
  {
    "number": "754",
    "text": "The message in Hadith 34 of an- Nawawi is about",
    "options": {
      "A": "Performing the society for the better",
      "B": "Preventing evil in the society by any means possible",
      "C": "Commanding good among people",
      "D": "Abstaining from evil deeds"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64606?exam_type=jamb&type=obj&page=151",
    "correct_answer": "B",
    "explanation": ": .....\"\"Whosoever of you sees an evil, let him change it with his hand; and if he is not able to do so, then [let him change it] with his tongue; and if he is not able to do so, then with his heart - and that is the weakest of faith.\" The message here is that we should encourage doing good, and doing everything in our power in rebuking bad things.",
    "year": "2017"
  },
  {
    "number": "755",
    "text": "The Hadith above warns Muslims against charity with",
    "options": {
      "A": "useless things",
      "B": "ill-gotten wealth",
      "C": "evil intention",
      "D": "cheap things"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64610?exam_type=jamb&type=obj&page=151",
    "correct_answer": "B",
    "explanation": "\"...Allah the Mighty is good and accepts only that which is good...\"This is the best way in giving charity; Volunteer in a shelter or NGO- Visit an elderly or sick person. ...- Sign up to an aid project. ...-Teach.-Remembrance (dhikr) of Allah.",
    "year": "2017"
  },
  {
    "number": "756",
    "text": "Q. 3:103 enjoins Muslims to",
    "options": {
      "A": "Unite and not be divided",
      "B": "Live in the same place",
      "C": "Speak with one voice politically",
      "D": "Unite for economic progress"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64612?exam_type=jamb&type=obj&page=152",
    "correct_answer": "A",
    "explanation": "Q.3:103 \"Hold fast together to the cable of Allah, and be not divided. Remember the blessing that Allah bestowed upon you: you were once enemies then He brought your hearts together, so that through His blessing you became brothers. You stood on the brink of a pit of fire and He delivered you from it. Thus Allah makes His signs clear to you that you may be guided to the right way.\" The message here enjoins us to be United and surpport each other.",
    "year": "2017"
  },
  {
    "number": "757",
    "text": "Good behavior and modesty in dress in Islam is an essential parts of",
    "options": {
      "A": "Amal",
      "B": "Duty",
      "C": "Iman",
      "D": "beauty"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64614?exam_type=jamb&type=obj&page=152",
    "correct_answer": "A",
    "explanation": "Amal means any action or deed. It can be good or bad. As per Islam the reward or punishment of amal is based on neeyah (intention). ... In Islam, first priority should be given to diplomacy and dialogue.",
    "year": "2017"
  },
  {
    "number": "758",
    "text": "Hadith 18 of an-Nwawai enjoins believers to",
    "options": {
      "A": "Be firm abravend",
      "B": "Be strong-minded and clean",
      "C": "Have piety and work righteously",
      "D": "Acquire knowledge and be polite"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64616?exam_type=jamb&type=obj&page=152",
    "correct_answer": "C",
    "explanation": "On the authority of Abu Dharr, Jundub ibn Junadah, and Abu Abdul Rahman Mu'adh ibn jabal (May Allah be pleased with both of them) from the Messenger of Allah (peace and blessings of Allah be upon him) who said: \"Fear Allah wherever you are. And follow up a bad deed with a good deed and it will wipe it out. And behave towards the people with good behaviour\".",
    "year": "2017"
  },
  {
    "number": "759",
    "text": "Prophet Muhammad (SAW) was described as the seal of all prophets, meaning that he",
    "options": {
      "A": "Was the last or the prophets of Allah",
      "B": "Covered all parts of the world preaching",
      "C": "Is reserved even by the Jews",
      "D": "Was accepted by all Christian"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64621?exam_type=jamb&type=obj&page=152",
    "correct_answer": "A",
    "explanation": "\"Muhammad is not the father of any of your men, but (he is) the Messenger of Allah, and the Seal of the Prophets: and Allah has full knowledge of all things.\"- The Qur'an - Chapter 33 Verse 40",
    "year": "2017"
  },
  {
    "number": "760",
    "text": "The act of taking refuge from the Jinns as mentioned in Q. 72:6 is that",
    "options": {
      "A": "They could harm the believers",
      "B": "People benefit from their protection",
      "C": "They would increase such people in fury",
      "D": "people may turn to be their partners"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64622?exam_type=jamb&type=obj&page=152",
    "correct_answer": "C",
    "explanation": "\"And verily there were men going mankind who took shelter with the males among the Jin but the (the Jin) increase them (the mankind) in sin and transgression\". Q. 72:6.",
    "year": "2017"
  },
  {
    "number": "761",
    "text": "The attributes of Allah as contained in Q.59:23 are",
    "options": {
      "A": "5",
      "B": "6",
      "C": "7",
      "D": "8"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64623?exam_type=jamb&type=obj&page=153",
    "correct_answer": "D",
    "explanation": "\"The attributes of Allah as contained in Q59: 23 are 8. i.e. 1. The king 2. The Holy 3. The one free from all defects 4. The Giver of security 5. The watcher over his creator 6. The Al-Mighty 7. The compeller 8. The supreme.",
    "year": "2017"
  },
  {
    "number": "762",
    "text": "34.′Lā yukallifu Hāhu naf san illā wus'ahā' This quotation is part of",
    "options": {
      "A": "Sūrat al - Alaq",
      "B": "Sūrat al - A 'lā",
      "C": "Ayāt al - kur'ay",
      "D": "Ayāt Amanar - Rasūl"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64624?exam_type=jamb&type=obj&page=153",
    "correct_answer": "D",
    "explanation": "Surah. 2:285:6 \"In the Name of Allah, the Beneficent, the Merciful.The Apostle, and the believers with him,believe in what has been bestowed upon him from on highby his Sustainer: they all believe in God, and His angels,and His revelations, and His apostles,making no distinction between any of His apostles; and they say:\"We have heard, and we pay heed. Grant us Thy forgiveness, O our Sustainer,for with Thee is all journeys' end!\"God does not burden any human being with more than he is well able to bear...\"",
    "year": "2017"
  },
  {
    "number": "763",
    "text": "'Surely, we created man of the best stature, then, we reduced him to the lowest of the low save those who believe and good works' This quotation is from Surat",
    "options": {
      "A": "al Asr",
      "B": "al-Alaq",
      "C": "al-Tīn",
      "D": "al-Bayyinah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64625?exam_type=jamb&type=obj&page=153",
    "correct_answer": "C",
    "explanation": "this verse can be found in Sūrat at-Tīn is the ninety-fifth sura of the Qur'an with 8 ayat.",
    "year": "2017"
  },
  {
    "number": "764",
    "text": "The memorization, recording and compilation of the Qur'ān ensured its",
    "options": {
      "A": "divine nature",
      "B": "divine authority",
      "C": "Authenticity",
      "D": "eternity"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64626?exam_type=jamb&type=obj&page=153",
    "correct_answer": "C",
    "explanation": "Memorizing and recording the Quran, so that it can be the same in the future and there will not be any conflicting words, statement or teaching in the Quran shows it's authenticity and it's originality.",
    "year": "2017"
  },
  {
    "number": "765",
    "text": "The attributes of Allah as contained in Q.59:23 are",
    "options": {
      "A": "8",
      "B": "7",
      "C": "6",
      "D": "5"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64632?exam_type=jamb&type=obj&page=153",
    "correct_answer": "A",
    "explanation": "\"The attributes of Allah as contained in Q59: 23 are 8. i.e. 1. The king 2. The Holy 3. The one free from all defects 4. The Giver of security 5. The watcher over his creator 6. The Al-Mighty 7. The compeller 8. The supreme",
    "year": "2017"
  },
  {
    "number": "766",
    "text": "34.′Lā yukallifu Hāhu naf san illā wus'ahā' This quotation is part of",
    "options": {
      "A": "Sūrat al - A 'lā",
      "B": "Ayāt al - kur'ay",
      "C": "Sūrat al - Alaq",
      "D": "Ayāt Amanar - Rasūl"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64633?exam_type=jamb&type=obj&page=154",
    "correct_answer": "D",
    "explanation": "Surah. 2:285:6 \"In the Name of Allah, the Beneficent, the Merciful.The Apostle, and the believers with him,believe in what has been bestowed upon him from on highby his Sustainer: they all believe in God, and His angels,and His revelations, and His apostles,making no distinction between any of His apostles; and they say:\"We have heard, and we pay heed. Grant us Thy forgiveness, O our Sustainer,for with Thee is all journeys' end!\"God does not burden any human being with more than he is well able to bear...\"",
    "year": "2017"
  },
  {
    "number": "767",
    "text": "The verse that can be recited for protection against evil machinations is",
    "options": {
      "A": "Q. 2:285",
      "B": "Q. 2:286",
      "C": "Q. 2:255",
      "D": "Q. 2:256"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64635?exam_type=jamb&type=obj&page=154",
    "correct_answer": "C",
    "explanation": "Allah, the Ever-Living, the Self-Subsisting by Whom all subsist, there is no god but He. Neither slumber seizes Him, nor sleep; to Him belongs all that is in the heavens and all that is in the earth. Who is there who might intercede with Him save with His leave?He knows what lies before them and what is hidden from them, whereas they cannot attain to anything of His knowledge save what He wills them to attain. His Dominion overspreads the heavens and the earth, and their upholding wearies Him not. He is All-High, All-Glorious. Irrespective of the number of gods or objects of worship set up by ignorant people, the fact remains that godhead in its entirety, belongs exclusively to the Eternal Being, Who is indebted to no one for His existence. In fact, He is not only self-existent, but upon Him rests the entire order of the universe. He alone wields all sovereign authority over His dominion. None shares either His attributes or His power and might, and no one has the same claims against the creatures as He. Hence, if anywhere in the heavens or the earth someone sets up anything or anybody as an object of worship and service (ilah) either instead of or in addition to the One True God this amounts to declaring war on reality.",
    "year": "2017"
  }
]