[
  {
    "number": "1140",
    "text": "The act of selling in a foreign market at a price lower than the cost price is called",
    "options": {
      "A": "Dumping",
      "B": "hedging",
      "C": "fair trading",
      "D": "under sale"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47775?exam_type=jamb&type=obj&page=228",
    "correct_answer": "A",
    "explanation": "Dumping is a term used in the context of international trade. It's when a country or company exports a product at a price that is lower in the foreign importing market than the price in the exporter's domestic market\nExporting goods at prices lower than the home-market prices",
    "year": "2018"
  },
  {
    "number": "1141",
    "text": "Current account holders withdraw money through",
    "options": {
      "A": "Credit card",
      "B": "Cheque",
      "C": "Transfer",
      "D": "Withdrawal form"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47777?exam_type=jamb&type=obj&page=229",
    "correct_answer": "B",
    "explanation": "Current account holder withdraws money using cheque, a cheque is an order to a bank to pay a stated sum from the drawer's account, written on a specially printed form.\nA cheque is a document that orders a bank to pay a specific amount of money from a person's account to the person in whose name the cheque has been issued.",
    "year": "2018"
  },
  {
    "number": "1142",
    "text": "One of the major problems of a sole proprietor is sourcing for",
    "options": {
      "A": "Funds",
      "B": "Labour",
      "C": "Raw materials",
      "D": "Machineries"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47779?exam_type=jamb&type=obj&page=229",
    "correct_answer": "A",
    "explanation": "sole proprietorship is solely financed by the owner and money from family and friends and most times it’s difficult to raise funds\nThe main disadvantages to being a sole proprietorship is raising of funds",
    "year": "2018"
  },
  {
    "number": "1143",
    "text": "Which of the following is a verbal means of communication",
    "options": {
      "A": "Telephone",
      "B": "Express mail",
      "C": "Business reply services",
      "D": "telex"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47782?exam_type=jamb&type=obj&page=229",
    "correct_answer": "A",
    "explanation": "The Verbal Communication is a type of oral communication wherein the message is transmitted through the spoken words.\ntelephone is a verbal means of communication",
    "year": "2018"
  },
  {
    "number": "1144",
    "text": "Trade fairs in Nigeria are organized by",
    "options": {
      "A": "Ministry of commerce and industry",
      "B": "Chambers of commerce",
      "D": "Manufacturer’s Association of Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47783?exam_type=jamb&type=obj&page=229",
    "correct_answer": "B",
    "explanation": "A chamber of commerce (or board of trade) is a form of business network, for example, a local organization of businesses whose goal is to further the interests of the community\nA chamber of commerce is an association or network of business people designed to promote and protect the interests of its members.",
    "year": "2018"
  },
  {
    "number": "1145",
    "text": "Privatization is",
    "options": {
      "A": "Transfer of ownership from individual to government",
      "B": "Transfer of ownership from government to stakeholders",
      "C": "Transfer of ownership from government to individuals",
      "D": "Government taking charge of all businesses"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47784?exam_type=jamb&type=obj&page=229",
    "correct_answer": "C",
    "explanation": "Privatization is the process of transferring an enterprise or industry from the public sector to the private sector. The public sector is the part of the economic system that is run by government agencies\nThe transfer of ownership, property or business from the government to the private sector is termed privatization",
    "year": "2018"
  },
  {
    "number": "1146",
    "text": "In the law of contact, a counter offer operates as",
    "options": {
      "A": "A contact",
      "B": "an acceptance",
      "C": "a rejection",
      "D": "a consensus"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47785?exam_type=jamb&type=obj&page=230",
    "correct_answer": "D",
    "explanation": "A counter offer is an offer made in response to a previous offer by the other party during negotiations for a final contract. Consensus ad idem in contract law means there has been a meeting of the minds of all parties involved and everyone involved has accepted the offered contractual obligations of each party.\nConsensus ad idem in contract law means there has been a meeting of the minds of all parties involved and everyone involved has accepted the offered contractual obligations of each party",
    "year": "2018"
  },
  {
    "number": "1147",
    "text": "What is a Quota?",
    "options": {
      "A": "Tax pad on goods produced within a country",
      "B": "A physical restriction placed on quantity of goods that can be imported",
      "C": "Tax paid on goods produced outside a country",
      "D": "Ban on all imported goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47786?exam_type=jamb&type=obj&page=230",
    "correct_answer": "B",
    "explanation": "An import quota is a type of trade restriction that sets a physical limit on the quantity of a good that can be imported into a country in a given period of time.\nQuota, in international trade, government-imposed limit on the quantity, or in exceptional cases the value, of the goods or services that may be exported or imported over a specified period of time",
    "year": "2018"
  },
  {
    "number": "1148",
    "text": "Which of the following functions is not performed by warehousing?",
    "options": {
      "A": "Stabilization of price",
      "B": "production ahead of demand",
      "C": "creating scarcity of goods",
      "D": "storage of goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47789?exam_type=jamb&type=obj&page=230",
    "correct_answer": "C",
    "explanation": "The function of storage can be carried out successful with the help of warehouses used for storing the goods. By storing the goods throughout the year and releasing them as and when they are needed, warehousing creates time utility.\nwarehousing doesn’t create scarcity of goods instead it makes goods available",
    "year": "2018"
  },
  {
    "number": "1149",
    "text": "One of these is a current asset",
    "options": {
      "A": "Fittings",
      "B": "Machineries",
      "C": "Motor vehicles",
      "D": "stock"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47792?exam_type=jamb&type=obj&page=230",
    "correct_answer": "D",
    "explanation": "Current assets is a balance sheet item that represents the value of all assets that can reasonably be expected to be converted into cash within one year. Example is stock\nstock is a current asset because it can easily be convertible to cash",
    "year": "2018"
  },
  {
    "number": "1150",
    "text": "From which of the following sources can partnership increase their capital?",
    "options": {
      "A": "Sales of shares",
      "B": "Admission of new partners",
      "C": "Discharge of mortgage",
      "D": "Grants from relatives"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47795?exam_type=jamb&type=obj&page=230",
    "correct_answer": "B",
    "explanation": "Partnership. An association of two or more persons engaged in a business enterprise in which the profits and losses are shared proportionally. A partnership can maintain a single partnership capital account for all partners, with a supporting schedule that breaks down the capital account for each partner\nAdmission of new partners is a major source of increasing capital in partnership",
    "year": "2018"
  },
  {
    "number": "1151",
    "text": "One of the disadvantages of rail transport is",
    "options": {
      "A": "It is not flexible",
      "B": "It carries bulky goods",
      "C": "It works at intervals",
      "D": "Cost of transportation is high"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47797?exam_type=jamb&type=obj&page=231",
    "correct_answer": "A",
    "explanation": "disadvantages of rail transportation includes: Lack of Flexibility, Lack of Door to Door Service, Monopoly, Unsuitable for Short Distance and Small Loads, Booking Formalities, No Rural Service, Under-utilized Capacity\nthere is lack of flexibility in rail transportation",
    "year": "2018"
  },
  {
    "number": "1152",
    "text": "The Central Bank Monetary policy instrument by which it buys and sells securities is called",
    "options": {
      "A": "Bank rate",
      "B": "Cash reserve ratio",
      "C": "Open market operation",
      "D": "Bank credit"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47798?exam_type=jamb&type=obj&page=231",
    "correct_answer": "C",
    "explanation": "Open market operations (OMO) refer to the buying and selling of government securities in the open market in order to expand or contract the amount of money in the banking system.\nOpen Market Operations. Definition: The Open Market Operations refers to the sale and purchase of government securities and treasury bills by the central bank of the country with a view to regulate the supply of money in the economy.",
    "year": "2018"
  },
  {
    "number": "1153",
    "text": "The duties paid on goods produced locally is",
    "options": {
      "A": "Ad-valorem duty",
      "B": "excise duty",
      "C": "export duty",
      "D": "quota"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47800?exam_type=jamb&type=obj&page=231",
    "correct_answer": "B",
    "explanation": "An excise duty is a type of tax charged on goods produced within the country\nexcise duty is a percentage levied on manufacture, sale, or use of locally produced goods",
    "year": "2018"
  },
  {
    "number": "1154",
    "text": "A title, symbol, or design that distinguishes a company is called",
    "options": {
      "A": "Brand name",
      "B": "Trademark",
      "C": "copyright",
      "D": "Patent right"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47803?exam_type=jamb&type=obj&page=231",
    "correct_answer": "B",
    "explanation": "A trademark, trade mark, or trade-mark is a recognizable sign, design, or expression which identifies products or services of a particular source from those of others\ntrademark is a symbol, word, or words legally registered or established by use as representing a company or product.",
    "year": "2018"
  },
  {
    "number": "1155",
    "text": "The board of directors of public enterprise is appointed by who?",
    "options": {
      "A": "Employees",
      "B": "management",
      "C": "government",
      "D": "shareholders"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47805?exam_type=jamb&type=obj&page=231",
    "correct_answer": "D",
    "explanation": "In a stock corporation, non-executive directors are voted for by the shareholders and the board is the highest authority in the management of the corporation. The board of directors appoints thechief executive officerof the corporation and sets out the overall strategic direction.",
    "year": "2018"
  },
  {
    "number": "1156",
    "text": "The factors which critically determines the choice of occupation is",
    "options": {
      "A": "Skill",
      "B": "Training",
      "C": "Aptitude",
      "D": "Interest"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47810?exam_type=jamb&type=obj&page=232",
    "correct_answer": "A",
    "explanation": "Occupation is a person's usual or principal work or business, especially as a means of earning a living; any activity in which a person is engaged\nFactors That Determine Types of Occupation are Climate and weather differences. Education, Skill and Training. Natural Resources. Salary and Wages.",
    "year": "2018"
  },
  {
    "number": "1157",
    "text": "Bank overdraft as a short term source of fund is",
    "options": {
      "A": "A current liability",
      "B": "An overdrawn account",
      "C": "Grade to a newly opened account",
      "D": "Repayable after more than a year"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47811?exam_type=jamb&type=obj&page=232",
    "correct_answer": "A",
    "explanation": "An overdraft occurs when money is withdrawn from a bank account and the available balance goes below zero. In this situation the account is said to be \"overdrawn\nCurrent liabilities are a company's debts or obligations that are due within one year or within a normal operating cycle, example is overdraft",
    "year": "2018"
  },
  {
    "number": "1158",
    "text": "Which of the following has power to order withdrawal of a particular food item from circulation?",
    "options": {
      "A": "Food and Drug Department of the Federal Ministry of Health",
      "B": "Federal High Courts in Nigeria",
      "C": "Standard Organization of Nigeria",
      "D": "Local Government Health Inspectors"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47812?exam_type=jamb&type=obj&page=232",
    "correct_answer": "A",
    "explanation": "Functions of the department of Planning Research And Statistics in the Food and drug department include developing plans and budgets and monitoring their implementation, serving as Secretariat to the National Council on Health, conducting health research in collaboration with other departments and agencies, institutions and parastatals.\nfood and drugs department are those that have the power to order withdrawal of a particular food item from circulation",
    "year": "2018"
  },
  {
    "number": "1159",
    "text": "In Nigeria, the ministry in charge of registering trade association is that of",
    "options": {
      "A": "Culture and tourism",
      "B": "Finance",
      "C": "Industries",
      "D": "Commerce"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47813?exam_type=jamb&type=obj&page=232",
    "correct_answer": "D",
    "explanation": "The Ministry of commerce also provides Geological Services for Industrial and Commercial, Registration of Trade Groups and artisans and Export promotion.\nThe ministry of Commerce is in charge of registering trade associations",
    "year": "2018"
  },
  {
    "number": "1160",
    "text": "Why is clear bill of lading called so?",
    "options": {
      "A": "It shows records of damaged goods",
      "B": "It shows no records of damaged goods",
      "C": "It is a clear bill",
      "D": "It signifies no debt is owed"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47814?exam_type=jamb&type=obj&page=232",
    "correct_answer": "B",
    "explanation": "So, a bill of lading is a contract of carriage between a shipper and a carrier, outlining the details of a particular shipment. And a clean bill of lading indicates that the carrier received the goods in good condition, before they actually ship them\na clean bill of lading indicates that the carrier received the goods in good condition, before they actually ship them",
    "year": "2018"
  },
  {
    "number": "1161",
    "text": "Which is the fastest means of transportation?",
    "options": {
      "A": "Water",
      "B": "air",
      "C": "rail",
      "D": "Road"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47815?exam_type=jamb&type=obj&page=233",
    "correct_answer": "B",
    "explanation": "Air transport is an aircraft design for transporting passengers and freight from one location to another in the air using airplanes, jets, rockets helicopters, and drones.\nHigh Speed: It is the fastest means of transport",
    "year": "2018"
  },
  {
    "number": "1162",
    "text": "A company which issues a promissory note in lieu of payment for goods purchased",
    "options": {
      "A": "Is not bound to renew the note before payment",
      "B": "Can return the goods purchased and refuse to pay",
      "C": "Can refuse to pay on due date since it is only a promise",
      "D": "Is bound to redeem the note for cash on due date"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47816?exam_type=jamb&type=obj&page=233",
    "correct_answer": "D",
    "explanation": "A promissory note is a financial instrument that contains a written promise by one party to pay another party a definite sum of money.\nthe company is bound to redeem the cash on the due date",
    "year": "2018"
  },
  {
    "number": "1163",
    "text": "The maximum number of shareholders in a public liability company is",
    "options": {
      "A": "One hundred",
      "B": "Unlimited",
      "C": "Fifty",
      "D": "Twenty"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47817?exam_type=jamb&type=obj&page=233",
    "correct_answer": "B",
    "explanation": "To start a company, a minimum number of 7 members are required and no restrictions on maximum number of members as per the provisions of the Companies Act, 2013.\nmembers are unlimited",
    "year": "2018"
  },
  {
    "number": "1164",
    "text": "The above chart represents the",
    "options": {
      "A": "Marketing mix relationship",
      "B": "Product mix relationship",
      "C": "Advertising mix relationship",
      "D": "Promotion mix relationship"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47818?exam_type=jamb&type=obj&page=233",
    "correct_answer": "A",
    "explanation": "The marketing mix has been defined as the \"set of marketing tools that the firm uses to pursue its organizational goal, there are basically 4 P's of marketing which are Price, Product, Place and Promotion.\nMarketing mix is a combination of factors that can be controlled by a company to influence consumers to purchase its products",
    "year": "2018"
  },
  {
    "number": "1165",
    "text": "Chinyere agreed to make a dress for Halima with September 20, 1995 as the delivery date. If the dress was not ready at that date, Halima could",
    "options": {
      "A": "Seize another gown from Chinyere’s shop",
      "B": "Regard the contract between them as terminated",
      "C": "Sue Chinyere for specific performance",
      "D": "Sue Chinyere for damages"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47819?exam_type=jamb&type=obj&page=233",
    "correct_answer": "B",
    "explanation": "When a breach of contract occurs or is alleged, one or both of the parties may wish to have the contract enforced on its terms, or may try to recover for any financial harm caused by the alleged breach. If a dispute over a contract arises and informal attempts at resolution fail, the most common next step is a lawsuit.\nHalimah can regard the contract as being terminated",
    "year": "2018"
  },
  {
    "number": "1166",
    "text": "Money is generally acceptable for transaction due to",
    "options": {
      "A": "The rule of the law",
      "B": "Its acceptability in the global market",
      "C": "The legal backing",
      "D": "The central bank’s Governor’s signature"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47820?exam_type=jamb&type=obj&page=234",
    "correct_answer": "C",
    "explanation": "Legal tender is any official medium of payment recognized by law that can be used to extinguish a public or private debt, or meet a financial obligation",
    "year": "2018"
  },
  {
    "number": "1167",
    "text": "Which of the following regulates and controls the activities in the Nigeria Stock Exchange",
    "options": {
      "A": "CBN",
      "B": "BPE",
      "D": "NDIC"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47821?exam_type=jamb&type=obj&page=234",
    "correct_answer": "A",
    "explanation": "The Securities and Exchange Commission (SEC) is the main regulatory institution of the Nigerian capital market\nThe Nigerian Stock Exchange (NSE) is privately owned and self-regulating, but the SEC maintains surveillance over it with the mandate of ensuring orderly and equitable dealings in securities, and protecting the market against insider trading abuses.",
    "year": "2018"
  },
  {
    "number": "1168",
    "text": "------------------- is a source of short term capital?",
    "options": {
      "A": "Shares",
      "B": "Overdraft",
      "C": "debenture",
      "D": "leasing"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47822?exam_type=jamb&type=obj&page=234",
    "correct_answer": "B",
    "explanation": "Short term capital is Liquid funds or assets that can be turned into liquid funds within less than a one year period. The amount of short-term capital that a business has available to it typically determines how much it can afford to devote to its operating expenses and will often affect its growth rate.\noverdraft is an example of short term capital",
    "year": "2018"
  },
  {
    "number": "1169",
    "text": "A debenture holder is entitled to",
    "options": {
      "A": "Dividend",
      "B": "Interest",
      "C": "commission",
      "D": "Profit"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47825?exam_type=jamb&type=obj&page=234",
    "correct_answer": "B",
    "explanation": "a debenture is defined as a certificate of agreement of loans which is given under the company's stamp and carries an undertaking that the debenture holder will get a fixed return (fixed on the basis of interest rates) and the principal amount whenever the debenture matures.\nThe interest is calculated on the face value of the debentures. This interest amount is paid periodically, generally yearly or half-yearly. The interest is a charge against the profit of the company.",
    "year": "2018"
  },
  {
    "number": "1170",
    "text": "The two main categories under which marine losses fall into are",
    "options": {
      "A": "Total loss and partial loss",
      "B": "Voyage policy loss and time policy loss",
      "C": "Particular loss and average loss",
      "D": "Actual loss and general loss"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47827?exam_type=jamb&type=obj&page=234",
    "correct_answer": "A",
    "explanation": "the two main types of marine loss are total and partial loss\n2 Types of Marine Losses are Total Loss and Partial Loss",
    "year": "2018"
  },
  {
    "number": "1171",
    "text": "In a public limited liability company, planning is carried out by",
    "options": {
      "A": "Employees",
      "B": "The chairman of the board",
      "C": "Shareholders",
      "D": "Manufacturer’s warehouse"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47829?exam_type=jamb&type=obj&page=235",
    "correct_answer": "C",
    "explanation": "In a publicly traded company, people who choose to buy stock in the company become shareholders and gain partial ownership of the company. Shareholders collectively elect executive board members who make high-level decisions about the direction of the company\nShareholders are the major stake holders of the company",
    "year": "2018"
  },
  {
    "number": "1172",
    "text": "One of the major disadvantages of pipeline transportation is its",
    "options": {
      "A": "High maintenance cost",
      "B": "High cost of construction",
      "C": "Limitation in scope",
      "D": "Vulnerability to climate changes"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47831?exam_type=jamb&type=obj&page=235",
    "correct_answer": "C",
    "explanation": "Pipeline transportation is one of the modes of transport that involves the use of hollow pipes in the transportation of water, crude oil, (petroleum), bio-fuels, and gas. This mode of transportation is safer and cheaper than using tankers or trailers in the transportation of these liquids\nThe major disadvantage with this mode of transportation is that it is not flexible, i.e., it can be used only for a few fixed points.",
    "year": "2018"
  },
  {
    "number": "1173",
    "text": "The sale of second hand securities is done in which market",
    "options": {
      "A": "Building society",
      "B": "cooperative society",
      "C": "stock exchange",
      "D": "capital market"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47833?exam_type=jamb&type=obj&page=235",
    "correct_answer": "C",
    "explanation": "A stock exchange, securities exchange or bourse, is a facility where stock brokers and traders can buy and sell securities, such as shares of stock and bonds and other financial instruments\nStock exchange is an organized and regulated financial market where securities (bonds, notes, shares) are bought and sold",
    "year": "2018"
  },
  {
    "number": "1174",
    "text": "An organization which focuses on consumers satisfaction is practicing",
    "options": {
      "A": "Marketing concepts",
      "B": "Selling concepts",
      "C": "Consumerism",
      "D": "Market segmentation"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47835?exam_type=jamb&type=obj&page=235",
    "correct_answer": "A",
    "explanation": "The marketing concept is a customer-centered “sense and responds” philosophy. The job is not to find the right customers for your product but to find the right products for your customers\nThe marketing concept is the belief that companies must assess the needs of their consumers first and foremost. Based on those needs, companies can make decisions in order to satisfy their consumers' needs, better than their competition",
    "year": "2018"
  },
  {
    "number": "1175",
    "text": "Distribution of goods belongs to",
    "options": {
      "A": "Construction industry",
      "B": "extractive industry",
      "C": "manufacturing industry",
      "D": "commercial industry"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47836?exam_type=jamb&type=obj&page=235",
    "correct_answer": "D",
    "explanation": "Commercial Occupation: This refers to all the people involved in the distribution and exchange of goods produced by the industrial sector. Examples of commercial workers are: bankers, transporters, insurers, traders, etc.",
    "year": "2018"
  },
  {
    "number": "1176",
    "text": "What do we call agreement between two people enforced by law?",
    "options": {
      "A": "Consideration",
      "B": "offer",
      "C": "contract",
      "D": "agreement"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47838?exam_type=jamb&type=obj&page=236",
    "correct_answer": "C",
    "explanation": "Contract is a written or spoken agreement, especially one concerning employment, sales, or tenancy that is intended to be enforceable by law",
    "year": "2018"
  },
  {
    "number": "1177",
    "text": "A disadvantage of personal selling is that it",
    "options": {
      "A": "Increase a company’s number of customers",
      "B": "Reduces a company area of patronage",
      "C": "Increases a company’s operating costs",
      "D": "Decreases a company’s operating costs"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47840?exam_type=jamb&type=obj&page=236",
    "correct_answer": "C",
    "explanation": "Personal selling is also known as face-to-face selling in which one person who is the salesman tries to convince the customer in buying a product. The major disadvantage is increase in the company’s operating cost\nthe cost of operating personal selling is high",
    "year": "2018"
  },
  {
    "number": "1178",
    "text": "One of the principles of insurance is",
    "options": {
      "A": "Proximate cause",
      "B": "Fidelity guarantee",
      "C": "Consequential loss",
      "D": "Surrender value"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47842?exam_type=jamb&type=obj&page=236",
    "correct_answer": "A",
    "explanation": "7 principles of insurance are Nature of contract, Principal of utmost good faith, Principle of Insurable interest, Principle of indemnity, Principal of subrogation, Double insurance and Principle of proximate cause\nProximate cause is a key principle of insurance and is concerned with how the loss or damage actually occurred and whether it is indeed as a result of an insured peril.",
    "year": "2018"
  },
  {
    "number": "1179",
    "text": "When does the buyer in a hire purchase becomes the owner of the goods?",
    "options": {
      "A": "When all installments have been fully paid",
      "B": "After payment of the first installment",
      "C": "Before the payment of the first installment",
      "D": "When half of the purchased price has been paid"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47843?exam_type=jamb&type=obj&page=236",
    "correct_answer": "A",
    "explanation": "Hire purchase is an arrangement for buying expensive consumer goods on credit, where the buyer makes an initial down payment, with the balance being paid in installments plus interest, ownership of the merchandise is not officially transferred to the buyer until all the payments have been made.\nownership is transferred when all installments have been paid",
    "year": "2018"
  },
  {
    "number": "1180",
    "text": "Why will a cheque be dishonored?",
    "options": {
      "A": "Regular signature",
      "B": "high amount of money written on the cheque",
      "C": "insufficient funds",
      "D": "general crossing"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47844?exam_type=jamb&type=obj&page=236",
    "correct_answer": "C",
    "explanation": "What is a Dishonored Cheque? A cheque is said to be honored, if the banks give the amount to the payee. While, if the bank refuses to pay the amount to the payee, the cheque is said to be dishonored. In other words, dishonor of cheque is a condition in which bank refuses to pay the amount of cheque to the payee. The cheque should have been returned or dishonored because of insufficient funds in the drawer's account\ninsufficient funds in the account is a major reason for dishonoring a cheque",
    "year": "2018"
  },
  {
    "number": "1181",
    "text": "The elements in marketing mix that ensures goods are available when and where needed is",
    "options": {
      "A": "Promotion",
      "B": "price",
      "C": "product",
      "D": "place"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47845?exam_type=jamb&type=obj&page=237",
    "correct_answer": "D",
    "explanation": "PLACE In the marketing mix, the process of moving products from the producer to the intended user is called place. In other words, it is how your product is bought and where it is bought. This movement could be through a combination of intermediaries such as distributors, wholesalers and retailers.",
    "year": "2018"
  },
  {
    "number": "1182",
    "text": "Balance of payment consist of ----------- and ---------- items",
    "options": {
      "A": "Credit and loss",
      "B": "visible and non-visible",
      "C": "valid and invalid",
      "D": "income and expenditure"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47846?exam_type=jamb&type=obj&page=237",
    "correct_answer": "B",
    "explanation": "The balance of payments is a summary of all monetary transactions between a country and rest of the world. These transactions are made by individuals, firms and government bodies. Thus the balance of payments includes all external visible and non-visible transactions of a country.",
    "year": "2018"
  },
  {
    "number": "1183",
    "text": "The satisfaction of consumer is best explained by",
    "options": {
      "A": "Product mix",
      "B": "Marketing concept",
      "C": "marketing mix",
      "D": "market segmentation"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47847?exam_type=jamb&type=obj&page=237",
    "correct_answer": "B",
    "explanation": "The marketing concept is the philosophy that firms should analyze the needs of their customers and then make decisions to satisfy those needs, better than the competition.\nThe marketing concept is the strategy that firms implement to satisfy customer’s needs, increase sales, maximize profit and beat the competition.",
    "year": "2018"
  },
  {
    "number": "1184",
    "text": "The internet is a system of telecommunication used for",
    "options": {
      "A": "The internet is a system of telecommunication used for providing a variety of information and communication facilities,",
      "B": "Communicating long distance messages",
      "C": "Sending and receiving text messages",
      "D": "Communicating messages through telegrams"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47848?exam_type=jamb&type=obj&page=237",
    "correct_answer": "A",
    "explanation": "The internet is a globally connected network system that uses TCP/IP to transmit data via various types of media, a global computer network providing a variety of information and communication facilities, consisting of interconnected networks using standardized communication protocols.",
    "year": "2018"
  },
  {
    "number": "1185",
    "text": "Goods and services are made available to consumers through",
    "options": {
      "A": "The advertising agency",
      "B": "Sales promotion",
      "C": "The channel of distribution",
      "D": "The middle men"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47849?exam_type=jamb&type=obj&page=237",
    "correct_answer": "C",
    "explanation": "Channel of distribution is a chain of businesses or intermediaries through which a good or service passes until it reaches the end consumer. It can include wholesalers, retailers, distributors, and even the internet\nA distribution channel is the path through which products pass to get from the producer to the consumer",
    "year": "2018"
  },
  {
    "number": "1186",
    "text": "What’s the first form an applicant must complete before taking an insurance policy?",
    "options": {
      "A": "Cover note",
      "B": "advice note",
      "C": "proposal form",
      "D": "certificate of insurance"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47850?exam_type=jamb&type=obj&page=238",
    "correct_answer": "C",
    "explanation": "A proposal form is the form completed by the proposer when applying for insurance, proposal forms are completed online or over the phone.\nthis is the first form to be filled by intending insured",
    "year": "2018"
  },
  {
    "number": "1187",
    "text": "What is the difference between current assets and current liabilities?",
    "options": {
      "A": "Working capital",
      "B": "nominal capital",
      "C": "capital employed",
      "D": "issued capital"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47851?exam_type=jamb&type=obj&page=238",
    "correct_answer": "A",
    "explanation": "The difference between current asset and current liability is known asworking capitalwhich represents operating liquidity available to business. Working capital is the capital of a business which is used in its day-to-day trading operations,calculated as the current assets - the current liabilities.\nWorking capital, also known as net working capital, is the difference between a company's current assets, like cash, accounts receivable (customers' unpaid bills) and inventories of raw materials and finished goods, and its current liabilities, like accounts payable.",
    "year": "2018"
  },
  {
    "number": "1188",
    "text": "An arrangement by independent firms to share the market of their products on quota basics Is referred to as",
    "options": {
      "A": "Cartel",
      "B": "Syndicate",
      "C": "Trust",
      "D": "Integration"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47852?exam_type=jamb&type=obj&page=238",
    "correct_answer": "A",
    "explanation": "A cartel is a group of apparently independent producers whose goal is to increase their collective profits by means of price fixing, limiting supply, or other restrictive practices",
    "year": "2018"
  },
  {
    "number": "1189",
    "text": "When does production ends?",
    "options": {
      "A": "When the goods are distributed to the wholesalers",
      "B": "When the goods reaches the retailer",
      "C": "When the goods reaches the final consumers",
      "D": "When the goods are fully packaged"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/47853?exam_type=jamb&type=obj&page=238",
    "correct_answer": "C",
    "explanation": "production ends when it reaches the final consumer\nproduction doesn’t end until the goods reaches its final consumers",
    "year": "2018"
  },
  {
    "number": "1190",
    "text": "The main objective of corporate mergers is to?",
    "options": {
      "A": "minimize the effect of taxation",
      "B": "increase financial advantage",
      "C": "facilitate profit maximization",
      "D": "enhance economies of scale"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48215?exam_type=jamb&type=obj&page=238",
    "correct_answer": "D",
    "explanation": "The main benefit of a merger is to gain more market share. This increases a firms monopoly power and enables higher prices (this is why mergers are often regulated by government.)",
    "year": "2018"
  },
  {
    "number": "1191",
    "text": "Rights issue means the?",
    "options": {
      "A": "issue of shares to the directors of a company.",
      "B": "issue of shares by a company only to the founders of the company",
      "C": "right of shareholders to vote on any issue",
      "D": "issue of shares to shareholders on favorable terms"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48234?exam_type=jamb&type=obj&page=239",
    "correct_answer": "B",
    "explanation": "A rights issue or rights offer is a dividend of subscription rights to buy additional securities in a company made to the company's existing security holders. When the rights are for equity securities, such as shares, in a public company, it is a non-dilutive pro rata way to raise capital. Rights issues are typically sold via a prospectus or prospectus supplement.  A rights issue is when a company issues its existing shareholders a right to buy additional shares in the company. The company will offer the shareholder a specific number of shares at a specific price.",
    "year": "2018"
  },
  {
    "number": "1192",
    "text": "The direct authority of a superior over his subordinate is known as?",
    "options": {
      "A": "staff authority",
      "B": "line authority",
      "C": "line and staff authority",
      "D": "lateral authority"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48241?exam_type=jamb&type=obj&page=239",
    "correct_answer": "B",
    "explanation": "The chain of command within an organization that confers the power to order subordinates to perform a task within their job description. Thelineofauthoritywithin a business establishes who is in charge of giving who orders, and it contributes to the efficient attainment of the company's objectives when properly used.",
    "year": "2018"
  },
  {
    "number": "1193",
    "text": "consumer sovereignty means that the consumer is?",
    "options": {
      "A": "a citizen",
      "B": "always independent",
      "C": "always wrong",
      "D": "always right"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48244?exam_type=jamb&type=obj&page=239",
    "correct_answer": "D",
    "explanation": "Consumer sovereignty is an economic concept which refers to the controlling power of consumers, over the custodians of scarce resources, in what final products should be produced. Sometimes the term consumer sovereignty is also used as a hypothesis that the production of goods and services is determined by the consumers' demand. The power of consumers to determine what goods and services are produced. The theory suggests that consumers, not producers, are the best judge of what products benefit them the most.",
    "year": "2018"
  },
  {
    "number": "1194",
    "text": "Taking a new product to a particular part of the country to test the reaction of consumers to the product is referred to as?",
    "options": {
      "A": "sales promotion",
      "B": "sampling",
      "C": "merchandising",
      "D": "advertising"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48245?exam_type=jamb&type=obj&page=239",
    "correct_answer": "A",
    "explanation": "Sales Promotionis one of the elements of the promotional mix.. Sales promotion uses both media and non-media marketing communications for a pre-determined, limited time to increase consumer demand, stimulate market demand or improve product availability. it means taking a product to a particular location in order to ascertain people's reaction to it.",
    "year": "2018"
  },
  {
    "number": "1195",
    "text": "when it becomes necessary to liquidate a company, the first step to be taken is the appointment of a?",
    "options": {
      "A": "a receiver",
      "B": "an auditor",
      "C": "an account",
      "D": "a liquidator"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48249?exam_type=jamb&type=obj&page=239",
    "correct_answer": "D",
    "explanation": "In law, a liquidator is the officer appointed when a company goes into winding-up or liquidation who has responsibility for collecting in all of the assets under such circumstances of the company and settling all claims against the company before putting the company into dissolution.",
    "year": "2018"
  },
  {
    "number": "1196",
    "text": "Transportation, retailing and wholesaling industries rely heavily on?",
    "options": {
      "A": "banking",
      "B": "insurance",
      "C": "manufacturing",
      "D": "railway"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48255?exam_type=jamb&type=obj&page=240",
    "correct_answer": "C",
    "explanation": "In the field of marketing, channels of distribution indicates routes or pathways through which goods and services flow, or more from producers to consumers. A channel of distribution is a path traced in the direct or indirect transfer of ownership of a product as it moves from producers to consumers. The transportation, retailing or wholesaling of goods wouldnt be possible without the manufacturing industry to actually transform this raw materials to consumables.",
    "year": "2018"
  },
  {
    "number": "1197",
    "text": "Erroneous real arrangement of financial figure such as writing N624 as N264 is called?",
    "options": {
      "A": "ommission",
      "B": "commission",
      "C": "transposition",
      "D": "principle"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48258?exam_type=jamb&type=obj&page=240",
    "correct_answer": "C",
    "explanation": "A transposition error is a simple error of data entry that occurs when two digits that are either individual or part of a larger sequence of numbers are accidentally reversed (transposed) when posting a transaction. Although this type of error is often small and unintentional, it can result in huge financial losses in some instances. Atransposition error is simply substituting two sequential digits. For example, the number 78 for 87 or 1346 for 1436.",
    "year": "2018"
  },
  {
    "number": "1198",
    "text": "The business organisation in which shareholders have equal votes is?",
    "options": {
      "A": "sole proprietorship",
      "B": "partnership",
      "C": "cooperative",
      "D": "limited liability company"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48262?exam_type=jamb&type=obj&page=240",
    "correct_answer": "C",
    "explanation": "The business of co-operative society is generally managed by a committee elected by the members at annual general meeting. Since most of the co-operatives operate on a local scale, the meetings of the members are well attended, and this puts the managing committee under a lot of close supervision. ‘One man one vote’ is the basic element of co-operative democracy.\nBut in a co­operative, one member may have 10,000 shares and the other only 1 share, but each would command one vote only and no proxies would be permitted.",
    "year": "2018"
  },
  {
    "number": "1199",
    "text": "Excise duties are paid on goods that are?",
    "options": {
      "A": "imported into the country",
      "B": "manufactured within the country",
      "C": "exported to other countries",
      "D": "kept in bonded warehouse"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48263?exam_type=jamb&type=obj&page=240",
    "correct_answer": "B",
    "explanation": "Excises are often associated with customs duties (which are levied on pre-existing goods when they cross a designated border in a specific direction); customs duties are levied on goods which come into existence – as taxable items – at the border, while excise is levied on goods which came into existence inland . That is to say, An excise duty is a type of tax charged on goods produced within the country (as opposed to customs duties, charged on goods from outside the country).",
    "year": "2018"
  },
  {
    "number": "1200",
    "text": "A person who undertakes any risk in insurance business is known as ?",
    "options": {
      "A": "a broker",
      "B": "an underwriter",
      "C": "an insurer",
      "D": "an actuary"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48264?exam_type=jamb&type=obj&page=240",
    "correct_answer": "B",
    "explanation": "An underwriter is any party that evaluates and assumes another party's risk for a fee, such as a commission, premium, spread or interest. Underwriters operate in many aspects of the financial world, including the mortgage industry, insurance industry, equity markets, and common types of debt securities.",
    "year": "2018"
  },
  {
    "number": "1201",
    "text": "Bank giro is a system where?",
    "options": {
      "A": "commercial banks can give loan to all customers.",
      "B": "a central bank opens accounts for commercial banks",
      "C": "a customer uses a cheque to pay several bills.",
      "D": "a customer closes his account by writing a cheque"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48265?exam_type=jamb&type=obj&page=241",
    "correct_answer": "C",
    "explanation": "Bankgirocredits (BGCs) are used by customers to pay cash or cheques into a bank account. They are commonly found in the form of tear-off strips at the bottom of utility, telephone and other regular bills.",
    "year": "2018"
  },
  {
    "number": "1202",
    "text": "one of the criteria for differenciating consumer markets from industrial ones is the?",
    "options": {
      "A": "type of demand",
      "B": "type of supply",
      "C": "nature of service rendered",
      "D": "price of the goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48266?exam_type=jamb&type=obj&page=241",
    "correct_answer": "C",
    "explanation": "The basic difference is Industrial market (Factor Market) is the market which produces goods and services, with inputs like labour, land, and machinery and these goods are consumed by Consumers in Consumer Market (Product Market) .\nIn Consumer Market , the buyer is always the end consumer of goods where as in Industrial Market , the buyer is not the end user of goods rather the one who will be procesisng it further to make it available for the end users .\nIn a consumer market the consumer uses the product for personal use but in an industrial market the industry uses the products as supplys or/ and to do operations.",
    "year": "2018"
  },
  {
    "number": "1203",
    "text": "The main objective of a trade association can best be described as promoting and protecting ?",
    "options": {
      "A": "the product",
      "B": "common interest",
      "C": "the market",
      "D": "customer's interest"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48267?exam_type=jamb&type=obj&page=241",
    "correct_answer": "B",
    "explanation": "A trade association is a voluntary organization of independent business units in the same branch of industry, which conducts co-operatively activities aimed at improving the welfare of the group, which does not deprive its members of the power to make essential managerial decisions.”Trade associations are formed by businesses which are engaged in same or similar trade. They are organized on a non-profit basis. Trade associations are formed for the protection and promotion of business interests of its members.",
    "year": "2018"
  },
  {
    "number": "1204",
    "text": "When a vendor supplies news papers from house to house and across the streets, the element of marketing mix involved is?",
    "options": {
      "A": "product",
      "B": "price",
      "C": "promoting",
      "D": "place"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48268?exam_type=jamb&type=obj&page=241",
    "correct_answer": "D",
    "explanation": "In the marketing mix, the process of moving products from the producer to the intended user is called place. In other words, it is how your product is bought and where it is bought. This movement could be through a combination of intermediaries such as distributors, wholesalers and retailers. In addition, a newer method is the internet which itself is a marketplace now.",
    "year": "2018"
  },
  {
    "number": "1205",
    "text": "Sudden technological changes can have the effect of making?",
    "options": {
      "A": "a company's management style ineffective",
      "B": "a company's product obsolete",
      "C": "the control mechanism difficult to implement",
      "D": "the motivational factors in the company difficult to monitor"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48269?exam_type=jamb&type=obj&page=241",
    "correct_answer": "B",
    "explanation": "Technological advances that improve production efficiency will shift a supply curve to the right. The cost of production goes down, and consumers will demand more of the product at lower prices. Computers, televisions and photographic equipment are good examples of the effects of technology on a supply curve.Changes in technology can affect the demand for different products or the demand for related products. It can increase the market for a product by increasing the demand for a new product and making an older product obsolete.",
    "year": "2018"
  },
  {
    "number": "1206",
    "text": "One of the factors which critically determines the choice of occupation is?",
    "options": {
      "A": "training",
      "B": "skill",
      "C": "aptitude",
      "D": "interest"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48270?exam_type=jamb&type=obj&page=242",
    "correct_answer": "B",
    "explanation": "Educational or trade/skill level- Certainly one is limited by his/her levels and areas of education or training when choosing a profession or avocation. After detection of one's aptitudes, one should channel him/herself into areas where there is both talent and skill in order to be qualified for a position. Choosing fields that are open to employment are also essential.Area where one lives or wishes to live- Individuals need to be aware of what job markets are available in the location where they live or where they wish to relocate.Demands/Requirements of the job- Individuals will want to consider what the position will entail, such as hours of work, clothing, equipment, travel, supplies, etc that one may have to purchase. Also, individuals may have to use their own vehicle for work assignments.Work Schedule- Some fields, such as recreation and retail and other sales, require a person to work evenings and weekends. If a person has a family, such a schedule could be during the time that others in the family are at home. So, the absence of the member working can affect interpersonal relations.Benefits available- Insurance, 401K, retirement plans, profit sharing, vacations, day care for children are all things to consider when choosing an occupation.",
    "year": "2018"
  },
  {
    "number": "1207",
    "text": "Extractive industries may also be denominated as?",
    "options": {
      "A": "direct industries",
      "B": "service industries",
      "C": "primary industries",
      "D": "indirect industries"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48271?exam_type=jamb&type=obj&page=242",
    "correct_answer": "C",
    "explanation": "Anindustryinvolved in the extraction and collection of natural resources, such as copper and timber, as well as by activities such as farming and fishing. A company in aprimary industrycan also be involved in turning natural resources into products. it involves industry, such as mining, agriculture, or forestry, that is concerned with obtaining or providing natural raw materials for conversion into commodities and products for the consumer.",
    "year": "2018"
  },
  {
    "number": "1208",
    "text": "services which are of absolute monopoly can best be provided by?",
    "options": {
      "A": "private companies",
      "B": "limited liability",
      "C": "public companies",
      "D": "public enterprises"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48272?exam_type=jamb&type=obj&page=242",
    "correct_answer": "D",
    "explanation": "Public enterprise, a business organization wholly or partly owned by the state and controlled through apublicauthority. Somepublic enterprisesare placed underpublicownership because, for social reasons, it is thought the service or product should be provided by a state monopoly.",
    "year": "2018"
  },
  {
    "number": "1209",
    "text": "The share capital value that forms part of the balance sheet total is the?",
    "options": {
      "A": "issued share capital",
      "B": "called-up share capital",
      "C": "authorised share capital",
      "D": "paid-up share capital"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48273?exam_type=jamb&type=obj&page=242",
    "correct_answer": "A",
    "explanation": "issued share capital. The total of a company's shares that are held by shareholders. A company can, at any time, issue new shares up to the full amount of authorized share capital. Also called subscribed capital, or subscribed share capital. It is the face value of the shares that have been issued to the shareholders. Issued share capital and share premium represent the amount invested by the shareholders in the company.",
    "year": "2018"
  },
  {
    "number": "1210",
    "text": "A printer that burns the print image into the photosensitive drum is called?",
    "options": {
      "A": "dot matrix printer",
      "B": "laser printer",
      "C": "daisy wheel printer",
      "D": "thermal printer"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48274?exam_type=jamb&type=obj&page=242",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1211",
    "text": "The insurance principle that requires full disclosure of information on the insured is known as ?",
    "options": {
      "A": "indemnity",
      "B": "caveat emptor",
      "C": "subrogation",
      "D": "uberrimae Fidel"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48275?exam_type=jamb&type=obj&page=243",
    "correct_answer": "D",
    "explanation": "Uberrima fides (sometimes seen in its genitive form uberrimae fidei) is a Latin phrase meaning \"utmost good faith\" (literally, \"most abundant faith\"). It is the name of a legal doctrine which governs insurance contracts. This means that all parties to an insurance contract must deal in good faith, making a full declaration of all material facts in the insurance proposal.",
    "year": "2018"
  },
  {
    "number": "1212",
    "text": "On liquidation of a public limited liability company, the residual owners are the?",
    "options": {
      "A": "creditors",
      "B": "debenture shareholders",
      "C": "preference shareholders",
      "D": "ordinary shareholder"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48276?exam_type=jamb&type=obj&page=243",
    "correct_answer": "D",
    "explanation": "Ordinary share capitalrefers toshares that are issued by a company that allow shareholders voting rights within a corporation. Ordinary shareholders may also receivedividends.  The value of the assets of a company net of its liabilities and any amounts of capital due to holders ofsharesother thanordinary shares(e.g. preferenceshares). If the company were to go into liquidation this would be the equity available for distribution to theordinary shareholders.",
    "year": "2018"
  },
  {
    "number": "1213",
    "text": "A form of money that has gone out of use is ?",
    "options": {
      "A": "commodity money",
      "B": "bank money",
      "C": "paper money",
      "D": "foreign money"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48277?exam_type=jamb&type=obj&page=243",
    "correct_answer": "A",
    "explanation": "Commodity money is money whose value comes from a commodity of which it is made. Commodity money consists of objects that have value in themselves (intrinsic value) as well as value in their use as money.Examples of commodities that have been used as mediums of exchange include gold, silver, copper, salt, peppercorns, tea, large stones (such as Rai stones), decorated belts, shells, alcohol, cigarettes, cannabis, silk, candy, nails, cocoa beans, cowries and barley. These items were sometimes used in a metric of perceived value in conjunction to one another, in various commodity valuation or price system economies.",
    "year": "2018"
  },
  {
    "number": "1214",
    "text": "The three components of staffing are?",
    "options": {
      "A": "recruitment, interview and appointment",
      "B": "recruitment, selection and placement",
      "C": "recruitment, test and placement",
      "D": "recruitment, procurement and appointment"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48278?exam_type=jamb&type=obj&page=243",
    "correct_answer": "B",
    "explanation": "you recruitselect the best from the recruitment andplacement",
    "year": "2018"
  },
  {
    "number": "1215",
    "text": "A chamber of commerce is an association made up of?",
    "options": {
      "A": "merchants",
      "B": "manufacturers",
      "C": "entrepreneurs",
      "D": "importers"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48279?exam_type=jamb&type=obj&page=243",
    "correct_answer": "C",
    "explanation": "A chamber of commerce (or board of trade) is a form of business network, for example, a local organization of businesses whose goal is to further the interests of businesses. Business owners in towns and cities form these local societies to advocate on behalf of the business community.\nAn entrepreneur is a person who sets up a business or businesses, taking on financial risks in the hope of profit.",
    "year": "2018"
  },
  {
    "number": "1216",
    "text": "The first known legislation to protect consumer rights in Nigeria is the?",
    "options": {
      "A": "usury laws",
      "B": "sale of goods act",
      "C": "hire purchase act",
      "D": "food and drugs act"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48280?exam_type=jamb&type=obj&page=244",
    "correct_answer": "B",
    "explanation": "The law governing Sale of Goods in Nigeria is the Sale of Goods Act2 1893 (SOGA), a statute of General Application in force in Nigeria.",
    "year": "2018"
  },
  {
    "number": "1217",
    "text": "A form of ownership which exploits the strenght of one partner to remedy the weakness of the other is the?",
    "options": {
      "A": "joint partnership",
      "B": "cooperative",
      "C": "corporation",
      "D": "joint venture"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48281?exam_type=jamb&type=obj&page=244",
    "correct_answer": "A",
    "explanation": "Ajoint partnershipis a legal structure for a business to use to bring together the abilities, resources, and talents of multiple companies or individuals for a common goal.",
    "year": "2018"
  },
  {
    "number": "1218",
    "text": "i. personal savings. ii. retained earnings iii. accrued taxes. Which of the items constitute internal sources of financing for companies?",
    "options": {
      "A": "i and ii",
      "B": "i and iii",
      "C": "ii and iii",
      "D": "i, ii and iii"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48282?exam_type=jamb&type=obj&page=244",
    "correct_answer": "A",
    "explanation": "Internal sources of finance are ways to use the assets you have to run your business rather than taking out loans or bringing in investors. Instead of borrowing from investors and bankers, your business has the option of using its own money to finance its operations. This approach can save money on interest payments and free your company from being accountable to outside parties. However, it can limit expansion options if you don't have enough cash available to proceed with your plans. the following are some sources of internal funding;\nRetained Profits:The term \"retained profit\" often refers to large companies with shareholders and stock, who decide to recycle profit as working capital rather than paying it out as dividends.sales os assets:If your business has equipment lying around that you don't use, you can raise working capital by selling these items and then funneling the proceeds back into your business as working capital.reducing working capital :Reducing working capital is a strategy based on managing your available money more closely. If you can negotiate shorter billing times with your clients and longer payment terms with your suppliers, you'll receive funds faster and pay them out more slowly, leaving you with more money for day-to-day operations.",
    "year": "2018"
  },
  {
    "number": "1219",
    "text": "A merchant wholesaler is referred to as?",
    "options": {
      "A": "del-credere agent",
      "B": "a broker",
      "C": "rack jobber",
      "D": "a factor"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48283?exam_type=jamb&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "merchant wholesaleris an entity that purchases products, takes title of them, and then sells them (generally to retailers, otherwholesalers, and industrial consumers) Merchant wholesaler is the intermediary between the producer and the retailer.\nA Factor. People who are employed by others to sell or purchase goods, who are entrusted with possession of the goods, and who are compensated by either a commission or a fixed salary. Afactoris a type ofagentwho sells goods owned by another, called a principal.",
    "year": "2018"
  },
  {
    "number": "1220",
    "text": "A pro forma invoice is sent to inform a buyer about the?",
    "options": {
      "A": "quantity of goods",
      "B": "price of goods",
      "C": "designation of goods",
      "D": "quality of goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48284?exam_type=jamb&type=obj&page=244",
    "correct_answer": "B",
    "explanation": "A pro forma invoice is a preliminary bill of sale sent to buyers in advance of a shipment or delivery of goods. The invoice will typically describe the purchased items and other important information such as the shipping weight and transport charges. Pro forma invoices streamline the sales process. Your customer agrees to the price on the pro forma invoice, and then you deliver the goods. There’s no back and forth after you’ve fulfilled your end of the bargain as it’s all agreed up front.",
    "year": "2018"
  },
  {
    "number": "1221",
    "text": "warehousing is a productive function because it increases the?",
    "options": {
      "A": "quantity of goods",
      "B": "utility of goods",
      "C": "quality of goods",
      "D": "price of goods"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48285?exam_type=jamb&type=obj&page=245",
    "correct_answer": "B",
    "explanation": "The efficient management of warehouses helps to optimise the existing production and distribution processes and greatly assist in the goal of cost reduction and service enhancement. Warehousing network plays a major role in the success of the physical distribution of products. A warehouse provides a central location for receiving, storing and distributing products. its needs and importance include;\nquality of goodsregular supplystock of tradeprice stabilityseasonal productsperishable goodscontinous production",
    "year": "2018"
  },
  {
    "number": "1222",
    "text": "The temporary working area of the control processing unit is called the?",
    "options": {
      "A": "CD-ROM",
      "B": "CD-RAM",
      "C": "ROM",
      "D": "RAM"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48286?exam_type=jamb&type=obj&page=245",
    "correct_answer": "D",
    "explanation": "Random-access memory;is a form of computer data storage that stores data and machine code currently being used. Arandom-access memorydevice allows data items to be read or written in almost the same amount of time irrespective of the physical location of data inside thememory. it is a temporal storage device example is the harddisk",
    "year": "2018"
  },
  {
    "number": "1223",
    "text": "one of the obstacles to achieving the objectives of ECOWAS is?",
    "options": {
      "A": "lack of a common currency",
      "B": "colonial linkages",
      "C": "sovereignty of state",
      "D": "language difference"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48287?exam_type=jamb&type=obj&page=245",
    "correct_answer": "D",
    "explanation": "Major problems facing the Economic Community of West African States, orECOWAS, include political instability and poor governance of member states, weakness and lack of diversification of national economies, poor or absent infrastructures for transportation and communications, and an abundance of similar organizations with the sameobjectives.",
    "year": "2018"
  },
  {
    "number": "1224",
    "text": "The agency in Nigeria which ensures that products conform with government quality specifications is the?",
    "options": {
      "A": "standard organisation of Nigeria",
      "B": "Nigeria consumer association",
      "C": "manufacturers association of Nigeria",
      "D": "Nigeria chambers of commerce"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48288?exam_type=jamb&type=obj&page=245",
    "correct_answer": "A",
    "explanation": "TheStandard OrganisationofNigeria(SON) is the sole statutory body that is vested with the responsibility of standardising and regulating the quality of all products inNigeria.",
    "year": "2018"
  },
  {
    "number": "1225",
    "text": "A group of companies is a collection of?",
    "options": {
      "A": "subsidiaries and their holding company",
      "B": "firms",
      "C": "associates and their holding company",
      "D": "industries"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48289?exam_type=jamb&type=obj&page=245",
    "correct_answer": "A",
    "explanation": "An industry is a group of companies that are related based on their primary business activities. it is also a group of manufacturers or businesses that produce a particular kind of goods or services. Workers in the textileindustrydesign, fabricate, and sell cloth.",
    "year": "2018"
  },
  {
    "number": "1226",
    "text": "communication process involves the transmission of a message over a selected channel to the?",
    "options": {
      "A": "encoder",
      "B": "receiver",
      "C": "audience",
      "D": "sender"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48290?exam_type=jamb&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "The process of communication refers to the transmission or passage of information or message from the sender through a selected channel to the receiver overcoming barriers that affect its pace.",
    "year": "2018"
  },
  {
    "number": "1227",
    "text": "The progragramme that makes up the operating system in a computer system is called?",
    "options": {
      "A": "system software",
      "B": "micro program",
      "C": "syntax",
      "D": "system flow-chart"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48291?exam_type=jamb&type=obj&page=246",
    "correct_answer": "A",
    "explanation": "System software is software designed to provide a platform to other software. Examples of system software include operating systems like macOS,",
    "year": "2018"
  },
  {
    "number": "1228",
    "text": "what is the rate of turnover from the table?",
    "options": {
      "A": "3.50 times",
      "B": "3.00 times",
      "C": "2.00 times",
      "D": "2.18"
    },
    "answer_url": "https://myschool.ng/classroom/commerce/48293?exam_type=jamb&type=obj&page=246",
    "correct_answer": "D",
    "explanation": "Definition ofrate of turnover: Number of times a firm sells out its merchandise or finished goods inventory, computed by dividing the total sales revenue in a period by the average inventory in that period.Theinventory turnoverratio is calculated by dividing thecostof goods sold for a period by the averageinventoryfor that period. Averageinventoryis used instead of endinginventorybecause many companies' merchandise fluctuates greatly throughout the year. thus we have;\ncost of goods sold= opening stock + puchases - closing stock5600+ 9700 = 15300 - 4400 = 10900 (to get the average inventory, add the opening and closing stock, then divide it by 2. thus we have);\nopening stock + closing stock / 25600 + 4400=10000 / 2 = 5000\nrate of turn over= 10900/5000 = 2.18 times",
    "year": "2018"
  }
]