[
  {
    "number": "1260",
    "text": "Night-blindness result from a deficiency of",
    "options": {
      "A": "vitamin E",
      "B": "Vitamin A",
      "C": "Vitamin K",
      "D": "Vitamin C"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14456?exam_type=jamb&type=obj&page=252",
    "correct_answer": "B",
    "explanation": "A deficiency in vitamin E can lead to hemolytic anemia and neurological deficits.\nNight blindness can be caused by a deficiency in vitamin A. Vitamin A is essential for the production of pigments in the retina that help you see in low light.\nVitamin K is essential for the production of proteins that help the blood clot, and a deficiency leads to impaired coagulation.\nA major disease caused by severe vitamin C deficiency is scurvy. Scurvy is a disease caused by a severe and prolonged deficiency of vitamin C, leading to symptoms like fatigue, bleeding gums, skin hemorrhages, and impaired wound healing.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1261",
    "text": "The product of excretion common to the mammalian kidney, lung and skin is",
    "options": {
      "A": "mineral salt",
      "B": "carbon (IV) oxide",
      "C": "water",
      "D": "urea"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14457?exam_type=jamb&type=obj&page=253",
    "correct_answer": "C",
    "explanation": "Water is a product of excretion common to the kidneys, lungs, and skin in mammals, although it is excreted in different forms and quantities by each organ.\nKidneys:The kidneys excrete water as a component of urine, along with other waste products like urea and salts.Lungs:The lungs excrete water in the form of water vapour during exhalation, along with carbon dioxide.Skin:The skin excretes water through sweat, which also contains salts and other waste products.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1262",
    "text": "An increase in air pressure in the lungs is due to the",
    "options": {
      "A": "increase in the volume of the thoracic cavity",
      "B": "upward movement of the ribs",
      "C": "relaxation of the diaphragm",
      "D": "contraction of the intercostal musles"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14473?exam_type=jamb&type=obj&page=253",
    "correct_answer": "C",
    "explanation": "As the diaphragm and intercostal muscles relax, the lungs and thoracic tissues recoil, and the volume of the lungs decreases. This causes the pressure within the lungs to increase above that of the atmosphere, causing air to leave the lungs.Muscle contraction and relaxation are not the same; contraction is the tightening or shortening of muscles, while relaxation is the return of the muscle fibers to a low-tension state.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1263",
    "text": "One basic similarity between nervous and endocrine system is that they both",
    "options": {
      "A": "produce widespread effects",
      "B": "transmit very fast impulses",
      "C": "involve the use of chemical substances",
      "D": "produce precise and short-lived effect"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14474?exam_type=jamb&type=obj&page=253",
    "correct_answer": "C",
    "explanation": "The nervous and endocrine systems both play crucial roles in maintaining homeostasis and coordinating bodily functions by using chemical signals to communicate and respond to stimuli, but they differ in their speed and duration of response.\nThe nervous system uses electrical and chemical signals (neurotransmitters) to transmit information rapidly, while the endocrine system uses chemical messengers (hormones) that are released into the bloodstream.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1264",
    "text": "The organ situated in the pericardial cavity of a mammal is the",
    "options": {
      "A": "heart",
      "B": "liver",
      "C": "stomach",
      "D": "spleen"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14478?exam_type=jamb&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "The heart is the organ located in the pericardial cavity of a mammal. The pericardial cavity is a sac that surrounds the heart and contains a small amount of fluid.\nIn mammals, the pericardial cavity, a space surrounding the heart, is located within the mediastinum, a region of the thoracic cavity, specifically between the lungs and sternum.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1265",
    "text": "A unique characteristics of the cervical vertebrae is the presence of",
    "options": {
      "A": "large centrum",
      "B": "long transverse processes",
      "C": "zgapophysis",
      "D": "vertebrartarial canal"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14479?exam_type=jamb&type=obj&page=253",
    "correct_answer": "D",
    "explanation": "The presence of a vertebroarterial canal (also known as the foramen transversarium) in the transverse processes is a unique characteristic of cervical vertebrae, specifically for the passage of the vertebral artery and vein.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1266",
    "text": "In rabbit the chamber of the heart that receives oxygenated blood from the lungs is the",
    "options": {
      "A": "left ventrictle",
      "B": "left auricle",
      "C": "right ventricle",
      "D": "right auricle"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14480?exam_type=jamb&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "In rabbits (and in all mammals), the left auricle (or left atrium) is the chamber of the heart that receives oxygenated blood from the lungs via the pulmonary veins.\nPulmonary Circulation:The lungs are part of the pulmonary circuit, where blood travels from the heart to the lungs to pick up oxygen and then returns to the heart. The pulmonary veins deliver this oxygenated blood to the left atrium, which is the upper chamber on the left side of the heart.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1267",
    "text": "The formation of water in the tissue respiration results from the",
    "options": {
      "A": "breakdown of water molecules",
      "B": "reduction of oxygen by hydrogen",
      "C": "reduction of carbon(IV) oxide",
      "D": "combination of water molecules"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14515?exam_type=jamb&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "The reduction of oxygen (O₂) by hydrogen (H) is indeed responsible for the formation of water (H₂O) in tissue respiration, specifically during the final stage of cellular respiration known as oxidative phosphorylation.\nYou'll recall that in cellular respiration, glucose and other organic molecules are broken down to release energy in the form of ATP (adenosine triphosphate).\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1268",
    "text": "Water is necessary for a germinating seed because it",
    "options": {
      "A": "promotes aerobic respiration",
      "B": "activate the enzymes",
      "C": "wets the soil for proper germination",
      "D": "protects the seed from  desiccation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14517?exam_type=jamb&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "Water is crucial for seed germination as it rehydrates the seed, activates enzymes, and facilitates the mobilization of stored food reserves, enabling the embryo to grow and develop.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1269",
    "text": "Which of the following produces both hormones and enzymes",
    "options": {
      "A": "lleum",
      "B": "pancreas",
      "C": "gall bladder",
      "D": "kidney"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14519?exam_type=jamb&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "The pancreas is a mixed gland, meaning it produces both hormones (like insulin and glucagon) and enzymes (like amylase, lipase, and trypsin).\nExocrine Function (Enzymes):The pancreas's exocrine tissue produces digestive enzymes that are released into the pancreatic duct, which then transports them to the small intestine to aid in digestion. These enzymes include:Amylase:Breaks down carbohydrates.Lipase:Breaks down fats.Protease (trypsin and chymotrypsin):Breaks down proteins.Endocrine Function (Hormones):The pancreas's endocrine tissue, specifically the islets of Langerhans, produces hormones that are released directly into the bloodstream. The main hormones produced are:Insulin:Lowers blood sugar levels.Glucagon:Raises blood sugar levels.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1270",
    "text": "The mammalian vein which starts with and ends in a capillary network is the",
    "options": {
      "A": "pulmonary vein",
      "B": "mesenteric vein",
      "C": "renal vein",
      "D": "hepatic portal vein"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14522?exam_type=jamb&type=obj&page=254",
    "correct_answer": "D",
    "explanation": "The hepatic portal system is a unique circulatory system that connects two systems of capillary beds:one in sinusoidal area of the liver and the other in the wall of the small intestine and spleen. The portal vein receives drainage from the gallbladder, spleen, pancreas, stomach, and small and large intestines. It is the only mammalian vein which starts with and ends in a capillary network.\nThe hepatic portal vein carries blood from organs in your abdomen (belly) to your liver.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1271",
    "text": "In the transverse of a dicot stem, the region lying between the endodermis and the vascular bundle is the",
    "options": {
      "A": "parenchyma",
      "B": "pericycle",
      "C": "phloem",
      "D": "hypodermis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14524?exam_type=jamb&type=obj&page=255",
    "correct_answer": "B",
    "explanation": "In a dicot stem, the region between the endodermis and the vascular bundles is called the pericycle.\nEndodermis:This is the innermost layer of the cortex, a single layer of cells that separates the cortex from the vascular bundles.Pericycle:This is a layer of cells located just inside the endodermis and is the outermost part of the stele (vascular cylinder).Vascular bundles:These are made up of xylem and phloem, which are arranged in a ring in dicot stems.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1272",
    "text": "The two normal types of sex chromosomes are",
    "options": {
      "A": "XXY and  XYY",
      "B": "XX and XYY",
      "C": "XY and XXY",
      "D": "XX and  XY"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14527?exam_type=jamb&type=obj&page=255",
    "correct_answer": "D",
    "explanation": "The two normal types of sex chromosomes are the X chromosome and the Y chromosome.\nFemales typically have two X chromosomes (XX) .Males typically have one X and one Y chromosome (XY) .\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1273",
    "text": "One advantage of variation in a species population is that individuals",
    "options": {
      "A": "with favoured traits become dominant",
      "B": "easily reach their reproductive age",
      "C": "are easily recognised by mates",
      "D": "are better adapted to changes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14528?exam_type=jamb&type=obj&page=255",
    "correct_answer": "D",
    "explanation": "Variation in a species population provides several advantages, including:\n- Increased adaptability to changing environments\n- Greater resistance to diseases and parasites\n- Ability to occupy a wider range of ecological niches\n- Increased potential for evolution and survival\nOption D is correct because individuals with varying traits are more likely to be better adapted to changes in their environment, such as climate change, predators, or competitors.\nThe other options are not directly related to the advantages of variation:\nA. Dominance of individuals with favored traits is a result of natural selection, but not the primary advantage of variation.\nB. Reaching reproductive age is not directly related to variation.\nC. Recognition by mates may be influenced by variation, but it's not the primary advantage.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1274",
    "text": "Mendel's second law of inheritance states that",
    "options": {
      "A": "alleles combine randomly",
      "B": "alleles segregates independently",
      "C": "alleles seperate predictably",
      "D": "chromosomes segregates independently"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14530?exam_type=jamb&type=obj&page=255",
    "correct_answer": "B",
    "explanation": "Mendel's second law of inheritance, also known as the law of independent assortment, states that genes for different traits are inherited independently. This means that the outcome of one gene is not affected by the outcome of another gene.\nMendel's second law of inheritance, also known as the law of independent assortment, deals with the independent segregation of different traits (genes).\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1275",
    "text": "The intensity of competition among animals in a given area will increase with",
    "options": {
      "A": "an increase in the frequency of disease outbreaks",
      "B": "an increase in population size",
      "C": "a decrease in immigration rate",
      "D": "an increase in the emigration rate"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14532?exam_type=jamb&type=obj&page=255",
    "correct_answer": "B",
    "explanation": "An increase in population leads to competition because a larger number of individuals vying for the same limited resources (like food, water, mates, or territory) intensifies the struggle for survival and reproduction.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1276",
    "text": "The part of the mammalian skin involved in temperature regulation is the",
    "options": {
      "A": "sweat gland",
      "B": "hair papilla",
      "C": "hair follicle",
      "D": "sebaceous gland"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14534?exam_type=jamb&type=obj&page=256",
    "correct_answer": "A",
    "explanation": "In mammalian skin, several structures contribute to temperature regulation, includingsweat glands, blood vessels, and hair.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1277",
    "text": "The role of the Golgi complex in an eukaryotic cell is to",
    "options": {
      "A": "conduct irons in and out of the cells",
      "B": "transport genetic materials out of the cell",
      "C": "provide attachment for ribosomal granules",
      "D": "transport organic materials in and out of the cells"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14537?exam_type=jamb&type=obj&page=256",
    "correct_answer": "D",
    "explanation": "The correct answer is option D - Transport organic materials in and out of the cells, but more specifically, to modify, sort, and package proteins and lipids for transport out of the cell.\nThe Golgi complex, also known as the Golgi apparatus, is a complex organelle found in eukaryotic cells. Its main functions include:\n- Modifying proteins and lipids (e.g., glycosylation, phosphorylation)\n- Sorting and packaging proteins and lipids for transport\n- Transporting materials to lysosomes, plasma membrane, or other organelles\nThe other options are not accurate:\nA. Conducting ions in and out of the cell is the role of ion channels and pumps, not the Golgi complex.\nB. Transporting genetic materials out of the cell is not a function of the Golgi complex.\nC. Providing attachment for ribosomal granules is the role of the endoplasmic reticulum (ER), not the Golgi complex.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1278",
    "text": "The dominant phase in the life cycle of a bryophyte is the",
    "options": {
      "A": "gametangium",
      "B": "sporophyte",
      "C": "gametophyte",
      "D": "prothallus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14542?exam_type=jamb&type=obj&page=256",
    "correct_answer": "C",
    "explanation": "The gametophyte is the dominant phase in the life cycle of Bryophytes. This simply means that the majority of the plant's life is spent in the gametophyte stage, while the sporophyte stage is smaller and dependent on the gametophyte for nutrition.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1279",
    "text": "The evidence that supports the advancement of ferns over mosses is derived from",
    "options": {
      "A": "comparative anatomy",
      "B": "molecular records",
      "C": "biochemical similarities",
      "D": "physiological records"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14546?exam_type=jamb&type=obj&page=256",
    "correct_answer": "A",
    "explanation": "The evidence that supports the advancement of ferns over mosses comes from comparative anatomy, which studies the structural similarities and differences between organisms.\nSome important anatomical features that support the advancement of ferns over mosses include:\n- Presence of vascular tissue (xylem and phloem) in ferns, which allows for efficient transport of water and nutrients\n- Development of true leaves (megaphylls) in ferns, which are more complex and efficient than the simple leaves (microphylls) found in mosses\n- Presence of roots in ferns, which provide better anchorage and absorption of nutrients\nThe other options are not directly relevant to the comparison between ferns and mosses:\nB. Molecular records refer to genetic information, which can provide evidence for evolutionary relationships, but is not directly related to anatomical advancements.\nC. Biochemical similarities refer to similarities in chemical composition or metabolic pathways, which can provide evidence for evolutionary relationships, but is not directly related to anatomical advancements.\nD. Physiological records refer to the study of the functions and processes that occur within living organisms, which can provide evidence for evolutionary adaptations, but is not directly related to anatomical advancements.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1280",
    "text": "Which of the following vertebrates has the most simple structured heart?",
    "options": {
      "A": "reptile",
      "B": "fish",
      "C": "mammal",
      "D": "amphibian"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14548?exam_type=jamb&type=obj&page=256",
    "correct_answer": "B",
    "explanation": "The correct answer is option B - Fish\nFishes have a two-chambered heart, which is the simplest structure among vertebrates. This two-chambered heart consists of:\n1. Atrium (single atrium)\n2. Ventricle (single ventricle)\nThis simple heart structure is sufficient for fish because they have:\n- A relatively slow metabolism\n- A simple circulatory system\n- Gills for oxygen exchange, which don't require a complex heart structure\nIn contrast, the other options have more complex heart structures:\nA. Reptiles: three-chambered heart (two atria, one ventricle)\nC. Mammals: four-chambered heart (two atria, two ventricles)\nD. Amphibians: three-chambered heart (two atria, one ventricle)\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1281",
    "text": "One primitive feature of the coelenterates is the possession of",
    "options": {
      "A": "a dorsal mouth",
      "B": "radial symmetry",
      "C": "bilateral symmetry",
      "D": "a false foot"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14549?exam_type=jamb&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "Coelenterates, also known as cnidarians, are a group of animals that include jellyfish, corals, and sea anemones. One of their primitive features is radial symmetry, meaning that their bodies are organized around a central axis, like the spokes of a wheel.\nRadial symmetry is a characteristic of simple, primitive body plans, and it allows coelenterates to respond to stimuli from all directions.\nThe other options are not correct:\nA. Dorsal mouth: Coelenterates have a mouth surrounded by tentacles, but it's not necessarily dorsal (on the back).\nC. Bilateral symmetry: This is a more advanced body plan, where the body can be divided into left and right halves. Coelenterates do not have bilateral symmetry.\nD. A false foot: This is a characteristic of some other animal groups, like mollusks, but not coelenterates.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1282",
    "text": "A characteristic that best exemplifies the evolutionary advancement of mammals over other vertebrates is the",
    "options": {
      "A": "viviparous mode of reproduction",
      "B": "possession of paired limbs",
      "C": "terrestrial mode of life",
      "D": "possession of a heart"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14550?exam_type=jamb&type=obj&page=257",
    "correct_answer": "A",
    "explanation": "One of the key characteristics that distinguish mammals from other vertebrates is their reproductive mode. Mammals are viviparous, meaning they give birth to live young, as opposed to laying eggs like birds or reptiles.\nThis characteristic is a significant evolutionary advancement because it:\n- Allows for more complex and intimate parental care\n- Enables mammals to nurture and protect their young in a more effective way\n- Supports the development of more complex social behaviors and bonding between parents and offspring\nThe other options are not unique to mammals or do not represent a significant evolutionary advancement:\nB. Paired limbs are found in many vertebrates, including birds, reptiles, and amphibians.\nC. Terrestrial mode of life is shared with many other vertebrates, including birds, reptiles, and amphibians.\nD. Possession of a heart is a characteristic shared with all vertebrates.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1283",
    "text": "An organism which exhibits extracellular digestion is",
    "options": {
      "A": "spirogyra",
      "B": "paramecium",
      "C": "amoeba",
      "D": "rhizopus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14554?exam_type=jamb&type=obj&page=257",
    "correct_answer": "D",
    "explanation": "Rhizopus, being a fungus, exhibits extracellular digestion, secreting enzymes onto its food source to break down complex molecules into simpler, absorbable substances.\nRhizopus, as a fungus, is a saprophyte, meaning it obtains nutrients from dead and decaying organic matter. Instead of ingesting food and digesting it internally, fungi like Rhizopus employ extracellular digestion. Rhizopus secretes enzymes, which are enzymes like amylase and cellulase, onto the food substrate (like bread) to break down complex molecules (like starch and cellulose) into simpler, soluble substances.\nThese simpler, soluble molecules are then absorbed into the fungal hyphae (filaments) through the fungal cell walls by diffusion, where they are then utilized for metabolism.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1284",
    "text": "The causative agent of typhoid fever is",
    "options": {
      "A": "salmonella",
      "B": "entamoeba",
      "C": "escherichia",
      "D": "shigella"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14555?exam_type=jamb&type=obj&page=257",
    "correct_answer": "A",
    "explanation": "Typhoid fever is a bacterial infection caused by the bacteria Salmonella Typhi. It is also sometimes called enteric fever. Typhoid fever is caused by the bacterium Salmonella enterica serotype Typhi, often referred to as Salmonella Typhi. It is transmitted through contaminated food or water, or direct contact with an infected person. It can cause symptoms like fever, headache, and abdominal pain, among others. However, it is often treated with antibiotics.\nThe parasitic disease amebiasis, often known as amoebic dysentery, is caused by the protozoan parasite Entamoeba histolytica, and can lead to a range of symptoms, including diarrhea, abdominal pain, and fever.\nE. coli (Escherichia coli) bacteria can cause diarrhea, urinary tract infections (UTIs), and other health problems.\nShigella, a bacteria, primarily causes shigellosis, a diarrheal illness characterized by symptoms like fever, stomach pain, and often bloody diarrhea.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1285",
    "text": "Grasses recover quickly from bush fires in the savanna because of their",
    "options": {
      "A": "perennating organs",
      "B": "rapid growth rate",
      "C": "fibrous roots",
      "D": "succulent stems"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14556?exam_type=jamb&type=obj&page=257",
    "correct_answer": "A",
    "explanation": "Perennation refers to the ability of plants to survive from one growing season to another, and perennating organs are the structures that facilitate this survival.\nA perennating organ is a specialized part of a plant that allows it to survive unfavorable conditions, like drought or cold, and persist for multiple growing seasons, often storing nutrients for future growth.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1286",
    "text": "Climax communities in a biotic succession are usually characterized by",
    "options": {
      "A": "a constant change in the appearance of the communities",
      "B": "different species that are constantly changing",
      "C": "a stable composition of plant and animal species",
      "D": "rapid changes in the plant and animal species"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14557?exam_type=jamb&type=obj&page=258",
    "correct_answer": "C",
    "explanation": "A climax community is a stable, mature ecosystem representing the final stage of ecological succession, characterized by high biodiversity, a balance of species adapted to local conditions, and a relatively constant species composition over time.\nEcological succession involves changes in species composition within a community over time, and the two main types are primary and secondary succession, with primary succession occurring in newly formed or exposed areas and secondary succession occurring in areas previously inhabited but disturbed.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1287",
    "text": "The soil type that contain nutrients which are not readily available for plants is",
    "options": {
      "A": "alluvial",
      "B": "clayey",
      "C": "sandy",
      "D": "loamy"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14559?exam_type=jamb&type=obj&page=258",
    "correct_answer": "B",
    "explanation": "Clayey soil contains nutrients, but they are not readily available for plants because Clay particles have a high cation exchange capacity, which means they hold onto nutrients tightly, making them less available to plants. Also,clayey soils tend to have poor drainage and aeration, which can limit root growth and nutrient uptake.\nIn contrast:\n- Alluvial soils (A) are typically fertile and have readily available nutrients. Also, it is not a type of soil\n- Sandy soils (C) have poor nutrient retention, but nutrients are readily available.\n- Loamy soils (D) have a balanced mix of clay, silt, and sand, making nutrients readily available to plants.\nTherefore, the correct answer is option B - Clayey soil\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1288",
    "text": "A population that doubles in size at constant intervals is an indication of",
    "options": {
      "A": "sigmoid growth",
      "B": "exponential growth",
      "C": "population explosion",
      "D": "rapid growth"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14560?exam_type=jamb&type=obj&page=258",
    "correct_answer": "B",
    "explanation": "Sigmoid growth, also known as S-shaped growth, describes a pattern where population density initially increases slowly, then rapidly (exponentially), and finally slows down and stabilizes as resources become limited, forming an S-shaped curve when plotted over time.\nWhen a population doubles in a consistent timeframe, it strongly suggests exponential growth, meaning the population is increasing at a rate proportional to its current size. Exponential growth occurs when a quantity (like a population) increases by a constant percentage or factor over equal time intervals.\nA population explosion refers to a rapid increase in the number of organisms in a specific area, often exceeding the ability of the environment and economy to sustain them.\nRapid growth\" refers to a situation where a population increases or develops at a very fast rate, often unexpectedly.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1289",
    "text": "Hassan and Hussain are identical twins but Hassan grows taller and fatter from Hussain. This is probably because",
    "options": {
      "A": "Hassan inherits genes for tallness and fatness from the father",
      "B": "They have dissimilar genotypes",
      "C": "Hussain is endowed with genes for shortness and thinness",
      "D": "They are raised in different environment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14566?exam_type=jamb&type=obj&page=258",
    "correct_answer": "D",
    "explanation": "Although, identical twins share the same DNA, subtle differences in their prenatal environment, particularly in placental development and nutrient/oxygen distribution, can lead to variations in growth, resulting in one twin being taller than the other.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1402",
    "text": "The organ through which the embryo receives food, water and oxygen is labelled",
    "options": {
      "A": "III",
      "B": "IV",
      "C": "II",
      "D": "I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14827?exam_type=jamb&type=obj&page=281",
    "correct_answer": "C",
    "explanation": "The organ through which the embryo receives food, water, and oxygen is called the placenta. The placenta is a temporary organ that develops in the uterus during pregnancy, attaching to the uterine wall and providing nutrients and oxygen to the developing fetus through the umbilical cord. It also removes carbon dioxide and other waste products from the foetus.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1403",
    "text": "Mammals are capable of producing hypertonic urine mainly because of re-absorption in the",
    "options": {
      "A": "Bowmans capsule",
      "B": "Urethra",
      "C": "Ureter",
      "D": "Loop of henle"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14838?exam_type=jamb&type=obj&page=281",
    "correct_answer": "D",
    "explanation": "Hypertonic urine is highly concentrated urine with a higher solute concentration than water, formed to conserve water in the body, especially during dehydration.\nMammals are able to produce hypertonic urine due to the unique structure and function of the Loop of Henle in the kidneys:\n- The Loop of Henle has a counter-current multiplier system that allows for the reabsorption of water and ions, concentrating the urine.\n- The descending limb of the Loop of Henle is permeable to water, allowing water to be reabsorbed into the medulla.\n- The ascending limb is impermeable to water, but actively reabsorbs ions, increasing the osmolarity of the medulla.\nThis process enables mammals to produce urine that is more concentrated than the blood, which is essential for conserving water.\nThe correct answer is D - Loop of Henle\nThe other options are not correct:\n- Bowman's capsule (A) is the initial part of the nephron where filtration occurs, but it's not responsible for reabsorption.\n- Urethra (B) is the tube that carries urine out of the body, not involved in urine concentration.\n- Ureter (C) is the tube that carries urine from the kidneys to the bladder, also not involved in urine concentration.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1712",
    "text": "Using the diagram, sexual reproduction is illustrated in",
    "options": {
      "A": "II",
      "B": "I",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37140?exam_type=jamb&type=obj&page=343",
    "correct_answer": "B",
    "explanation": "Paramecia can undergo sexual reproduction, specifically through a process called conjugation, although their primary mode of reproduction is asexual binary fission, where a single cell divides into two identical daughter cells.\nSexual Reproduction (Conjugation):Under certain conditions, like nutrient scarcity, paramecia can engage in sexual reproduction through conjugation. It involves two paramecia temporarily fusing, exchanging genetic material (specifically micronuclear elements), and then separating. This process leads to genetic recombination and nuclear reorganization within the cell, which can increase genetic diversity and potentially help the paramecia adapt to changing environments.  Paramecia also exhibit autogamy, a form of self-fertilization, where two nuclei fuse within the same cell.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1713",
    "text": "Using the diagram, A plant that exhibits the type of reproduction shown in IV is",
    "options": {
      "A": "cola",
      "B": "ginger",
      "C": "bryophyllum",
      "D": "sugar cane"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37141?exam_type=jamb&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "Both Cola and sugar cane undergo artificial vegetative propagation(where part of the plant are cut into portions and planted to produce new plants, called cutting).\nOn the other hand, both Ginger and Bryophyllum plants undergo the Natural vegetative reproduction. However, the difference is while Ginger uses the modified underground stem for its vegetative reproduction, the bryophyllum plant uses its fleshy leaves to produce new individuals.\nConsequently, the correct answer is option  C - bryophyllum\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1714",
    "text": "Using the diagram, the part labelled IV is for",
    "options": {
      "A": "excretion",
      "B": "nourishment",
      "C": "protection",
      "D": "respiration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37142?exam_type=jamb&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "Amniotic fluid, the fluid surrounding the fetus, protects it from injury, maintains a stable temperature, allows for fetal movement and development, and supports the development of the lungs and digestive system.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1715",
    "text": "The diagram represents the structure of",
    "options": {
      "A": "proteins",
      "B": "chromosomes",
      "C": "RNA",
      "D": "DNA"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37146?exam_type=jamb&type=obj&page=343",
    "correct_answer": "D",
    "explanation": "The structure of DNA is a double helix, resembling a twisted ladder, composed of two strands of nucleotides linked by sugar-phosphate backbones, with nitrogenous bases (adenine, thymine, guanine, and cytosine) pairing specifically (A with T, C with G).\nDNA is the long molecule that contains your unique genetic code. A bit like a recipe book, which holds the instructions your cells need to make all the proteins in your body.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1716",
    "text": "In the diagram, the part labelled I represents the",
    "options": {
      "A": "base pairs",
      "B": "ribose sugar",
      "C": "phosphate linkage",
      "D": "deoxyri-bose sugar"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37147?exam_type=jamb&type=obj&page=344",
    "correct_answer": "A",
    "explanation": "The part labelled I are the nitrogenous bases usually held together by hydrogen bonds.\n(See diagram above for reference)\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1717",
    "text": "In the diagram, the change in the length of the neck of the giraffes shown was brought about by",
    "options": {
      "A": "geographical isolation",
      "B": "predation",
      "C": "symbiosis",
      "D": "natural selection"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37148?exam_type=jamb&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "Geographical selection, in the context of evolution, refers to the process where populations of the same species become separated by physical barriers, leading to the development of distinct species over time due to adaptation to different environments.\nPredation is a biological interaction where one organism (the predator) kills and consumes another organism (the prey) for food.\ninteraction between two different organisms living in close physical association, typically to the advantage of both.\nThe change in the length of giraffes' necks is primarily attributed to natural selection, where individuals with slightly longer necks had a survival advantage, allowing them to reach higher food sources and reproduce more successfully, thus passing on their longer neck genes - Charles Darwin\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1718",
    "text": "In the diagram, the variation illustration is",
    "options": {
      "A": "discontinuous",
      "B": "morphological",
      "C": "physiological",
      "D": "biochemical"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37149?exam_type=jamb&type=obj&page=344",
    "correct_answer": "B",
    "explanation": "The elongated neck of a giraffe is a clear example of a morphological adaptation, as it's a physical characteristic that allows them to reach high-up foliage for food and also helps with visual vigilance.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1719",
    "text": "In the diagram, The economic importance of the larva is that it",
    "options": {
      "A": "is eaten by birds",
      "B": "develop into a moth",
      "C": "resembles the plant on which it lives",
      "D": "feeds on the leaves of crops"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37150?exam_type=jamb&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "Larva can have both positive and negative economic impacts, as they can be a vital food source for some while also being agricultural pests that damage crops. Some larva are edible and provide a source of protein and nutrients for humans and animals.\nOn the other hand, larva can consume leaves and other plant parts, potentially damaging crops and reducing yields. In the context of the manner in which the question was asked, the negative economic impact is actually what the examiner intended. Thus, option D is the correct answer.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1720",
    "text": "In the diagram, the type of adaptation shown in the larva is",
    "options": {
      "A": "mimicry",
      "B": "countershading",
      "C": "flash colouration",
      "D": "disruptive colouration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37151?exam_type=jamb&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "The adaptation shown by a larva on plant leaves is most likely disruptive coloration, where the larva's coloration breaks up its outline, making it harder for predators to spot.  Many insects, like butterflies and caterpillars, use disruptive coloration to blend in with leaves, twigs, or other parts of their environment.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1721",
    "text": "In the diagram, The maxillary palp is labelled?",
    "options": {
      "A": "ii",
      "B": "iv",
      "C": "i",
      "D": "iii"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37153?exam_type=jamb&type=obj&page=345",
    "correct_answer": "B",
    "explanation": "The maxillary palp labelled iv:\n- Smallantenna-like sensory appendage emerging from the maxilla.\n- These palpsserve as organs of touch and taste in feeding and in the inspection of potential foods and/or prey.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1722",
    "text": "In the diagram, the structure labelled I is sensitive to",
    "options": {
      "A": "light and touch",
      "B": "chemicals only",
      "C": "light only",
      "D": "chemicals and touch"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37154?exam_type=jamb&type=obj&page=345",
    "correct_answer": "D",
    "explanation": "Insect antennae are sensitive to touch, air movement, heat, vibration (sound), and especially smell or taste.\nInsect antennae are highly sensitive to both touch and chemicals, serving as their primary sensory organs for detecting environmental stimuli like odors, vibrations, and even humidity.",
    "year": "2006"
  },
  {
    "number": "1723",
    "text": "In the diagram, A unique characteristic that distinguishes the class of vertebrates represented from other vertebrates is the presence of",
    "options": {
      "A": "two pair of limbs",
      "B": "scales on the lower legs",
      "C": "a pair of wings",
      "D": "a covering of feathers"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37155?exam_type=jamb&type=obj&page=345",
    "correct_answer": "D",
    "explanation": "The unique feature that distinguishes chickens (and birds in general) from other vertebrates is their covering of feathers. Feathers provide insulation and temperature regulation, Support and protection during flight, Camouflage and display for communication and mating.\nFeathers are a characteristic that sets birds apart from other vertebrates, such as mammals, reptiles, and amphibians.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1724",
    "text": "In the diagram, the structures used for offense and defense are labelled",
    "options": {
      "A": "i and iv",
      "B": "i and ii",
      "C": "ii and iii",
      "D": "iii and iv"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37156?exam_type=jamb&type=obj&page=345",
    "correct_answer": "B",
    "explanation": "Birds use both their beaks as well as their limbs for offense and defense against predators.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1725",
    "text": "In the diagram, Which of the following can be decided from the distribution?",
    "options": {
      "A": "species II is found only in locations where it rains all year round",
      "B": "species III inreases in number as rainfall increases",
      "C": "the distribution of species IV is not dependent on rainfall",
      "D": "species I thrives under conditions of moderate to high rainfall"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37157?exam_type=jamb&type=obj&page=345",
    "correct_answer": "D",
    "explanation": "Species I thrives under conditions of moderate to high rainfall because as rainfall gradually increases, the number of organisms increases as well.\nSpecie II is not only found in locations where it rains all year round because even at point zero where there was no rainfall, the number of the organisms remained at 200/km\\(^2\\).\nSpecies III decreases in number as rainfall increases, which means increase in rainfall does not favour them.\nSpecies IV increases in number gradually as rainfall increases, got to a peak and started decreasing in number again which means its distribution is dependent on rainfall.\nTherefore, the correct option is D.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1726",
    "text": "In the diagram, the species whose distribution is not affected by rainfall is",
    "options": {
      "A": "ii",
      "B": "iv",
      "C": "i",
      "D": "iii"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37158?exam_type=jamb&type=obj&page=346",
    "correct_answer": "A",
    "explanation": "The distribution of Species II is not affected by rainfall because as the rate of rainfall increases, the number of organisms remained constant at 200. Hence, the distribution of species II are not affected by rainfall.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1727",
    "text": "In the diagram, the importance of the association to the fungus is that it obtains",
    "options": {
      "A": "a partner for reproduction",
      "B": "anchorage from the algea",
      "C": "oxygen and carbohydrates from the algae",
      "D": "water and mineral salts from the algae"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37160?exam_type=jamb&type=obj&page=346",
    "correct_answer": "C",
    "explanation": "In the symbiotic relationship between fungal hyphae and algae, fungi benefit from the algae's photosynthetic activity, gaining access to sugars (food) produced by the algae, while the algae are protected and can access nutrients from the fungal hyphae. The algae provides the fungus with carbohydrates (energy) and oxygen, while the fungus provides the algae with water and minerals.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "1728",
    "text": "In the diagram, the association illustrated demonstrates",
    "options": {
      "A": "parasitism",
      "B": "commensalism",
      "C": "saprophytism",
      "D": "mutualism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37161?exam_type=jamb&type=obj&page=346",
    "correct_answer": "D",
    "explanation": "The relationship between fungal hyphae and algal plants in lichens is a mutualistic symbiosis, where both organisms benefit from the interaction. The algae (or cyanobacteria) provide food through photosynthesis, while the fungus offers protection and resources.\nThere is an explanation video availablebelow.",
    "year": "2006"
  },
  {
    "number": "2444",
    "text": "The main purpose of establishing shelter belts in the Sahel region is to",
    "options": {
      "A": "check desert encroachment",
      "B": "provide wood fuel",
      "C": "beautify the region",
      "D": "break the harmattan wind"
    },
    "answer_url": "https://myschool.ng/classroom/biology/72271?exam_type=jamb&type=obj&page=489",
    "correct_answer": "A",
    "explanation": "The correct answer is A - Check desert encroachment.\nThe Sahel region is a transition zone between the Sahara Desert and the savannas to the south, and is vulnerable to desertification.\nShelter belts, also known as windbreaks or green belts, are established in the Sahel region to prevent desertification and sand dune encroachment, reduce soil erosion and degradation,protect crops and livestock from harsh winds and sandstorms, and help maintain soil fertility and biodiversity.\nThe other options are not the primary purpose of establishing shelter belts:\n- Providing wood fuel (B) may be a secondary benefit, but not the main purpose.\n- Beautifying the region (C) is not a primary goal, although shelter belts can have aesthetic benefits.\n- Breaking the harmattan wind (D) is a benefit, but not the main purpose. The harmattan is a dry, dusty wind that blows from the Sahara during the winter months.\nThere is an explanation video availablebelow.",
    "year": "2006"
  }
]