[
  {
    "number": "311",
    "text": "The Nguni people are originally from?",
    "options": {
      "A": "South Africa",
      "B": "Namibia",
      "C": "Mozambique",
      "D": "Botswana"
    },
    "answer_url": "https://myschool.ng/classroom/history/63637?exam_type=jamb&type=obj&page=63",
    "correct_answer": "A",
    "explanation": "Nguni people are a group of closely related Bantu ethnic groups native to South Africa, with off-shoots in neighbouring countries in Southern Africa.",
    "year": "2022"
  },
  {
    "number": "312",
    "text": "Who was the head of the Zulus at the time of the Mfecane war?",
    "options": {
      "A": "Zwide",
      "B": "Shaka",
      "C": "Dingiswayo",
      "D": "Sobhuza"
    },
    "answer_url": "https://myschool.ng/classroom/history/63638?exam_type=jamb&type=obj&page=63",
    "correct_answer": "B",
    "explanation": "The three powerful states that became involved in the Mfecane at the initial stages were the Ndwandwe led by Zwide, the Mthethwa led by Dingiswayo and the Ngwane led by Sobhuza and their expansionist ideas were ultimately crashed by Shaka(king of Zulu)",
    "year": "2022"
  },
  {
    "number": "313",
    "text": "Who introduced indirect rule in Nigeria?",
    "options": {
      "A": "John Beecroft",
      "B": "Bernard Bourdillon",
      "C": "Lord Lugard",
      "D": "King Richard II"
    },
    "answer_url": "https://myschool.ng/classroom/history/63639?exam_type=jamb&type=obj&page=63",
    "correct_answer": "C",
    "explanation": "The system of indirect rule was first introduced in the Northern Nigeria around 1906 by Sir Lord Fredrick Lugard when he was a high commissioner of the protectorate of the Northern Nigeria.",
    "year": "2022"
  },
  {
    "number": "314",
    "text": "The Ekumeku movement started from Anioma which is part of present day ________.",
    "options": {
      "A": "Delta",
      "B": "Enugu",
      "C": "Imo",
      "D": "Anambra"
    },
    "answer_url": "https://myschool.ng/classroom/history/63640?exam_type=jamb&type=obj&page=63",
    "correct_answer": "A",
    "explanation": "When the Royal Niger Company attempted to establish its authority in the Asaba hinterland in the 1880s, the existing town societies in the area provided the foundations of a resistance movement which became known as the Ekumeku.",
    "year": "2022"
  },
  {
    "number": "315",
    "text": "The policy of Association was adopted by the ________.",
    "options": {
      "A": "French",
      "B": "British",
      "C": "Portuguese",
      "D": "Belgians"
    },
    "answer_url": "https://myschool.ng/classroom/history/63642?exam_type=jamb&type=obj&page=63",
    "correct_answer": "A",
    "explanation": "The Policy of Association was the second policy the French Colonial Administration tuned to which recognized and preserved the identity, traditions, institutions, religions, customs, and way of life of the people within the French empire. This policy was emphasized by the French between 1920-1945.",
    "year": "2022"
  },
  {
    "number": "316",
    "text": "The Berlin conference on the partitioning of Africa was held in _______.",
    "options": {
      "A": "1888/1889",
      "B": "1887/1888",
      "C": "1885/1886",
      "D": "1884/1885"
    },
    "answer_url": "https://myschool.ng/classroom/history/63644?exam_type=jamb&type=obj&page=64",
    "correct_answer": "D",
    "explanation": "In 1884 at the request of Portugal, German Chancellor Otto von Bismark called together the major western powers of the world to negotiate questions and end confusion over the control of Africa. The conference lasted until February 26, 1885 – a three month period where colonial powers haggled over geometric boundaries in the interior of the continent, disregarding the cultural and linguistic boundaries already established by the Native Indigenous African population. What ultimately resulted was a hodgepodge of geometric boundaries that divided Africa into fifty irregular countries.",
    "year": "2022"
  },
  {
    "number": "317",
    "text": "The indigenous pre-colonial Nigerian economy consisted of the following except",
    "options": {
      "A": "oil mining",
      "B": "crafts",
      "C": "local industries"
    },
    "answer_url": "https://myschool.ng/classroom/history/63646?exam_type=jamb&type=obj&page=64",
    "correct_answer": "A",
    "explanation": "The indigenous pre-colonial Nigerian economy consisted of agriculture, local industry and crafts, trade and services. It was the basic pre-colonial activity with the pattern of specialization dictated by ecology and culture. crude implements, such as hoes, cutlass, sickles, etc. were used.",
    "year": "2022"
  },
  {
    "number": "318",
    "text": "Which of these system was most popular in the pre-colonial era?",
    "options": {
      "A": "The barter system",
      "B": "The coin system",
      "C": "The paper notes",
      "D": "The digital system"
    },
    "answer_url": "https://myschool.ng/classroom/history/63648?exam_type=jamb&type=obj&page=64",
    "correct_answer": "A",
    "explanation": "The barter system was implemented at that time and the pre-colonial people enjoyed a life filled with imported goods which reflected their fashion and lifestyle.",
    "year": "2022"
  },
  {
    "number": "319",
    "text": "In what year was the peace treaty signed in Yorubaland?",
    "options": {
      "A": "1885",
      "B": "1886",
      "C": "1887",
      "D": "1888"
    },
    "answer_url": "https://myschool.ng/classroom/history/63649?exam_type=jamb&type=obj&page=64",
    "correct_answer": "B",
    "explanation": "IN the thousands of years of the pre-20th Century history of the Yoruba nation, the Yoruba Peace Treaty of September 23 1886 is a unique document of incalculable importance. In modern Yoruba history, it is a foremost document that was deliberately designed to foster unity and peace among all parts of Yoruba land and among the entire Yoruba nation, Black Africa's largest nation and Black Africa's foremost leader in civilization.",
    "year": "2022"
  },
  {
    "number": "320",
    "text": "The longest war in Yoruba land lasted _____ years.",
    "options": {
      "A": "15",
      "B": "14",
      "C": "16",
      "D": "10"
    },
    "answer_url": "https://myschool.ng/classroom/history/63650?exam_type=jamb&type=obj&page=64",
    "correct_answer": "C",
    "explanation": "The Kiriji War, also known as the Ekiti-Parapo War, was a 16-year civil war, which is referred to among the Yorubas as the longest war in the history of wars.",
    "year": "2022"
  },
  {
    "number": "321",
    "text": "Who were the first Europeans travellers to reach Benin?",
    "options": {
      "A": "Germans",
      "B": "French",
      "C": "Portuguese",
      "D": "British"
    },
    "answer_url": "https://myschool.ng/classroom/history/63651?exam_type=jamb&type=obj&page=65",
    "correct_answer": "C",
    "explanation": "The first European travelers to reach Benin were Portuguese explorers under João Afonso de Aveiro in about 1485. A strong mercantile relationship developed, with the Edo trading slaves and tropical products such as ivory, pepper and palm oil for European goods such as manillas and guns.",
    "year": "2022"
  },
  {
    "number": "322",
    "text": "What is the title of the king's mother in Benin kingdom?",
    "options": {
      "A": "Iye",
      "B": "Iyoba",
      "C": "Yeye",
      "D": "Ummi"
    },
    "answer_url": "https://myschool.ng/classroom/history/63653?exam_type=jamb&type=obj&page=65",
    "correct_answer": "B",
    "explanation": "In the Benin kingdom, the iyoba, or mother of the oba (king), occupies an important and historically significant place within Benin's political hierarchy.",
    "year": "2022"
  },
  {
    "number": "323",
    "text": "Who is regarded the father of modern Egypt?",
    "options": {
      "A": "Haile Selaisse",
      "B": "Brutus Ghali Brutus",
      "C": "Senghor Cedric",
      "D": "Mohammad Ali"
    },
    "answer_url": "https://myschool.ng/classroom/history/63654?exam_type=jamb&type=obj&page=65",
    "correct_answer": "D",
    "explanation": "Mohammad Ali is regarded as the father of modern Egypt. He founded the Khedivate of Egypt and Sudan in 1805, capitalizing on the disorder in Egypt that followed the French occupation (1798 to 1801), and his descendants ruled Egypt until the Free Officers' Revolution in 1952.",
    "year": "2022"
  },
  {
    "number": "324",
    "text": "How many geo-political zones are there in Nigeria?",
    "options": {
      "A": "5",
      "B": "6",
      "C": "7",
      "D": "8"
    },
    "answer_url": "https://myschool.ng/classroom/history/63656?exam_type=jamb&type=obj&page=65",
    "correct_answer": "B",
    "explanation": "The states in Nigeria are grouped into six geopolitical zones, the North Central (NC), North East (NE), North West (NW), South West (SW), South East (SE) and South (SS).",
    "year": "2022"
  },
  {
    "number": "325",
    "text": "Who established the Sokoto Caliphate?",
    "options": {
      "A": "Abdullahi Dan Fodio",
      "B": "Ahmadu Bello",
      "C": "Usman Dan Fodio",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63657?exam_type=jamb&type=obj&page=65",
    "correct_answer": "C",
    "explanation": "The Sokoto Caliphate was a West African Empire that became a part of northern Nigeria. It was founded by the charismatic Fulani Islamic scholar and political leader Usman dan Fodio upon his conquer of the Hausa people",
    "year": "2022"
  },
  {
    "number": "326",
    "text": "Which constitution laid the foundation for the establishment of political parties in Nigeria?",
    "options": {
      "A": "The Clifford constitution of 1922",
      "B": "The Richards constitution of 1946",
      "C": "The Macpherson constitution of 1951",
      "D": "The Lyttleton constitution of 1954"
    },
    "answer_url": "https://myschool.ng/classroom/history/63659?exam_type=jamb&type=obj&page=66",
    "correct_answer": "A",
    "explanation": "The Clifford's constitution of 1922 introduced Elective principles which laid the foundation for the establishment of political parties in Nigeria.",
    "year": "2022"
  },
  {
    "number": "327",
    "text": "The _____ conference of 1950 discussed the provisions of the Macpherson's constitution.",
    "options": {
      "A": "London",
      "B": "Ibadan",
      "C": "Lagos",
      "D": "Calabar"
    },
    "answer_url": "https://myschool.ng/classroom/history/63661?exam_type=jamb&type=obj&page=66",
    "correct_answer": "B",
    "explanation": "The Ibadan Conference of 1950 was convened to discuss the provisions of the Macpherson Constitution.",
    "year": "2022"
  },
  {
    "number": "328",
    "text": "In what year was Lagos annexed by the British?",
    "options": {
      "A": "1861",
      "B": "1862",
      "C": "1863",
      "D": "1851"
    },
    "answer_url": "https://myschool.ng/classroom/history/63662?exam_type=jamb&type=obj&page=66",
    "correct_answer": "A",
    "explanation": "Lagos Colony was a British colonial possession centred on the port of Lagos in what is now southern Nigeria. Lagos was annexed on 6 August 1861 under the threat of force by Commander Beddingfield of HMS Prometheus who was accompanied by the Acting British Consul, William McCoskry.",
    "year": "2022"
  },
  {
    "number": "329",
    "text": "What was the first capital of the Kanem-Borno empire?",
    "options": {
      "A": "Birni Ngazargamu",
      "B": "Njimi",
      "C": "Bornu",
      "D": "Birni Gazargamu"
    },
    "answer_url": "https://myschool.ng/classroom/history/63663?exam_type=jamb&type=obj&page=66",
    "correct_answer": "B",
    "explanation": "Kanem-Bornu was probably founded around the mid-9th century, and its first capital was at Njimi, northeast of Lake Chad.",
    "year": "2022"
  },
  {
    "number": "330",
    "text": "After the death of Said bin Sultan in 1856, the Asian section of the empire was ruled by ________.",
    "options": {
      "A": "Majid bin Said",
      "B": "Thuwaini bin Said.",
      "C": "Saif bin Sultan",
      "D": "Sultan bin Ahmad"
    },
    "answer_url": "https://myschool.ng/classroom/history/63665?exam_type=jamb&type=obj&page=66",
    "correct_answer": "B",
    "explanation": "After the death of Said bin Sultan in 1856 the empire was divided between his sons into two sultanates, an African section (Sultanate of Zanzibar) ruled by Majid bin Said and an Asian section (Sultanate of Muscat and Oman) ruled by Thuwaini bin Said.",
    "year": "2022"
  },
  {
    "number": "331",
    "text": "When did the Madhist war begin?",
    "options": {
      "A": "1880",
      "B": "1881",
      "C": "1882",
      "D": "1883"
    },
    "answer_url": "https://myschool.ng/classroom/history/63667?exam_type=jamb&type=obj&page=67",
    "correct_answer": "B",
    "explanation": "The Mahdist War was a war between the Mahdist Sudanese of the religious leader Muhammad Ahmad bin Abd Allah, who had proclaimed himself the \"Mahdi\" of Islam, and the forces of the Khedivate of Egypt, initially, and later the forces of Britain.",
    "year": "2022"
  },
  {
    "number": "332",
    "text": "Nigeria joined UNO as the ___ member.",
    "options": {
      "A": "99th",
      "B": "100th",
      "C": "98th",
      "D": "90th"
    },
    "answer_url": "https://myschool.ng/classroom/history/63669?exam_type=jamb&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "Nigeria became the 99th member of the United Nations General Assembly, eight days after her independence in 1960.",
    "year": "2022"
  },
  {
    "number": "333",
    "text": "Who was the first state president of the republic of South Africa?",
    "options": {
      "A": "Charles Robberts Swart",
      "B": "Theophilus Ebenhaezer Dönges",
      "C": "Nelson Mandela",
      "D": "Thabo Mbeki"
    },
    "answer_url": "https://myschool.ng/classroom/history/63670?exam_type=jamb&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "The Republic of South Africa was proclaimed on 21 May 1961. Charles Robberts Swart, the last Governor-General, was sworn in as the first State President. The title 'State President' was originally used for the head of state of the Boer Republics, and like them, the holder of the office wore a sash with the Republic's coat of arms. He was elected to a seven-year term by the Parliament of South Africa, and was not eligible for re-election.",
    "year": "2022"
  },
  {
    "number": "334",
    "text": "The Trans-Atlantic slave trade was abolished in Britain in what year?",
    "options": {
      "A": "1806",
      "B": "1807",
      "C": "1808",
      "D": "1809"
    },
    "answer_url": "https://myschool.ng/classroom/history/63672?exam_type=jamb&type=obj&page=67",
    "correct_answer": "B",
    "explanation": "Britain finally abolished the trans-Atlantic slave trade in 1807, and the United States implemented its ban a year later in 1808. Despite these legal bans, and subsequent acts to suppress the trade in the United States and elsewhere, the illegal trans-Atlantic slave trade continued into the 1860s.",
    "year": "2022"
  },
  {
    "number": "335",
    "text": "When was the Census crisis in Nigeria?",
    "options": {
      "A": "1962/1963",
      "B": "1964/1965",
      "C": "1965/1966",
      "D": "1968/1969"
    },
    "answer_url": "https://myschool.ng/classroom/history/63673?exam_type=jamb&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "The 1962 population census put the total population of the country at 45 million, out of which the south had 24 million and the north 21 million. This was the first time the population of the south would exceed that of the north. The population count created a big political problem for the Balewa government, which had to cancel it and order a re-count.",
    "year": "2022"
  },
  {
    "number": "336",
    "text": "When did Christianity start in Sierra Leone?",
    "options": {
      "A": "1729",
      "B": "1793",
      "C": "1794",
      "D": "1795"
    },
    "answer_url": "https://myschool.ng/classroom/history/63674?exam_type=jamb&type=obj&page=68",
    "correct_answer": "A",
    "explanation": "Christianity was first introduced in Sierra Leone in 1792, however, Sierra Leone is a predominately Muslim country today. Seventy-eight percent of the population are Muslim, and the country's two largest ethnic groups, the Mende and Temne, are Muslim majority.",
    "year": "2022"
  },
  {
    "number": "337",
    "text": "Islam came to Nigeria in the ______ century.",
    "options": {
      "A": "11th",
      "B": "12th",
      "C": "17th",
      "D": "18th"
    },
    "answer_url": "https://myschool.ng/classroom/history/63675?exam_type=jamb&type=obj&page=68",
    "correct_answer": "A",
    "explanation": "The spread of Islam in Nigeria dates back to the eleventh century when it first appeared in Borno in the northeast of the country. Later Islam emerged in Hausaland in the northwest and its influence was evident in Kano and Katsina.",
    "year": "2022"
  },
  {
    "number": "338",
    "text": "The first school in Nigeria was __________.",
    "options": {
      "A": "CMS grammar school",
      "B": "Yaba higher school",
      "C": "Nursery of Infant Church",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63676?exam_type=jamb&type=obj&page=68",
    "correct_answer": "C",
    "explanation": "The first primary school in Nigeria was founded in 1843 in the town of Badagry. The school was named the Nursery of Infant Church which was later renamed as St. Thomas Anglican Nursery and primary school by Rev. Golmer of the Church Missionary Society (CMS).",
    "year": "2022"
  },
  {
    "number": "339",
    "text": "Nigeria's vice president in the second republic was",
    "options": {
      "A": "Shehu Yar'adua",
      "B": "Tunde Idiagbon",
      "C": "Alex Ekwueme",
      "D": "Mohammed Goni"
    },
    "answer_url": "https://myschool.ng/classroom/history/63677?exam_type=jamb&type=obj&page=68",
    "correct_answer": "C",
    "explanation": "Ekwueme was the first elected Vice President of Nigeria from 1979 to 1983 during the Second Nigerian Republic serving under President Shehu Shagari as a member of the National People's Party (NPN).",
    "year": "2022"
  },
  {
    "number": "340",
    "text": "The economic reforms of Theodore II of Ethiopia involved which of the following?",
    "options": {
      "A": "encouragement of slave trade",
      "B": "improvement of agriculture",
      "C": "reorganization of the fiscal system",
      "D": "revival of external trade"
    },
    "answer_url": "https://myschool.ng/classroom/history/63678?exam_type=jamb&type=obj&page=68",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2022"
  },
  {
    "number": "341",
    "text": "Which of these was not an effect of the Great Trek?",
    "options": {
      "A": "Afrikaners remained politically divided for many years",
      "B": "The Trek resulted in the cultural and economic isolation of the Boers.",
      "C": "The Great Trek led directly to the founding of several autonomous Boer republics",
      "D": "It reduced trade between black and white groups"
    },
    "answer_url": "https://myschool.ng/classroom/history/63679?exam_type=jamb&type=obj&page=69",
    "correct_answer": "D",
    "explanation": "The Great Trek led directly to the founding of several autonomous Boer republics, namely the South African Republic (also known simply as the Transvaal), the Orange Free State, and the Natalia Republic. As a result of the Trek, the Afrikaners remained politically divided for many years. Furthermore, the Trek resulted in the cultural and economic isolation of the Boers. The Great Trek increased the conflicts between the Boers and indigenous tribes, but, on the other hand stimulated trade between black and white groups.",
    "year": "2022"
  },
  {
    "number": "342",
    "text": "Clothe dyeing started in what part of Nigeria?",
    "options": {
      "A": "South-East",
      "B": "South-West",
      "C": "North-East",
      "D": "North-Central"
    },
    "answer_url": "https://myschool.ng/classroom/history/63680?exam_type=jamb&type=obj&page=69",
    "correct_answer": "B",
    "explanation": "Adire textile is a resist-dyed cloth produced and worn primarily by the Yoruba people of southwestern Nigeria.",
    "year": "2022"
  },
  {
    "number": "343",
    "text": "How many states did General Murtala Mohammed create?",
    "options": {
      "A": "5",
      "B": "7",
      "C": "9",
      "D": "11"
    },
    "answer_url": "https://myschool.ng/classroom/history/63681?exam_type=jamb&type=obj&page=69",
    "correct_answer": "B",
    "explanation": "On February 3, 1976, the Military Government of Murtala Muhammed created new states and renamed others, the states he created include: Bauchi, Benue, Borno, Imo, Niger, Ogun, and Ondo. This brought the total number of states in Nigeria to nineteen in 1976.",
    "year": "2022"
  },
  {
    "number": "344",
    "text": "In what year was the Oil River protectorate established?",
    "options": {
      "A": "1885",
      "B": "1886",
      "C": "1887",
      "D": "1888"
    },
    "answer_url": "https://myschool.ng/classroom/history/63683?exam_type=jamb&type=obj&page=69",
    "correct_answer": "A",
    "explanation": "The Oil Rivers Protectorate was established by the British in 1885. It was renamed the Niger Coast Protectorate in 1893 and in 1900 was joined to the Nigerian territories administered by the British government. Its name derives from the palm oil that was the chief product of the area.",
    "year": "2022"
  },
  {
    "number": "345",
    "text": "The Lagos colony and the Southern Protectorate was almagamated in _____.",
    "options": {
      "A": "1905",
      "B": "1906",
      "C": "1907",
      "D": "1908"
    },
    "answer_url": "https://myschool.ng/classroom/history/63684?exam_type=jamb&type=obj&page=69",
    "correct_answer": "B",
    "explanation": "The protectorate was incorporated into the new Southern Nigeria Protectorate in February 1906, and Lagos became the capital of the Protectorate of Nigeria.",
    "year": "2022"
  },
  {
    "number": "346",
    "text": "Who was known as the Napoleon of West Africa?",
    "options": {
      "A": "Cedric Senghor",
      "B": "Mohammad Ali",
      "C": "Samori Toure",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63685?exam_type=jamb&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "Described as African Napoleon, Samori Toure built a Muslim empire fighting off the French colonisation of West Africa in the 19th Century.",
    "year": "2022"
  },
  {
    "number": "347",
    "text": "What are the Kingmakers in Oyo called?",
    "options": {
      "A": "Ogoni",
      "B": "Iwarefa",
      "C": "Eunuchs",
      "D": "Oyomesi"
    },
    "answer_url": "https://myschool.ng/classroom/history/63686?exam_type=jamb&type=obj&page=70",
    "correct_answer": "D",
    "explanation": "The Oyomesi were the seven hereditary kingmakers in the empire headed by the Bashorun. Their duty was to install a new Alafin when the ruling one dies or to remove the Alafin. They also assisted the Alafin in the administration of the empire.",
    "year": "2022"
  },
  {
    "number": "348",
    "text": "Who brought Christianity to Liberia?",
    "options": {
      "A": "Missionaries",
      "B": "British Consuls",
      "C": "Freed American slaves",
      "D": "Freed British slaves"
    },
    "answer_url": "https://myschool.ng/classroom/history/63687?exam_type=jamb&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "Christianity reached Liberia in the 19th century with the arrival of freed slaves from the United States. Missionaries of various Protestant denominations started arriving in the 1820s, eventually forming what became one of the highest per capita missionary populations in the world.",
    "year": "2022"
  },
  {
    "number": "349",
    "text": "Who is the father of nationalism in Nigeria?",
    "options": {
      "A": "Obafemi Awolowo",
      "B": "Nnamdi Azikiwe",
      "C": "Hebert Macaulay",
      "D": "Ahmadu Bello"
    },
    "answer_url": "https://myschool.ng/classroom/history/63688?exam_type=jamb&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "Nigerian nationalism is territorial nationalism and emphasizes a cultural connection of the people to the land, particularly the Niger and the Benue Rivers. It first emerged in the 1920s under the influence of Herbert Macaulay, who is considered to be the founder of Nigerian nationalism.",
    "year": "2022"
  },
  {
    "number": "350",
    "text": "In what year did Britain invade Egypt?",
    "options": {
      "A": "1882",
      "B": "1884",
      "C": "1886",
      "D": "1888"
    },
    "answer_url": "https://myschool.ng/classroom/history/63689?exam_type=jamb&type=obj&page=70",
    "correct_answer": "A",
    "explanation": "The British conquest of Egypt (1882), also known as Anglo-Egyptian War occurred in 1882 between Egyptian and Sudanese forces under Ahmed 'Urabi and the United Kingdom. It ended a nationalist uprising against the Khedive Tewfik Pasha. It established firm British influence over Egypt at the expense of the Egyptians, the French, and the Ottoman Empire, whose already weak authority became nominal.",
    "year": "2022"
  },
  {
    "number": "391",
    "text": "What is the king of the Nupe called?",
    "options": {
      "A": "Oba of Nupe",
      "B": "Etsu Nupe",
      "C": "King of Nupe",
      "D": "Head of Nupe"
    },
    "answer_url": "https://myschool.ng/classroom/history/63759?exam_type=jamb&type=obj&page=79",
    "correct_answer": "B",
    "explanation": "Etsu Nupe means King of Nupe",
    "year": "2022"
  },
  {
    "number": "392",
    "text": "Who founded Nupe?",
    "options": {
      "A": "Tapa",
      "B": "Idah",
      "C": "Tsoede",
      "D": "Oduduwa"
    },
    "answer_url": "https://myschool.ng/classroom/history/63761?exam_type=jamb&type=obj&page=79",
    "correct_answer": "C",
    "explanation": "The Nupe kingdom was founded by Tsoede, alias Edegi who was born in 1465. The early Nupe history recognised Tsoede and his fundamental contributions to the building of Nupe dynasty.",
    "year": "2022"
  },
  {
    "number": "393",
    "text": "The Nigerian civil war lasted _____ months.",
    "options": {
      "A": "20",
      "B": "18",
      "C": "30",
      "D": "28"
    },
    "answer_url": "https://myschool.ng/classroom/history/63762?exam_type=jamb&type=obj&page=79",
    "correct_answer": "C",
    "explanation": "The civil war lasted from 6 July 1967 to 15 January 1970 (2 years, 6 months/ 30 months)",
    "year": "2022"
  },
  {
    "number": "394",
    "text": "What country was the first to be introduced to Christianity in West Africa?",
    "options": {
      "A": "Sierra Leone",
      "B": "Liberia",
      "C": "Nigeria",
      "D": "Ghana"
    },
    "answer_url": "https://myschool.ng/classroom/history/63763?exam_type=jamb&type=obj&page=79",
    "correct_answer": "A",
    "explanation": "Christian evangelism first took root in Western Africa when Methodists and Anglicans settled in Sierra Leone in 1804 to evangelize freed slaves returned to that British colony.",
    "year": "2022"
  },
  {
    "number": "395",
    "text": "The Nok culture was known for",
    "options": {
      "A": "terracotta sculptures",
      "B": "water painting",
      "C": "fishing",
      "D": "dancing"
    },
    "answer_url": "https://myschool.ng/classroom/history/63764?exam_type=jamb&type=obj&page=79",
    "correct_answer": "A",
    "explanation": "Nok culture is known for its unique terracotta sculptures and its early iron working. In Nigeria in 1943, a visitor came to archaeologist Bernard Fagg and drew his attention to some unique-looking artifacts, which Fagg and his colleagues eventually determined belonged to a then-unknown culture now known as the Nok.",
    "year": "2022"
  },
  {
    "number": "396",
    "text": "General Muhammadu Buhari regime was overthrown by",
    "options": {
      "A": "Gen. Ibrahim Babangida",
      "B": "Buka Suka Dimka",
      "C": "Gen. Sani Abacha",
      "D": "Gen. Olusegun Obasanjo"
    },
    "answer_url": "https://myschool.ng/classroom/history/63765?exam_type=jamb&type=obj&page=80",
    "correct_answer": "A",
    "explanation": "The 1985 Nigerian coup d'état was a military coup which took place in Nigeria on 27 August 1985 when a faction of mid-level Armed Forces officers, led by the Chief of Army Staff Major-General Ibrahim Babangida, overthrew the government of Major General Muhammadu Buhari (who himself took power in the 1983 coup d'état).",
    "year": "2022"
  },
  {
    "number": "397",
    "text": "Who founded itsekiri kingdom?",
    "options": {
      "A": "Iginua",
      "B": "Oba Olua",
      "C": "Iyoba",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63766?exam_type=jamb&type=obj&page=80",
    "correct_answer": "B",
    "explanation": "It is a well established fact that Oba Olua founded the Itsekiri kingdom for his unpopular son Iginua(1473- 1480A.D.)",
    "year": "2022"
  },
  {
    "number": "398",
    "text": "How many states were created by Gen. Sani Abacha?",
    "options": {
      "A": "5",
      "B": "6",
      "C": "7",
      "D": "9"
    },
    "answer_url": "https://myschool.ng/classroom/history/63767?exam_type=jamb&type=obj&page=80",
    "correct_answer": "B",
    "explanation": "Gen. Sani Abacha created the following 6 states of Nigeria: Ebonyi; Bayelsa; Nasarawa; Zamfara; Gombe; Ekiti.",
    "year": "2022"
  },
  {
    "number": "399",
    "text": "Nigeria was birthed in the year",
    "options": {
      "A": "1900",
      "B": "1906",
      "C": "1914",
      "D": "1960"
    },
    "answer_url": "https://myschool.ng/classroom/history/63768?exam_type=jamb&type=obj&page=80",
    "correct_answer": "C",
    "explanation": "On January 1, 1914, Lord Frederick Lugard, the governor of both the Northern Nigeria Protectorate and the Colony and Protectorate of Southern Nigeria, signed a document consolidating the two, thereby creating the Colony and Protectorate of Nigeria. Forty-six years later in 1960, Nigeria became an independent state.",
    "year": "2022"
  },
  {
    "number": "400",
    "text": "The Great Trek happened in what country?",
    "options": {
      "A": "South Africa",
      "B": "Liberia",
      "C": "Sierra Leone",
      "D": "Egypt"
    },
    "answer_url": "https://myschool.ng/classroom/history/63770?exam_type=jamb&type=obj&page=80",
    "correct_answer": "A",
    "explanation": "Great Trek, Afrikaans Groot Trek, the emigration of some 12,000 to 14,000 Boers from Cape Colony in South Africa between 1835 and the early 1840s, in rebellion against the policies of the British government and in search of fresh pasturelands.",
    "year": "2022"
  },
  {
    "number": "401",
    "text": "In what century did the Trans-Saharan trade start?",
    "options": {
      "A": "8th century",
      "B": "5th century",
      "C": "17th century",
      "D": "4th century"
    },
    "answer_url": "https://myschool.ng/classroom/history/63771?exam_type=jamb&type=obj&page=81",
    "correct_answer": "A",
    "explanation": "Around the fifth century, thanks to the availability of the camel, Berber-speaking people began crossing the Sahara Desert. From the eighth century onward, annual trade caravans followed routes later described by Arabic authors with minute attention to detail.",
    "year": "2022"
  },
  {
    "number": "402",
    "text": "Who established the Tukulor empire?",
    "options": {
      "A": "Cedric Senghor",
      "B": "Mohammad Ali",
      "C": "Al-Ḥajj ʿUmar",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63774?exam_type=jamb&type=obj&page=81",
    "correct_answer": "C",
    "explanation": "Tukulor empire, Tukulor also spelled Tukolor, or Toucouleur, Muslim theocracy that flourished in the 19th century in western Africa from Senegal eastward to Timbuktu (Tombouctou). The founder of the empire is Al-Ḥajj ʿUmar.",
    "year": "2022"
  },
  {
    "number": "403",
    "text": "Emperor Menelik II defeated Italian troops in the battle of",
    "options": {
      "A": "Adwa",
      "B": "Mfecane",
      "C": "Kiriji",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63775?exam_type=jamb&type=obj&page=81",
    "correct_answer": "A",
    "explanation": "The Battle of Adwa was the climactic battle of the First Italo-Ethiopian War. The Ethiopian forces defeated the Italian invading force.",
    "year": "2022"
  },
  {
    "number": "404",
    "text": "The Nigerian second republic began in the year ____",
    "options": {
      "A": "1983",
      "B": "1979",
      "C": "1963",
      "D": "1966"
    },
    "answer_url": "https://myschool.ng/classroom/history/63776?exam_type=jamb&type=obj&page=81",
    "correct_answer": "B",
    "explanation": "The Second Nigerian Republic was a brief formation of the Nigerian state which succeeded the military governments formed after the overthrow of the first republic. It lasted from 1979-1983.",
    "year": "2022"
  },
  {
    "number": "405",
    "text": "The __________ were the first missionaries to arrive Nigeria.",
    "options": {
      "A": "Anglicans",
      "B": "Catholics",
      "C": "Witnesses",
      "D": "Apostolic"
    },
    "answer_url": "https://myschool.ng/classroom/history/63777?exam_type=jamb&type=obj&page=81",
    "correct_answer": "B",
    "explanation": "The Catholics, through the influence of the Portuguese traders, were the first missionaries to set foot on Nigerian soil. The primary objective of the early Christian missionaries was to convert the 'heathen' or the benighted African to Christianity via education.",
    "year": "2022"
  },
  {
    "number": "406",
    "text": "________ preceded Nelson Mandela as president of South Africa.",
    "options": {
      "A": "Thabo Mbeki",
      "B": "Frederik Willem de Klerk",
      "C": "Jan Christiaan Heunis",
      "D": "Pieter Willem Botha"
    },
    "answer_url": "https://myschool.ng/classroom/history/63778?exam_type=jamb&type=obj&page=82",
    "correct_answer": "B",
    "explanation": "De Klerk was a South African politician who served as state president of South Africa from 1989 to 1994 and as deputy president from 1994 to 1996 in the democratic government. As South Africa's last head of state from the era of white-minority rule, he and his government dismantled the apartheid system and introduced universal suffrage. Ideologically a conservative and an economic liberal, he led the National Party (NP) from 1989 to 1997.",
    "year": "2022"
  },
  {
    "number": "407",
    "text": "What does the name Liberia mean?",
    "options": {
      "A": "Liberated",
      "B": "Cheers to freedom",
      "C": "Land of freedom",
      "D": "independence"
    },
    "answer_url": "https://myschool.ng/classroom/history/63779?exam_type=jamb&type=obj&page=82",
    "correct_answer": "C",
    "explanation": "Settled in the early 1800s by freeborn Blacks and former slaves from America, Liberia, whose name means \"land of freedom,\" has always struggled with its double cultural heritage: that of the settlers and of the indigenous Africans.",
    "year": "2022"
  },
  {
    "number": "408",
    "text": "The first coup in Nigeria was led by",
    "options": {
      "A": "Major Chukwuma Nzeogu",
      "B": "Gen. Aguiyi Ironsi",
      "C": "Gen Sani Abacha",
      "D": "Gen Murtala Mohammed"
    },
    "answer_url": "https://myschool.ng/classroom/history/63780?exam_type=jamb&type=obj&page=82",
    "correct_answer": "A",
    "explanation": "The 1966 Nigerian coup d'état began on 15 January 1966, when mutinous Nigerian soldiers led by Chukwuma Kaduna Nzeogwu and Emmanuel Ifeajuna killed 22 people including the Prime Minister of Nigeria, many senior politicians, many senior Army officers (including their wives), and sentinels on protective duty.",
    "year": "2022"
  },
  {
    "number": "409",
    "text": "In what year was ECOWAS established?",
    "options": {
      "A": "1975",
      "B": "1976",
      "C": "1960",
      "D": "1963"
    },
    "answer_url": "https://myschool.ng/classroom/history/63781?exam_type=jamb&type=obj&page=82",
    "correct_answer": "A",
    "explanation": "The Economic Community Of West African States (ECOWAS) is a regional group of fifteen countries, founded in 1975.",
    "year": "2022"
  },
  {
    "number": "410",
    "text": "NYM(Nigerian Youth Movement) evolved from _____.",
    "options": {
      "A": "LYM",
      "B": "NNDP",
      "C": "NCNC",
      "D": "NPC"
    },
    "answer_url": "https://myschool.ng/classroom/history/63782?exam_type=jamb&type=obj&page=82",
    "correct_answer": "A",
    "explanation": "The NYM was formed by Lagos nationalist led by Ernest Ikoli, H.O Davies, Dr. J.C Vaughan and Samuel Akinsanya in 1934. The party was first called Lagos Youth Movement by 1936 other Nigerian from other parts then changed to Nigerian Youth Movement.",
    "year": "2022"
  },
  {
    "number": "411",
    "text": "The __________ constitution introduced federalism in Nigeria.",
    "options": {
      "A": "Richard's",
      "B": "Clifford's",
      "C": "Macpherson's",
      "D": "Lyttleton's"
    },
    "answer_url": "https://myschool.ng/classroom/history/63783?exam_type=jamb&type=obj&page=83",
    "correct_answer": "A",
    "explanation": "Bernard Bourdillon the Governor-general at that time initiated and laid the foundation of federalism in Nigeria in 1939 by creating three provinces. He later handed over the constitution to his successor Arthur Richards and it became the Richards Constitution of 1946.",
    "year": "2022"
  },
  {
    "number": "412",
    "text": "________ moved the motion for Nigeria's independence.",
    "options": {
      "A": "Anthony Enahoro",
      "B": "Herbert Macaulay",
      "C": "Obafemi Awolowo",
      "D": "Nnamdi Azikiwe"
    },
    "answer_url": "https://myschool.ng/classroom/history/63784?exam_type=jamb&type=obj&page=83",
    "correct_answer": "A",
    "explanation": "In 1953, Enahoro became the first to move the motion for Nigeria's independence which was eventually granted in 1960 after several political setbacks and defeats in parliament. Enahoro has been regarded by academics and many Nigerians as the \"Father of Nigeria State\".",
    "year": "2022"
  },
  {
    "number": "413",
    "text": "The Northern region of Nigeria gained self-government in ____.",
    "options": {
      "A": "1957",
      "B": "1958",
      "C": "1959",
      "D": "1960"
    },
    "answer_url": "https://myschool.ng/classroom/history/63785?exam_type=jamb&type=obj&page=83",
    "correct_answer": "C",
    "explanation": "Western and Eastern Nigeria were both awarded self-government in 1957, while the Northern region would follow in 1959.",
    "year": "2022"
  },
  {
    "number": "414",
    "text": "In 1840, Sayyid Said transferred his capital from Muscat to?",
    "options": {
      "A": "Arabia",
      "B": "Zanzibar",
      "C": "Omani",
      "D": "None of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63786?exam_type=jamb&type=obj&page=83",
    "correct_answer": "B",
    "explanation": "In 1840 Said moved his entire household to Zanzibar and declared it the new capital of his empire. Said and his many relatives and associates built numerous palaces, bath houses and country manors on Zanzibar, and introduced the commercial farming of cloves, sugar and other crops.",
    "year": "2022"
  },
  {
    "number": "415",
    "text": "Nigeria practised the Westminster system of government between",
    "options": {
      "A": "1959 and 1983",
      "B": "1959 and 1966",
      "C": "1960 and 1966",
      "D": "1963 and 1966"
    },
    "answer_url": "https://myschool.ng/classroom/history/63787?exam_type=jamb&type=obj&page=83",
    "correct_answer": "C",
    "explanation": "The 'Westminster Model' existed in Nigeria from the time of independence in particular until the first military coup in 1966",
    "year": "2022"
  },
  {
    "number": "416",
    "text": "The equivalent of the Aare- ona kankanfo of the Yoruba pre-colonial system in the Hausa/Fulani pre-colonial system is the",
    "options": {
      "A": "Galadima",
      "B": "Madawaki",
      "C": "Waziri",
      "D": "Sarkin"
    },
    "answer_url": "https://myschool.ng/classroom/history/63788?exam_type=jamb&type=obj&page=84",
    "correct_answer": "B",
    "explanation": "The Aare- ona kankanfo is the head of the army in the Yoruba pre-colonial system; the equivalent is the Madawaki who is the head of the army in the Hausa/Fulani pre-colonial system. The Waziri is the prime minister; the Galadima is head of the capital while the Dogari is the head of the police.",
    "year": "2022"
  },
  {
    "number": "417",
    "text": "The first British consul in Nigeria was",
    "options": {
      "A": "Lord Lugard",
      "B": "John Beecroft",
      "C": "William Parry",
      "D": "Edward Nicolls"
    },
    "answer_url": "https://myschool.ng/classroom/history/63789?exam_type=jamb&type=obj&page=84",
    "correct_answer": "B",
    "explanation": "In 1849, John Beecroft was appointed Consul of the Bights of Benin and Biafra by the British, a position he held (along with his governorship of Fernando Po) until his death in 1854",
    "year": "2022"
  },
  {
    "number": "418",
    "text": "The first almagamation in Nigeria happened in the year ___",
    "options": {
      "A": "1914",
      "B": "1886",
      "C": "1906",
      "D": "1900"
    },
    "answer_url": "https://myschool.ng/classroom/history/63790?exam_type=jamb&type=obj&page=84",
    "correct_answer": "C",
    "explanation": "In 1906, the Southern protectorate was almagamated with the Lagos colony to form the colony and protectorate of Southern Nigeria.",
    "year": "2022"
  },
  {
    "number": "419",
    "text": "Who was appointed by the federal government of Nigeria as the administrator of Western Region in 1962?",
    "options": {
      "A": "Chief Ladoke Akintola",
      "B": "Chief Obafemi Awolowo",
      "C": "Dr M.A Majekodunmi",
      "D": "Chief Remi Fani Kayode"
    },
    "answer_url": "https://myschool.ng/classroom/history/63791?exam_type=jamb&type=obj&page=84",
    "correct_answer": "C",
    "explanation": "He was appointed sole administrator of Western Region in June 1962 after a political crisis in the region, holding office in place of the Premier Samuel Akintola until December that year.",
    "year": "2022"
  },
  {
    "number": "420",
    "text": "The Coussey Commission Report laid the ground-work for the eventual independence of",
    "options": {
      "A": "Ghana",
      "B": "Gambia",
      "C": "Liberia",
      "D": "Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/63792?exam_type=jamb&type=obj&page=84",
    "correct_answer": "A",
    "explanation": "The recommendation of the Coussey Commission formed the basis of the 1950 constitution. It marked the beginning of the process of independence for the Gold Coast as Ghana, The first Sub -Saharan British Colony to achieve independence.",
    "year": "2022"
  },
  {
    "number": "421",
    "text": "Before the Macpherson's constitution of 1951, the North was governed by",
    "options": {
      "A": "Elders",
      "B": "Emirs",
      "C": "The Constitution",
      "D": "Proclamation of the Governor"
    },
    "answer_url": "https://myschool.ng/classroom/history/63793?exam_type=jamb&type=obj&page=85",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2022"
  },
  {
    "number": "422",
    "text": "Kastina and Akwa-Ibom were created in September, _____.",
    "options": {
      "A": "1985",
      "B": "1986",
      "C": "1987",
      "D": "1988"
    },
    "answer_url": "https://myschool.ng/classroom/history/63794?exam_type=jamb&type=obj&page=85",
    "correct_answer": "C",
    "explanation": "In September 1987 Babangida created Akwa Ibom State from part of Cross River State and Katsina State from part of Kaduna State.",
    "year": "2022"
  },
  {
    "number": "423",
    "text": "Nigeria joined the Organisation of Petroleum Exporting Countries (OPEC) in__________",
    "options": {
      "A": "1971",
      "B": "1972",
      "C": "1973",
      "D": "1974"
    },
    "answer_url": "https://myschool.ng/classroom/history/63795?exam_type=jamb&type=obj&page=85",
    "correct_answer": "A",
    "explanation": "It was on July 12, 1971, that Nigeria became the 11th Member of OPEC.",
    "year": "2022"
  },
  {
    "number": "424",
    "text": "Nnamdi Azikiwe's West African Pilot was established in what year?",
    "options": {
      "A": "1936",
      "B": "1937",
      "C": "1938",
      "D": "1939"
    },
    "answer_url": "https://myschool.ng/classroom/history/63796?exam_type=jamb&type=obj&page=85",
    "correct_answer": "B",
    "explanation": "The West African Pilot was a newspaper launched in Nigeria by Nnamdi Azikiwe in 1937, dedicated to fighting for independence from British colonial rule.",
    "year": "2022"
  },
  {
    "number": "425",
    "text": "When did Lagos become a colony?",
    "options": {
      "A": "5 March,1861",
      "B": "7 May, 1861",
      "C": "5 March, 1862",
      "D": "5 May, 1961"
    },
    "answer_url": "https://myschool.ng/classroom/history/63797?exam_type=jamb&type=obj&page=85",
    "correct_answer": "C",
    "explanation": "Lagos was bombarded by the British in 1851, annexed on 6 August 1861 and declared a colony on 5 March 1862.",
    "year": "2022"
  },
  {
    "number": "426",
    "text": "The sokoto jihad began in what year",
    "options": {
      "A": "1804",
      "B": "1805",
      "C": "1807"
    },
    "answer_url": "https://myschool.ng/classroom/history/63798?exam_type=jamb&type=obj&page=86",
    "correct_answer": "A",
    "explanation": "The Fulani War of 1804–1808, also known as the Fulani Jihad or Jihad of Usman dan Fodio, was a military conflict in present-day Nigeria and Cameroon.",
    "year": "2022"
  },
  {
    "number": "427",
    "text": "The Kanem–Bornu Empire existed in areas which are now part of the following countries except",
    "options": {
      "A": "Chad",
      "B": "Central African Republic",
      "C": "Nigeria",
      "D": "Togo"
    },
    "answer_url": "https://myschool.ng/classroom/history/63799?exam_type=jamb&type=obj&page=86",
    "correct_answer": "D",
    "explanation": "The Kanem–Bornu Empire existed in areas which are now part of Niger, Cameroon, Central African Republic, Chad and Nigeria.",
    "year": "2022"
  },
  {
    "number": "428",
    "text": "The republic of Benin was formerly known as",
    "options": {
      "A": "Nguni",
      "B": "Dahomey",
      "C": "Zulu",
      "D": "Rhodesia"
    },
    "answer_url": "https://myschool.ng/classroom/history/63800?exam_type=jamb&type=obj&page=86",
    "correct_answer": "B",
    "explanation": "The History of Benin since the 16th century, for the geographical area included in 1960 in what was then called the Republic of Dahomey before becoming the People's Republic of Benin.",
    "year": "2022"
  },
  {
    "number": "429",
    "text": "Ismail Pasha was removed as the Khedive of Egypt at the behest of Great Britain in____________",
    "options": {
      "A": "1878",
      "B": "1879",
      "C": "1880",
      "D": "1881"
    },
    "answer_url": "https://myschool.ng/classroom/history/63801?exam_type=jamb&type=obj&page=86",
    "correct_answer": "B",
    "explanation": "Isma'il Pasha was the Khedive of Egypt and conqueror of Sudan from 1863 to 1879, when he was removed at the behest of Great Britain.",
    "year": "2022"
  },
  {
    "number": "430",
    "text": "The United Nations was created as a result of the failure of the ________",
    "options": {
      "A": "Commonwealth of Nations",
      "B": "OPEC",
      "C": "League of Nations",
      "D": "All of the above"
    },
    "answer_url": "https://myschool.ng/classroom/history/63802?exam_type=jamb&type=obj&page=86",
    "correct_answer": "C",
    "explanation": "The League of Nations was the first intergovernmental organization that was established after World War 1 in order to try and maintain peace. It was headquartered in Geneva, Switzerland and designed to be a forum for handling international disputes before they flared up into military action and caused domino effects that pulled ally nations into the conflict (as had happened with the Great War). Unfortunately, the League failed miserably in its intended goal: to prevent another world war from happening (WW2 broke out only two decades later).\nThe idea was for the League of Nations to prevent wars through disarmament, collective security, and negotiation. It was also involved in other issues such as drug trafficking, arms trade, and global health. Although the League disbanded during WW2, it was replaced with the United Nations, which is still going strong today.",
    "year": "2022"
  }
]