[
  {
    "number": "633",
    "text": "The distinctive attribute of a state is the monopoly of",
    "options": {
      "A": "control",
      "B": "power",
      "C": "violence",
      "D": "justice"
    },
    "answer_url": "https://myschool.ng/classroom/government/27167?exam_type=jamb&type=obj&page=127",
    "correct_answer": "B",
    "explanation": "The state has four essential attributes, Population, Territory, Government, and Sovereignty. Population and territory constitute the physical basis of the State while government and sovereignty constitute its legal basis or political basis. sovereignty means the supreme power of a state\nOne very unique feature of a state is the fact that it has the supreme power to make decisions and enforce the same on the people.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "634",
    "text": "State as a political entity refers to",
    "options": {
      "A": "An organized group within a definite territory",
      "B": "An association of men in a given society",
      "C": "A branch of a nation",
      "D": "A geographical location"
    },
    "answer_url": "https://myschool.ng/classroom/government/27168?exam_type=jamb&type=obj&page=127",
    "correct_answer": "A",
    "explanation": "A state is a type of political entity. It is an organized political community that lives under a single system of government. The main difference between state and government is that the government refers to a particular group of people who control the state at a given time whereas the state is an organized political community.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "635",
    "text": "Political values are acquired in any given society through",
    "options": {
      "A": "political re-orientation",
      "B": "political campaign",
      "C": "political socialization",
      "D": "political indoctrination"
    },
    "answer_url": "https://myschool.ng/classroom/government/27169?exam_type=jamb&type=obj&page=127",
    "correct_answer": "C",
    "explanation": "Political socialization is the \"process by which individuals learn and frequently internalize a political lens framing their perceptions of how power is arranged and how the world around them is (and should be) organized; those perceptions, in turn, shape and define individuals' definitions of who they are and how they should behave in the political and economic institutions in which they live.\" Political socialization also encompasses the way in which people acquire values and opinions that shape their political stance and ideology: it is a \"study of the developmental processes by which people of all ages and adolescents acquire political cognition, attitudes, and behaviors.\" It refers to a learning process by which norms and behaviors acceptable to a well running political system are transmitted from one generation to another. It is through the performance of this function that individuals are inducted into the political culture and their orientations towards political objects are formed. Schools, media, and the state have a major influence in this process.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "636",
    "text": "In a democratic government, political sovereignty is vested in the",
    "options": {
      "A": "legislature",
      "B": "elite",
      "C": "executive",
      "D": "electorate"
    },
    "answer_url": "https://myschool.ng/classroom/government/27170?exam_type=jamb&type=obj&page=128",
    "correct_answer": "D",
    "explanation": "In a democratic government,politicalauthority isvestedin the people. it is a form ofgovernmentin which the people, or some significant portion of them, retainsovereigntyover thegovernmentand where offices of state are not granted through heritage.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "637",
    "text": "One judicial function performed by the executive is",
    "options": {
      "A": "Granting of amnesty",
      "B": "Implementing judicial orders",
      "C": "Ensuring obedience to the law",
      "D": "Appointing judges"
    },
    "answer_url": "https://myschool.ng/classroom/government/27171?exam_type=jamb&type=obj&page=128",
    "correct_answer": "A",
    "explanation": "Amnesty.Amnesty, in criminal law, sovereign act of oblivion or forgetfulness (from Greek amnēsia) for past acts,grantedby a government to persons who have been guilty of crimes. ...Amnestyisgrantedusually for political crimes against the state, such as treason, sedition, or rebellion.the President (executive) has thepower to grant amnesty for offences against the States, but understood that this power to grant amnesty was included in the power \" to grant pardons\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "638",
    "text": "A political system which empowers the leader with the ultimate responsibility to execute laws is",
    "options": {
      "A": "parliamentarianism",
      "B": "presidentialism",
      "C": "dictatorship",
      "D": "autocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/27173?exam_type=jamb&type=obj&page=128",
    "correct_answer": "B",
    "explanation": "A constitution is presidential if the executive and legislative branches of government are elected separately for fixed terms. Similarly, a constitution is presidential if the executive and legislative branches of government are elected separately for fixed terms, giving the president the ultimate responsibility to execute laws.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "639",
    "text": "A bill is a draft which is awaiting the consideration of the",
    "options": {
      "A": "executive",
      "B": "party caucus",
      "C": "legislature",
      "D": "judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/27174?exam_type=jamb&type=obj&page=128",
    "correct_answer": "C",
    "explanation": "A bill does not become law until it is passed by the legislature and, in most cases, approved by the executive. Once a bill has been enacted into law, it is called an act of the legislature, or a statute.\nAbillis aproposed lawthat isformally written and submittedfor discussion. Before it becomes a law, it must go through severalreadings, debates and approvalsin thelegislative arm of government. The executive may initiate or implement laws, but it is not the primary body forconsideringa bill.",
    "year": "2012"
  },
  {
    "number": "640",
    "text": "The private ownership of the means of production is a feature of",
    "options": {
      "A": "capitalism",
      "B": "socialism",
      "C": "communalism",
      "D": "communism"
    },
    "answer_url": "https://myschool.ng/classroom/government/27175?exam_type=jamb&type=obj&page=128",
    "correct_answer": "A",
    "explanation": "an economic and political system in which a country's trade and industry are controlled by private owners for profit, rather than by the state.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "641",
    "text": "In a feudal system, the two major classes are the serfs and the",
    "options": {
      "A": "masses",
      "B": "vassals",
      "C": "lords",
      "D": "elite"
    },
    "answer_url": "https://myschool.ng/classroom/government/27176?exam_type=jamb&type=obj&page=129",
    "correct_answer": "C",
    "explanation": "Feudalism represented asystemin which the occupants and users of the land they lived and worked on were not the owners; they were “tenants” of the “sovereign” – theLordof the Manor – who legitimized his authority by claiming to offer protection to the occupants in the form of military service.\nPeasants or Serfs.Peasants are commoners and lived on the manors of monarchs, nobles, or knights. They were granted the right to farm a plot of land in exchange for working the nobleʼs land.\nLordof the Manor” was often used to denote someone who was in control of land.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "642",
    "text": "An example of a country with a flexible constitution is",
    "options": {
      "A": "South Africa",
      "B": "Britain",
      "C": "Benin Republic",
      "D": "the United States of America"
    },
    "answer_url": "https://myschool.ng/classroom/government/27177?exam_type=jamb&type=obj&page=129",
    "correct_answer": "B",
    "explanation": "It is at once a legislature and a constituent assembly. The constitution of England is a typical example of a flexible constitution. The British Parliament is competent to pass, amend or repeal any constitutional law in an ordinary legislative process as both constitutional laws and ordinary laws are treated alike.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "643",
    "text": "The rule of law is negation of",
    "options": {
      "A": "equality before the law",
      "B": "supremacy of the law",
      "C": "Limited power",
      "D": "absolute power"
    },
    "answer_url": "https://myschool.ng/classroom/government/27178?exam_type=jamb&type=obj&page=129",
    "correct_answer": "D",
    "explanation": "Theruleoflawis a principle of the UK constitution that means politicians govern within their powers, thelawapplies equally to all and that thelawis certain. No arm of government is superior to the other. In the face of the law, the president is the same as the ordinary citizen being governed. no one enjoys absolute power. we are all equal before the law\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "644",
    "text": "To ensure the rights and freedom of citizens, the powers of the arms of government must be",
    "options": {
      "A": "fused",
      "B": "incorporated",
      "C": "separated",
      "D": "rotated"
    },
    "answer_url": "https://myschool.ng/classroom/government/27179?exam_type=jamb&type=obj&page=129",
    "correct_answer": "C",
    "explanation": "The separation of powers is a model for the governance of a state. Under this model, a state's government is divided into branches, each with separate and independent powers and areas of responsibility so that the powers of one branch are not in conflict with the powers associated with the other branches.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "645",
    "text": "Delegated legislation is made by bodies other than the",
    "options": {
      "A": "president",
      "B": "governor",
      "C": "parliament",
      "D": "judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/27180?exam_type=jamb&type=obj&page=129",
    "correct_answer": "C",
    "explanation": "· Delegated Legislation is law made by a person or body to whom Parliament has delegated law-making power; hence the term ‘delegated legislation\nDelegated legislation is a law that is not passed by an Act of Parliament.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "646",
    "text": "The primary aim of pressure groups is to",
    "options": {
      "A": "Attract people's attention",
      "B": "protects the interest of members",
      "C": "captured political power",
      "D": "fight corrupt officials"
    },
    "answer_url": "https://myschool.ng/classroom/government/27181?exam_type=jamb&type=obj&page=130",
    "correct_answer": "B",
    "explanation": "The aim of all pressure groups is to influence the people who actually have the power to make decisions. Pressure groups do not look for the power of political office for themselves, but do seek to influence the decisions made by those who do hold this political power.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "647",
    "text": "The French colonial system was underlined by the policy of",
    "options": {
      "A": "assimilation",
      "B": "paternalism",
      "C": "socialism",
      "D": "indirect rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/27182?exam_type=jamb&type=obj&page=130",
    "correct_answer": "A",
    "explanation": "Assimilation was one ideological basis of French colonial policy in the 19th and 20th centuries. In contrast with British imperial policy, the French taught their subjects that, by adopting French language and culture, they could eventually become French. The famous 'Four Communes' in Senegal were seen as proof of this.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "648",
    "text": "Which of the following is used in gauging public opinion?",
    "options": {
      "A": "constitution",
      "B": "educational institution",
      "C": "mass media",
      "D": "electoral college"
    },
    "answer_url": "https://myschool.ng/classroom/government/27183?exam_type=jamb&type=obj&page=130",
    "correct_answer": "C",
    "explanation": "Mass mediahelps shapepublic opinion. It is a powerful force yet many people do not realize what effect it has in shaping theiropinion.Mass mediais intended to be informative.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "649",
    "text": "Colonization of Africa was mainly motivated by",
    "options": {
      "A": "security considerations",
      "B": "economic reasons",
      "C": "religious reasons",
      "D": "cultural factors"
    },
    "answer_url": "https://myschool.ng/classroom/government/27184?exam_type=jamb&type=obj&page=130",
    "correct_answer": "B",
    "explanation": "The primary reason for European colonization of Africa was capitalism. European nations saw opportunity for new trade routes and potential wealth in some of Africa's natural resources. The geographical limitations of Europe were also a factor.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "650",
    "text": "The commission charged with the conduct of federal elections in Nigeria is",
    "options": {
      "A": "NEC",
      "B": "FEDECO",
      "C": "INEC",
      "D": "NECON"
    },
    "answer_url": "https://myschool.ng/classroom/government/27185?exam_type=jamb&type=obj&page=130",
    "correct_answer": "C",
    "explanation": "TheIndependent National Electoral Commission(INEC) was established by the 1999 Constitution of the Federal Republic of Nigeria to among other things organize elections into various political offices in the country.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "651",
    "text": "In the Hausa pre- colonial political system, a district was headed by",
    "options": {
      "A": "A hakimi",
      "B": "a dagaci",
      "C": "an alkali",
      "D": "a waziri"
    },
    "answer_url": "https://myschool.ng/classroom/government/27187?exam_type=jamb&type=obj&page=131",
    "correct_answer": "A",
    "explanation": "Hakimi (Official in charge of districts, collection of taxes, maintenance of law and order).\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "652",
    "text": "Which of the following ensured the practice of democracy in the pre-colonial Yoruba political system?",
    "options": {
      "A": "Checks and balances",
      "B": "Fusion of power",
      "C": "individual responsibility",
      "D": "the rule of law"
    },
    "answer_url": "https://myschool.ng/classroom/government/27188?exam_type=jamb&type=obj&page=131",
    "correct_answer": "A",
    "explanation": "The system of administration and governance was based on the principle of checks and balances especially between the king and Oyomesi/Ogboni.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "653",
    "text": "An electoral system in which parties are assigned seats in the parliament commensurate to the number of votes polled is",
    "options": {
      "A": "Absolute majority",
      "B": "Simple majority",
      "C": "proportional representation",
      "D": "indirect election"
    },
    "answer_url": "https://myschool.ng/classroom/government/27193?exam_type=jamb&type=obj&page=131",
    "correct_answer": "C",
    "explanation": "Proportional representation (PR) characterizes electoral systems in which divisions in an electorate are reflected proportionately in the elected body. If n% of the electorate support a particular political party, then roughly n% of seats will be won by that party. The essence of such systems is that all votes contribute to the result - not just a plurality, or a bare majority.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "654",
    "text": "The bringing of a session of a parliament to an end through royal proclamation is known as",
    "options": {
      "A": "political impasse",
      "B": "dissolution of parliament",
      "C": "vote of no confidence",
      "D": "prorogation of parliament"
    },
    "answer_url": "https://myschool.ng/classroom/government/27195?exam_type=jamb&type=obj&page=131",
    "correct_answer": "D",
    "explanation": "Prorogation of a Parliament is simply the termination of a parliamentary session.\nProrogation is normally a privileged act of the Crown (monarchy), taken on the advice of the Prime Minister.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "655",
    "text": "The right of citizens to participate in the affairs of government of their country is called",
    "options": {
      "A": "economic right",
      "B": "civil right",
      "C": "political right",
      "D": "social right"
    },
    "answer_url": "https://myschool.ng/classroom/government/27196?exam_type=jamb&type=obj&page=131",
    "correct_answer": "C",
    "explanation": "Politicalrightsinclude natural justice (procedural fairness) in law, such as therightsof the accused, including therightto a fair trial; due process; therightto seek redress or a legal remedy; andrightsof participation in civil society and politics such as freedom of association, therightto assemble, therightto petition etc.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "656",
    "text": "A permanent structure that facilitates continuity and guarantees orderly conduct in governance is",
    "options": {
      "A": "Bureaucracy",
      "B": "public corporation",
      "C": "ombudsman",
      "D": "political party"
    },
    "answer_url": "https://myschool.ng/classroom/government/27197?exam_type=jamb&type=obj&page=132",
    "correct_answer": "A",
    "explanation": "Bureaucracy refers to both a body of non-elective government officials and an administrative policy-making group. Historically, a bureaucracy was a government administration managed by departments staffed with non-elected officials. Today, bureaucracy is the administrative system governing any large institution, whether publicly owned or privately owned. The public administration in many countries is an example of a bureaucracy, but so is the centralized hierarchical structure of a business firm.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "657",
    "text": "An intra-party activity for the selection of candidates for elective positions is known as",
    "options": {
      "A": "primary election",
      "B": "general election",
      "C": "mid-term election",
      "D": "bye-election"
    },
    "answer_url": "https://myschool.ng/classroom/government/27198?exam_type=jamb&type=obj&page=132",
    "correct_answer": "A",
    "explanation": "A primary election is the process by which voters, either the general public (open primary) or members of a political party (closed primary), can indicate their preference for a candidate in an upcoming general election or by-election, thus narrowing the field of candidates.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "658",
    "text": "Radical nationalism in Nigeria is generally attributed to the influence of",
    "options": {
      "A": "Aminu Kano",
      "B": "Herbert Marcaulay",
      "C": "Nnamdi Azikiwe",
      "D": "Mbonu Ojike"
    },
    "answer_url": "https://myschool.ng/classroom/government/27199?exam_type=jamb&type=obj&page=132",
    "correct_answer": "C",
    "explanation": "Nnamdi Azikiwe(\"Zik of Africa\") is closely associated withradical nationalismin Nigeria.Through his fiery journalism (e.g., in theWest African Pilot) and political activism, hemobilised Nigerians for immediate independence, especially during the 1930s and 1940s. His approach to nationalism is more confrontational and aimed at achieving the independence of Nigeria. His efforts led to the creation of the \"Zikist Movement\", an army of supporters who rallied behind him.",
    "year": "2012"
  },
  {
    "number": "659",
    "text": "Two foreigners that directly aroused nationalist feelings among Nigerians are",
    "options": {
      "A": "Edward Blyden and Payne  Jackson",
      "B": "Casely Hayford and James Horton",
      "C": "W.E du Boise and H.O Davies",
      "D": "Marcus Garvey and Casely Hayford"
    },
    "answer_url": "https://myschool.ng/classroom/government/27201?exam_type=jamb&type=obj&page=132",
    "correct_answer": "D",
    "explanation": "Caseley Hayford of Gold coast (now Ghana) and Marcus Garvey of Jamaica.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "660",
    "text": "The Sharia legal system was first introduced in the Fourth Republic in",
    "options": {
      "A": "Kano State",
      "B": "Katsina State",
      "C": "Zamfara State",
      "D": "Sokoto State"
    },
    "answer_url": "https://myschool.ng/classroom/government/27205?exam_type=jamb&type=obj&page=132",
    "correct_answer": "C",
    "explanation": "In Nigeria, Sharia has been instituted as a main body of civil and criminal law in 9 Muslim-majority and in some parts of 3 Muslim-plurality states since 1999, when then- Zamfara State governor Ahmad Sani Yerima began the push for the institution of Sharia at the state level of government. It started in Zamfara State (27 October 1999)\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "661",
    "text": "The main focus of Nigeria's foreign policy since independence centers on",
    "options": {
      "A": "South- south cooperation",
      "B": "Sub-regionalism",
      "C": "Globalism",
      "D": "Afrocentrism"
    },
    "answer_url": "https://myschool.ng/classroom/government/27206?exam_type=jamb&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "Since independence in 1960, Nigeria's external relations have been characterized by a focus on Africa as a region, focusing on fighting colonialism, apartheid, and the discrimination of black peoples in the African continent and elsewhere in the world.\nA general word to describe this policy would be Afrocentrism, which is a cultural and political movement meant to positively reflect traditional African values and promote the history of Black people.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "662",
    "text": "Military intervention in Nigeria arose from",
    "options": {
      "A": "perceived incapability of civilians to govern",
      "B": "international pressure for change",
      "C": "the desire for a military government",
      "D": "civilian's desire to relinquish power"
    },
    "answer_url": "https://myschool.ng/classroom/government/27207?exam_type=jamb&type=obj&page=133",
    "correct_answer": "A",
    "explanation": "Corruption and Political Developmentis Another greatreason for military interventionin politics is political crisis in a country; like in the case ofmilitary interventionsduring the Cold War because the communistic regimes failed against capitalism and democracy. If politicians in a civilian government are perceived to be incompetent in managing the affairs of the country, the military may forcefully take over the government.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "663",
    "text": "The first institution introduced by the military to exercise legislative power was the",
    "options": {
      "A": "supreme military council",
      "B": "armed forces ruling council",
      "C": "federal executive council",
      "D": "provisional ruling council"
    },
    "answer_url": "https://myschool.ng/classroom/government/27208?exam_type=jamb&type=obj&page=133",
    "correct_answer": "A",
    "explanation": "The Supreme Military Council was the body that ruled Nigeria after the 1983 Nigerian coup d'état. Its chairman, Muhammadu Buhari, was the head of state. It lasted until 1985 when, following another coup, Ibrahim Babangida replaced the body with a new Armed Forces Ruling Council.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "664",
    "text": "The central objective of privatization in Nigeria is to",
    "options": {
      "A": "Reduce the retrenchment of workers",
      "B": "Encourage prompt payment of salaries",
      "C": "Improve standard of living",
      "D": "Improve the efficiency of enterprises"
    },
    "answer_url": "https://myschool.ng/classroom/government/27209?exam_type=jamb&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "The principle for privatization in Nigeria commenced in 1999 with the aim to diversify totally or partially, the shares owned by the Federal Government, its agencies and parastatals in public. enterprise active or dormant. The primary goal of the privatization in Nigeria is to reduce the dominance of the public sector and to  re-structure and rationalize the public sector in order to lessen the dominant unproductive investment in that sector.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "665",
    "text": "Workers in the public corporations are known as",
    "options": {
      "A": "civil servants",
      "B": "private employees",
      "C": "public servants",
      "D": "professional employees"
    },
    "answer_url": "https://myschool.ng/classroom/government/27210?exam_type=jamb&type=obj&page=133",
    "correct_answer": "C",
    "explanation": "A person who holds a government position by election or appointment is called a public servant.\nThe terms Civil Servant and Public Servant can be differentiated using the following parameters;\nEmployees of the civil service or a ministry or a government department are known as civil servants while employees of a public corporation are called public servants.\nWhile workers of a public corporation are appointed or employed by the board of directors, whereas civil servants are employed by the public service commission.\nWhile the civil service performs administrative functions, the public corporation provides social services and amenities to the general public.\nThe civil service is managed by a minister, advised by the Director General (Permanent Secretary) while public corporation is managed by members of the board of directors.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "666",
    "text": "Quota system and federal character principles were entrenched in the 1979 constitution to ensure",
    "options": {
      "A": "loyalty",
      "B": "Economic empowerment",
      "C": "Equity",
      "D": "Even development"
    },
    "answer_url": "https://myschool.ng/classroom/government/27211?exam_type=jamb&type=obj&page=134",
    "correct_answer": "C",
    "explanation": "The federal character and quota system as enshrined in the constitution of Nigeria is to ensure equitable distributions of bureaucratic and political roles in the public service at federal, states and local government levels. The objectives of the policy are to foster national unity and give every Nigerian a sense of belonging in the country.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "667",
    "text": "In Nigeria, the agency mainly responsible for the maintenance of internal peace and security is the",
    "options": {
      "A": "army",
      "B": "navy",
      "C": "civil defence corps",
      "D": "police"
    },
    "answer_url": "https://myschool.ng/classroom/government/27212?exam_type=jamb&type=obj&page=134",
    "correct_answer": "D",
    "explanation": "Nigeria Police Force. The Nigeria Police Force is the principal law enforcement agency in Nigeria with a staff strength of about 371,800. There are currently plans to increase the force to 650,000, adding 280,000 new recruits to the existing 370,000.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "668",
    "text": "The National Assembly in Nigeria is primarily responsible for",
    "options": {
      "A": "Executing laws",
      "B": "interpreting laws",
      "C": "Ratifying appointments",
      "D": "Making laws"
    },
    "answer_url": "https://myschool.ng/classroom/government/27213?exam_type=jamb&type=obj&page=134",
    "correct_answer": "D",
    "explanation": "The National Assembly of the Federal Republic of Nigeria is a bicameral legislature established under section 4 of the Nigerian Constitution. It consists of a Senate with 109 membersand a 360-memberHouse of Representatives The body, modelled after the federal Congress of the United States, is supposed to guarantee equal representation of the 36 states irrespective of size in the Senate and proportional representation of population in the House. The National Assembly, like many other organs of the Nigerian government, is based in Abuja, in the Federal Capital Territory.\nThe Assembly has broad oversight functions and is empowered to establish committees of its members to scrutinise bills and the conduct of government officials.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "669",
    "text": "The major factor militating against the efficient operation of electoral commissions in Nigeria is",
    "options": {
      "A": "Inadequate public support",
      "B": "Population size",
      "C": "Inadequate skilled manpower",
      "D": "Excessive political interference"
    },
    "answer_url": "https://myschool.ng/classroom/government/27214?exam_type=jamb&type=obj&page=134",
    "correct_answer": "D",
    "explanation": "In this regard all elected officers ranging from the Presidency, the Governors to the Local Government Chairmen should step down before the general election is conducted, this due to the fact that, such officials have influence over the election in their respective domain, they have the power to hijack the electioneering materials thereby dictating the area where ballot boxes would be  sent to and not to be sent, in the past election most pulling boot did not receive election material because of fear of losing the area, while the passive area of their victory will be well furnished with electoral materials. This is done right from the inception of taking statistics of eligible voters in the area to the time of registration through the period of the election proper, base on this points raised, I suggest that all elected officials should step aside three months or at most two mouths to the period of the general election. This will also go along way in solving the problem of intimidating any resident electoral commissioner from doing a thorough job thereby conducting a free and fair election.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "670",
    "text": "A major objective of the public Complaints Commission is",
    "options": {
      "A": "Training and promotion of public servants",
      "B": "Settlement of disputes among individuals",
      "C": "Addressing the grievances of individuals and groups",
      "D": "Fighting corruption and indiscipline"
    },
    "answer_url": "https://myschool.ng/classroom/government/27215?exam_type=jamb&type=obj&page=134",
    "correct_answer": "C",
    "explanation": "The commission's mission statement reads thus;\nMISSION. To promote an effective and efficient service that is responsible and responsive to the needs of the citizenry through investigation and resolution of complaints against federal, state, local governments, public corporations and private sector organisations and their officials.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "671",
    "text": "The country that championed decolonization in Africa was",
    "options": {
      "A": "Nigeria",
      "B": "South Africa",
      "C": "Ghana",
      "D": "Kenya"
    },
    "answer_url": "https://myschool.ng/classroom/government/27216?exam_type=jamb&type=obj&page=135",
    "correct_answer": "C",
    "explanation": "The decolonisation of Africa took place in the mid-to-late 1950s and 1960s, with sudden and radical regime changes on the continent as colonial governments made the transition to independent states; this was often quite unorganized and marred with violence and political turmoil.\nOn 6 March 1957, Ghana (formerly the Gold Coast) became the first sub-Saharan African country to gain its independence from European colonization.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "672",
    "text": "One of the programmes binding members of the Commonwealth is the",
    "options": {
      "A": "Food and aid programme",
      "B": "Cultural programme",
      "C": "Agenda for peace",
      "D": "Scholarship scheme"
    },
    "answer_url": "https://myschool.ng/classroom/government/27217?exam_type=jamb&type=obj&page=135",
    "correct_answer": "C",
    "explanation": "An Agenda for Peace: Preventive diplomacy, peacemaking and peace-keeping, more commonly known simply as An Agenda for Peace, is a report written for the United Nations by Secretary-General Boutros Boutros-Ghali in 1992. In it, Boutros-Ghali responds to a request by the UN Security Council for an \"analysis and recommendations\" to strengthen peacemaking and peace-keeping. The document outlines the way Boutros-Ghali felt the UN should respond to conflict in the post-Cold War world.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "673",
    "text": "ECOMOG at the initial stage of its intervention in Liberia was perceived as",
    "options": {
      "A": "Neutral",
      "B": "Incompetent",
      "C": "Partisan",
      "D": "Invaders"
    },
    "answer_url": "https://myschool.ng/classroom/government/27218?exam_type=jamb&type=obj&page=135",
    "correct_answer": "A",
    "explanation": "click here\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "674",
    "text": "A major drawback to the NEPAD initiative is its",
    "options": {
      "A": "Articulation by few African leaders",
      "B": "Affiliation by few African union",
      "C": "Inability to empower the youth",
      "D": "Reliance on Western donors for funds"
    },
    "answer_url": "https://myschool.ng/classroom/government/27224?exam_type=jamb&type=obj&page=135",
    "correct_answer": "D",
    "explanation": "click here\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "675",
    "text": "The structures of the African Union includes",
    "options": {
      "A": "the court of justice, pan African congress and peolpe's Assembly",
      "B": "pan African parliament, the court of justice and the peace and security conucil",
      "C": "sepcialized Technical commission, the court of justice and humanitarian board",
      "D": "people's Assembly, Humanitarian Board and the peace and security council"
    },
    "answer_url": "https://myschool.ng/classroom/government/27225?exam_type=jamb&type=obj&page=135",
    "correct_answer": "B",
    "explanation": "click here\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "676",
    "text": "The African leader mostly credited for spearheading the formation of the African Union is",
    "options": {
      "A": "Muammar Ghaddafi",
      "B": "Abdelaziz Bouteflika",
      "C": "Abdoulaye Wade",
      "D": "Thabo Mbeki"
    },
    "answer_url": "https://myschool.ng/classroom/government/27226?exam_type=jamb&type=obj&page=136",
    "correct_answer": "A",
    "explanation": "Frustration at its ineffectiveness led African leaders, spearheaded by Libyan leader Muammar el-Qaddafi, to launch the African Union, a body with a structure modeled on that of the European Union. Fifty-three countries in Africa are members of the AU.\nThere is an explanation video availablebelow.",
    "year": "2012"
  },
  {
    "number": "677",
    "text": "The founding members of OPEC are",
    "options": {
      "A": "Algeria,Iran,Iraq,Saudi Arabia and Kuwait",
      "B": "Nigeria,Libya,Iraq and Saudi Arabia",
      "C": "Venezuela,Nigeria,Libya,Iran and Iraq",
      "D": "Saudi Arabia,Iran,Iraq Kuwait and Venezuela"
    },
    "answer_url": "https://myschool.ng/classroom/government/27227?exam_type=jamb&type=obj&page=136",
    "correct_answer": "D",
    "explanation": "The founding members of OPEC were Iran, Iraq, Kuwait, Saudi Arabia, and Venezuela. Other countries joining OPEC were Algeria (1969), Indonesia (1962), Libya (1962), Nigeria (1971), Qatar (1961), and the United Arab Emirates (1967). Ecuador and Gabon both joined OPEC in 1973, but withdrew in 1992 and 1995, respectively.\nThere is an explanation video availablebelow.",
    "year": "2012"
  }
]