[
  {
    "number": "2327",
    "text": "The major building block of an organism is...",
    "options": {
      "A": "Nitrogen",
      "B": "Carbon",
      "C": "Water",
      "D": "Sulphur"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69867?exam_type=jamb&type=obj&page=466",
    "correct_answer": "B",
    "explanation": "Carbon is the primary building block of life on Earth.Carbon can form stable, complex molecules with other elements, especially hydrogen, oxygen, and nitrogen.\nCarbon-based molecules are the basis for life in all living organisms, including humans. These molecules include nucleic acids, carbohydrates, lipids, cells, and proteins. It is considered the major building block of organismsbecause of its unique ability to form stable bonds with many different elements, including itself, allowing it to create complex, diverse, and large molecules necessary for life, like proteins, carbohydrates, and nucleic acids, which are the foundation of all living things.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2328",
    "text": "The process by which plants loss water to the atmosphere is",
    "options": {
      "A": "transpiration",
      "B": "guttation",
      "C": "translocation",
      "D": "evaporation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69868?exam_type=jamb&type=obj&page=466",
    "correct_answer": "A",
    "explanation": "The process by which plants lose water to the atmosphere is called transpiration.\nTranspiration is the process by which plants release water into the atmosphere as water vapour. It occurs through stomata, which are tiny pores on the surface of leaves that allow plants to exchange gases with the atmosphere. Transpiration also occurs through evaporation from the surfaces of leaves, stems, and flowers. Guttation also involves water loss but there is difference between the two.\nTranspiration is the process where plants lose water vapour through tiny pores called stomata on their leaves,whileguttation is the release of liquid water droplets from specialized structures called hydathodes, usually located on the edges of leaves, occurring when the plant absorbs water faster than it can transpire,creating a pressure that forces the water out; essentially,transpiration is water loss as vapour, andguttation is water loss as liquid droplets.\nTranslocation is the process by which plants move dissolved materials, like sugars and nutrients, throughout the plant.\nEvaporation\" in plants refers to the process called transpiration, where water absorbed by the plant roots travels through the plant's vascular system and exits as water vapour through tiny pores on the leaves called stomata.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2329",
    "text": "Use the diagram above to answer the question that follows\nThe organism belongs to kingdom",
    "options": {
      "A": "monera",
      "B": "protista",
      "C": "fungi",
      "D": "animalia"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69871?exam_type=jamb&type=obj&page=466",
    "correct_answer": "A",
    "explanation": "The diagram is that of the virus. Viruses are obligate parasites, meaning they can't produce their own energy or proteins. They enter the host cell and use the cell's machinery to make their own nucleic acids and proteins. Viruses also use the host cell's lipids and sugar chains to create their membranes and glycoproteins. This parasitic replication can severely damage the host cell, which can lead to disease or cell death. Theyusually enter your body through your mucous membranes. These include your eyes, nose, mouth, penis, vagina and anus.\nViruses are a unique type of organism that are not plants, animals, or bacteria. They are often classified in their own kingdom. However, for the sake of the question, since most of their attributes and metabolic activities are more of the bacteria, we'll go with option A - Monera\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2330",
    "text": "The formation of cilia and flagella in living cells is carried out with the help of",
    "options": {
      "A": "ribosome",
      "B": "lysosome",
      "C": "centriole",
      "D": "plastid"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69873?exam_type=jamb&type=obj&page=466",
    "correct_answer": "C",
    "explanation": "A lysosome functions as the \"garbage disposal unit\" of a cell, primarily responsible for breaking down and recycling waste materials within the cell by digesting old cell parts, extracellular debris, and invading pathogens using digestive enzymes, thus maintaining cellular homeostasis and contributing to important processes like programmed cell death (apoptosis).\nThe primary function of a ribosome in a living cell is to synthesize proteins by translating the genetic code carried by messenger RNA (mRNA) into a sequence of amino acids, which then fold to form functional proteins; essentially acting as the site where protein synthesis occurs within the cell.\nCentrioles are barrel-shaped organelles in the cytoplasm of animal cells that help organize microtubules and form centrosomes, cilia, and flagella. They are found near the nuclear envelope.Centrioles are essential for the formation of cilia and flagella in living cells.It is a barrel-shaped organelles made of microtubules that play a central role in the formation of cilia, flagella, and centrosomes.\nPlastids, organelles found primarily in plant cells, are responsible for the synthesis and storage of important molecules like food, pigments, and other metabolites, with their primary function being photosynthesis, using sunlight to convert carbon dioxide into energy-rich compounds like glucose; they also play a role in the plant's color due to the pigments they store\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2331",
    "text": "The food nutrient with the highest energy value is",
    "options": {
      "A": "protein",
      "B": "carbohydrate",
      "C": "lipid",
      "D": "minerals"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69874?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "Fat is the food nutrient with the highest energy value, providing 9 calories per gram, while carbohydrates and proteins provide 4 calories per gram.\nFat is the body's most concentrated source of energy, providing more than twice as much potential energy as carbohydrates or proteins.However, carbohydrates burn fastest in metabolism. Fats are a type of lipid. Lipids are a group of organic compounds that are insoluble in water but soluble in organic solvents. Fats are solid at room temperature, while oils are liquid at room temperature.\nTherefore, the correct answer is option C.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2332",
    "text": "I\n6 X  +  6 H\\(_2\\)O      →     C\\(_6\\)H\\(_{12}\\)O\\(_6\\)   +   6O\\(_2\\) \n III               chlorophyll      II               IV\nUse the diagram above to answer question that follows\nThe part labelled I is",
    "options": {
      "A": "enzyme",
      "B": "water",
      "C": "sunlight",
      "D": "chemical"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69879?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "The chemical reaction represents photosynthesis, a process through which green plants manufacture their food in the presence ofsunlight,making use of Carbon(IV) oxide and Water.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2333",
    "text": "Bilateral symmetry,cylindrical bodies and double openings are characteristic features of",
    "options": {
      "A": "nematodes",
      "B": "hydra",
      "C": "protozoa",
      "D": "protists"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69883?exam_type=jamb&type=obj&page=467",
    "correct_answer": "A",
    "explanation": "Nematodes are bilaterally symmetrical. Bilaterally symmetrical means that an organism can be divided lengthwise into two identical halves that are mirror images of each other. Nematodes have two openings: a mouth and an anus. This is because they have a complete digestive system, also known as an alimentary canal.\nHere are some other characteristics of nematodes:\nBilateral symmetry: Nematodes have identical right and left halves.Cylindrical shape: Nematodes have a cylindrical body shape.Sexually dimorphic: Most species of nematodes have both males and females.No circulatory system: Nematodes don't have a circulatory system, so they transfer nutrients and oxygen to their cells through diffusion. Hydra is not bilaterally symmetrical; it exhibits radial symmetry, meaning its body can be divided into equal halves along any plane through its central axis. Protozoans are single-celled organisms that lack a true mouth and anus, instead they have a single opening that serves both the entrance and exit point for nutrients, wastes and other materials. E.g Amoeba, paramecium etc. Protists also have a single opening, though certain types of algae or protozoans with complex cell structures might have multiple openings for feeding, reproduction etc(dinoflagellates, ciliates like paramecium), but generally, protists don't have double openings in the classical sense.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2334",
    "text": "Mouth part adapted for piercing and sucking is found in",
    "options": {
      "A": "housefly",
      "B": "grasshopper",
      "C": "mosquito",
      "D": "cockroach"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69888?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "The housefly has a sponging and sucking type of mouthpart, meaning it absorbs liquid food by essentially \"lapping\" it up with its spongy labellum, not piercing to suck like a mosquito does.\nGrasshopper has a biting and chewing type of mouthpart, which is used to process solid foods like grass and leaves.\nPiercing and sucking mouth partsare found in insects such asmosquitoes, lice, fleas, bedbugs, and stinkbugs.These insects have mouth parts that are adapted for piercing the skin of animals and plants to suck up blood and plant juice.\nMajor insect groups that havechewing mouthparts include the cockroaches and grasshoppers, most wasps, beetles, termites and caterpillars. Insects with piercing-sucking mouthparts include some flies (think mosquitoes), fleas, true bugs and their relatives.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2335",
    "text": "The web-feet of frogs and toads is basically for",
    "options": {
      "A": "leaping",
      "B": "walking",
      "C": "swimming",
      "D": "mating"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69890?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "The webbed feet of frogs and toads help themswimand move through water.The thin layer of skin that connects the toes of frogs and toads increases the surface area of their feet, allowing them to push against the water more effectively. This helps them move quickly through the water to chase food or escape predators.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2336",
    "text": "The part of the inner ear that is responsible for hearing is",
    "options": {
      "A": "sacculus",
      "B": "cochlea",
      "C": "utriculus",
      "D": "ampullae"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69891?exam_type=jamb&type=obj&page=468",
    "correct_answer": "B",
    "explanation": "The sacculus is a sensory organ located in the inner ear that primarily functions to detect vertical linear acceleration, meaning it senses movement in the up and down direction, like when you're in an elevator, and helps maintain balance by providing information about your head's position relative to gravity; essentially, it tells your brain if your head is tilting forward or backward.\nThe cochleais the part of the inner ear that is responsible for hearing.\nThe cochlea is a snail-shaped organ filled with fluid that contains the organ of Corti, which is made up of tiny hair cells that line the cochlea. When sound enters the ear, it causes the fluid in the cochlea to vibrate, which makes the hair cells vibrate and send electrical impulses to the brain. The brain perceives these electrical signals as sound.\nThe utriculus, located in the inner ear, functions as a sensory organ that detects linear acceleration and head position in the horizontal plane, essentially sensing side-to-side tilting movements of the head, contributing to our sense of balance by providing information about static equilibrium.Theinner earalso contains the semicircular canals, which are responsible for balance. The semicircular canals are filled with fluid and have calcium crystals embedded in their lining.\nThe function of the ampullae in the ear is to detect head rotation by sensing the movement of fluid within the semicircular canals, sending signals to the brain regarding angular acceleration and deceleration of the head, essentially contributing to balance perception.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2337",
    "text": "The changes of living organisms over generation is referred to as",
    "options": {
      "A": "human evolution",
      "B": "organic evolution",
      "C": "physical evolution",
      "D": "chemical evolution"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69893?exam_type=jamb&type=obj&page=468",
    "correct_answer": "B",
    "explanation": "Human evolution is the process by which humans evolved from ape-like ancestors over millions of years. This process resulted in the development of physical and behavioral traits that all humans share today.\nOrganic evolution is the theory that all living organisms have evolved from pre-existing species, and that the differences between organisms are due to changes in their genetic makeup over generations. Organic evolution, also known as biological evolution, is the gradual process by which living organisms change over time. It's the theory that all species are descended from common ancestors, and that the differences between them are due to changes in their genetic makeup over generations.\nPhysical evolution\" refers to the process by which the physical characteristics of an organism change over generations, primarily due to changes in its genetic makeup, resulting in adaptations to its environment, often manifested in alterations to body shape, size, and function of different body parts; essentially, it's the observable physical manifestation of biological evolution at the organism level.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2338",
    "text": "In a cross involving a heterozygous red flower plant (Rr) and a white flowered plant (rr). What is the probability that the offspring will be Rr?",
    "options": {
      "A": "\\(\\frac{1}{2}\\)",
      "B": "1",
      "C": "2",
      "D": "\\(\\frac{1}{4}\\)"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69899?exam_type=jamb&type=obj&page=468",
    "correct_answer": "A",
    "explanation": "By crossing  Rr  x  rr\nWe obtain  Rr , rr , rr , Rr\n⇒ 50% = \\(\\frac{1}{2}\\)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2339",
    "text": "Inbreeding is highly discouraged in humans because it may",
    "options": {
      "A": "increase the death rate of new born",
      "B": "lead to the birth of dwarfs",
      "C": "lead to high rate of competition among offspring",
      "D": "lead to outbreak of hereditary diseases"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69900?exam_type=jamb&type=obj&page=468",
    "correct_answer": "D",
    "explanation": "Inbreeding is the mating of organisms that are more closely related than would normally occur in nature. This can include mating between siblings, parents and children, or first cousins. Studies have confirmed anincrease in several genetic disordersdue to inbreeding such as blindness, hearing loss, neonatal diabetes, limb malformations, disorders of sex development, schizophrenia and several others. In adults, inbreeding can lead to deafness, visual impairment, and mental deficiency.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2340",
    "text": "One main feature of trees in the savanna habitat is the possession of",
    "options": {
      "A": "large, leathery leaves",
      "B": "straight slender stems with branches near the top",
      "C": "thin, smooth barks",
      "D": "thick, corky bark"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69902?exam_type=jamb&type=obj&page=468",
    "correct_answer": "D",
    "explanation": "A savanna is a hot, dry ecosystem with a mix of grasslands and woodland.Trees in savannas often have thick bark to protect them from fire damage. Savannas are usually found near the equator, where there is more direct sunlight and warm temperatures all year.Some common trees found in savannas include acacia, combretum, baobabs, borassus, and euphorbia.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2341",
    "text": "Use the diagram above to answer the question that follows\nThe zone labelled II is called",
    "options": {
      "A": "supra-tidal zone",
      "B": "pelagic zone",
      "C": "littoral zone",
      "D": "benthic zone"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69903?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "The supra-tidal zone, also known as the splash zone or spray zone, is the area of a coastline or estuary that is above the spring high tide line and is regularly splashed by ocean water but never submerged. The supra-tidal zone is only flooded during storms or spring tides.\nThe pelagic zone is the open water column of an ocean or lake that is not close to the shore or the bottom.\nThe littoral zone is the area where the land meets the water in a lake, river, or sea, and is also known as the nearshore or littoral. It's a shallow, sloped area that stretches from the high-water mark to the shore, and into the water where sunlight reaches the bottom.\nThe benthic zone is the lowest ecological region of a body of water, such as a lake, ocean, or stream. It includes the sediment surface and some sub-surface layers.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2342",
    "text": "Which of the following structures enables the exchange of gases in insects?",
    "options": {
      "A": "skin",
      "B": "tracheae",
      "C": "Malpighian tubules",
      "D": "flame cell"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69905?exam_type=jamb&type=obj&page=469",
    "correct_answer": "B",
    "explanation": "Insects have a tracheal respiratory system in whichoxygen and carbon dioxide travel primarily through air-filled tubes called tracheae.\nMalpighian tubules (MTs) are the primary excretory organs in most insects, and they have a number of uses, including excretion.They are responsible for producing primary urine and removing toxic compounds and excretion products.\nFlame cells are not used in insects, but they are used in other invertebrates, such as flatworms, rotifers, and nemerteans.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2343",
    "text": "The total number of ATP produced during glycolysis is",
    "options": {
      "A": "3 molecules",
      "B": "2 molecules",
      "C": "4 molecules",
      "D": "6 molecules"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69910?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "Glycolysis is the process in which glucose is broken down to produce energy. It produces two molecules of pyruvate, ATP, NADH and water. Glycolysis is a two-phase process that begins in the cytoplasm of a cell. The first phase, called the investment phase, requires two ATP molecules to add phosphates to glucose. The net gain istwo ATP molecules.The total number of ATP produced during glycolysis istwo.The net gain of ATP produced during glycolysis is 2 molecules. While 4 ATP molecules are produced, 2 are consumed in the initial steps, resulting in a net gain of 2.\nDuring glycolysis, glucose ultimately breaks down into pyruvate and energy; a total of 2 ATP is derived in the process (Glucose + 2 NAD+ + 2 ADP + 2 Pi  → 2 Pyruvate + 2 NADH + 2 H\\(^+\\) + 2 ATP + 2 H\\(_2\\)O).",
    "year": "2024"
  },
  {
    "number": "2344",
    "text": "Use the diagram above to answer the question that follows\nThe diagram above is",
    "options": {
      "A": "circulatory system",
      "B": "reproductive system",
      "C": "urinary system",
      "D": "nervous system"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69912?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "The circulatory system is a network of blood vessels, the heart, and blood that moves throughout the body. The circulatory system's main function is to transport nutrients, oxygen, and hormones to the body's cells, and remove waste products.\nThe reproductive system is a collection of organs in both males and females that work together to produce offspring, primarily consisting of the gonads (ovaries in females, testes in males) which create sex cells (eggs and sperm), and accessory organs that transport and nurture these cells to facilitate fertilization and potential pregnancy.\nThe nervous system is a complex network of nerves and nerve cells (neurons) that control bodily functions by sending signals between the brain and the rest of the body, allowing us to move, think, feel, and regulate internal processes; it consists of two main parts: the central nervous system (brain and spinal cord) and the peripheral nervous system\nThe urinary system helps the body maintain balance by removing waste products like urea, extra salt, and extra water. Urea is a waste product created when the body breaks down protein from foods like meat, poultry, and some vegetables. Its function is to remove waste from the body through urine bladder, urethra, kidneys and ureters.\nParts of the urinary system\nKidneys: Two bean-shaped organs located in the middle back, under the ribs. They filter blood to remove waste and extra water.Ureters: Two tubes that carry urine from the kidneys to the bladder.Bladder: A hollow organ in the pelvis that stores urine. When the bladder is full, it signals the body to urinate.Urethra: A small tube that carries urine from the bladder out of the body.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2345",
    "text": "Bile is a greenish alkaline liquid which is stored in the",
    "options": {
      "A": "gall bladder",
      "B": "liver",
      "C": "stomach",
      "D": "pancreas"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69915?exam_type=jamb&type=obj&page=469",
    "correct_answer": "A",
    "explanation": "The gallbladder stores bile, a greenish-yellow digestive fluid that helps break down fats in food:\nThe gallbladder is a small, pear-shaped organ located beneath the liver. Bile is produced in the liver and travels through ducts to the gallbladder, where it's concentrated and stored. When food is eaten, the gallbladder contracts and releases bile into the duodenum to aid digestion.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2346",
    "text": "A medium texture soil with high organic matter is",
    "options": {
      "A": "clay",
      "B": "loamy",
      "C": "humus",
      "D": "sandy"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69918?exam_type=jamb&type=obj&page=470",
    "correct_answer": "B",
    "explanation": "Loamy Soil is the mixture of clay, sand and silt soilwhich consists of additional organic matter and is very fertile compared to other types of soil. It is a mixture of sand, silt, and clay, loamy soil is characterized by a significant amount of organic matter, which is decomposed plant and animal material. Loamy soil is fertile and well-suited for cultivation because it provides plants with the nutrients and water they need to grow.\nHumus on the other hand is a well-broken down soil organic matter, humus has a high cation exchange capacity (CEC). Soils with low CEC are more likely to acidify quickly and develop deficiencies in potassium, magnesium, and other cations.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2347",
    "text": "One of the following is an example of discontinuous variation",
    "options": {
      "A": "shape of the head",
      "B": "blood group",
      "C": "body complexion",
      "D": "pointed nose"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69919?exam_type=jamb&type=obj&page=470",
    "correct_answer": "B",
    "explanation": "Discontinuous variation is when individuals fall into distinct categories or classes, and there are no values in between. Blood group is an example of discontinuous variation. In the ABO blood group system, there are only four possible blood groups: A, B, AB, or O. You can't have a blood group in between these four groups.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2348",
    "text": "The type of variation where there are no remarkable differences between the two extreme individuals is called",
    "options": {
      "A": "continuous variation",
      "B": "morphological variation",
      "C": "physiological variation",
      "D": "discontinuous variation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69920?exam_type=jamb&type=obj&page=470",
    "correct_answer": "A",
    "explanation": "Continuous variation is a type of variation where there are no clear differences between two extreme individuals, and instead there is a gradual change from one extreme to another.\nMorphological variations are changes in the physical appearance of individuals of the same species. e.g height, weight, eye colour etc\nPhysiological variation refers to the differences in physiological function between individuals of the same species. e.g taste, rolling of the tongues, blood type etc\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2349",
    "text": "The transmission of diseases through contamination of food is an economic importance of",
    "options": {
      "A": "mosquitoes",
      "B": "cockroaches",
      "C": "butterflies",
      "D": "bees"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69921?exam_type=jamb&type=obj&page=470",
    "correct_answer": "B",
    "explanation": "Cockroaches can transmit diseases through food contamination, which is an economic concern.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2350",
    "text": "Bryophyte is an intermediate group between higher algae and",
    "options": {
      "A": "thallophyte",
      "B": "pteridophyte",
      "C": "spermatophyte",
      "D": "tracheophyte"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69923?exam_type=jamb&type=obj&page=470",
    "correct_answer": "B",
    "explanation": "Bryophytes are sometimes referred to as an intermediate group between algae and vascular plants(Pteridophytes).\nBryophytes: A small group of land plants that includes liverworts, hornworts, and mosses. They are considered the most primitive group of Embryophyta, and are thought to be the first land plants. They lack vascular tissues and seeds, but produce embryos while the algae is a a group of organisms with cell walls made of cellulose, similar to bryophytes. However, algae do not divide their plant body internally into photosynthetic and storage zones, unlike bryophytes. Bryophytes produce embryos but lack seeds and vascular tissues. They are the most simple and primitive group of Embryophyta.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2351",
    "text": "Ecological succession can result from",
    "options": {
      "A": "newly formed habitat",
      "B": "habitat with abundant food",
      "C": "habitat with space and light",
      "D": "population of plants on a fertile land"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69924?exam_type=jamb&type=obj&page=471",
    "correct_answer": "A",
    "explanation": "Ecological succession is a gradual process that occurs when an ecosystem changes in species composition and community structure over time after a disturbance.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2352",
    "text": "The first organism evolved from which of the following habitat?",
    "options": {
      "A": "terrestrial",
      "B": "arboreal",
      "C": "aquatic",
      "D": "desert"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69925?exam_type=jamb&type=obj&page=471",
    "correct_answer": "C",
    "explanation": "Amphibians, reptiles, mammals, and birds evolved after fish. The first amphibians evolved from a lobe-finned fish ancestor . They were the first vertebrates to live on land, but they had to return to water to reproduce.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2353",
    "text": "Which of these pair of substances must be present for a seed to germinate in a laboratory set-up?",
    "options": {
      "A": "microbes and water",
      "B": "heat and water",
      "C": "soil and manure",
      "D": "heat and microbe"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69926?exam_type=jamb&type=obj&page=471",
    "correct_answer": "B",
    "explanation": "All seeds needwater, oxygen, and proper temperaturein order to germinate. Experiment has shown thatgerminating seedsproduceheat.\nThe correct answer is B - Heat and water.\nFor a seed to germinate in a laboratory setup, two essential factors are required:\n1. Water: Seeds need water to rehydrate and initiate metabolic processes.\n2. Heat (or optimal temperature): Seeds require a specific temperature range to break dormancy and germinate.\nThe other options are not essential for seed germination:\nA. Microbes: While microbes can influence seed germination, they are not a required factor.\nC. Soil and manure: Seeds can germinate in a laboratory setup without soil and manure.\nD. Heat and microbe: Microbes are not a necessary factor for seed germination.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2354",
    "text": "A fruit formed from one flower with many carpels is referred to as",
    "options": {
      "A": "simple",
      "B": "multiple",
      "C": "aggregate",
      "D": "false"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69933?exam_type=jamb&type=obj&page=471",
    "correct_answer": "C",
    "explanation": "Asimple fruitis a fruit that develops from asingle flowerwithone ovaryor multiple fused carpels. The ovary wall ripens into a single fruit, separate from other ovaries.E.g Apples, Oranges, peaches, Lemon, melon etc\nAmultiple fruitis a type offruitthat develops from theovaries of manyflowersgrowing in a cluster or that are fused together into a largerfruit. E.g Pineapple\nA fruit that develops from asingle flower with multiple carpelsis called an aggregate fruit. Examples include Raspberry, strawberry, and Blackberry.\nAfalse fruitis a fruit that develops fromparts of a flower other than the ovary.False fruits are also known as pseudo fruits or accessory fruits.E.g Pear, Cashew\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2355",
    "text": "Which of the following plant is found in the ground layer of a tropical rainforest in Nigeria?",
    "options": {
      "A": "obeche",
      "B": "liverwort",
      "C": "mahogany",
      "D": "oil palm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69934?exam_type=jamb&type=obj&page=471",
    "correct_answer": "B",
    "explanation": "Liverworts are found in the ground layer of a tropical rainforest, along with other plants like ferns, wildflowers, moss, and sedges. Liverworts are non-vascular plants, meaning they don't have roots or vascular tissue, and instead absorb nutrients and water from the air through their leaves.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2356",
    "text": "Use the diagram above to answer the question that follows\nThe endocrine gland that is located in the part labelled I is",
    "options": {
      "A": "thyroid",
      "B": "adrenal",
      "C": "parathyroid",
      "D": "pituitary"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69935?exam_type=jamb&type=obj&page=472",
    "correct_answer": "D",
    "explanation": "The pituitary gland is located at the base of the brain, in the sella turcica, an indent in the sphenoid bone. It's directly below the hypothalamus, and behind the bridge of the nose.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2357",
    "text": "Which of the following processes takes place in the carbon cycle?",
    "options": {
      "A": "evaporation",
      "B": "nitrification",
      "C": "combustion",
      "D": "transpiration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69936?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "Combustion is a process that takes place in the carbon cycle, while transpiration is not.\nCombustionis the process of burning organic materials, such as fossil fuels, wood, paper, plastics, and cloth, in the presence of oxygen. This releases carbon dioxide and water vapor into the atmosphere.\nNitrification is a biological process that converts ammonia (NH3)into nitrite (NO2) and then nitrate (NO3).\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2358",
    "text": "Which of the following plants shows hypogeal germination?",
    "options": {
      "A": "castor oil",
      "B": "groundnut",
      "C": "maize",
      "D": "orange"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69948?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "Hypogeal germination is a type of seed germination that occurs below ground, where the cotyledons  remain below the soil.\nHypogeal germination occurs in both monocotyledonous seeds including paddy, wheat, maize, etc. and dicotyledonous seeds, including pea, mango, groundnuts, etc.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2359",
    "text": "In vascular plants, xylem tissue is responsible for",
    "options": {
      "A": "transportation of water",
      "B": "translocation of food",
      "C": "transportation of hormones",
      "D": "storage of sugar"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69949?exam_type=jamb&type=obj&page=472",
    "correct_answer": "A",
    "explanation": "In vascular plants, xylem tissue is responsible for transporting water and dissolved minerals from the roots to the leaves. Xylem is a vascular tissue, along with phloem, which is the other main transport system in plants.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2360",
    "text": "The causative agent of tuberculosis is",
    "options": {
      "A": "virus",
      "B": "bacteria",
      "C": "protozoa",
      "D": "fungi"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69957?exam_type=jamb&type=obj&page=472",
    "correct_answer": "B",
    "explanation": "The causative agent of tuberculosis (TB) is thebacterium Mycobacterium tuberculosis.TB is a contagious disease that spreads through the air when people with active TB in their lungs cough, sneeze, or spit.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2361",
    "text": "Which of these is a respiratory organ in mammals?",
    "options": {
      "A": "skin",
      "B": "mouth",
      "C": "heart",
      "D": "lungs"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69958?exam_type=jamb&type=obj&page=473",
    "correct_answer": "D",
    "explanation": "The lungs are the respiratory organ in mammals.They are the primary respiratory organs in mammals. They are located in the thorax, on either side of the mediastinum. The lungs take in oxygen from the air and release carbon dioxide, which oxygenates the blood.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2362",
    "text": "Which of the Nigeria states is Northern guinea savanna located?",
    "options": {
      "A": "Borno",
      "B": "Kano",
      "C": "Oyo",
      "D": "Kwara"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69959?exam_type=jamb&type=obj&page=473",
    "correct_answer": "D",
    "explanation": "The Guinea savanna is a vegetation zone in Nigeria that covers more than half of the country's land area. It's characterized by short trees and tall grasses.KwaraState is located in the Northern Guinea savanna, at the southern border of the Niger River.\nOther states in the Northern Guinea Savanna include: Niger, Taraba, Kaduna, Bauchi, Benue, and Kogi.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2363",
    "text": "Darwin's theory of evolution is based on the principle of",
    "options": {
      "A": "use and disuse of organ",
      "B": "natural selection",
      "C": "acquired characteristics",
      "D": "mutation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69961?exam_type=jamb&type=obj&page=473",
    "correct_answer": "B",
    "explanation": "Jean-Baptiste Lamarck proposed the theory of use and disuse of organs, also known as Lamarckism\nDarwin's theory of evolution, also known as Darwinism, explains how species evolve over time through natural selection.\nJean-Baptiste Lamarckrepeated the ancient folk wisdom of the inheritance of acquired characteristics.\nDe Vries held that new species arrive suddenly and without prior precedent through the process of mutation. The mutation Theory of Evolution was proposed byHugo de Vries.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2364",
    "text": "Similar structures that are modified to work in different ways in different organisms are referred to as",
    "options": {
      "A": "homologous structures",
      "B": "analogous structures",
      "C": "divergent structures",
      "D": "convergent structures"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69963?exam_type=jamb&type=obj&page=473",
    "correct_answer": "A",
    "explanation": "Similar structures that are modified to work in different ways in different organisms are called homologous structures.\nHomologous structures are physical features that are similar in organisms that share a common ancestor, but have different functions. For example, the limbs of humans, cats, whales, and bats are homologous structures.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2365",
    "text": "One of the ways of controlling Schistosomiasis is by",
    "options": {
      "A": "destroying water snails and water weeds",
      "B": "clearing the bushes around the house",
      "C": "washing hands after using the toilet",
      "D": "properly washing fruits before eating them"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69965?exam_type=jamb&type=obj&page=473",
    "correct_answer": "A",
    "explanation": "Schistosomiasis, also known as bilharzia or snail fever, is a parasitic disease caused by blood flukes that live in freshwater snails. The larval form of the parasite, called cercariae, emerges from the snail and contaminates water. People become infected when their skin comes into contact with the contaminated water. Treating water sources with chemicals to kill snails (molluscicides) can reduce the number of infective larvae.This will help control the snails.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2366",
    "text": "The central nervous system comprises of",
    "options": {
      "A": "brain and somatic",
      "B": "brain and spinal cord",
      "C": "spinal cord and somatic",
      "D": "brain only"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69983?exam_type=jamb&type=obj&page=474",
    "correct_answer": "B",
    "explanation": "The central nervous system (CNS) is made up of the brain and spinal cord:\nBrain: Controls how we think, feel, move, and learn.Spinal cord: Carries messages between the brain and the nerves that run throughout the body.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2367",
    "text": "Use the diagram above to answer the question that follows\nThe organelle that shows the organism has plant characteristics is",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69986?exam_type=jamb&type=obj&page=474",
    "correct_answer": "C",
    "explanation": "I - Paramylum granules\nII - Contractile vacuole\nIII- Chloroplasts\nIV- Nucleus\nThe chloroplasts is the plant-like feature of euglena, which enables it to carryout photosynthesis.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2368",
    "text": "Reproduction in paramecium is by",
    "options": {
      "A": "binary fission",
      "B": "budding",
      "C": "spore formation",
      "D": "fragmentation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69988?exam_type=jamb&type=obj&page=474",
    "correct_answer": "A",
    "explanation": "The type of reproduction in Paramecium isasexual binary fissionin which a fully grown organism divides into two daughter cells. Paramecium also exhibits several types of sexual processes.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2369",
    "text": "A community with a population of two million three hundred and ten thousand people living in an area of two thousand three hundred and ten square kilometres has a population density of",
    "options": {
      "A": "10000",
      "B": "10",
      "C": "100",
      "D": "1000"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69992?exam_type=jamb&type=obj&page=474",
    "correct_answer": "D",
    "explanation": "The formula for population density is Dp = \\(\\frac{N}{A}\\)\n, where:   Dp = The population density\nN = The total number of individuals in the population\nA = The area, which can be measured in any land area unit, such as acres, meters, centimeters, or miles\nGiven: N = 2,310,000people ,  A = 2,310 km\\(^2\\)\nDp = \\(\\frac{N}{A}\\) = Dp = \\(\\frac{2,310,000}{2,310}\\)\n= 1,000\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2370",
    "text": "A succession that occurs in an area where there are no pre-existing community is called",
    "options": {
      "A": "tertiary succession",
      "B": "primary succession",
      "C": "post-primary succession",
      "D": "secondary succession"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69994?exam_type=jamb&type=obj&page=474",
    "correct_answer": "B",
    "explanation": "Primary succession is the ecological succession that occurs in an area where there is no pre-existing community. Primary succession is the process of colonization that begins when an area has no plant life, such as after a volcanic eruption or glacial retreat.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2371",
    "text": "Which of the following processes releases oxygen to the atmosphere?",
    "options": {
      "A": "Respiration",
      "B": "Combustion",
      "C": "Decomposition",
      "D": "photosynthesis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69996?exam_type=jamb&type=obj&page=475",
    "correct_answer": "D",
    "explanation": "Photosynthesis is the process that releases oxygen into the atmosphere.\nPhotosynthesis is a process that uses light energy from the sun to convert water and carbon dioxide into oxygen and organic compounds. This process is performed by green plants and certain other organisms, including phytoplankton in the oceans.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2372",
    "text": "The depressed side of paramecium which is lined with cilia leads to a tube-like structure called",
    "options": {
      "A": "anal pore",
      "B": "oral groove",
      "C": "gullet",
      "D": "food vacuole"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69998?exam_type=jamb&type=obj&page=475",
    "correct_answer": "C",
    "explanation": "The depressed side of a paramecium that is lined with cilia leads to a tube-like structure called thebuccal cavity,also known as thegullet.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2373",
    "text": "The rhizoid of liverwort is",
    "options": {
      "A": "unicellular and unbranched",
      "B": "multicellular and branched",
      "C": "unicellular and branched",
      "D": "multicellular and unbranched"
    },
    "answer_url": "https://myschool.ng/classroom/biology/69999?exam_type=jamb&type=obj&page=475",
    "correct_answer": "A",
    "explanation": "The rhizoids of liverworts areunicellularandunbranched.Rhizoids are root-like structures that anchor liverworts to the ground.\nIn contrast, mosses have multicellular rhizoids. In vascular plants, rhizoids are often called root hairs and can be unicellular or multicellular.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2374",
    "text": "In glycolysis, glucose is broken down through series of reactions in the presence of enzyme and absence of oxygen to produce",
    "options": {
      "A": "Acetyl-coenzyme + ATP",
      "B": "Phosphorylated glucose",
      "C": "pyruvic acid + ATP",
      "D": "Amino acid"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70000?exam_type=jamb&type=obj&page=475",
    "correct_answer": "C",
    "explanation": "Glycolysis is the first step in cellular respiration and occurs in the cytoplasm of cells. It's a series of ten enzymatic reactions that break down glucose into pyruvic acid. In glycolysis, glucose is broken down through a series of enzyme-catalyzed reactions to produce pyruvate, ATP, and NADH\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2375",
    "text": "Gaseous exchange takes place through the plasma membrane in",
    "options": {
      "A": "hydra",
      "B": "paramecium",
      "C": "flatworm",
      "D": "earthworm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70001?exam_type=jamb&type=obj&page=475",
    "correct_answer": "B",
    "explanation": "In unicellular organisms such as amoeba andparameciumexchange of gases takes place throughplasma membrane(also known as the cell membrane, the plasma membrane is found in all cells and separates the cell's interior from the outside environment) by simple diffusion. In earthworm, leech and frogs exchange of gases takes place through their moist skin.\nFlatworms are small, simple organisms that lack specialized circulatory and respiratory systems. Their flat shape and moist cells allow for quick diffusion of gases across theirouter membrane(the outer membrane is made up of phospholipids, proteins). This process is called direct diffusion.\nGaseous exchange in earthworms takes place through their moist skin and capillaries, not through the plasma membrane.  Earthworms don't have respiratory organs, so they exchange gases through their skin in a process called cutaneous respiration. The skin is covered with a thin layer of mucus that keeps the body moist and creates an environment for gas exchange.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2376",
    "text": "One of the characteristics of secondary succession is that it",
    "options": {
      "A": "starts on a bare surface",
      "B": "takes longer time to reach climax",
      "C": "starts on already colonized surface",
      "D": "starts with low organism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70002?exam_type=jamb&type=obj&page=476",
    "correct_answer": "C",
    "explanation": "Secondary succession is a natural ecological process that occurs when an area is disrupted, but some plants and animals still survive. A characteristic of secondary succession is that it starts on an already colonized surface. It may start with fairly complex organisms and it takes a shorter time or duration to reach a climax community.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2377",
    "text": "One of the components of xylem tissue is",
    "options": {
      "A": "companion cell",
      "B": "tracheid",
      "C": "sieve tube",
      "D": "epidermal"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70006?exam_type=jamb&type=obj&page=476",
    "correct_answer": "B",
    "explanation": "One of the components of xylem tissue istracheids.Tracheids areLong, tube-like cells with lignified walls and tapering ends that overlap with adjacent cells. Tracheids are dead and non-protoplasmic.\nCompanion cells are living cells in plants that are associated with sieve tube members in the phloem. They are responsible for loading and unloading sugars, and transporting macromolecules and signaling molecules.They are not found in Xylem tissue but exclusively in phloem. Also, sieve tubes are found in phloem while Xylem and phloem is a vascular tissue and an example of complex tissues, and not epidermal tissue.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2378",
    "text": "Which of the following statements explains the theory of natural selection?",
    "options": {
      "A": "There is no struggle for existence",
      "B": "New species get better adaptation",
      "C": "The weaker offspring are eliminated",
      "D": "Unused structures disappear later"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70008?exam_type=jamb&type=obj&page=476",
    "correct_answer": "C",
    "explanation": "The theory of natural selection, proposed by Charles Darwin, states that individuals with favorable traits are more likely to survive, reproduce, and pass those traits on to their offspring. Conversely, individuals with unfavorable traits are more likely to struggle, die off, or fail to reproduce, thereby eliminating those traits from the population.\nIn other words, natural selection acts on the variation within a population, favoring individuals with traits that enhance their survival and reproductive success, while eliminating those with traits that hinder their ability to survive and reproduce.\nSo, option C accurately reflects this concept.\nA. \"There is no struggle for existence\" is the opposite of what natural selection proposes.\nB. \"New species get better adaptation\" is a consequence of natural selection, but it doesn't explain the mechanism.\nD. \"Unused structures disappear later\" refers to the concept of vestigial structures, which is related to evolution, but not a direct explanation of natural selection.",
    "year": "2024"
  },
  {
    "number": "2379",
    "text": "The chemical and physical composition of soil is an example of",
    "options": {
      "A": "climatic factor",
      "B": "topographic factor",
      "C": "Edaphic factor",
      "D": "chemical factor"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70011?exam_type=jamb&type=obj&page=476",
    "correct_answer": "C",
    "explanation": "Climatic factors are environmental conditions that affect the climate of a region, such as temperature, precipitation, and solar radiation.\nTopographic factors are the features of the Earth's surface, such as its elevation, slope, and curvature.\nThe chemical and physical composition of soil is an example of an edaphic factor. Edaphic factors are abiotic factors that relate to the chemical or physical composition of soil in a specific area. E.g texture, porosity, bulk density etc\nChemical factors of soil include the concentrations of chemicals in the soil, the pH level, and the soil's cation exchange capacity.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2380",
    "text": "The abiotic factor that affect the population growth of an organism is",
    "options": {
      "A": "predator",
      "B": "rainfall",
      "C": "food shortage",
      "D": "disease"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70013?exam_type=jamb&type=obj&page=476",
    "correct_answer": "B",
    "explanation": "Abiotic factors are non-living, physical, and chemical elements that influence ecosystems and the communities of organisms within them. E.g temperature, water, soil,sunlight, rainfall etc\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2381",
    "text": "The cells responsible for transmitting messages to the effectors are",
    "options": {
      "A": "motor neurons",
      "B": "sensory neurons",
      "C": "hair cells",
      "D": "relay neurons"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70014?exam_type=jamb&type=obj&page=477",
    "correct_answer": "A",
    "explanation": "The cells that transmit messages to effectors aremotor neurons, also known as efferent neurons. They Transmit impulses from the central nervous system (CNS) to effectors, such as muscles and glands. Motor neurons typically have long axons and short dendrites. while the sensory neutrons transmit impulses from sense organs to the CNS. When a stimulus is detected, the information is converted to an electrical signal and sent through a sensory neuron.\nHair cells are sensory cells that convert mechanical force into electrical signals. They are found in the inner ear and are responsible for hearing and balance.\nRelay neurons are neurons in the central nervous system (CNS) that connect sensory neurons to motor neurons. They are found in the brain and spinal cord.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2382",
    "text": "The oxygen transported to all parts of the body during blood circulation is used for the",
    "options": {
      "A": "growth and development of cells",
      "B": "removal of waste products",
      "C": "release of energy from food",
      "D": "formation of carboxyl haemoglobin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70015?exam_type=jamb&type=obj&page=477",
    "correct_answer": "C",
    "explanation": "Oxygen transported to all parts of the body during blood circulation is used to release energy from food. When the red blood cells reach tissues that need oxygen, the oxygen is released from the haemoglobin and diffuses into the cells where it is used to make energy. All the systems in our body rely on oxygen to make energy.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2383",
    "text": "After fertilization in plants, the zygote develops into",
    "options": {
      "A": "fruit",
      "B": "an embryo",
      "C": "seed",
      "D": "an endosperm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70016?exam_type=jamb&type=obj&page=477",
    "correct_answer": "B",
    "explanation": "Afterfertilizationin plants, thezygotedevelops into anembryo, which is contained in theseed.\nAfter fertilization in plants, the zygote develops into an embryo, not a seed:\nFertilization: A sperm cell fuses with an egg cell to form a zygote.Zygote division: The zygote's cells divide, and the zygote develops into an embryo.Embryo storage: The embryo is stored in a seed capsule until environmental conditions are right for it to develop into a new plant.Seed development: The ovule develops into a seed, and the ovary develops into a fruit.Seed germination: When conditions are favorable, the embryo in the seed gives rise to a new plant.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2384",
    "text": "Use the diagram above to answer the question that follows\nThe organ is responsible for",
    "options": {
      "A": "production of heat",
      "B": "osmoregulation",
      "C": "vasoconstriction",
      "D": "production of hormones"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70017?exam_type=jamb&type=obj&page=477",
    "correct_answer": "B",
    "explanation": "The kidneys' primary function is osmoregulation, which is the process of regulating the balance of water and electrolytes in the body. The kidneys also produce urine, filter blood, and remove waste.\nVasoconstriction is narrowing or constriction of the blood vessels. It happens when smooth muscles in blood vessel walls tighten, which increases blood pressure.\nThe brain, liver, heart, skeletal muscles, and other organs produce heat in the body. The kidneys don't produce heat, but they do play a role in regulating body temperature. When the body is exposed to heat stress, the kidneys respond by redirecting blood flow to the skin to help the body lose heat. However, heat stress can also damage the kidneys.\nHormones are produced by endocrine glands, which are groups of cells located throughout the body. Yes, healthy kidneys produce hormones that help regulate many bodily functions, including blood pressure, bone health, and red blood cell production, but it's major function is osmoregulation - regulating the balancing of water and electrolytes in the body.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2385",
    "text": "Which of the following evidences of evolution employs the use of radio-isotope dating?",
    "options": {
      "A": "comparative anatomy",
      "B": "Embryology",
      "C": "Fossil records",
      "D": "vestigial organs"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70019?exam_type=jamb&type=obj&page=477",
    "correct_answer": "C",
    "explanation": "Scientists can roughly date fossils using radiometric dating, a process that measures theradioactive decay of certain elements. Fossils document the existence of now-extinct species, showing that different organisms have lived on Earth during different periods of the planet's history.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2386",
    "text": "Pentadactyl forelimb of vertebrate function due to differences in environment is",
    "options": {
      "A": "comparative anatomy",
      "B": "physiological evidence",
      "C": "embryological evidence",
      "D": "fossil records"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70020?exam_type=jamb&type=obj&page=478",
    "correct_answer": "B",
    "explanation": "A pentadactyl forelimb in vertebrates, meaning a forelimb with five digits, serves a variety of functions depending on the animal's environment, showcasing how a single basic structure can be adapted through evolution to suit different needs, like swimming, flying, running, or grasping, all while maintaining the underlying five-digit pattern as a result of shared ancestry.\nPhysiologicalevidenceis an evidence of evolution that deals with the functions of body parts among different species. For example, analogous structures are body parts of different species that have a similar function but can look different.\nMoreover,physiological evidencefocuses on thespecific functional mechanismsand processes that underline the pentadactyl limb's operation whilecomparative anatomyaddresses the evolutionary andanatomical origins of the pentadactyl plan. In other words, Anatomy is the study of the body's physical structure, while physiology is the study of how the body functions.\nWhile both comparative anatomy and physiological evidence can support the concept of the pentadactyl forelimb in vertebrates, the key difference lies in the focus of study:comparative anatomyexamines thestructural similarities in bone arrangement across different species, whereasphysiological evidenceinvestigates howthe limb functionsandadapts to different behaviours in each species; essentially, comparative anatomy looks at the \"blueprint\" of the limb, while physiology examines how that structure is used in different contexts.\nEmbryological evidence of the pentadactyl forelimb of vertebrates includes the regulation of gene expression during limb development.\nThe fossil record of pentadactyl forelimbs shows that many vertebrates have a similar bone structure, even though their limbs look different on the outside.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2387",
    "text": "The feeding relationship between ruminants and the bacteria in their digestive tract is",
    "options": {
      "A": "saprophytic",
      "B": "parasitic",
      "C": "symbiotic",
      "D": "heterotrophic"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70023?exam_type=jamb&type=obj&page=478",
    "correct_answer": "C",
    "explanation": "The relationship between ruminants and the bacteria in their digestive tract issymbiotic and mutualistic, meaning both organisms benefit from the interaction. The ruminant provides the bacteria with a warm, moist environment, a constant food supply, and a safe habitat, while the bacteria produce enzymes that break down complex compounds into simpler molecules that the ruminant's intestines can absorb. The bacteria also provide a protein source for the ruminant.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2388",
    "text": "A photosynthetic carnivorous plant which feeds on insects is",
    "options": {
      "A": "parasitic",
      "B": "saprophytic",
      "C": "herbivorous",
      "D": "insectivorous"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70026?exam_type=jamb&type=obj&page=478",
    "correct_answer": "D",
    "explanation": "The green plants which obtain their food partly from insects are calledinsectivorous plants. Example -Pitcher plant, Sundew plant, venus fly-trap plant etc.\nInsectivorous plants are carnivorous plants that eat insects. They are green and can photosynthesize to produce some of their food, but they also eat insects to obtain nitrogen for growth. Nitrogen is a key component of proteins, nucleic acids, and chlorophyll, which plants use for photosynthesis.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2389",
    "text": "Xerophytes are mostly found in the",
    "options": {
      "A": "arid land",
      "B": "tropical rainforest",
      "C": "montane forest",
      "D": "Sudan savanna"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70028?exam_type=jamb&type=obj&page=478",
    "correct_answer": "A",
    "explanation": "Xerophytes are plants that have adapted to survive in environments with little water, such as deserts, windy areas, or saline soil. Xerophytes are plants that are found indry habitats like the desert. They have special adaptations that help them survive in extreme dry conditions.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2390",
    "text": "In which zone of the marine habitat does the organisms require adaptation for attachment?",
    "options": {
      "A": "Supratidal",
      "B": "Subtidal",
      "C": "intertidal",
      "D": "abyssal zone"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70031?exam_type=jamb&type=obj&page=478",
    "correct_answer": "C",
    "explanation": "Organisms in the intertidal zone of the marine habitat require adaptations for attachment.\nThe intertidal zone is the area of the marine biome that's between the land and the open sea. Organisms in this zone need to be able to adapt to alternating wet and dry conditions as the tides come in and recede.\nIntertidal zone, also known as the littoral zone, organisms in this zone must adapt to alternating wet and dry conditions as tides come in and recede. They must also be able to withstand the damage caused by waves.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2391",
    "text": "Energy transfer in plants and animals are in the form of",
    "options": {
      "A": "DNA",
      "B": "ATP",
      "C": "GTP",
      "D": "RNA"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70033?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "Energy transfer in plants and animals occurs in the form of chemical energy, adenosine triphosphate (ATP), and heat.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2392",
    "text": "The pigment carrying oxygen in the blood is",
    "options": {
      "A": "plasma",
      "B": "haemoglobin",
      "C": "oxyhaemoglobin",
      "D": "erythrocytes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70036?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "Plasma is a liquid component of blood that carries blood cells and other vital substances throughout the body. It's also a state of matter, like solids, liquids, and gases. It is a light yellow liquid that contains water, salts, enzymes, and proteins. It contains clotting factors that help blood clot. It also contains antibodies that help fight infection.\nHemoglobin is the pigment that carries oxygen in the blood. Hemoglobin is a protein found in red blood cells (RBCs) that carries oxygen. It's also the reason why blood appears red. It picks up oxygen in the lungs and drops it off in other parts of the body.\nErythrocytes, also known as red blood cells (RBCs), are the most common type of blood cell in vertebrates. They are responsible for transporting oxygen and nutrients throughout the body.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2393",
    "text": "Production of healthier offspring, viable seeds and formation of new varieties are good characteristics",
    "options": {
      "A": "self pollination",
      "B": "cross pollination",
      "C": "wind pollination",
      "D": "insect pollination"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70045?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "Cross-pollination is a type of pollination that produces healthier offspring, viable seeds, and new varieties.\nCross-pollination involves the transfer of pollen from the anther of one flower to the stigma of a different flower. In contrast, self-pollination is when pollen is transferred within a flower or between flowers on the same plant. Self-pollination is effective in a stable environment, but it can lead to weak offspring that are less adapted to the environment.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2394",
    "text": "One of the following is a courtship behaviour in animals",
    "options": {
      "A": "fighting",
      "B": "display",
      "C": "hibernation",
      "D": "feeding"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70047?exam_type=jamb&type=obj&page=479",
    "correct_answer": "B",
    "explanation": "Courtship behavior is a series of actions that animals perform to find a mate and reproduce. Animals may display their beauty or strength to attract a mate.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2395",
    "text": "In blood transfusion, a patient with group AB receives",
    "options": {
      "A": "Group A, B, AB",
      "B": "Group O, A, B",
      "C": "Group O, B, AB",
      "D": "Group O, A, B, AB"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70049?exam_type=jamb&type=obj&page=479",
    "correct_answer": "D",
    "explanation": "A patient with type AB blood can receive red blood cells from any blood type( A, B,AB or O), making them sometimes known as universal recipients. This is because people with type AB blood do not produce anti-A or anti-B antibodies.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2396",
    "text": "A trait that is always expressed during crossing of hereditary characteristics is",
    "options": {
      "A": "recessive trait",
      "B": "dominant trait",
      "C": "homozygous trait",
      "D": "heterozygous trait"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70051?exam_type=jamb&type=obj&page=480",
    "correct_answer": "B",
    "explanation": "A dominant allele is a trait that is always expressed in an organism's phenotype, as long as at least one copy of the allele is present. An organism's observable traits are called its phenotype, while its underlying genetic makeup is called its genotype. A person's phenotype is determined by both their genotype and environmental factors.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2397",
    "text": "Blood group AB is considered as universal recipient because they can receive blood from groups",
    "options": {
      "A": "A and O",
      "B": "B and O",
      "C": "AB and O",
      "D": "A, B, AB and O"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70055?exam_type=jamb&type=obj&page=480",
    "correct_answer": "D",
    "explanation": "People with type AB blood are considered universal recipients because they can receive blood from all blood groups A, B, or O without the risk of adverse effects. This is because people with type AB blood have both A and B antigens on their red blood cells, but no antibodies in their plasma.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2398",
    "text": "An example of organism that exhibits counter-shading to escape from its predator is",
    "options": {
      "A": "grasshopper",
      "B": "toad",
      "C": "fish",
      "D": "chameleon"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70058?exam_type=jamb&type=obj&page=480",
    "correct_answer": "C",
    "explanation": "Counter-shading is a form of camouflage that helps organisms blend into their surroundings. Counter-shading is a coloration pattern where the parts of an animal that are usually in shadow are lighter in colour, and the parts that are usually in light are darker. This makes the animal more difficult to detect by reducing the contrast between the animal and its background.\nChameleons do not exhibit counter-shading, but they do have active camouflage that allows them to change their colour to match their environment. This pattern is used by many animals, including fish, birds, reptiles, mammals, etc.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2399",
    "text": "A form of adaptive colouration that helps animals to remain unnoticed is",
    "options": {
      "A": "hibernation",
      "B": "aestivation",
      "C": "countershading",
      "D": "migration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70059?exam_type=jamb&type=obj&page=480",
    "correct_answer": "C",
    "explanation": "Hibernation is a natural behavior that allows animals to survive the winter by slowing down their metabolism and body temperature. Hibernating animals use stored fat for energy while they are inactive.\nAestivation is a state of dormancy that animals enter during hot and dry periods to conserve energy and avoid dehydration. It's similar to hibernation, but occurs in the summer instead of winter.\nCounter-shading is a camouflage technique where an animal's upper body is darker and its lower body is lighter. It is an adaptive feature that enables animals to remain undetected or unnoticed.\nAnimal migration is when animals move from one place to another in a regular pattern. Migrations can be seasonal, but other factors like rainfall can also influence them.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2400",
    "text": "Use the diagram above to answer the question that follows\nThe part labelled III is",
    "options": {
      "A": "abdomen",
      "B": "head",
      "C": "maxillae",
      "D": "thorax"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70061?exam_type=jamb&type=obj&page=480",
    "correct_answer": "D",
    "explanation": "I - Pincers(maxillae)\nII - Head\nIII - Thorax\nIV - Abdomen\n(See diagram below)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2401",
    "text": "Lamarck's theory of evolution is based on the idea of",
    "options": {
      "A": "the inheritance of acquired traits",
      "B": "organisms' survival of the fittest",
      "C": "organisms constantly struggling for existence",
      "D": "plenty offspring produced by organisms"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70063?exam_type=jamb&type=obj&page=481",
    "correct_answer": "A",
    "explanation": "Jean-Baptiste Lamarck's theory of evolution, also known as Lamarckism, is based on the idea that organisms can pass on physical characteristics they acquire during their lifetime to their offspring. This is also known as the inheritance of acquired characteristics or soft inheritance.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2402",
    "text": "How many chromosomes will be present in a gamete if the somatic cell has 8 chromosomes?",
    "options": {
      "A": "16",
      "B": "6",
      "C": "4",
      "D": "8"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70065?exam_type=jamb&type=obj&page=481",
    "correct_answer": "C",
    "explanation": "Somatic cells are diploid, meaning they have two sets of chromosomes, one from the mother and one from the father. During mitosis, somatic cells replicate their DNA and divide to produce two daughter cells that each receive a complete copy of the genome.\nIf a somatic cell has 8 chromosomes, then the gamete will have 4 chromosomes. This is because gametes have half the number of chromosomes as somatic cells.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2403",
    "text": "Use the diagram above to answer the question that follows\nWhat is the genotypic ratio of the offspring produced in F\\(_1\\) generation?",
    "options": {
      "A": "2:1:1",
      "B": "1:2:1",
      "C": "2:2",
      "D": "3:1"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70068?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "Since offsprings for F\\(_1\\)  are  AA  AS  AS  SS\nPhenotypic ratio :     3: 1\nGenotypic ratio : 1 AA  : 2 AS : 1 SS  ⇒  1:  2: 1\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2404",
    "text": "Body temperature, thirst and hunger are regulated by",
    "options": {
      "A": "thalamus",
      "B": "hypothalamus",
      "C": "medulla oblongata",
      "D": "spinal cord"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70071?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "The thalamus is a part of the brain that relays sensory and motor signals, and regulates consciousness, alertness, learning, and memory.\nThe hypothalamus, a part of the brain, regulates body temperature, thirst, and hunger. It produces hormones that control many bodily functions, including body temperature, heart rate, hunger, mood, and sleep.\nThe medulla oblongata controls vital functions like breathing, heart rate, and blood pressure.\nThe spinal cord acts as a communication pathway between the brain and the rest of the body, carrying sensory information from the body to the brain and motor commands from the brain to the muscles, while also coordinating reflexes independently of the brain.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2405",
    "text": "Cell division that involves the growth, development, repairs and replacement of worn out tissues is",
    "options": {
      "A": "biosynthesis",
      "B": "mitosis",
      "C": "meiosis",
      "D": "synthesis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70075?exam_type=jamb&type=obj&page=481",
    "correct_answer": "B",
    "explanation": "Biosynthesis is the process by which living organisms create new chemical compounds from nutrients. It involves chemical reactions that occur within cells.\nMitosis is the type of cell division that is responsible for growth, development, repair, and replacement of worn out tissues. The process of mitosis generates new cells that are genetically identical to each other. Mitosis helps organisms grow in size and repair damaged tissue.\nMeiosis is a type of cell division that produces reproductive cells, or gametes, like eggs and sperm.\nSynthesis refers specifically to the process of building compounds from more elementary substances by means of one or more chemical reactions.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2406",
    "text": "Use the diagram to answer the question that follows\nThe flower of plants belongs to part labelled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70122?exam_type=jamb&type=obj&page=482",
    "correct_answer": "C",
    "explanation": "The flower is the reproductive organ of a plant. It is a plant organ, which is defined as a group of tissues that work together to perform a specific function.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2407",
    "text": "The bacteria in the large intestine of man synthesizes",
    "options": {
      "A": "vitamins and minerals",
      "B": "vitamins and glucose",
      "C": "amino acids and vitamins",
      "D": "amino acids and minerals"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70124?exam_type=jamb&type=obj&page=482",
    "correct_answer": "C",
    "explanation": "The bacteria in the colon produce large amounts ofvitamins B and Kthroughfermentation.Vitamin K is a fat-soluble vitamin that helps blood clot and prevents excessive bleeding. Bacteria in the large intestine synthesize vitamins, not minerals, neither do they synthesize glucose but they do play a role in other processes that are important for the body.\nAlso, bacteria in the large intestine can synthesize amino acids. This process helps regulate the body's amino acid balance.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2408",
    "text": "The main excretory product of earthworm is",
    "options": {
      "A": "ammonia",
      "B": "carbon dioxide",
      "C": "urea",
      "D": "uric acid"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70125?exam_type=jamb&type=obj&page=482",
    "correct_answer": "C",
    "explanation": "The main excretory product of an earthworm is urea, with some ammonia gas also being released.\nEarthworm is an annelid whose major excretory products are:Urea ~ 50%, Ammonia ~ 20-40% , Creatinine and other nitrogenous compounds ~ 5%\nUric acid is the main excretory product of birds, reptiles, and some insects.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2409",
    "text": "Which of the following conditions causes aestivation in animals?",
    "options": {
      "A": "Wind",
      "B": "Drought",
      "C": "Rain",
      "D": "Cold"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70126?exam_type=jamb&type=obj&page=482",
    "correct_answer": "B",
    "explanation": "Aestivation is a state of dormancy or reduced activity that animals enter to survive in hot, dry conditions or when food or water is scarce.\nDrought is a primary trigger for aestivation in animals, as it leads to water scarcity and increased temperatures.\nWhile strong winds can be uncomfortable for animals, they don't typically trigger aestivation.\nRain is often associated with cooler temperatures and increased water availability.\nCold temperatures are more likely to trigger hibernation not aestivation.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2410",
    "text": "An instrument used for measuring the intensity of light",
    "options": {
      "A": "thermometer",
      "B": "photometer",
      "C": "anemometer",
      "D": "hygrometer"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70128?exam_type=jamb&type=obj&page=482",
    "correct_answer": "B",
    "explanation": "Photometers measure the strength of electromagnetic radiation, including visible light, ultraviolet light, gamma rays, and x-rays.\nAn anemometer measures wind speed, wind direction, and the strength of gusts.\nA hygrometer measures the amount of water vapour, or humidity, in the air or another gas.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2411",
    "text": "A common component of blood and lymph is",
    "options": {
      "A": "fats",
      "B": "plasma",
      "C": "red blood cell",
      "D": "white blood cell"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70130?exam_type=jamb&type=obj&page=483",
    "correct_answer": "D",
    "explanation": "White blood cells, also known as leukocytes, are a common component of both blood and lymph.\nWhite blood cells: These cells are made in the bone marrow and help the body fight infection. They are a key part of the immune system's reaction to foreign substances in the body.Lymph: This fluid is similar in composition to blood plasma and is derived from it. It contains lymphocytes, which are a type of white blood cell. Lymph is part of the lymphatic system, which helps the body defend itself.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2412",
    "text": "The part of the kidney where the selective reabsorption takes place is",
    "options": {
      "A": "glomerulus",
      "B": "Bowman's capsule",
      "C": "Henle's loop",
      "D": "urethra"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70132?exam_type=jamb&type=obj&page=483",
    "correct_answer": "C",
    "explanation": "The glomerulus is a cluster of capillaries in the kidney that filters blood to remove waste and extra water. The filtered waste and water are then excreted from the body in urine.\nBowman's capsule is a cup-shaped sac in the kidney that filters blood to create urine. It's part of the nephron, which is the filtration structure in the kidney.\nSelective reabsorption of useful substances occurs inthe proximal convoluted tubule,the loop of Henleand the collecting duct. The loop of Henle is a U-shaped tubule in the kidney's medulla that reabsorbs water and salt from the filtrate.\nThe urethra's main function is to allow urine to pass out of the body. It also allows semen to pass through in males.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2413",
    "text": "The schlerenchyma tissues consist of",
    "options": {
      "A": "dead cell",
      "B": "living cell",
      "C": "tracheid cell",
      "D": "meristematic cell"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70134?exam_type=jamb&type=obj&page=483",
    "correct_answer": "A",
    "explanation": "Sclerenchyma tissue is made up ofdead cellswith thick walls that contain lignin and cellulose.\nparenchyma cells are living cells. They are the main component of the soft tissues in plants, and are found in leaves, stems, roots, and fruits.\nTracheid cells are specialized cells that dead at maturity and are responsible for transporting water and minerals from the roots to the rest of the plant. They are joined end-to-end to form a tube-like structure.\nSome parenchyma cells come from meristematic cells, but not all parenchyma cells are meristematic.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2414",
    "text": "The number of vertebrae in the human vertebral column is",
    "options": {
      "A": "30",
      "B": "33",
      "C": "38",
      "D": "39"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70136?exam_type=jamb&type=obj&page=483",
    "correct_answer": "B",
    "explanation": "The human vertebral column, also known as the spinal column or backbone, has 33 vertebrae:\nCervical: 7 vertebrae (neck region)Thoracic: 12 vertebrae (Chest cavity)Lumbar: 5 vertebrae (in the lower back, between the thoracic vertebrae and the pelvis)Sacral: 5 vertebrae that fuse together to form the sacrum (at the base of the spine)Caudal: 4 vertebrae that fuse together to form the coccyx (in the tail region, posterior to the anus)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2415",
    "text": "The organisms that adopt swarming as an adaptation to overcome overcrowding are",
    "options": {
      "A": "Agama lizard",
      "B": "tilapia",
      "C": "rats",
      "D": "termites"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70137?exam_type=jamb&type=obj&page=483",
    "correct_answer": "D",
    "explanation": "Swarming is a coordinated collective motion that can be seen in both animate and inanimate systems. For example, when ants get crowded, they coordinate waves of activity every 20 minutes. Social insects like ants and honey bees, as well as non-social insects like flies, moths, cockroaches, and locusts.Termites swarm after their original colony has reached a certain capacity leveland is ready to expand.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2416",
    "text": "Loamy soil is characterized by",
    "options": {
      "A": "low humus and high porosity",
      "B": "high humus and high porosity",
      "C": "moderate humus and low porosity",
      "D": "high humus and moderate porosity"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70139?exam_type=jamb&type=obj&page=484",
    "correct_answer": "D",
    "explanation": "Loam soil is considered the \"friendliest\" soil to cultivate. It's also relatively resistant to drought, warms up early in the spring, and is moderately easy to work. Loamy soil has moderate porosity. Loam is a mixture of sand, silt, and clay in roughly equal amounts, which results in a soil that's airy and not too dry.\nSandy soil:Highly porous because it's made up of large granules and sometimes pebbles. Sandy soil loses moisture easily.\nClayey soil: Very low porosity because it's made up of very fine particles that are tightly packed together. Clayey soil is sticky and heavy.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2417",
    "text": "The cone in the retina of eye is an example of",
    "options": {
      "A": "cell",
      "B": "tissue",
      "C": "organ",
      "D": "system"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70140?exam_type=jamb&type=obj&page=484",
    "correct_answer": "A",
    "explanation": "Cones in the retina of the eye are photoreceptor cells, which are responsible for colour vision, visual acuity, and daylight vision.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2418",
    "text": "The part of the flower that develops into seed is",
    "options": {
      "A": "ovule",
      "B": "pedicel",
      "C": "petal",
      "D": "style"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70178?exam_type=jamb&type=obj&page=484",
    "correct_answer": "A",
    "explanation": "The ovule, which is located inside the ovary of a flower, develops into a seed after fertilization. After fertilization, the ovary grows and matures into a fruit, which encloses the seeds.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2419",
    "text": "Which of these is a medium of transportation in plants?",
    "options": {
      "A": "cell sap",
      "B": "Nucleus",
      "C": "Mitochondrion",
      "D": "Ribosome"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70183?exam_type=jamb&type=obj&page=484",
    "correct_answer": "A",
    "explanation": "Cell Sap is a fluid transported in xylem cells (vessel elements or tracheids) or phloem sieve tube elements of a plant. These cells transport water and nutrients throughout the plant.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2420",
    "text": "Which of the following is a viral disease?",
    "options": {
      "A": "Syphilis",
      "B": "Measles",
      "C": "Cholera",
      "D": "Typhoid"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70184?exam_type=jamb&type=obj&page=484",
    "correct_answer": "B",
    "explanation": "Syphilis is a bacterial sexually transmitted infection (STI).\nMeasles is caused by the measles virus, a highly contagious RNA virus.It spreads through the air when an infected person breathes, coughs, or sneezes. It can also spread through direct contact with secretions.\nCholera is a bacterial infection of the intestines caused by the bacterium Vibrio cholerae.\nTyphoid fever is a bacterial infection that can be life-threatening if left untreated. It's caused by the Salmonella Typhi bacteria, which is related to the bacteria that cause salmonella food poisoning.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2421",
    "text": "Use the diagram above to answer the question that follows\nThe experiment is set up to determine the presence of",
    "options": {
      "A": "chlorophyll",
      "B": "starch",
      "C": "oxygen",
      "D": "pigment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70187?exam_type=jamb&type=obj&page=485",
    "correct_answer": "B",
    "explanation": "The experiment is set up to determine the presence of starch. When Iodine is added to the parboiled leaf, a blue-black or brown colour is observed. This indicates the presence of starch and vice versa.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2422",
    "text": "The type of circulatory system found in arthropods and some molluscs is",
    "options": {
      "A": "open circulatory system",
      "B": "closed circulatory system",
      "C": "single circulatory system",
      "D": "double circulatory system"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70190?exam_type=jamb&type=obj&page=485",
    "correct_answer": "A",
    "explanation": "Arthropods and most molluscs have an open circulatory system.  In an open circulatory system, blood is pumped from the heart into a body cavity, called a hemocoel, instead of being enclosed in blood vessels. The blood, called hemolymph, mixes with interstitial fluid and circulates around the organs as the animal moves. The blood returns to the heart through small pores called ostia.\nA closed circulatory system is a system where blood flows through a network of vessels, or tubes, that are connected to each other. The heart pumps blood through the system in a continuous loop. Many animals have a closed circulatory system, including all mammals, birds, fish, reptiles, amphibians, and some invertebrates.\nA single circulatory system is a type of circulatory system where blood passes through the heart only once during each complete circuit of the body, meaning it only travels through the heart one time before returning to it. e.g fishes, invertebrates and some amphibians etc\nA double circulatory system is a system where blood passes through the heart twice during each circuit of the body. This system is found in mammals, including humans.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2423",
    "text": "In plants, the main excretory product produced during metabolism is",
    "options": {
      "A": "oxygen",
      "B": "alkaloids",
      "C": "carbon(iv)oxide",
      "D": "mucilage"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70191?exam_type=jamb&type=obj&page=485",
    "correct_answer": "C",
    "explanation": "The main excretory products of plants during metabolism are carbon dioxide, excess water, and nitrogenous compounds.\nPlantsproducecarbon dioxideas a metabolic waste productduring respiration, whileoxygenis a metabolic waste product fromphotosynthesis.Excretion of gaseous waste in plants takes placethrough stomatal pores on leaves. Oxygen released during photosynthesis is used for respiration while carbon dioxide released during respiration is used for photosynthesis.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2424",
    "text": "Use the diagram above to answer the questions that follow\nThe part labelled I is",
    "options": {
      "A": "oviduct",
      "B": "placenta",
      "C": "amnion",
      "D": "uterus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70193?exam_type=jamb&type=obj&page=485",
    "correct_answer": "A",
    "explanation": "The oviduct is a muscular, J-shaped tube that carries eggs from the ovaries to the uterus. It's a vital part of the female reproductive system, and fertilization typically occurs in the oviduct. The tube that connects the ovary to the uterus is called the fallopian tube. There are two fallopian tubes, one on each side of the uterus. It is also called the oviduct.\nThe placenta isan organ that forms in the womb, also called the uterus, during pregnancy. The placenta is connected to a developing baby by a tube-like structure called the umbilical cord. Through the umbilical cord, the placenta provides oxygen and nutrients to a developing baby.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2425",
    "text": "Comparative anatomy to study evidence for evolution depends on",
    "options": {
      "A": "four fingered",
      "B": "three fingered",
      "C": "two fingered",
      "D": "five fingered"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70676?exam_type=jamb&type=obj&page=485",
    "correct_answer": "D",
    "explanation": "Comparative anatomy is the study of similarities and differences in the anatomy of different species. It indicates that organisms share a common ancestor. Pentadactyl forelimb of vertebrate\n(see diagram above)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2426",
    "text": "Iron is an essential nutrient in plants because it",
    "options": {
      "A": "aids in the formation of chlorophyll and proteins",
      "B": "helps in cell division",
      "C": "protects the plants from pest attack",
      "D": "fastens fruits maturation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70677?exam_type=jamb&type=obj&page=486",
    "correct_answer": "A",
    "explanation": "Iron is a key component in the production of chlorophyll, which is essential for photosynthesis. It serves as a component of many vital enzymes such as cytochromes of the electron transport chain, and it is thus required for a wide range of biological functions. In plants, iron isinvolved in the synthesis of chlorophyll, and it is essential for the maintenance of chloroplast structure and function.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2427",
    "text": "The endocrine gland that is called the master gland is the",
    "options": {
      "A": "thyroid gland",
      "B": "pancreas",
      "C": "pituitary gland",
      "D": "adrenal gland"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70678?exam_type=jamb&type=obj&page=486",
    "correct_answer": "C",
    "explanation": "The pituitary gland is known as the \"master gland\" because it controls the functions of many other endocrine glands in the body. The pituitary gland is a small, pea-sized gland located at the base of the brain, in line with the top of the nose.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2428",
    "text": "Which of the following characteristics is possessed by both living and non-living things?",
    "options": {
      "A": "Both age and die",
      "B": "Both have life",
      "C": "Both have weight",
      "D": "Both have no shape"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70749?exam_type=jamb&type=obj&page=486",
    "correct_answer": "C",
    "explanation": "Both living and non-living things are matters. Matters are defined to be anything (living nad non-living things) that has mass and occupies space.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2429",
    "text": "Infectious diseases are caused by",
    "options": {
      "A": "bacteria",
      "B": "protists",
      "C": "Amoeba",
      "D": "protozoa"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70752?exam_type=jamb&type=obj&page=486",
    "correct_answer": "A",
    "explanation": "Infectious diseases are diseases caused by microorganisms like bacteria, viruses, fungi, or parasites that enter the body and multiply, damaging cells and causing an infection.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2430",
    "text": "The cell organelle responsible for the synthesis of protein is the",
    "options": {
      "A": "centriole",
      "B": "vacuole",
      "C": "plastid",
      "D": "ribosome"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70753?exam_type=jamb&type=obj&page=486",
    "correct_answer": "D",
    "explanation": "Centrioles are organelles that help organize microtubules, cell division, and the assembly of cilia and flagella.\nVacuoles are organelles that help cells store, transport, and manage waste. They are found in plant, animal, fungal, and protist cells.\nPlastids are organelles in plant cells that perform a variety of functions, including photosynthesis, storage, and biosynthesis.\nRibosomes are organelles in cells that synthesize proteins by reading messenger RNA (mRNA) and translating the genetic code into amino acids.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2431",
    "text": "Use the diagram above to answer the question that follows\nThe diagram demonstrates",
    "options": {
      "A": "thigmotropism",
      "B": "phototropism",
      "C": "geotropism",
      "D": "hydrotropism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70754?exam_type=jamb&type=obj&page=487",
    "correct_answer": "B",
    "explanation": "Thigmotropism is a directional growth movement which occurs as a mechanosensory response to a touch stimulus. Mechanosensory responses in plants are the ways that plants move or change shape in response to touch, wind, or other mechanical stimuli.\nPhototropism is the ability of plants to grow towards or away from light, which is a vital adaptive process for plants.\nGeotropism is the growth of the parts of plants in response to the force of gravity.\nHydrotropism is a plant's growth response in which the direction of growth is determined by a stimulus or gradient in water concentration. It is the growth or turning of plant roots towards or away from moisture.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2432",
    "text": "Which of the following factors can lead to overcrowding?",
    "options": {
      "A": "Emigration",
      "B": "Competition",
      "C": "High natality",
      "D": "High mortality"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70791?exam_type=jamb&type=obj&page=487",
    "correct_answer": "C",
    "explanation": "High natality, also known as a high birth rate, is when a population has a high number of births per person in a given amount of time. It's usually measured in relation to the population size, such as the number of births per 1,000 people in a year.\nHigh natality, or fertility rate, can lead to overcrowding if the population outgrows the available resources.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2433",
    "text": "The common examples of trees found in the desert are",
    "options": {
      "A": "raffia palm and coconut",
      "B": "baobab and cacti",
      "C": "white and red mangrove",
      "D": "shea-butter and isobelina"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70794?exam_type=jamb&type=obj&page=487",
    "correct_answer": "B",
    "explanation": "Raffia palm and Coconut are  common features in tropical rainforests.\nDesert plants are adapted to survive in regions with high temperature and less moisture content in the soil. Cactus, baobao and acacia trees are examples of desert plants.\nWhite and red Mangrove grow mainly at tropical and subtropical latitudes because mangrove trees cannot withstand freezing temperatures.\nIsoberlinia doka is a hardwoodtreenative to African tropical savannas and Guinean forest-savanna\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2434",
    "text": "If the F1 generation allows for self-pollination, what will be the genotypic ratio of the offspring?",
    "options": {
      "A": "1 : 2 : 1",
      "B": "2 : 2",
      "C": "3 : 1",
      "D": "2 : 1 : 1"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70795?exam_type=jamb&type=obj&page=487",
    "correct_answer": "A",
    "explanation": "Self-pollination is the transfer of pollen grains from the anther to the stigma of the same flower.If the F1 generation self-pollinates, the genotypic ratio of the offspring will depend on the genotype of the F1 generation. The genotypic ratio is 1:2:1\n(See diagram above)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2435",
    "text": "The resemblance of an organism to another organism as means of enhancing it's chances of survival in its habitat is known as",
    "options": {
      "A": "counter shading",
      "B": "protective colouration",
      "C": "mimicry",
      "D": "warning"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70796?exam_type=jamb&type=obj&page=487",
    "correct_answer": "C",
    "explanation": "Mimicry is a biological phenomenon where organisms that are not closely related resemble each other. This resemblance can be between different species or between individuals of the same species.\nWhen an organism resembles another organism to improve its chances of survival, it's calledmimicry.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2436",
    "text": "The urinary tubules opens into a proximal convoluted tubule coils to form distal by making a",
    "options": {
      "A": "Z- shaped loop",
      "B": "L- shaped loop",
      "C": "U- shaped loop",
      "D": "I- shaped loop"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70798?exam_type=jamb&type=obj&page=488",
    "correct_answer": "C",
    "explanation": "The urinary tubules open into a proximal convoluted tubule to form a U-shaped loop called the loop of Henle. The loop of Henle transfers fluid from the proximal to the distal tubule. The loop of Henle's two main functions are to dilute urine and establish an osmotic gradient.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2437",
    "text": "A discontinuous morphological variation often used in crime detection is the",
    "options": {
      "A": "skin colour",
      "B": "blood group",
      "C": "finger prints",
      "D": "eye colour"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70799?exam_type=jamb&type=obj&page=488",
    "correct_answer": "C",
    "explanation": "Continuous variation refers to a characteristic within a species that can vary gradually across a range of values, like height or weight, where individuals can fall anywhere along a spectrum.Discontinuous variation is when a characteristic has a limited number of possible values, and individuals fall into distinct categories. For example, Blood type(People can only have one of the four blood types: A, B, AB, or O), Gender(People are either male or female) , Eye colour(Eyes can only be a certain colour) etc\nFingerprints are a type of discontinuous morphological variation, which means that the differences between variants are more qualitative than quantitative. Morphological variations are variations in physical traits or outward appearances. Fingerprints are an important method of forensic science, and recovering partial fingerprints from a crime scene is a common technique\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2438",
    "text": "The component that serves as major buffer in blood is",
    "options": {
      "A": "plasma",
      "B": "erythrocytes",
      "C": "leucocytes",
      "D": "lymph"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70800?exam_type=jamb&type=obj&page=488",
    "correct_answer": "A",
    "explanation": "A \"blood buffer\" refers to a chemical system within the blood, that helps maintain a stable pH level by neutralizing added acids or bases, ensuring proper bodily functions can occur;\nPlasmais the liquid component of blood, in which the red blood cells, white blood cells, and platelets are suspended.Plasmais the component of blood that acts as the major buffer, maintaining a normal pH level that supports cell function.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2439",
    "text": "DNA carries the genetic information and are generally found in the",
    "options": {
      "A": "ribosomes",
      "B": "chromosomes",
      "C": "blood",
      "D": "enzymes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70813?exam_type=jamb&type=obj&page=488",
    "correct_answer": "B",
    "explanation": "DNA is the material that contains genes and is the building block of the human body. DNA is made up of two strands that twist into a spiral ladder called a helix.\nDNA is packaged into chromosomesto protect it and to regulate which genes are accessed and when. Chromosomes are not visible in the cell's nucleus when the cell is not dividing, but they become more tightly packed and visible during cell division.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2440",
    "text": "Use the diagram above to answer the question that follows:\nRecombination of genes at fertilization is represented by the part labelled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70821?exam_type=jamb&type=obj&page=488",
    "correct_answer": "C",
    "explanation": "During prophase I, homologous chromosomes from each parent pair up and exchange genetic material, a process known as crossing over. This process creates new combinations of genes in the resulting gametes. When two gametes unite during fertilization, the offspring will have a unique combination of DNA.\nGenetic recombination during fertilization takes place in the prophase I stage of meiosis ( part labelled III)\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2441",
    "text": "Hemophilia in humans is controlled by the",
    "options": {
      "A": "blood group",
      "B": "dominant gene",
      "C": "rhesus factor",
      "D": "recessive gene"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70858?exam_type=jamb&type=obj&page=489",
    "correct_answer": "D",
    "explanation": "Hemophilia is a rare,genetic blood disorderthat happens when your blood doesn't clot and make your bleeding slow down or stop.Most people who have hemophilia are born with it. It is inherited (passed down) from a parent to a child.Itis a chromosomally linked recessive disorder, the result of a mutated gene on the X chromosome. Because those assigned male at birth only have one X chromosome, they can develop hemophilia if they inherit the altered gene.\nThe X-linked recessive inheritance pattern explains why hemophilia is more common in males than females. Females can be carriers of the mutated gene, but they are less likely to develop the disorder themselves. In summary, hemophilia in humans controlled by recessive genes.\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2442",
    "text": "The part of the brain that receives sensory impulses of smell is the",
    "options": {
      "A": "olfactory lobe",
      "B": "medulla oblongata",
      "C": "cerebrum",
      "D": "Cerebellum"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70859?exam_type=jamb&type=obj&page=489",
    "correct_answer": "A",
    "explanation": "TheOlfactory lobeis the portion of the cerebral cortex concerned with the sense of smell. It is part of the Cerebrum. It is a structurally distinct cortical region on the ventral surface of the forebrain, composed of several areas.\nThe medulla oblongata controls vital functions like breathing, heart rate, and blood pressure.\nThe cerebrum, the largest part of the brain, is responsible for controlling conscious thought, actions, emotions, memory, language, reasoning, and sensory perception, essentially acting as the center for higher-level cognitive functions like thinking, learning, and problem-solving;\nThe cerebellum's primary function is to coordinate movement, maintain balance and posture, regulate muscle tone, and facilitate motor learning, essentially ensuring smooth and precise muscle control by processing information from other brain areas and sensory receptors;\nThere is an explanation video availablebelow.",
    "year": "2024"
  },
  {
    "number": "2443",
    "text": "Use the diagram above to answer the question that follows.\nExamples of non-vascular plants are labelled",
    "options": {
      "A": "I and II",
      "B": "I and III",
      "C": "II and III",
      "D": "II and IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/70877?exam_type=jamb&type=obj&page=489",
    "correct_answer": "A",
    "explanation": "Marchantiais a member of the Marchantiaceae, the Marchantia family. This family is one of many thalloid liverwort families orbryophyta. A thalloid liverwort is strap-like and often forms large colonies on the surface on which it grows. A liverwort is non-vascular green plant.\nSpirogyrais a green algae that is a member of theThallophytadivision. It is also known as water silk, mermaid's tresses, and blanket weed.\nDryopteris, also known as woodferns,male ferns, or buckler ferns, is a genus of ferns in the Dryopteridaceae family, ofpteridophyta.\nCycadsare part of the order Cycadales and the division Cycadophyta, which are both groups ofgymnosperms.\nMaizebelongs to the groupangiosperms. Angiosperms are plants that have a well-developed vascular system\nOnly bryophytes(Marchantia) -  I and Thallophytes (Spirogyra) - II are non- vascular, others have vascular systems. Therefore option A is the correct answer.\nThere is an explanation video availablebelow.",
    "year": "2024"
  }
]