[
  {
    "number": "2303",
    "text": "The Babylonian Exile was a consequence of",
    "options": {
      "A": "The division of the kingdom into Israel and Judah",
      "B": "The Israelites' disobedience to God and their social injustices",
      "C": "The Israelites' refusal to pay tribute to Babylon",
      "D": "The Assyrian invasion and destruction of Jerusalem"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67914?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "The Babylonian Exile was a consequence of the Israelites' disobedience to God and their social injustices. The Bible records that the Israelites had turned away from God and were worshipping idols, and their society was marked by injustice and oppression. God allowed the Babylonians to conquer them as a punishment for their sins.",
    "year": "2023"
  },
  {
    "number": "2304",
    "text": "Which prophet confronted King Ahab and challenged the prophets of Baal on Mount Carmel?",
    "options": {
      "A": "Isaiah",
      "B": "Elijah",
      "C": "Ezekiel",
      "D": "Jeremiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67915?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "The prophet Elijah confronted King Ahab and challenged the prophets of Baal on Mount Carmel. This is recorded in the Book of Kings in the Bible. Elijah's challenge was a demonstration of God's power over the false gods of Baal.",
    "year": "2023"
  },
  {
    "number": "2305",
    "text": "Which prophet warned the people of Nineveh about God's impending judgment?",
    "options": {
      "A": "Micah",
      "B": "Jonah",
      "C": "Amos",
      "D": "Nahum"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67916?exam_type=jamb&type=obj&page=461",
    "correct_answer": "B",
    "explanation": "The prophet Jonah was the one who warned the people of Nineveh about God's impending judgment. This is recorded in the Book of Jonah in the Bible.",
    "year": "2023"
  },
  {
    "number": "2306",
    "text": "The downfall of the Northern Kingdom of Israel was mainly due to",
    "options": {
      "A": "Invasion by the Philistines",
      "B": "Division and infighting among tribes",
      "C": "The rise of powerful neighboring kingdoms",
      "D": "Rejection of the Mosaic Law"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67917?exam_type=jamb&type=obj&page=462",
    "correct_answer": "D",
    "explanation": "The downfall of the Northern Kingdom of Israel was mainly due to the rejection of the Mosaic Law. This led to moral decay and spiritual decline, which eventually led to their downfall.",
    "year": "2023"
  },
  {
    "number": "2307",
    "text": "The Book of Lamentations is traditionally attributed to which prophet and describes the sorrow and mourning over the fall of Jerusalem?",
    "options": {
      "A": "Ezekiel",
      "B": "Amos",
      "C": "Daniel",
      "D": "Jeremiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67918?exam_type=jamb&type=obj&page=462",
    "correct_answer": "D",
    "explanation": "The Book of Lamentations is traditionally attributed to the prophet Jeremiah. It describes the sorrow and mourning over the fall of Jerusalem in 586 B.C. by the Babylonians. Jeremiah, often referred to as the 'weeping prophet', laments over the destruction of Jerusalem and the Temple, expressing the pain and confusion of the people.",
    "year": "2023"
  },
  {
    "number": "2308",
    "text": "According to the Apostle Peter, what will happen to the heavens and the earth on the day of the Lord's return?",
    "options": {
      "A": "They will merge into a new dimension",
      "B": "They will be destroyed by fire",
      "C": "They will be transformed into paradise",
      "D": "They will disappear completely"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67920?exam_type=jamb&type=obj&page=462",
    "correct_answer": "B",
    "explanation": "According to the Apostle Peter, the heavens and the earth will be destroyed by fire on the day of the Lord's return. This is mentioned in 2 Peter 3:10, where Peter describes the day of the Lord as a time when the heavens will disappear with a roar, the elements will be destroyed by fire, and the earth and everything in it will be laid bare.",
    "year": "2023"
  },
  {
    "number": "2309",
    "text": "Which prophet confronted the people with the challenge of rebuilding the temple after the exile?",
    "options": {
      "A": "Micah",
      "B": "Haggai",
      "C": "Zechariah",
      "D": "Ezekiel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67921?exam_type=jamb&type=obj&page=462",
    "correct_answer": "B",
    "explanation": "The prophet Haggai confronted the people with the challenge of rebuilding the temple after the exile. In the book of Haggai, the prophet encourages the people to rebuild the temple, promising that God's glory will fill the new temple and bring prosperity.",
    "year": "2023"
  },
  {
    "number": "2310",
    "text": "In which book of the New Testament do we find the account of the Apostle Paul's conversion and subsequent missionary journeys?",
    "options": {
      "A": "Luke",
      "B": "Matthew",
      "C": "John",
      "D": "Acts of the Apostles"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67922?exam_type=jamb&type=obj&page=462",
    "correct_answer": "D",
    "explanation": "The account of the Apostle Paul's conversion and subsequent missionary journeys is found in the 'Acts of the Apostles'. The book of Acts, written by Luke, provides a detailed account of Paul's dramatic conversion on the road to Damascus and his subsequent missionary journeys.",
    "year": "2023"
  },
  {
    "number": "2311",
    "text": "The story of Gideon showcases leadership qualities like humility and reliance on divine guidance during",
    "options": {
      "A": "The Period of Judges",
      "B": "The Conquest of Canaan",
      "C": "The Reign of David",
      "D": "The Babylonian Exile"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67923?exam_type=jamb&type=obj&page=463",
    "correct_answer": "A",
    "explanation": "The story of Gideon is found in the book of Judges in the Bible. Gideon was a judge who led the Israelites to victory over the Midianites. His story is characterized by his humility and reliance on divine guidance, which were key to his leadership during the period of Judges. The other options refer to different periods or events in the Bible.",
    "year": "2023"
  },
  {
    "number": "2312",
    "text": "Which Gospel gives the most detailed account of Jesus' temptation?",
    "options": {
      "A": "Luke",
      "B": "Mark",
      "C": "John",
      "D": "Matthew"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67924?exam_type=jamb&type=obj&page=463",
    "correct_answer": "D",
    "explanation": "The Gospel of Matthew gives the most detailed account of Jesus' temptation. In Matthew 4:1-11, the writer provides a detailed narrative of how Jesus was led by the Spirit into the wilderness to be tempted by the devil.",
    "year": "2023"
  },
  {
    "number": "2313",
    "text": "In the book of Acts, which event symbolizes the inclusion of the Gentiles into the new covenant?",
    "options": {
      "A": "The Pentecost experience",
      "B": "The stoning of Stephen",
      "C": "The conversion of Saul (Paul)",
      "D": "The baptism of Cornelius"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67925?exam_type=jamb&type=obj&page=463",
    "correct_answer": "D",
    "explanation": "In the book of Acts, the baptism of Cornelius, a Gentile, symbolizes the inclusion of the Gentiles into the new covenant (Acts 10). The other options refer to other significant events in the book of Acts, but they do not symbolize the inclusion of the Gentiles into the new covenant.",
    "year": "2023"
  },
  {
    "number": "2314",
    "text": "In which epistle does the apostle Paul extensively discuss the concept of \"New Life in Christ\"?",
    "options": {
      "A": "Acts of the Apostles",
      "B": "Revelation",
      "C": "Ephesians",
      "D": "Corinthians"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67926?exam_type=jamb&type=obj&page=463",
    "correct_answer": "C",
    "explanation": "The apostle Paul extensively discusses the concept of 'New Life in Christ' in the Epistle to the Ephesians. This concept refers to the transformation that occurs in a person's life when they accept Jesus Christ as their Lord and Savior. It does not feature prominently in the Revelation, Acts of the Apostles, or Corinthians.",
    "year": "2023"
  },
  {
    "number": "2315",
    "text": "Which city served as a central hub for the Early Church's fellowship and growth?",
    "options": {
      "A": "Athens",
      "B": "Rome",
      "C": "Antioch",
      "D": "Jerusalem"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67927?exam_type=jamb&type=obj&page=463",
    "correct_answer": "D",
    "explanation": "Jerusalem served as a central hub for the Early Church's fellowship and growth. After the death and resurrection of Jesus Christ, the apostles stayed in Jerusalem where they preached and converted many to Christianity.",
    "year": "2023"
  },
  {
    "number": "2316",
    "text": "According to the Gospel accounts, what was the first miracle performed by Jesus?",
    "options": {
      "A": "Feeding the five thousand",
      "B": "Calming a storm",
      "C": "Turning water into wine",
      "D": "Healing a blind man"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67928?exam_type=jamb&type=obj&page=464",
    "correct_answer": "C",
    "explanation": "According to the Gospel of John (John 2:1-11), the first miracle performed by Jesus was turning water into wine at a wedding in Cana. The other options refer to other miracles performed by Jesus, but they were not his first.",
    "year": "2023"
  },
  {
    "number": "2317",
    "text": "Which Gospel emphasizes the role of the Holy Spirit as the Comforter or Advocate?",
    "options": {
      "A": "John",
      "B": "Matthew",
      "C": "Luke",
      "D": "Mark"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67929?exam_type=jamb&type=obj&page=464",
    "correct_answer": "A",
    "explanation": "The Gospel of John emphasizes the role of the Holy Spirit as the Comforter or Advocate. In John 14:16, Jesus promises to ask the Father to give another Advocate to help and be with the disciples forever.",
    "year": "2023"
  },
  {
    "number": "2318",
    "text": "Which prophet warned the Israelites about the consequences of their disobedience?",
    "options": {
      "A": "Jonah",
      "B": "Isaiah",
      "C": "Hosea",
      "D": "Ezekiel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67930?exam_type=jamb&type=obj&page=464",
    "correct_answer": "B",
    "explanation": "Isaiahis one of the major prophets in the Bible who warned the Israelites about the consequences of their disobedience to God. He preached extensively about their sins and urged them to repent, or else face judgment, which included exile and destruction. Isaiah’s prophecies include both warnings and promises, with significant emphasis on the coming of a Messiah and the restoration of Israel.",
    "year": "2023"
  },
  {
    "number": "2319",
    "text": "How did the early Christian community in Acts make decisions about the distribution of resources to the needy?",
    "options": {
      "A": "They left it to chance and luck",
      "B": "They appointed deacons to oversee the process",
      "C": "They gave everything to the apostles for distribution",
      "D": "They relied on the guidance of local rulers"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67931?exam_type=jamb&type=obj&page=464",
    "correct_answer": "B",
    "explanation": "In the book of Acts, the early Christian community appointed deacons to oversee the distribution of resources to the needy. This was done to ensure fairness and to allow the apostles to focus on prayer and the ministry of the word (Acts 6:1-4).",
    "year": "2023"
  },
  {
    "number": "2320",
    "text": "Jesus often referred to Himself as the \"Good Shepherd.\" Which Gospel contains this metaphor?",
    "options": {
      "A": "Matthew",
      "B": "Luke",
      "C": "Mark",
      "D": "John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67932?exam_type=jamb&type=obj&page=464",
    "correct_answer": "D",
    "explanation": "The metaphor of Jesus referring to Himself as the 'Good Shepherd' is found in the Gospel of John, specifically in John 10:11 and 10:14. In these verses, Jesus uses the metaphor to illustrate His care and sacrifice for His followers.",
    "year": "2023"
  },
  {
    "number": "2321",
    "text": "Which prophet is associated with the \"valley of dry bones\" vision, symbolizing the restoration of Israel from exile?",
    "options": {
      "A": "Ezekiel",
      "B": "Daniel",
      "C": "Jeremiah",
      "D": "Zechariah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67935?exam_type=jamb&type=obj&page=465",
    "correct_answer": "A",
    "explanation": "The prophet associated with the \"valley of dry bones\" vision is Ezekiel. In the book of Ezekiel, chapter 37, Ezekiel has a vision where he is set in the middle of a valley full of dry bones. He prophesies to these bones that they will hear the word of the Lord, and the Lord will cause breath to enter the bones and they will come to life, symbolizing the restoration of Israel from exile.",
    "year": "2023"
  },
  {
    "number": "2322",
    "text": "What decision did Pilate's wife make when she had a dream about Jesus?",
    "options": {
      "A": "She kept the dream to herself",
      "B": "She warned Pilate not to get involved",
      "C": "She sought advice from the chief priests",
      "D": "She urged Pilate to release Jesus immediately"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67937?exam_type=jamb&type=obj&page=465",
    "correct_answer": "B",
    "explanation": "In Matthew 27:19, Pilate's wife sent him a message warning him not to have anything to do with Jesus because she had suffered a great deal in a dream because of him. This shows that she warned Pilate not to get involved with Jesus.",
    "year": "2023"
  },
  {
    "number": "2323",
    "text": "During the trial before Pontius Pilate, which Roman custom allowed the release of one prisoner during Passover?",
    "options": {
      "A": "Barabbas",
      "B": "Pax Romana",
      "C": "Prima Nocte",
      "D": "Quinquennium"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67938?exam_type=jamb&type=obj&page=465",
    "correct_answer": "B",
    "explanation": "It was a period of Peace.",
    "year": "2023"
  },
  {
    "number": "2324",
    "text": "In a diverse and multicultural society, civic responsibility includes",
    "options": {
      "A": "Promoting stereotypes and prejudice",
      "B": "Isolating oneself from people of different backgrounds",
      "C": "Disrespecting other cultures and beliefs",
      "D": "Embracing diversity and promoting inclusivity"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67939?exam_type=jamb&type=obj&page=465",
    "correct_answer": "D",
    "explanation": "In a diverse and multicultural society, civic responsibility includes embracing diversity and promoting inclusivity. This means respecting and valuing the differences among people, including their backgrounds, cultures, and beliefs, and promoting an inclusive society where everyone feels valued and accepted. It does not involve isolating oneself from people of different backgrounds, promoting stereotypes and prejudice, or disrespecting other cultures and beliefs.",
    "year": "2023"
  },
  {
    "number": "2325",
    "text": "The prophet who emphasized the concept of \"the day of the Lord\" as a time of judgment and salvation was",
    "options": {
      "A": "Amos",
      "B": "Habakkuk",
      "C": "Joel",
      "D": "Zephaniah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67942?exam_type=jamb&type=obj&page=465",
    "correct_answer": "C",
    "explanation": "The prophet Joel emphasized the concept of \"the day of the Lord\" as a time of judgment and salvation. In the book of Joel, the 'day of the Lord' is described as a time when God will judge His enemies and save His people.",
    "year": "2023"
  },
  {
    "number": "2326",
    "text": "In the Gospel of Matthew, which group of religious leaders were particularly hostile towards Jesus?",
    "options": {
      "A": "Zealots",
      "B": "Sadducees",
      "C": "Pharisees",
      "D": "Essenes"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67943?exam_type=jamb&type=obj&page=466",
    "correct_answer": "C",
    "explanation": "The Pharisees were particularly hostile towards Jesus, according to the Gospel of Matthew. They often challenged Jesus' authority and teachings, leading to many confrontations.",
    "year": "2023"
  },
  {
    "number": "2327",
    "text": "The prophet who spoke extensively about the restoration of Israel and the coming of the Messiah was",
    "options": {
      "A": "Zephaniah",
      "B": "Micah",
      "C": "Malachi",
      "D": "Obadiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67946?exam_type=jamb&type=obj&page=466",
    "correct_answer": "C",
    "explanation": "The prophet Malachi spoke extensively about the restoration of Israel and the coming of the Messiah. In the book of Malachi, he prophesies about the coming of the 'messenger' who will prepare the way for the Lord. This is interpreted as a prophecy about the coming of John the Baptist and Jesus Christ.",
    "year": "2023"
  },
  {
    "number": "2328",
    "text": "Which prophet had a vision of a \"wheel within a wheel,\" symbolizing God's divine presence and sovereignty?",
    "options": {
      "A": "Daniel",
      "B": "Ezekiel",
      "C": "Amos",
      "D": "Joel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67948?exam_type=jamb&type=obj&page=466",
    "correct_answer": "B",
    "explanation": "The prophet Ezekiel had a vision of a \"wheel within a wheel,\" which is recorded in the Book of Ezekiel in the Bible. This vision symbolizes God's divine presence and sovereignty, showing that God is omnipresent and has control over all things.",
    "year": "2023"
  },
  {
    "number": "2329",
    "text": "In which Gospel do we find the Parable of the Good Samaritan?",
    "options": {
      "A": "Luke",
      "B": "Matthew",
      "C": "John",
      "D": "Mark"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67949?exam_type=jamb&type=obj&page=466",
    "correct_answer": "A",
    "explanation": "The Parable of the Good Samaritan is found in the Gospel of Luke, specifically in Luke 10:25-37. In this parable, Jesus uses a Samaritan, considered an outsider by the Jews, as an example of a neighbor who showed mercy to a man who was robbed and beaten.",
    "year": "2023"
  },
  {
    "number": "2330",
    "text": "The new covenant is based on",
    "options": {
      "A": "Keeping the Ten Commandments",
      "B": "Human efforts and good deeds",
      "C": "Faith in Jesus Christ and His sacrifice",
      "D": "Strict adherence to religious rituals"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67950?exam_type=jamb&type=obj&page=466",
    "correct_answer": "C",
    "explanation": "The new covenant, as described in the New Testament of the Bible, is based on faith in Jesus Christ and His sacrifice. This is a shift from the old covenant, which was based on adherence to the Law (the Ten Commandments and other laws). The other options refer to aspects of the old covenant or to human efforts, which are not the basis of the new covenant.",
    "year": "2023"
  },
  {
    "number": "2331",
    "text": "What significant event led to the division of languages among humankind?",
    "options": {
      "A": "The Exodus",
      "B": "The Flood",
      "C": "The Tower of Babel",
      "D": "The Crucifixion"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67951?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "The significant event that led to the division of languages among humankind was the Tower of Babel. This is recorded in Genesis 11:1-9 in the Bible.",
    "year": "2023"
  },
  {
    "number": "2332",
    "text": "Nahum's prophecy mainly focused on the impending doom of",
    "options": {
      "A": "Egypt",
      "B": "Israel",
      "C": "Nineveh",
      "D": "Babylon"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67952?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "Nahum's prophecy mainly focused on the impending doom of Nineveh. The Book of Nahum in the Bible is essentially an oracle of judgment against the city of Nineveh, which was the capital of the Assyrian Empire.",
    "year": "2023"
  },
  {
    "number": "2333",
    "text": "The Apostle Paul's life in Acts exemplifies God's sovereignty through",
    "options": {
      "A": "His unwavering devotion to Jewish traditions",
      "B": "His escape from imprisonment through supernatural means",
      "C": "His transformation from a persecutor to a proclaimer of the Gospel",
      "D": "His ability to convert everyone he encountered"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67953?exam_type=jamb&type=obj&page=467",
    "correct_answer": "C",
    "explanation": "The Apostle Paul's life in Acts exemplifies God's sovereignty through his transformation from a persecutor to a proclaimer of the Gospel. Before his conversion, Paul (then known as Saul) was a zealous persecutor of Christians. However, after his encounter with Jesus on the road to Damascus, he became one of the most fervent proclaimers of the Gospel (Acts 9:1-22).",
    "year": "2023"
  },
  {
    "number": "2334",
    "text": "Setting boundaries and rules for children helps them",
    "options": {
      "A": "Develop a sense of discipline and responsibility",
      "B": "Become isolated from their peers",
      "C": "Rebel against authority figures",
      "D": "Develop a fear of their parents"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67954?exam_type=jamb&type=obj&page=467",
    "correct_answer": "A",
    "explanation": "Setting boundaries and rules for children helps them develop a sense of discipline and responsibility. Boundaries provide a safe space for children to explore and understand their environment, while rules guide their behavior and actions, teaching them what is acceptable and what is not. This helps inculcate a sense of discipline and responsibility in them.",
    "year": "2023"
  },
  {
    "number": "2335",
    "text": "According to the Gospels, what was the profession of Peter and Andrew before becoming disciples of Jesus?",
    "options": {
      "A": "Tentmakers",
      "B": "Tax collectors",
      "C": "Shepherds",
      "D": "Fishermen"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67955?exam_type=jamb&type=obj&page=467",
    "correct_answer": "D",
    "explanation": "Peter and Andrew were fishermen before they became disciples of Jesus. This is stated in the Gospels, where Jesus tells them to follow him and he will make them 'fishers of men'.",
    "year": "2023"
  },
  {
    "number": "2336",
    "text": "Which event marked the beginning of the Early Church's fellowship?",
    "options": {
      "A": "The crucifixion of Jesus",
      "B": "Pentecost",
      "C": "The resurrection of Jesus",
      "D": "The Last Supper"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67956?exam_type=jamb&type=obj&page=468",
    "correct_answer": "B",
    "explanation": "The event that marked the beginning of the Early Church's fellowship was Pentecost. This is when the Holy Spirit descended upon the apostles, as recorded in Acts 2. The resurrection of Jesus, the crucifixion of Jesus, and the Last Supper were all significant events, but they did not mark the beginning of the church's fellowship.",
    "year": "2023"
  },
  {
    "number": "2337",
    "text": "How do the Gospels portray God's sovereignty concerning human salvation?",
    "options": {
      "A": "It is only accessible to a select few",
      "B": "It is exclusively determined by human choices",
      "C": "It is based on God's grace and mercy",
      "D": "It depends on human effort and achievements"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67957?exam_type=jamb&type=obj&page=468",
    "correct_answer": "C",
    "explanation": "The Gospels portray God's sovereignty concerning human salvation as being based on God's grace and mercy. This is evident in passages such as Ephesians 2:8-9, which states that it is by grace through faith that we are saved, not by works, so that no one can boast. This shows that salvation is a gift from God, not something that can be earned through human effort or achievements.",
    "year": "2023"
  },
  {
    "number": "2338",
    "text": "Who were the three disciples who witnessed the Transfiguration with Jesus?",
    "options": {
      "A": "Matthew, Mark, and Luke",
      "B": "Andrew, Simon, and Philip",
      "C": "Mary, Martha, and Lazarus",
      "D": "Peter, James, and John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67958?exam_type=jamb&type=obj&page=468",
    "correct_answer": "D",
    "explanation": "The three disciples who witnessed the Transfiguration with Jesus were Peter, James, and John. This event is recorded in all three Synoptic Gospels (Matthew 17:1-9, Mark 9:2-8, Luke 9:28-36).",
    "year": "2023"
  },
  {
    "number": "2339",
    "text": "Leadership qualities such as integrity and honesty are illustrated in the life of",
    "options": {
      "A": "Judas Iscariot",
      "B": "Joseph",
      "C": "Jezebel",
      "D": "Jacob"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67959?exam_type=jamb&type=obj&page=468",
    "correct_answer": "B",
    "explanation": "Leadership qualities such as integrity and honesty are illustrated in the life of Joseph. This is evident in his life story as recorded in the Book of Genesis in the Bible.",
    "year": "2023"
  },
  {
    "number": "2340",
    "text": "The law was given to humanity primarily to",
    "options": {
      "A": "Bring condemnation",
      "B": "Guide them in righteous living",
      "C": "Establish a covenant with God",
      "D": "Save them from sin"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67960?exam_type=jamb&type=obj&page=468",
    "correct_answer": "B",
    "explanation": "The law was given to humanity primarily to guide them in righteous living. The law provides a moral and ethical framework for humans to follow, which helps them distinguish between right and wrong and guides their actions and decisions. It does not save them from sin or establish a covenant with God, but it does bring condemnation when it is broken.",
    "year": "2023"
  },
  {
    "number": "2341",
    "text": "In the Gospel of Matthew, Jesus walks on water to meet His disciples in a boat. Which disciple attempts to walk on water but begins to sink?",
    "options": {
      "A": "Peter",
      "B": "James",
      "C": "Andrew",
      "D": "John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67961?exam_type=jamb&type=obj&page=469",
    "correct_answer": "A",
    "explanation": "In the Gospel of Matthew (Matthew 14:22-33), Peter is the disciple who attempts to walk on water to meet Jesus but begins to sink because of his doubt. The other options refer to other disciples who did not attempt to walk on water in this account.",
    "year": "2023"
  },
  {
    "number": "2342",
    "text": "What event in the Old Testament marked the beginning of the Exodus of the Israelites from Egypt, eventually leading to the Ten Commandments?",
    "options": {
      "A": "Passover",
      "B": "The Last Supper",
      "C": "Crossing of the Jordan River",
      "D": "Building of the Ark of the Covenant"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67962?exam_type=jamb&type=obj&page=469",
    "correct_answer": "A",
    "explanation": "The event in the Old Testament that marked the beginning of the Exodus of the Israelites from Egypt, eventually leading to the Ten Commandments, was the Passover. During the Passover, God spared the Israelites from the final plague in Egypt - the death of the firstborn - and this led to Pharaoh releasing the Israelites from slavery, marking the beginning of the Exodus.",
    "year": "2023"
  },
  {
    "number": "2343",
    "text": "Which Gospel includes the account of Jesus washing the disciples' feet during the Last Supper?",
    "options": {
      "A": "Matthew",
      "B": "Luke",
      "C": "John",
      "D": "Mark"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67963?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "The account of Jesus washing the disciples' feet during the Last Supper is found in the Gospel of John, specifically John 13:1-17. This act was a demonstration of humility and service, setting an example for his disciples to follow.",
    "year": "2023"
  },
  {
    "number": "2344",
    "text": "Divine love in Christianity is primarily expressed through",
    "options": {
      "A": "Rituals and ceremonies",
      "B": "Church attendance",
      "C": "God's grace and mercy",
      "D": "The Ten Commandments"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67964?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "Divine love in Christianity is primarily expressed through God's grace and mercy. This is evident in the Christian belief that God sent His Son, Jesus Christ, to die for the sins of humanity, offering forgiveness and eternal life to all who believe in Him. This act of sacrifice is seen as the ultimate expression of God's love, grace, and mercy.",
    "year": "2023"
  },
  {
    "number": "2345",
    "text": "Which prophet from the Old Testament strongly condemned the greed of the wealthy and powerful?",
    "options": {
      "A": "Ezekiel",
      "B": "Isaiah",
      "C": "Amos",
      "D": "Jeremiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67966?exam_type=jamb&type=obj&page=469",
    "correct_answer": "C",
    "explanation": "The prophet Amos strongly condemned the greed of the wealthy and powerful. Amos was a shepherd and a farmer before God called him to be a prophet. He was an outsider from Judah who was called to deliver a message to Israel. His message was one of justice and concern for the poor and oppressed.",
    "year": "2023"
  },
  {
    "number": "2346",
    "text": "What was the name of the high priest who played a prominent role in opposing the early Christian movement?",
    "options": {
      "A": "Annas",
      "B": "Caiaphas",
      "C": "Gamaliel",
      "D": "Nicodemus"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67968?exam_type=jamb&type=obj&page=470",
    "correct_answer": "B",
    "explanation": "Caiaphas was the high priest who played a prominent role in opposing the early Christian movement. He was the one who plotted to kill Jesus after the raising of Lazarus, as mentioned in John 11:49-50. He also presided over the Sanhedrin trial of Jesus.",
    "year": "2023"
  },
  {
    "number": "2347",
    "text": "According to the Bible, how many days after his resurrection did Jesus ascend into heaven?",
    "options": {
      "A": "40 days",
      "B": "60 days",
      "C": "30 days",
      "D": "50 days"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67969?exam_type=jamb&type=obj&page=470",
    "correct_answer": "A",
    "explanation": "According to the Bible, Jesus ascended into heaven 40 days after his resurrection. This is recorded in Acts 1:3 where it is stated that Jesus presented himself alive to his disciples by many proofs, appearing to them during forty days and speaking about the kingdom of God.",
    "year": "2023"
  },
  {
    "number": "2348",
    "text": "Who was the first Gentile to receive the Holy Spirit and be baptized, as mentioned in Acts?",
    "options": {
      "A": "Philip",
      "B": "Timothy",
      "C": "Cornelius",
      "D": "Barnabas"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67970?exam_type=jamb&type=obj&page=470",
    "correct_answer": "C",
    "explanation": "The first Gentile to receive the Holy Spirit and be baptized, as mentioned in the book of Acts, was Cornelius. This event is recorded in Acts 10, where Peter is shown in a vision that the Gospel is for all people, not just the Jews, leading to the baptism of Cornelius and his household.",
    "year": "2023"
  },
  {
    "number": "2349",
    "text": "In which Gospel does Jesus say, \"Before Abraham was, I am\"?",
    "options": {
      "A": "Luke",
      "B": "Matthew",
      "C": "John",
      "D": "Mark"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67971?exam_type=jamb&type=obj&page=470",
    "correct_answer": "C",
    "explanation": "The statement, \"Before Abraham was, I am\" is found in the Gospel of John, specifically John 8:58. Here, Jesus is declaring His eternal existence and His identity as God. The phrase 'I am' is a direct reference to God's name in Exodus 3:14, where God revealed Himself to Moses as 'I AM WHO I AM'.",
    "year": "2023"
  },
  {
    "number": "2350",
    "text": "Which epistle encourages believers to \"eagerly desire spiritual gifts, especially the gift of prophecy\"?",
    "options": {
      "A": "1 Corinthians",
      "B": "Ephesians",
      "C": "Romans",
      "D": "1 Timothy"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67972?exam_type=jamb&type=obj&page=470",
    "correct_answer": "A",
    "explanation": "The quote 'eagerly desire spiritual gifts, especially the gift of prophecy' is from 1 Corinthians 14:1. Therefore, the epistle that encourages believers to eagerly desire spiritual gifts, especially the gift of prophecy, is 1 Corinthians.",
    "year": "2023"
  },
  {
    "number": "2351",
    "text": "Which virtue is often mentioned alongside impartiality in the selected epistles?",
    "options": {
      "A": "Prejudice",
      "B": "Greed",
      "C": "Arrogance",
      "D": "Humility"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67973?exam_type=jamb&type=obj&page=471",
    "correct_answer": "D",
    "explanation": "Humility is often mentioned alongside impartiality in the selected epistles. Humility is a virtue that involves recognizing one's own limitations and placing the needs of others before one's own. It is closely related to impartiality, as a humble person does not show favoritism or partiality.",
    "year": "2023"
  },
  {
    "number": "2352",
    "text": "In the context of prayer, what does \"intercession\" mean?",
    "options": {
      "A": "Personal requests",
      "B": "Praying for others",
      "C": "Thanksgiving",
      "D": "Silent meditation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67974?exam_type=jamb&type=obj&page=471",
    "correct_answer": "B",
    "explanation": "Intercession in the context of prayer refers to the act of intervening on behalf of another through prayer. This is often done by praying for others, making requests to God on their behalf. Therefore, the correct answer is 'Praying for others'.",
    "year": "2023"
  },
  {
    "number": "2353",
    "text": "David's skill in playing the harp made him a favorite musician in the court of which king?",
    "options": {
      "A": "King Herod",
      "B": "Pharaoh of Egypt",
      "C": "King Saul",
      "D": "King Nebuchadnezzar"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67975?exam_type=jamb&type=obj&page=471",
    "correct_answer": "C",
    "explanation": "David's skill in playing the harp made him a favorite musician in the court of King Saul. This is documented in the Bible, specifically in the book of 1 Samuel 16:23. Whenever King Saul was troubled by an evil spirit, David would play the harp and the king would feel better.",
    "year": "2023"
  },
  {
    "number": "2354",
    "text": "True religion in Christianity emphasizes the importance of",
    "options": {
      "A": "Material wealth and prosperity",
      "B": "Rigid adherence to traditions",
      "C": "Isolation from the world",
      "D": "Unity among believers"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67976?exam_type=jamb&type=obj&page=471",
    "correct_answer": "D",
    "explanation": "True religion in Christianity emphasizes the importance of unity among believers. This is based on the teachings of Jesus Christ who prayed for unity among his followers in John 17:21. The other options do not accurately represent the emphasis of true religion in Christianity.",
    "year": "2023"
  },
  {
    "number": "2355",
    "text": "In 1 Corinthians 12, Paul compares the Church to what metaphorical body?",
    "options": {
      "A": "A tree",
      "B": "A human body",
      "C": "A flock of sheep",
      "D": "A building"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67978?exam_type=jamb&type=obj&page=471",
    "correct_answer": "B",
    "explanation": "In 1 Corinthians 12, Paul uses the metaphor of a human body to describe the Church. He explains that just as a body, though one, has many parts, but all its many parts form one body, so it is with Christ. Therefore, the correct answer is 'A human body'.",
    "year": "2023"
  },
  {
    "number": "2356",
    "text": "What is a prominent theme in St. James' Epistles?",
    "options": {
      "A": "Faith and works",
      "B": "Love and forgiveness",
      "C": "The Trinity and divinity",
      "D": "End times and prophecy"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67979?exam_type=jamb&type=obj&page=472",
    "correct_answer": "A",
    "explanation": "The Epistle of James emphasizes practical aspects of Christian conduct. It stresses the ethical and moral responsibilities of Christians in dealing with social issues. The prominent theme in St. James' Epistles is 'Faith and works'. James 2:14-26, in particular, emphasizes that faith without works is dead.",
    "year": "2023"
  },
  {
    "number": "2357",
    "text": "Who was the prophet that warned Israel about the impending Babylonian exile?",
    "options": {
      "A": "Hosea",
      "B": "Micah",
      "C": "Jeremiah",
      "D": "Amos"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67980?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "The prophet Jeremiah warned Israel about the impending Babylonian exile. Jeremiah prophesied during the last forty years of Judah, the southern kingdom, warning God's people of their coming fate if they did not turn from their sins.",
    "year": "2023"
  },
  {
    "number": "2358",
    "text": "In the Gospel of Mark, which group of people did Jesus specifically mention that we should love with all our hearts?",
    "options": {
      "A": "The poor and needy",
      "B": "Family members",
      "C": "Our enemies",
      "D": "Fellow believers"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67981?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "In the Gospel of Mark, Jesus specifically mentions that we should love our enemies. This is found in Mark 12:30-31, where Jesus states the greatest commandment is to love God with all our heart, soul, mind, and strength, and the second is to love our neighbor as ourselves. In the context of the New Testament, 'neighbor' includes enemies.",
    "year": "2023"
  },
  {
    "number": "2359",
    "text": "In the epistles, corruption is often linked to which of the following vices?",
    "options": {
      "A": "Generosity and benevolence",
      "B": "Austerity and frugality",
      "C": "Greed and selfishness",
      "D": "Tolerance and acceptance"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67982?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "In the epistles, corruption is often linked to vices such as greed and selfishness. These vices are seen as moral corruption and are often warned against in the teachings of the apostles. Therefore, the correct answer is 'Greed and selfishness'.",
    "year": "2023"
  },
  {
    "number": "2360",
    "text": "David was known for his musical talents and was credited for composing many",
    "options": {
      "A": "Prophecies",
      "B": "Sermons",
      "C": "Psalms",
      "D": "Hymns"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67983?exam_type=jamb&type=obj&page=472",
    "correct_answer": "C",
    "explanation": "David was known for his musical talents and was credited for composing many Psalms. The Book of Psalms in the Bible contains many songs and poems attributed to David. These psalms express a range of human emotions and were often used as hymns in Jewish and Christian worship.",
    "year": "2023"
  },
  {
    "number": "2361",
    "text": "Where did Peter make the \"Great Confession\"?",
    "options": {
      "A": "Near the Sea of Galilee",
      "B": "At the Last Supper",
      "C": "At the foot of the Cross",
      "D": "In the Garden of Gethsemane"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67985?exam_type=jamb&type=obj&page=473",
    "correct_answer": "A",
    "explanation": "Peter made the 'Great Confession' near the Sea of Galilee. This event is recorded in Matthew 16:13-20, Mark 8:27-30, and Luke 9:18-21. Peter confesses that Jesus is the Christ, the Son of the living God, a pivotal moment in the Gospels.",
    "year": "2023"
  },
  {
    "number": "2362",
    "text": "What significant event led to the division of the kingdom of Israel into the northern and southern kingdoms?",
    "options": {
      "A": "The Assyrian invasion",
      "B": "The reign of King Solomon",
      "C": "The Exodus from Egypt",
      "D": "The Babylonian exile"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67987?exam_type=jamb&type=obj&page=473",
    "correct_answer": "B",
    "explanation": "The significant event that led to the division of the kingdom of Israel into the northern and southern kingdoms was the reign of King Solomon. After Solomon's death, his son Rehoboam became king. Rehoboam's harsh rule led to a rebellion, resulting in the division of the kingdom into the northern kingdom of Israel and the southern kingdom of Judah.",
    "year": "2023"
  },
  {
    "number": "2363",
    "text": "In which Gospel(s) do we find an account of the triumphal entry of Jesus into Jerusalem?",
    "options": {
      "A": "Matthew, Mark, John and Luke",
      "B": "Luke and John",
      "C": "Matthew and Luke",
      "D": "Mark and John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67988?exam_type=jamb&type=obj&page=473",
    "correct_answer": "A",
    "explanation": "The triumphal entry of Jesus into Jerusalem is an event that is described in all four canonical Gospels. In Matthew 21:1–11, Mark 11:1–11, Luke 19:28–44, and John 12:12–19.",
    "year": "2023"
  },
  {
    "number": "2364",
    "text": "What is the key to effective prayer according to the selected epistles?",
    "options": {
      "A": "Persistence",
      "B": "Impressive language",
      "C": "Lengthy prayers",
      "D": "Faith"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67989?exam_type=jamb&type=obj&page=473",
    "correct_answer": "D",
    "explanation": "According to the selected epistles, the key to effective prayer is faith. This is based on the belief that God hears and answers prayers, and that He is able to do exceedingly abundantly above all that we ask or think, according to the power that works in us. Therefore, when praying, one must have faith that God will answer in His own time and way.",
    "year": "2023"
  },
  {
    "number": "2365",
    "text": "According to the epistles, what is the root cause of showing partiality to others?",
    "options": {
      "A": "Ignorance and lack of knowledge",
      "B": "Fear of being judged by others",
      "C": "Lack of self-confidence",
      "D": "Favoring those who can offer personal benefits"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67990?exam_type=jamb&type=obj&page=473",
    "correct_answer": "D",
    "explanation": "According to the epistles, the root cause of showing partiality to others is favoring those who can offer personal benefits. This is a form of selfishness and is contrary to the teachings of the Bible, which encourages believers to treat everyone equally and without favoritism.",
    "year": "2023"
  },
  {
    "number": "2366",
    "text": "In which epistle does the apostle Peter remind believers that they are part of a \"chosen race, a royal priesthood, a holy nation\" while facing persecution?",
    "options": {
      "A": "1 Peter",
      "B": "1 Corinthians",
      "C": "Colossians",
      "D": "Galatians"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67991?exam_type=jamb&type=obj&page=474",
    "correct_answer": "A",
    "explanation": "The apostle Peter reminds believers that they are part of a 'chosen race, a royal priesthood, a holy nation' in the face of persecution in the epistle of 1 Peter, specifically in 1 Peter 2:9. Therefore, the correct answer is '1 Peter'.",
    "year": "2023"
  },
  {
    "number": "2367",
    "text": "What was the central theme of Ezekiel's prophecies during the exile?",
    "options": {
      "A": "God's judgment and the hope of restoration",
      "B": "The promise of a new messianic king",
      "C": "The punishment of Babylon",
      "D": "The restoration of the temple in Jerusalem"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67992?exam_type=jamb&type=obj&page=474",
    "correct_answer": "A",
    "explanation": "The central theme of Ezekiel's prophecies during the exile was God's judgment and the hope of restoration. Ezekiel was a prophet during the time of the Babylonian exile. He prophesied about the destruction of Jerusalem and the temple, but he also spoke of a future time when God would restore His people and their place of worship.",
    "year": "2023"
  },
  {
    "number": "2368",
    "text": "How many books are there in the New Testament of the Bible?",
    "options": {
      "A": "66",
      "B": "12",
      "C": "39",
      "D": "27"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67993?exam_type=jamb&type=obj&page=474",
    "correct_answer": "D",
    "explanation": "There are 27 books in the New Testament of the Bible. These books include the four Gospels, the Acts of the Apostles, the Epistles, and the book of Revelation.",
    "year": "2023"
  },
  {
    "number": "2369",
    "text": "How many recorded appearances did Jesus make after his resurrection?",
    "options": {
      "A": "7",
      "B": "10",
      "C": "12",
      "D": "40"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67994?exam_type=jamb&type=obj&page=474",
    "correct_answer": "A",
    "explanation": "Jesus made 7 recorded appearances after his resurrection. These appearances were to Mary Magdalene, the other women, two disciples on the road to Emmaus, Peter, the ten disciples (Thomas was absent), the eleven disciples (Thomas was present), and the seven disciples by the Sea of Tiberias.",
    "year": "2023"
  },
  {
    "number": "2370",
    "text": "Who was the first king of the divided kingdom of Israel?",
    "options": {
      "A": "Jeroboam",
      "B": "Rehoboam",
      "C": "David",
      "D": "Solomon"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67995?exam_type=jamb&type=obj&page=474",
    "correct_answer": "A",
    "explanation": "The first king of the divided kingdom of Israel was Jeroboam. After the death of King Solomon, the kingdom of Israel was divided into two: the northern kingdom of Israel and the southern kingdom of Judah. Jeroboam became the king of the northern kingdom.",
    "year": "2023"
  },
  {
    "number": "2371",
    "text": "The Epistle of Romans is significant in discussing the contrast between law and grace. Who is the author of the Epistle to the Romans?",
    "options": {
      "A": "James",
      "B": "John",
      "C": "Paul",
      "D": "Peter"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67996?exam_type=jamb&type=obj&page=475",
    "correct_answer": "C",
    "explanation": "The Epistle to the Romans, often shortened to Romans, is the sixth book in the New Testament. Biblical scholars agree that it was composed by the Apostle Paul to explain that salvation is offered through the gospel of Jesus Christ. Hence, Paul is the author of the Epistle to the Romans.",
    "year": "2023"
  },
  {
    "number": "2372",
    "text": "Why did the Pharisees criticize Jesus during the triumphal entry?",
    "options": {
      "A": "They were jealous of Jesus' popularity",
      "B": "They thought Jesus was a Roman sympathizer",
      "C": "They believed Jesus was claiming to be the Messiah",
      "D": "They were upset about the disruption caused by the crowd"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67997?exam_type=jamb&type=obj&page=475",
    "correct_answer": "C",
    "explanation": "During the triumphal entry, the Pharisees criticized Jesus because they believed He was claiming to be the Messiah. This is evident in Luke 19:39 where the Pharisees in the crowd said to Jesus, 'Teacher, rebuke your disciples!' They were upset that the crowd was proclaiming Jesus as the Messiah.",
    "year": "2023"
  },
  {
    "number": "2373",
    "text": "In Acts, what event caused the dispersion of Christians and led to the spread of the Gospel among Gentiles?",
    "options": {
      "A": "The resurrection of Jesus",
      "B": "The stoning of Stephen",
      "C": "The conversion of Saul",
      "D": "The crucifixion of Jesus"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67998?exam_type=jamb&type=obj&page=475",
    "correct_answer": "B",
    "explanation": "The event that caused the dispersion of Christians and led to the spread of the Gospel among Gentiles was the stoning of Stephen. This event is recorded in Acts 7:54-60 and Acts 8:1. After Stephen's death, a great persecution broke out against the church in Jerusalem, and all except the apostles were scattered throughout Judea and Samaria.",
    "year": "2023"
  },
  {
    "number": "2374",
    "text": "Which epistle addresses the issue of moral purity and living a sanctified life within the Christian community?",
    "options": {
      "A": "1 Peter",
      "B": "1 Timothy",
      "C": "Titus",
      "D": "2 Corinthians"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/67999?exam_type=jamb&type=obj&page=475",
    "correct_answer": "B",
    "explanation": "The First Epistle to Timothy addresses the issue of moral purity and living a sanctified life within the Christian community. In this letter, Paul provides guidance to Timothy, a young leader in the church, on how to conduct himself and lead the church in a manner that is pleasing to God. This includes instructions on moral purity and living a sanctified life.",
    "year": "2023"
  },
  {
    "number": "2375",
    "text": "In which Gospel do we find the story of the \"Good Samaritan\" who showed love and compassion to a wounded man?",
    "options": {
      "A": "Luke",
      "B": "Matthew",
      "C": "John",
      "D": "Mark"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68001?exam_type=jamb&type=obj&page=475",
    "correct_answer": "A",
    "explanation": "The story of the 'Good Samaritan' is found in the Gospel of Luke, specifically in Luke 10:25-37. In this parable, Jesus uses the example of a Samaritan, who was considered an outsider, to illustrate the concept of 'neighbor' and to demonstrate that love and compassion should extend beyond social or religious boundaries.",
    "year": "2023"
  },
  {
    "number": "2376",
    "text": "Which epistle emphasizes the importance of love and unity among believers in the Christian community?",
    "options": {
      "A": "Colossians",
      "B": "Philippians",
      "C": "Galatians",
      "D": "Ephesians"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68002?exam_type=jamb&type=obj&page=476",
    "correct_answer": "D",
    "explanation": "The Epistle to the Ephesians emphasizes the importance of love and unity among believers in the Christian community. It is a letter written by the Apostle Paul to the church in Ephesus, and it focuses on the themes of unity in the body of Christ, the importance of love, and the spiritual growth of believers.",
    "year": "2023"
  },
  {
    "number": "2377",
    "text": "Which apostle famously doubted Jesus' resurrection until he saw the wounds in His hands and side?",
    "options": {
      "A": "John",
      "B": "Thomas",
      "C": "James",
      "D": "Peter"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68003?exam_type=jamb&type=obj&page=476",
    "correct_answer": "B",
    "explanation": "The apostle who famously doubted Jesus' resurrection until he saw the wounds in His hands and side was Thomas. This event is recorded in John 20:24-29, where Jesus appeared to his disciples after his resurrection, but Thomas was not present. When the others told him about it, he refused to believe until he could see and touch Jesus' wounds. When Jesus appeared again, Thomas was present and believed.",
    "year": "2023"
  },
  {
    "number": "2378",
    "text": "The period of the \"Return from Exile\" is associated with which Persian King's decree?",
    "options": {
      "A": "King Cyrus",
      "B": "King Artaxerxes",
      "C": "King Darius",
      "D": "King Xerxes"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68004?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "The period of the 'Return from Exile' is associated with King Cyrus's decree. According to the Bible, specifically the book of Ezra, King Cyrus of Persia issued a decree that allowed the Jews to return to Jerusalem and rebuild the temple.",
    "year": "2023"
  },
  {
    "number": "2379",
    "text": "Which epistle contains the famous analogy of the Church as the \"body of Christ\" and the members as individual parts?",
    "options": {
      "A": "1 Corinthians",
      "B": "Romans",
      "C": "Galatians",
      "D": "Colossians"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68005?exam_type=jamb&type=obj&page=476",
    "correct_answer": "A",
    "explanation": "The analogy of the Church as the 'body of Christ' and the members as individual parts is found in the epistle of 1 Corinthians, specifically in 1 Corinthians 12:12-27. Therefore, the correct answer is '1 Corinthians'.",
    "year": "2023"
  },
  {
    "number": "2380",
    "text": "Which biblical passage is known as the \"Lord's Prayer\" and contains a model of prayer and guidance?",
    "options": {
      "A": "John 3:16",
      "B": "Psalm 23",
      "C": "Romans 8:28",
      "D": "Matthew 6:9-13"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68006?exam_type=jamb&type=obj&page=476",
    "correct_answer": "D",
    "explanation": "The biblical passage known as the 'Lord's Prayer' is found in Matthew 6:9-13. This prayer was taught by Jesus to his disciples as a model for how they should pray. It contains petitions for daily needs, forgiveness, and deliverance from temptation.",
    "year": "2023"
  },
  {
    "number": "2381",
    "text": "The message of repentance and forgiveness was a central theme in the prophecies directed to which city?",
    "options": {
      "A": "Jerusalem",
      "B": "Nineveh",
      "C": "Babylon",
      "D": "Rome"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68007?exam_type=jamb&type=obj&page=477",
    "correct_answer": "B",
    "explanation": "The message of repentance and forgiveness was a central theme in the prophecies directed to Nineveh. This is evident in the book of Jonah, where Jonah was sent by God to warn the people of Nineveh of their impending destruction unless they repented of their sins.",
    "year": "2023"
  },
  {
    "number": "2382",
    "text": "The southern kingdom of Judah experienced a significant religious reform under the leadership of which righteous king?",
    "options": {
      "A": "King Hezekiah",
      "B": "King Ahab",
      "C": "King Nebuchadnezzar",
      "D": "King Jeroboam"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/68008?exam_type=jamb&type=obj&page=477",
    "correct_answer": "A",
    "explanation": "The southern kingdom of Judah experienced a significant religious reform under the leadership of King Hezekiah. Hezekiah is known for his efforts to abolish idolatry in his kingdom, as documented in the Bible in the books of 2 Kings 18-20 and 2 Chronicles 29-32.",
    "year": "2023"
  }
]