[
  {
    "number": "2162",
    "text": "What happens to the position of equilibrium, if a reversible exothermic reaction is subjected to a decrease in temperature?",
    "options": {
      "A": "The position of equilibrium shifts to the left",
      "B": "The position of equilibrium shifts to the right.",
      "C": "The position of equilibrium remains unchanged",
      "D": "The reaction stops"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67406?exam_type=jamb&type=obj&page=433",
    "correct_answer": "B",
    "explanation": "When the temperature is decreased in a reversible reaction, the equilibrium shifts in the direction that produces heat (exothermic direction). For an exothermic reaction, this means the equilibrium position shifts to the right, favoring the forward reaction.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2163",
    "text": "Which noble gas is radioactive and is produced as a decay product of uranium and thorium?",
    "options": {
      "A": "Argon",
      "B": "Krypton",
      "C": "Radon",
      "D": "Neon"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67407?exam_type=jamb&type=obj&page=433",
    "correct_answer": "C",
    "explanation": "Radon is a radioactive noble gas and is produced as a decay product of uranium and thorium in the Earth's crust. It is colorless, odorless, and tasteless, making it potentially hazardous when it accumulates in enclosed spaces.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2164",
    "text": "Which of the following reactions would be expected to have the highest entropy change?",
    "options": {
      "A": "Liquid → Gas",
      "B": "Solid → Liquid",
      "C": "Gas → Liquid",
      "D": "Gas → Solid"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67408?exam_type=jamb&type=obj&page=433",
    "correct_answer": "A",
    "explanation": "The phase change from a liquid to a gas involves an increase in entropy. In the gas phase, molecules have higher degrees of freedom and are more dispersed compared to the liquid phase, resulting in higher entropy change.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2165",
    "text": "What is the sum of the oxidation numbers in a neutral compound?",
    "options": {
      "A": "+2",
      "B": "-1",
      "C": "0",
      "D": "+1"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67409?exam_type=jamb&type=obj&page=433",
    "correct_answer": "C",
    "explanation": "The sum of the oxidation numbers in a neutral compound is always zero. This is because oxidation numbers represent the charge that an atom would have if all bonding were ionic. In a neutral compound, the total positive charge (from the oxidation numbers of the atoms that have positive oxidation numbers) must equal the total negative charge (from the atoms that have negative oxidation numbers).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2166",
    "text": "According to the kinetic theory of gases, the pressure exerted by a gas is due to",
    "options": {
      "A": "The vibrations of gas particles.",
      "B": "The weight of the gas particles",
      "C": "The attractive forces between gas particles",
      "D": "The collisions of gas particles with the container walls"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67410?exam_type=jamb&type=obj&page=434",
    "correct_answer": "D",
    "explanation": "In the kinetic theory of gases, the pressure exerted by a gas is a result of the frequent and random collisions of gas particles with the walls of the container. The force of these collisions creates pressure on the container walls.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2167",
    "text": "What is eutrophication?",
    "options": {
      "A": "The release of harmful chemicals into water bodies",
      "B": "The excessive growth of algae due to nutrient enrichment",
      "C": "The presence of heavy metals in water",
      "D": "The formation of oil slicks on water surfaces"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67412?exam_type=jamb&type=obj&page=434",
    "correct_answer": "B",
    "explanation": "Eutrophication is the excessive growth of algae and aquatic plants in water bodies due to the increased availability of nutrients like nitrogen and phosphorus. This nutrient enrichment often comes from agricultural runoff, sewage, and industrial discharges.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2168",
    "text": "What is the name of the process by which ammonia is produced on an industrial scale?",
    "options": {
      "A": "Nitrogenation",
      "B": "Ammoniation",
      "C": "Nitrification",
      "D": "Haber process"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67413?exam_type=jamb&type=obj&page=434",
    "correct_answer": "D",
    "explanation": "The industrial production of ammonia is known as the Haber process. It involves the reaction of nitrogen gas (N\\(_2\\)) and hydrogen gas (H\\(_2\\)) at high temperature and pressure in the presence of a catalyst to produce ammonia (NH\\(_3\\)).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2169",
    "text": "Who proposed the planetary model of the atom with electrons orbiting the nucleus?",
    "options": {
      "A": "Erwin Schrödinger",
      "B": "Ernest Rutherford",
      "C": "Niels Bohr",
      "D": "J.J. Thomson"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67414?exam_type=jamb&type=obj&page=434",
    "correct_answer": "B",
    "explanation": "Both Rutherford and Bohr contributed to the planetary model of the atom, but it was Rutherford who initially proposed the idea of electrons orbiting the nucleus. Rutherford's model, however, had limitations in explaining the stability of the atom. Later, Niels Bohr refined Rutherford's model by introducing the concept of quantized energy levels and stable orbits for electrons.",
    "year": "2023"
  },
  {
    "number": "2170",
    "text": "Which of the following is an example of an endothermic reaction?",
    "options": {
      "A": "Combustion of propane (C\\(_3\\)H\\(_8\\)) to produce carbon dioxide (CO\\(_2\\)) and water (H\\(_2\\)O).",
      "B": "Burning of methane (CH\\(_4\\)) in the presence of oxygen",
      "C": "Formation of table salt (NaCl) from sodium (Na) and chlorine (Cl\\(_2\\)).",
      "D": "Decomposition of hydrogen peroxide (H\\(_2\\)O\\(_2\\)) into water (H\\(_2\\)O) and oxygen (O\\(_2\\))."
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67416?exam_type=jamb&type=obj&page=434",
    "correct_answer": "C",
    "explanation": "Combustion of propane, burning of methane and the decomposition of hydrogen peroxide into water and oxygen are all exothermic reaction because heat is given off from the system to the environment. However, only formation of table salt from Sodium and Chlorine is endothermic reaction, as the reaction is a simple combination reaction.\nThe formation of sodium chloride (NaCl) is an endothermic reaction because it requires energy in several steps, including:\nSublimation: Sodium metal sublimates, or turns directly from a solid to a gas, without becoming a liquid first. This is an endothermic process.Ionization: Sodium atoms lose an electron to become Na+ ions, which is also endothermic.Dissociation: The chlorine molecule splits into two chlorine atoms, which is endothermic.\nConversely, the formation of sodium chloride is not entirely endothermic, however, because the final step of the process is exothermic:\nIonic lattice formation: The Na+ and Cl- ions come together to form the ionic lattice of sodium chloride, releasing a large amount of energy.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2171",
    "text": "What happens to the value of the equilibrium constant (Kc) for a reaction if the reaction is reversed?",
    "options": {
      "A": "It becomes zero",
      "B": "It becomes negative",
      "C": "It remains the same",
      "D": "It becomes the reciprocal of the original value"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67417?exam_type=jamb&type=obj&page=435",
    "correct_answer": "D",
    "explanation": "If a reaction is reversed, the equilibrium constant (Kc) for the reversed reaction becomes the reciprocal of the original equilibrium constant. For a reaction:A + B ⇌ C + DThe equilibrium constant Kc = [C][D]/[A][B]For the reversed reaction:C + D ⇌ A + BThe equilibrium constant Kc(reversed) = [A][B]/[C][D]Thus, Kc(reversed) = 1/Kc.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2172",
    "text": "What is the chemical structure of soap and detergent molecules?",
    "options": {
      "A": "Hydrophilic head and hydrophobic tail",
      "B": "Hydrophilic head and hydrophilic tail",
      "C": "Hydrophobic head and hydrophobic tail",
      "D": "Hydrophilic tail and hydrophobic head"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67418?exam_type=jamb&type=obj&page=435",
    "correct_answer": "A",
    "explanation": "Both soap and detergent molecules have a hydrophilic (water-attracting) head and a hydrophobic (water-repelling) tail. The hydrophilic head allows the molecules to interact with water, while the hydrophobic tail interacts with oils and grease.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2173",
    "text": "What is the solubility product constant (Ksp) used for?",
    "options": {
      "A": "To measure the total mass of a solute that can dissolve in a solvent",
      "B": "To determine the concentration of a solute in a saturated solution",
      "C": "To calculate the solubility of a solute in a given solvent",
      "D": "To compare the solubilities of different solutes in the same solvent"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67419?exam_type=jamb&type=obj&page=435",
    "correct_answer": "B",
    "explanation": "The solubility product constant (Ksp) is a constant specific to a given solute and solvent at a particular temperature. It is used to calculate the concentration of a solute in a saturated solution, where no more solute can dissolve at equilibrium.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2174",
    "text": "Which trace gas in the atmosphere plays a significant role in the greenhouse effect?",
    "options": {
      "A": "Oxygen",
      "B": "Argon",
      "C": "Carbon dioxide",
      "D": "Nitrogen"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67420?exam_type=jamb&type=obj&page=435",
    "correct_answer": "C",
    "explanation": "Carbon dioxide (CO2) is a trace gas in the atmosphere, but it plays a significant role in the greenhouse effect. It absorbs and traps heat from the Earth's surface, contributing to global warming.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2175",
    "text": "Which of the following methods can be used to remove temporary hardness from water?",
    "options": {
      "A": "Boiling",
      "B": "Filtration",
      "C": "sedimentation",
      "D": "Chlorination"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67421?exam_type=jamb&type=obj&page=435",
    "correct_answer": "A",
    "explanation": "Temporary hardness in water can be removed by boiling. When water is boiled, the calcium and magnesium bicarbonates decompose, forming insoluble calcium carbonate (CaCO3) and magnesium carbonate (MgCO3), which precipitate out of the water.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2176",
    "text": "What is Faraday's constant?",
    "options": {
      "A": "6.022 x 10\\(^{23}\\) mol\\(^{-1}\\)",
      "B": "3.00 x 10\\(^8\\) m/s",
      "C": "9.81 m/s\\(^2\\)",
      "D": "96,485 C/mol"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67422?exam_type=jamb&type=obj&page=436",
    "correct_answer": "D",
    "explanation": "Faraday's constant is a proportionality constant that relates the amount of electric charge (in coulombs) required to liberate or deposit one mole of substance during an electrolytic reaction. Its value is approximately 96,485 C/mol.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2177",
    "text": "A gas occupies a volume of 1.5 liters at a pressure of 2 atmospheres. If the pressure is increased to 4 atmospheres while the temperature remains constant, what will be the new volume of the gas?",
    "options": {
      "A": "6 liters",
      "B": "1.5 liters",
      "C": "0.75 liters",
      "D": "3 liters"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67424?exam_type=jamb&type=obj&page=436",
    "correct_answer": "C",
    "explanation": "According to Boyle's law (for constant temperature), the product of initial pressure and initial volume is equal to the product of final pressure and final volume. Therefore, (1.5 liters) × (2 atmospheres) = (new volume) × (4 atmospheres). Solving for the new volume gives us (new volume) = (1.5 liters × 2 atmospheres) / 4 atmospheres = 0.75 liters.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2178",
    "text": "Stainless steel is an alloy made up of",
    "options": {
      "A": "Iron and zinc",
      "B": "Copper and tin",
      "C": "Iron and chromium",
      "D": "Iron and carbon"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67425?exam_type=jamb&type=obj&page=436",
    "correct_answer": "C",
    "explanation": "Stainless steel is an alloy composed of iron and chromium, with small amounts of other elements like nickel and molybdenum. The addition of chromium provides stainless steel with excellent corrosion resistance.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2179",
    "text": "What is the state of matter in which particles are widely spaced and move freely with high kinetic energy?",
    "options": {
      "A": "Liquid",
      "B": "Solid",
      "C": "Plasma",
      "D": "Gas"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67426?exam_type=jamb&type=obj&page=436",
    "correct_answer": "D",
    "explanation": "In the gas state of matter, particles are widely spaced and move freely with high kinetic energy. Gases do not have a definite shape or volume and will fill the entire available space.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2180",
    "text": "Identify the reducing agent in the following reaction:\nZn + CuSO\\(_4\\) → ZnSO\\(_4\\) + Cu",
    "options": {
      "A": "Cu",
      "B": "Zn",
      "C": "ZnSO\\(_4\\)",
      "D": "CuSO\\(_4\\)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67427?exam_type=jamb&type=obj&page=436",
    "correct_answer": "B",
    "explanation": "The reducing agent is the species that undergoes oxidation and causes the reduction of another species. In this reaction, zinc (Zn) is being oxidized to form zinc sulfate (ZnSO\\(_4\\)) while reducing copper sulfate (CuSO\\(_4\\)) to copper (Cu).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2181",
    "text": "Balance the following redox reaction:\nFe\\(_2\\)O\\(_3\\) + CO → Fe + CO\\(_2\\)",
    "options": {
      "A": "Fe\\(_2\\)O\\(_3\\) + CO → 2Fe + 2CO\\(_2\\)",
      "B": "2Fe\\(_2\\)O\\(_3\\) + 3CO → 4Fe + 3CO\\(_2\\)",
      "C": "Fe\\(_2\\)O\\(_3\\) + 2CO → 2Fe + 2CO\\(_2\\)",
      "D": "Fe\\(_2\\)O\\(_3\\) + 3CO → 2Fe + 3CO\\(_2\\)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67431?exam_type=jamb&type=obj&page=437",
    "correct_answer": "D",
    "explanation": "To balance the redox reaction, we need to ensure that the number of atoms of each element and the total charge are the same on both sides of the equation. In this reaction, we can see that the number of oxygen (O) atoms is not balanced. To balance them, we need to add a coefficient of 3 in front of CO\\(_2\\) to get 3CO\\(_2\\). Similarly, the number of iron (Fe) atoms is not balanced. To balance them, we need to add a coefficient of 2 in front of Fe to get 2Fe\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2182",
    "text": "What is the trend for ionization energy across a period in the periodic table?",
    "options": {
      "A": "Increases from left to right.",
      "B": "Remains constant",
      "C": "Varies randomly",
      "D": "Decreases from left to right"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67433?exam_type=jamb&type=obj&page=437",
    "correct_answer": "A",
    "explanation": "Ionization energy generally increases from left to right across a period. Ionization energy is the energy required to remove an electron from a neutral atom, and as you move from left to right, the atomic size decreases, making it harder to remove an electron, and thus, the ionization energy increases.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2183",
    "text": "Which type of chemical combination involves the transfer of electrons from one atom to another, resulting in the formation of oppositely charged ions?",
    "options": {
      "A": "Ionic bonding",
      "B": "Hydrogen bonding",
      "C": "Covalent bonding",
      "D": "Metallic bonding"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67435?exam_type=jamb&type=obj&page=437",
    "correct_answer": "A",
    "explanation": "Ionic bonding occurs between a metal and a non-metal. The metal atom donates one or more electrons to the non-metal atom, resulting in the formation of positively charged cations and negatively charged anions. These oppositely charged ions are held together by electrostatic forces to form an ionic compound.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2184",
    "text": "Which of the following alkanes has a straight-chain structure?",
    "options": {
      "A": "Cyclopentane (C5H10)",
      "B": "Isobutane (C4H10)",
      "C": "2 - methyl propane (C4H10)",
      "D": "Pentane (C5H12)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67443?exam_type=jamb&type=obj&page=437",
    "correct_answer": "D",
    "explanation": "Pentane (C5H12) is a straight-chain alkane. Alkanes are hydrocarbons with the general formula CnH2n+2. They are called straight-chain alkanes if all the carbon atoms are connected in a continuous chain without any branches. Butane and Isobutane are both C4H10, but Isobutane has a branched structure, not a straight chain. Cyclopentane (C5H10) is a cycloalkane, not a straight-chain alkane.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2185",
    "text": "What is the product of the electrolysis of aqueous sodium chloride (NaCl) using inert electrodes?",
    "options": {
      "A": "Hydrogen gas at the cathode and chlorine gas at the anode",
      "B": "Hydrogen gas at the cathode and oxygen gas at the anode",
      "C": "Sodium metal at the cathode and chlorine gas at the anode",
      "D": "Sodium metal at the cathode and oxygen gas at the anode"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67446?exam_type=jamb&type=obj&page=437",
    "correct_answer": "B",
    "explanation": "During the electrolysis of aqueous sodium chloride using inert electrodes (such as platinum or carbon), the cations (H\\(^+\\)) are attracted to the cathode and are reduced to form hydrogen gas (H\\(_2\\)). The anions (OH\\(^-\\)) are attracted to the anode and are oxidized to form oxygen gas (O\\(_2\\)).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2186",
    "text": "When an acidic solution is diluted, what happens to its pH?",
    "options": {
      "A": "It depends on the specific acid",
      "B": "It decreases",
      "C": "It remains the same",
      "D": "It increases"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67448?exam_type=jamb&type=obj&page=438",
    "correct_answer": "D",
    "explanation": "When an acidic solution is diluted by adding more solvent (usually water), the concentration of hydrogen ions (H\\(^+\\)) decreases. As a result, the pH of the solution increases, making it less acidic\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2187",
    "text": "Which of the following factors does NOT affect the rate of a chemical reaction?",
    "options": {
      "A": "Concentration of reactants",
      "B": "Presence of a catalyst",
      "C": "Molecular weight of products",
      "D": "Temperature"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67450?exam_type=jamb&type=obj&page=438",
    "correct_answer": "C",
    "explanation": "The molecular weight of products is not directly related to the rate of a chemical reaction. The factors that affect the reaction rate include concentration of reactants, temperature, presence of catalysts, surface area, and the nature of the reactants and products.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2188",
    "text": "Which organic compound is responsible for the characteristic aroma of fruits?",
    "options": {
      "A": "Alkane",
      "B": "Alkyne",
      "C": "Ester",
      "D": "Amine"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67452?exam_type=jamb&type=obj&page=438",
    "correct_answer": "C",
    "explanation": "Esters are organic compounds that have a pleasant, fruity aroma. They are responsible for the characteristic smells of fruits and many other fragrant substances.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2189",
    "text": "What is the molar mass of water (H2O)?",
    "options": {
      "A": "18 g/mol",
      "B": "22 g/mol",
      "C": "16 g/mol",
      "D": "12 g/mol"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67453?exam_type=jamb&type=obj&page=438",
    "correct_answer": "A",
    "explanation": "The molar mass of water (H2O) is calculated by adding the atomic masses of its constituent elements: 2 hydrogen atoms (each with a molar mass of approximately 1 g/mol) and 1 oxygen atom (with a molar mass of approximately 16 g/mol). Therefore, the molar mass of water is 2 x 1 g/mol + 1 x 16 g/mol = 18 g/mol.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2190",
    "text": "What is the chemical formula of rust, which is formed on the surface of iron in the presence of oxygen and moisture?",
    "options": {
      "A": "Fe\\(_3\\)O\\(_4\\)",
      "B": "FeO",
      "C": "Fe(OH)3",
      "D": "Fe\\(_2\\)O\\(_3\\)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67455?exam_type=jamb&type=obj&page=438",
    "correct_answer": "D",
    "explanation": "Rust is a reddish-brown compound that forms on the surface of iron in the presence of oxygen and moisture. Its chemical formula is Fe\\(_2\\)O\\(_3\\), indicating the presence of two iron atoms and three oxygen atoms in the compound.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2191",
    "text": "How many pi (\\(\\pi\\)) bonds are there in an alkene with six carbon atoms?",
    "options": {
      "A": "1",
      "B": "6",
      "C": "5",
      "D": "3"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67457?exam_type=jamb&type=obj&page=439",
    "correct_answer": "A",
    "explanation": "The alkene with six carbon atoms is hexene with the formula C\\(_6\\)H\\(_{12}\\).Hexene is an alkene, which means it has one carbon-carbon double bond,C=C and each double bond consists of one sigma bond and one pi bond.\nA single bond is a sigma bond.A double bond consists of one sigma bond and one pi bond.A triple bond consists of one sigma bond and two pi bonds.",
    "year": "2023"
  },
  {
    "number": "2192",
    "text": "What is the principal ore of iron, from which iron is extracted?",
    "options": {
      "A": "Calcite",
      "B": "Bauxite",
      "C": "Magnetite",
      "D": "Hematite"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67458?exam_type=jamb&type=obj&page=439",
    "correct_answer": "D",
    "explanation": "Hematite (Fe\\(_2\\)O\\(_3\\)) is the principal ore of iron and is widely mined for the extraction of iron metal.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2193",
    "text": "Which group does calcium belong to in the periodic table?",
    "options": {
      "A": "Alkaline earth metals",
      "B": "Halogens",
      "C": "Alkali metals",
      "D": "Noble gases"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67459?exam_type=jamb&type=obj&page=439",
    "correct_answer": "A",
    "explanation": "Calcium belongs to the alkaline earth metals group in the periodic table. It is located in Group 2 and has two valence electrons.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2194",
    "text": "Which of the following is a primary constituent of crude oil?",
    "options": {
      "A": "Pentane",
      "B": "Ethanol",
      "C": "Heptane",
      "D": "Methane"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67460?exam_type=jamb&type=obj&page=439",
    "correct_answer": "D",
    "explanation": "Crude oil is a mixture of hydrocarbons of various chain lengths. methane is one of the primary constituents of crude oil, and it belongs to the group of alkanes.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2195",
    "text": "What is the main source of carbon monoxide (CO) in urban areas?",
    "options": {
      "A": "Volcanic eruptions",
      "B": "Vehicle emissions",
      "C": "Forest fires",
      "D": "Industrial processes"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67461?exam_type=jamb&type=obj&page=439",
    "correct_answer": "B",
    "explanation": "The main source of carbon monoxide (CO) in urban areas is vehicle emissions, especially from incomplete combustion of gasoline and diesel in engines.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2196",
    "text": "What is the empirical formula of a compound containing 40.00% carbon, 6.67% hydrogen, and 53.33% oxygen by mass?",
    "options": {
      "A": "C\\(_4\\)H\\(_8\\)O\\(_4\\)",
      "B": "CH\\(_2\\)O",
      "C": "C\\(_2\\)H\\(_4\\)O\\(_2\\)",
      "D": "C\\(_3\\)H\\(_6\\)O\\(_3\\)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67463?exam_type=jamb&type=obj&page=440",
    "correct_answer": "B",
    "explanation": "To determine the empirical formula, we first need to convert the percentages to moles by assuming a convenient mass for the sample. Let's assume we have 100 grams of the compound.Mass of carbon = 40.00 gramsMass of hydrogen = 6.67 gramsMass of oxygen = 53.33 gramsNow, we calculate the moles of each element:Moles of carbon = 40.00 g / molar mass of carbon = 40.00 g / 12.01 g/mol ≈ 3.33 molMoles of hydrogen = 6.67 g / molar mass of hydrogen = 6.67 g / 1.01 g/mol ≈ 6.60 molMoles of oxygen = 53.33 g / molar mass of oxygen = 53.33 g / 16.00 g/mol ≈ 3.33 molNow, we find the smallest whole-number ratio of the moles:C ≈ 3.33 / 3.33 ≈ 1H ≈ 6.60 / 3.33 ≈ 2O ≈ 3.33 / 3.33 ≈ 1Thus, the empirical formula is CH2O.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2197",
    "text": "Which separation technique is used to separate different pigments in a mixture based on their affinity for a stationary phase and a mobile phase?",
    "options": {
      "A": "Chromatography",
      "B": "Filtration",
      "C": "Decantation",
      "D": "Distillation"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67464?exam_type=jamb&type=obj&page=440",
    "correct_answer": "A",
    "explanation": "Chromatography is a separation technique used to separate and analyze components of a mixture based on their differential partitioning between a stationary phase (e.g., paper or a column) and a mobile phase (e.g., solvent). Different components move at different rates, leading to separation.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2198",
    "text": "What is the common name for ethanoic acid?",
    "options": {
      "A": "Acetic acid",
      "B": "Butyric acid",
      "C": "Propionic acid",
      "D": "Formic acid"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67466?exam_type=jamb&type=obj&page=440",
    "correct_answer": "A",
    "explanation": "Ethanoic acid is commonly known as acetic acid. It is the main component of vinegar and is used in various industrial processes.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2199",
    "text": "What type of reaction is involved in the formation of alkanols from alkenes?",
    "options": {
      "A": "Elimination reaction",
      "B": "Redox reaction",
      "C": "Substitution reaction",
      "D": "Addition reaction"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67467?exam_type=jamb&type=obj&page=440",
    "correct_answer": "D",
    "explanation": "Alkanols can be formed from alkenes through an addition reaction. In this reaction, the carbon-carbon double bond of the alkene is broken, and a hydroxyl group (-OH) is added to one of the carbon atoms, resulting in the formation of an alcohol.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2200",
    "text": "What is the mass percentage of carbon (C) in methane (CH4)? (The molar mass of carbon is approximately 12 g/mol.)",
    "options": {
      "A": "25%",
      "B": "12%",
      "C": "75%",
      "D": "50%"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67468?exam_type=jamb&type=obj&page=440",
    "correct_answer": "C",
    "explanation": "The molar mass of methane (CH4) is calculated by adding the atomic masses of carbon (approximately 12 g/mol) and hydrogen (approximately 1 g/mol). Therefore, the molar mass of CH4 is 12 g/mol + 4 x 1 g/mol = 16 g/mol. The mass percentage of carbon in CH4 is given by (mass of carbon / total mass) x 100% = (12 g / 16 g) x 100% = 75%.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2201",
    "text": "Which of the following is a common property of non-metals?",
    "options": {
      "A": "Exist as solids at room temperature",
      "B": "Tend to gain electrons in chemical reactions",
      "C": "High thermal conductivity",
      "D": "Readily form cations in chemical reactions"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67470?exam_type=jamb&type=obj&page=441",
    "correct_answer": "B",
    "explanation": "Tend to gain electrons in chemical reactions. Non-metals typically have a high electronegativity and tend to gain electrons to achieve a stable electron configuration. This results in the formation of negatively charged ions (anions) during chemical reactions.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2202",
    "text": "What is the symbol used to represent an alpha particle?",
    "options": {
      "A": "α",
      "B": "γ",
      "C": "δ",
      "D": "β"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67471?exam_type=jamb&type=obj&page=441",
    "correct_answer": "A",
    "explanation": "An alpha particle is represented by the Greek letter 'α'. Alpha particles are a type of ionizing radiation ejected by certain types of radioactive materials. They consist of two protons and two neutrons, so they can be represented as a Helium-4 nucleus.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2203",
    "text": "When a substance is oxidized, it",
    "options": {
      "A": "Loses electrons",
      "B": "Gains oxygen atoms",
      "C": "Gains electrons",
      "D": "Loses protons (H+ ions)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67473?exam_type=jamb&type=obj&page=441",
    "correct_answer": "A",
    "explanation": "When a substance is oxidized, it loses electrons. Oxidation is a chemical reaction that involves the moving of electrons. Specifically, it's a process that involves the substance losing electrons. This is an old definition of oxidation, based on the oxygen's role in reactions. The modern definition of oxidation involves an increase in oxidation state by a molecule, atom, or ion.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2204",
    "text": "A blue litmus paper turns red when dipped into a solution. What does this indicate about the solution?",
    "options": {
      "A": "The solution is basic",
      "B": "The solution is neutral",
      "C": "The solution is acidic",
      "D": "The litmus paper is faulty"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67475?exam_type=jamb&type=obj&page=441",
    "correct_answer": "C",
    "explanation": "If a blue litmus paper turns red when dipped into a solution, it indicates the presence of an acid in the solution. Acids turn blue litmus paper red.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2205",
    "text": "Which of the following compounds is an example of an electrovalent bond?",
    "options": {
      "A": "NaCl (sodium chloride)",
      "B": "CO2 (carbon dioxide)",
      "C": "H2O (water)",
      "D": "CH4 (methane)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67477?exam_type=jamb&type=obj&page=441",
    "correct_answer": "A",
    "explanation": "NaCl, commonly known as sodium chloride or table salt, is an example of an electrovalent bond. Sodium (Na) donates one electron to chlorine (Cl), resulting in the formation of Na+ and Cl- ions, which are held together by the ionic bond.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2206",
    "text": "If gas A has a molar mass of 32 g/mol and gas B has a molar mass of 64 g/mol, what is the ratio of their diffusion rates?",
    "options": {
      "A": "2:1",
      "B": "1:2",
      "C": "1:1",
      "D": "1:4"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67478?exam_type=jamb&type=obj&page=442",
    "correct_answer": "A",
    "explanation": "According to Graham's law of diffusion, the ratio of the diffusion rates of two gases is the inverse of the square root of the ratio of their molar masses. Therefore:Rate of A / Rate of B = √(Molar mass of B / Molar mass of A)Rate of A / Rate of B = √(64 g/mol / 32 g/mol) = √2 = 1.41So, the ratio of their diffusion rates is approximately 2:1.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2207",
    "text": "The contact process is used for the industrial production of",
    "options": {
      "A": "sulfuric acid (H2SO4)",
      "B": "Hydrochloric acid (HCl)",
      "C": "Sodium hydroxide (NaOH)",
      "D": "Calcium oxide (CaO)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67480?exam_type=jamb&type=obj&page=442",
    "correct_answer": "A",
    "explanation": "The contact process is used for the industrial production of sulfuric acid (H2SO4), not any of the options provided. The process involves the oxidation of sulfur dioxide (SO2) to sulfur trioxide (SO3) which is then absorbed in sulfuric acid to form oleum (H2S2O7). The oleum is then diluted with water to form sulfuric acid.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2208",
    "text": "Which of the following is a unique property of water compared to other liquids?",
    "options": {
      "A": "It is a poor solvent",
      "B": "It does not evaporate",
      "C": "It expands when freezing",
      "D": "It has a low heat capacity"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67481?exam_type=jamb&type=obj&page=442",
    "correct_answer": "C",
    "explanation": "One unique property of water is that it expands when it freezes. Most substances contract and become denser when they freeze, but water expands and becomes less dense. This is why ice floats on water.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2209",
    "text": "Sodium reacts vigorously with water to produce",
    "options": {
      "A": "Sodium chloride (NaCl) and oxygen gas (O2)",
      "B": "Sodium nitrate (NaNO3) and water (H2O)",
      "C": "Sodium hydroxide (NaOH) and hydrogen gas (H2)",
      "D": "Sodium oxide (Na2O) and hydrogen gas (H2)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67483?exam_type=jamb&type=obj&page=442",
    "correct_answer": "C",
    "explanation": "When sodium reacts with water, it undergoes a highly exothermic reaction, producing sodium hydroxide (NaOH) and hydrogen gas (H2).\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2210",
    "text": "At room temperature and standard pressure, chlorine gas is in which state of matter?",
    "options": {
      "A": "Plasma",
      "B": "Solid",
      "C": "Liquid",
      "D": "Gas"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67484?exam_type=jamb&type=obj&page=442",
    "correct_answer": "D",
    "explanation": "Chlorine gas exists in the gaseous state at room temperature (around 25 degrees Celsius) and standard pressure.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2211",
    "text": "What is the molecular geometry of a molecule with three bonding pairs and no lone pairs around the central atom?",
    "options": {
      "A": "Tetrahedral",
      "B": "Trigonal planar",
      "C": "Linear",
      "D": "Octahedral"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67489?exam_type=jamb&type=obj&page=443",
    "correct_answer": "B",
    "explanation": "In a molecule with three bonding pairs and no lone pairs around the central atom, the electron pairs arrange themselves in a trigonal planar geometry, with bond angles of approximately 120 degrees.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2212",
    "text": "Isotopes of an element have",
    "options": {
      "A": "The same number of protons but different numbers of neutrons.",
      "B": "The same number of neutrons and electrons",
      "C": "The same number of protons and neutrons",
      "D": "The same number of protons and electrons"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67491?exam_type=jamb&type=obj&page=443",
    "correct_answer": "A",
    "explanation": "Isotopes of an element have the same number of protons (which defines the element) but may have different numbers of neutrons. Since atoms are electrically neutral, the number of protons must equal the number of electrons in an atom.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2213",
    "text": "Which element is placed at the top of the electrochemical series?",
    "options": {
      "A": "Copper",
      "B": "Hydrogen",
      "C": "Sodium",
      "D": "Oxygen"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67493?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "In the electrochemical series, also known as the reactivity series, Sodium is placed at the top. The electrochemical series is a list of elements in the order of their standard electrode potentials (or redox potentials). Elements at the top of the series are more reactive and have a greater tendency to lose electrons and form positive ions.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2214",
    "text": "Which transition metal is known for its multiple colorful oxidation states and compounds used in pigments and paints?",
    "options": {
      "A": "Silver (Ag)",
      "B": "Copper (Cu)",
      "C": "Gold (Au)",
      "D": "Zinc (Zn)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67495?exam_type=jamb&type=obj&page=443",
    "correct_answer": "B",
    "explanation": "Copper is known for its multiple oxidation states, including +1 and +2, and its compounds are used in pigments and paints to create various colors, such as blues and greens.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2215",
    "text": "Which of the following methods is commonly used to remove suspended impurities from water?",
    "options": {
      "A": "Fluoridation",
      "B": "Chlorination",
      "C": "Filtration",
      "D": "Distillation"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67496?exam_type=jamb&type=obj&page=443",
    "correct_answer": "C",
    "explanation": "Filtration is commonly used to remove suspended impurities, such as dirt, sand, and other particles, from water. In this process, water is passed through a filter medium that traps the solid impurities while allowing the clean water to pass through.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2216",
    "text": "What is the valency of an element with the electronic configuration 2, 8, 7?",
    "options": {
      "A": "7",
      "B": "1",
      "C": "2",
      "D": "3"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67498?exam_type=jamb&type=obj&page=444",
    "correct_answer": "B",
    "explanation": "The valency of an element is determined by the number of electrons it gains or loses to achieve a stable electron configuration. For an element with the electronic configuration 2, 8, 7, the outermost shell (valence shell) has 7 electrons. To achieve stability, it needs 1 more electron to fill the outermost shell, so its valency is 1.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2217",
    "text": "When anhydrous cobalt chloride paper is exposed to water, what color change is observed?",
    "options": {
      "A": "From pink to blue",
      "B": "From white to blue",
      "C": "From blue to white",
      "D": "From blue to pink"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67500?exam_type=jamb&type=obj&page=444",
    "correct_answer": "D",
    "explanation": "nhydrous cobalt chloride paper is blue in the absence of water. However, when it comes into contact with water, it undergoes a color change to pink due to the formation of hydrated cobalt chloride.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2218",
    "text": "Which type of salt is found in antacid medications and is used to relieve heartburn and indigestion?",
    "options": {
      "A": "Aluminum chloride",
      "B": "Magnesium chloride",
      "C": "Sodium chloride",
      "D": "Calcium chloride"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67507?exam_type=jamb&type=obj&page=444",
    "correct_answer": "B",
    "explanation": "Magnesium chloride is used in antacid medications to relieve heartburn and indigestion. It helps neutralize excess stomach acid.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2219",
    "text": "What is the atomic number of aluminium?",
    "options": {
      "A": "13",
      "B": "26",
      "C": "14",
      "D": "12"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67509?exam_type=jamb&type=obj&page=444",
    "correct_answer": "A",
    "explanation": "The atomic number of an element is the number of protons in the nucleus of an atom of that element. The atomic number of aluminium is 13, which means it has 13 protons in its nucleus.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2220",
    "text": "Which of the following metals is commonly alloyed with copper to make brass?",
    "options": {
      "A": "Iron",
      "B": "Nickel",
      "C": "Aluminum",
      "D": "Zinc"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67510?exam_type=jamb&type=obj&page=444",
    "correct_answer": "D",
    "explanation": "Brass is an alloy made by combining copper with zinc. It is a versatile material with a golden appearance and is used in various applications, including musical instruments, plumbing fittings, and decorative items.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2221",
    "text": "What happens when alkanoic acids react with alcohols in the presence of an acid catalyst?",
    "options": {
      "A": "Saponification",
      "B": "Esterification",
      "C": "Polymerization",
      "D": "Hydrolysis"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67511?exam_type=jamb&type=obj&page=445",
    "correct_answer": "B",
    "explanation": "When alkanoic acids react with alcohols in the presence of an acid catalyst, esterification occurs. This chemical reaction forms esters and water.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2222",
    "text": "Which functional group is present in alkanals?",
    "options": {
      "A": "Carbonyl group (C=O)",
      "B": "Hydroxyl group (-OH)",
      "C": "Alkyl group (-R)",
      "D": "Carboxyl group (-COOH)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67513?exam_type=jamb&type=obj&page=445",
    "correct_answer": "A",
    "explanation": "The carbonyl group (C=O) is the functional group present in alkanals. It consists of a carbon atom double-bonded to an oxygen atom.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2223",
    "text": "At 2.0 atm pressure, the volume of a gas is 4.0 L. If the pressure is reduced to 1.0 atm while keeping the temperature constant, what will be the new volume of the gas?",
    "options": {
      "A": "2.0 L",
      "B": "6.0 L",
      "C": "8.0 L",
      "D": "4.0 L"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67515?exam_type=jamb&type=obj&page=445",
    "correct_answer": "C",
    "explanation": "According to Boyle's law, when the temperature is constant, the initial pressure multiplied by the initial volume is equal to the final pressure multiplied by the final volume. Mathematically, P1V1 = P2V2, where P1 and V1 are the initial pressure and volume, and P2 and V2 are the final pressure and volume, respectively. Using the given values:(2.0 atm) * (4.0 L) = (1.0 atm) * (V2)Solving for V2:V2 = (2.0 atm * 4.0 L) / (1.0 atm) = 8.0 L\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2224",
    "text": "What is the main environmental concern associated with sulfur dioxide emissions?",
    "options": {
      "A": "Formation of acid rain",
      "B": "Global warming potential",
      "C": "Depletion of the stratospheric ozone",
      "D": "Depletion of the ozone layer"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67516?exam_type=jamb&type=obj&page=445",
    "correct_answer": "A",
    "explanation": "Sulfur dioxide, when released into the atmosphere, can react with water vapor and other atmospheric components to form sulfuric acid (H2SO4), which contributes to the formation of acid rain. Acid rain can have harmful effects on the environment, including damaging aquatic life, forests, and buildings.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2225",
    "text": "Benzene can be converted to its derivative toluene by the addition of a methyl group. The reaction is an example of",
    "options": {
      "A": "Nucleophilic substitution",
      "B": "Elimination reaction",
      "C": "Electrophilic substitution",
      "D": "Addition reaction"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67518?exam_type=jamb&type=obj&page=445",
    "correct_answer": "C",
    "explanation": "The conversion of benzene to toluene involves an electrophilic aromatic substitution reaction. In this reaction, a methyl group (CH3) is added to the benzene ring, replacing one of the hydrogen atoms, and the reaction proceeds through electrophilic attack on the benzene ring.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2226",
    "text": "Why is water often referred to as the \"universal solvent\"?",
    "options": {
      "A": "Water is the most abundant substance on Earth",
      "B": "Water is essential for all living organisms.",
      "C": "Water is involved in many chemical reactions",
      "D": "Water can dissolve a wide variety of substances due to its polar nature"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67519?exam_type=jamb&type=obj&page=446",
    "correct_answer": "D",
    "explanation": "Water is often referred to as the \"universal solvent\" because of its ability to dissolve a wide range of substances. This unique property is mainly due to water's polar nature. Water molecules have a slightly positive charge on the hydrogen atoms and a slightly negative charge on the oxygen atom, making it a polar molecule. This polarity allows water molecules to interact with and surround other polar and ionic substances, breaking them down and forming solutions.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2227",
    "text": "Which of the following mixtures is an example of a colloid?",
    "options": {
      "A": "Milk",
      "B": "Orange juice",
      "C": "Saltwater",
      "D": "Sugar dissolved in water"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67520?exam_type=jamb&type=obj&page=446",
    "correct_answer": "A",
    "explanation": "A colloid is a type of mixture where one substance is dispersed in another in the form of tiny particles that do not settle out. In milk, fat globules are dispersed in water, forming a colloid.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2228",
    "text": "Which of the following substances is NOT hygroscopic?",
    "options": {
      "A": "Salt",
      "B": "Sugar",
      "C": "Silica gel",
      "D": "Aluminum"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67521?exam_type=jamb&type=obj&page=446",
    "correct_answer": "D",
    "explanation": "Aluminum is not hygroscopic. It does not have a strong affinity for water vapor and does not absorb moisture from the air.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2229",
    "text": "What is the mass (in grams) of 500 mL of ethanol? (density of ethanol = 0.789 g/mL)",
    "options": {
      "A": "394.5 mL",
      "B": "500 mL",
      "C": "394.5 g",
      "D": "500 g"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67522?exam_type=jamb&type=obj&page=446",
    "correct_answer": "C",
    "explanation": "To calculate the mass of a substance, we can use the formula:Mass = Volume x DensityGiven the volume of ethanol is 500 mL and the density of ethanol is 0.789 g/mL, we can plug the values into the formula:Mass = 500 mL x 0.789 g/mL = 394.5 g\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2230",
    "text": "The heat of reaction can be determined experimentally using a device called a",
    "options": {
      "A": "Calorimeter",
      "B": "Barometer",
      "C": "Spectrometer",
      "D": "Thermometer"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67524?exam_type=jamb&type=obj&page=446",
    "correct_answer": "A",
    "explanation": "A calorimeter is a device used to measure the heat of reaction experimentally. It is designed to isolate the reaction from the surroundings and measure the temperature change in the surroundings to calculate the heat exchanged.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2231",
    "text": "Which halogen is a gas at room temperature and is pale yellow in color?",
    "options": {
      "A": "Chlorine (Cl)",
      "B": "Fluorine (F)",
      "C": "Iodine (I)",
      "D": "Bromine (Br)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67525?exam_type=jamb&type=obj&page=447",
    "correct_answer": "B",
    "explanation": "Fluorine is a halogen that is a gas at room temperature and is pale yellow in color. Halogens are a group in the periodic table consisting of five chemically related elements: fluorine (F), chlorine (Cl), bromine (Br), iodine (I), and astatine (At). Among these, only Fluorine and Chlorine are gases at room temperature, but Chlorine is greenish-yellow, not pale yellow.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2232",
    "text": "What unit of temperature should be used when applying the ideal gas law?",
    "options": {
      "A": "Fahrenheit (°F)",
      "B": "Kelvin (K)",
      "C": "Rankine (°R)",
      "D": "Celsius (°C)"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67527?exam_type=jamb&type=obj&page=447",
    "correct_answer": "B",
    "explanation": "Temperature must be expressed in Kelvin when using the ideal gas law. The Kelvin scale is an absolute temperature scale, and its zero point (0 K) corresponds to absolute zero, the point at which the kinetic energy of gas particles is minimal.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2233",
    "text": "Chlorine gas is commonly used in the production of which of the following industrial compounds?",
    "options": {
      "A": "Chlorofluorocarbons (CFCs)",
      "B": "Methane",
      "C": "Ammonia",
      "D": "Ethanol"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67528?exam_type=jamb&type=obj&page=447",
    "correct_answer": "A",
    "explanation": "Chlorine gas is used in the production of chlorofluorocarbons (CFCs), which were once widely used as refrigerants, aerosol propellants, and foam-blowing agents. However, due to their harmful impact on the ozone layer, their use has been significantly reduced.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2234",
    "text": "The process of rusting is an example of the formation of",
    "options": {
      "A": "Basic oxide",
      "B": "Acidic oxide",
      "C": "Reducing oxide",
      "D": "Amphoteric oxide"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67531?exam_type=jamb&type=obj&page=447",
    "correct_answer": "A",
    "explanation": "Rusting is the corrosion of iron or steel due to exposure to oxygen and moisture in the air, resulting in the formation of iron oxide (Fe\\(_2\\)O\\(_3\\) or Fe\\(_3\\)O\\(_4\\)), which is an example of an basic oxide.\nFe\\(_2\\)O\\(_3\\), also known as iron(III) oxide, is considered basic in nature; it exhibits more basic properties than acidic ones, although it can act as an amphoteric oxide, meaning it can react with both acids and bases under certain conditions.Since iron is a metal, its oxide (Fe2O3) is generally classified as basic.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2235",
    "text": "Which of the following is an example of a primary cell?",
    "options": {
      "A": "Alkaline battery",
      "B": "Nickel-cadmium battery",
      "C": "Lead-acid battery",
      "D": "Lithium-ion battery"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67532?exam_type=jamb&type=obj&page=447",
    "correct_answer": "A",
    "explanation": "Primary cells are non-rechargeable batteries, and the alkaline battery is a common example of a primary cell\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2236",
    "text": "Which of the following is a characteristic property of acids?",
    "options": {
      "A": "Turn litmus paper blue",
      "B": "Bitter taste",
      "C": "pH value above 7",
      "D": "React with metals to produce hydrogen gas"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67533?exam_type=jamb&type=obj&page=448",
    "correct_answer": "D",
    "explanation": "Acids are substances that can donate protons (H+) in aqueous solutions. When acids react with certain metals, they can release hydrogen gas (H2) as one of the products. This is a common behavior of many acids and can be used to distinguish them from other substances.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2237",
    "text": "The lanthanides and actinides are located in which block of the periodic table?",
    "options": {
      "A": "P-block",
      "B": "S-block",
      "C": "F-block",
      "D": "D-block"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67534?exam_type=jamb&type=obj&page=448",
    "correct_answer": "C",
    "explanation": "The lanthanides and actinides are located in the f-block of the periodic table, which is a separate row placed at the bottom of the main table. These elements are also known as the inner transition metals.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2238",
    "text": "What is the IUPAC name for the compound CCl\\(_4\\)?",
    "options": {
      "A": "Tetrahydrochloride",
      "B": "Tetrachloromethane",
      "C": "Carbon tetrachloride",
      "D": "Chloroform"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67535?exam_type=jamb&type=obj&page=448",
    "correct_answer": "B",
    "explanation": "The compound CCl\\(_4\\) is a chlorinated hydrocarbon with a central carbon atom and four chlorine atoms attached to it. According to IUPAC rules, the correct name for this compound is \"tetrachloromethane.\"\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2239",
    "text": "Which of the following statements is true regarding the melting and boiling points of pure substances?",
    "options": {
      "A": "The boiling point is always higher than the melting point",
      "B": "The melting point is always higher than the boiling point",
      "C": "The melting and boiling points are always the same for all substances",
      "D": "The melting and boiling points can vary depending on the substance"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67536?exam_type=jamb&type=obj&page=448",
    "correct_answer": "D",
    "explanation": "The melting and boiling points are specific physical properties of each substance and can vary depending on the nature of the substance. Different substances have different melting and boiling points, which are determined by the strength of the intermolecular forces and the molecular structure of the substance.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2240",
    "text": "An element has an atomic number of 8 and a mass number of 16. How many neutrons does this element have?",
    "options": {
      "A": "24",
      "B": "16",
      "C": "8",
      "D": "32"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67538?exam_type=jamb&type=obj&page=448",
    "correct_answer": "C",
    "explanation": "The atomic number of an element is equal to the number of protons, which in this case is 8. The mass number is the total number of protons and neutrons, which is 16. To find the number of neutrons, we subtract the atomic number from the mass number:Number of neutrons = Mass number - Atomic numberNumber of neutrons = 16 - 8Number of neutrons = 8So, the element has 8 neutrons.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2241",
    "text": "Which of the following statements is true for strong electrolytes?",
    "options": {
      "A": "They do not conduct electricity in the molten state",
      "B": "They completely dissociate into ions in solution",
      "C": "They are non-polar substances",
      "D": "They partially dissociate into ions in solution"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67540?exam_type=jamb&type=obj&page=449",
    "correct_answer": "B",
    "explanation": "They completely dissociate into ions in solution. Strong electrolytes are substances that fully dissociate into ions when dissolved in water or melted. As a result, they produce a high concentration of ions in the solution, allowing for efficient electrical conductivity.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2242",
    "text": "What is the maximum number of electrons that can occupy the second energy level (n=2)?",
    "options": {
      "A": "2 electrons",
      "B": "18 electrons",
      "C": "8 electrons",
      "D": "32 electrons"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67542?exam_type=jamb&type=obj&page=449",
    "correct_answer": "C",
    "explanation": "The correct answer is (b). The second energy level (n=2) can hold a maximum of 8 electrons. It consists of two subshells, 2s and 2p, which can hold 2 and 6 electrons, respectively.\nThere is an explanation video availablebelow.",
    "year": "2023"
  },
  {
    "number": "2243",
    "text": "Which of the following is a common laboratory indicator for bases?",
    "options": {
      "A": "Methyl orange",
      "B": "Phenolphthalein",
      "C": "Bromothymol blue",
      "D": "Litmus"
    },
    "answer_url": "https://myschool.ng/classroom/chemistry/67544?exam_type=jamb&type=obj&page=449",
    "correct_answer": "B",
    "explanation": "Phenolphthalein is a common laboratory indicator used to detect the presence of bases in a solution. In its basic form (pH > 8.3), it turns pink or purple, indicating the presence of a base.\nThere is an explanation video availablebelow.",
    "year": "2023"
  }
]