[
  {
    "number": "1290",
    "text": "The organs that will be most useful to giant African rats in finding their way in underground habitats are the",
    "options": {
      "A": "vibrissae",
      "B": "nostrils",
      "C": "eyes",
      "D": "tails"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14567?exam_type=jamb&type=obj&page=258",
    "correct_answer": "A",
    "explanation": "The correct answer is A. Vibrissae.\nGiant African rats, like many other rodents, use their vibrissae (whiskers) to navigate in the dark. Their vibrissae are highly sensitive to touch and can detect even slight changes in air pressure, helping them to:\n1. Detect obstacles and avoid collisions\n2. Sense the width of tunnels and passages\n3. Locate food and other objects. In underground habitats, where visibility is limited, the vibrissae become a crucial sensory organ for navigation.\nThe other options are less relevant:\nB. Nostrils: While important for smell, they're not directly useful for navigation.\nC. Eyes: Limited visibility underground makes eyes less useful.\nD. Tails: While helpful for balance, tails aren't directly involved in navigation\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1291",
    "text": "The increasing order of the particle size in following soil type is",
    "options": {
      "A": "clay → sand → silt →gravel",
      "B": "silt → sand → clay → gravel",
      "C": "clay → silt → sand → gravel",
      "D": "silt → clay → sand → gravel"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14568?exam_type=jamb&type=obj&page=259",
    "correct_answer": "C",
    "explanation": "Here's the increasing order of particle sizes:\nClay (< 0.002 mm) → Silt (0.002 - 0.05) → Sand (0.05 - 2 mm) → Gravel (2 - 60 mm)\nClay particles are the smallest. Infact, their tiny particles can be carried by water or wind. Silt particles are relatively small but bigger than clay. Sands are larger, coarse and gritty, and you can feel them between your fingers. Gravel particles are the largest. They are big and rocky and can be seen easily.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1292",
    "text": "The causative agent of bird flu is a",
    "options": {
      "A": "protozoan",
      "B": "virus",
      "C": "bacterium",
      "D": "fungus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14569?exam_type=jamb&type=obj&page=259",
    "correct_answer": "B",
    "explanation": "Bird flu, also known as avian influenza, is caused by influenza A viruses.\nThe virus spreads through contact with infected birds, their droppings, or contaminated surfaces. Humans can become infected by inhaling dust particles from infected birds or by touching contaminated surfaces.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1293",
    "text": "Which of the following is an example of parasitism?",
    "options": {
      "A": "fungi growing on a dead tree branch",
      "B": "a squirrel living in an abondoned nest of a bird",
      "C": "mistletoe growing on an orange tree",
      "D": "cattle egrets taking ticks from the body of cattle"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14570?exam_type=jamb&type=obj&page=259",
    "correct_answer": "C",
    "explanation": "The correct answer is C. Mistletoe growing on an orange tree.\nMistletoe is a parasitic plant that grows on the branches of another plant (in this case, an orange tree). It derives its nutrients from the host plant, harming it in the process.\nThe other options are not examples of parasitism:\nA. Fungi growing on a dead tree branch is an example of saprophytism (obtaining nutrients from dead organic matter).\nB. A squirrel living in an abandoned nest is an example of commensalism (one organism benefits, the other is not affected).\nD. Cattle egrets taking ticks from the body of cattle is an example of mutualism (both organisms benefit).\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1294",
    "text": "One adaptation shown by hydrophytes in freshwater habitats is the",
    "options": {
      "A": "leaves reduced to spines",
      "B": "poor development of roots and xylem tissues",
      "C": "waxy cuticle on shoot surface",
      "D": "well developed roots and supporting system"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14571?exam_type=jamb&type=obj&page=259",
    "correct_answer": "B",
    "explanation": "Hydrophytes (aquatic plants) in freshwater habitats often have adaptations that allow them to thrive in environments with abundant water. Consequently, one of the adaptations shown by hydrophytes in freshwater is poor development of roots and xylem tissues. Two common adaptations are:\n1. Poor development of roots: Since water is readily available, hydrophytes don't need extensive root systems to absorb water and nutrients.\n2. Poor development of xylem tissues: Xylem tissues are responsible for transporting water and minerals from the roots to the rest of the plant. With abundant water surrounding the plant, the need for xylem tissues is reduced.\nThe other options are not accurate:\nA. Leaves reduced to spines: This adaptation is more common in xerophytes (plants adapted to dry environments), not hydrophytes.\nC. Waxy developed roots and supporting system: This adaptation is more common in plants that need to conserve water, not hydrophytes.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1295",
    "text": "A crucible of 5g weighed 10g after filling with fresh soil. it is then heated in an oven at 100°C for 1 hour. After cooling in a desiccator, the weight was 8g.The percentage of water in the soil is",
    "options": {
      "A": "80%",
      "B": "60%",
      "C": "20%",
      "D": "40%"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14572?exam_type=jamb&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "Weight of crucible                                                       =  5g\nWeight of crucible + fresh soil before heating             = 10g\nWeight of crucible + fresh soil after heating                =  8g\nWeight of water loss                                                    = 10 - 8 = 2g\n% H2O in soil  = \\(\\frac{water loss}{wt. of  fresh soil}\\times 100\\)\n= \\(\\frac{2}{5}\\times 100\\)\n= 40%\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1296",
    "text": "The highest level of ecological organization is the",
    "options": {
      "A": "ecosystem",
      "B": "population",
      "C": "biosphere",
      "D": "niche"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14573?exam_type=jamb&type=obj&page=260",
    "correct_answer": "C",
    "explanation": "The biosphere is the global sum of all ecosystems. The two joined words are \"bio\" and \"sphere\". It can also be termed as the zone of life on Earth, a closed system, and largely self-regulating. The biosphere is the highest level of ecological organization. It's the sum of all ecosystems on Earth and includes all living organisms and the factors that support life.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1297",
    "text": "The mangrove swamp in Nigeria is restricted to the",
    "options": {
      "A": "sahel savana",
      "B": "sudan savanna",
      "C": "guinea savanna",
      "D": "tropical rain forest"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14574?exam_type=jamb&type=obj&page=260",
    "correct_answer": "D",
    "explanation": "The correct answer is D - Tropical rain forest.\nMangrove swamps are coastal ecosystems found in tropical and subtropical regions, including Nigeria. They thrive in areas with high rainfall, high temperatures, and saline or brackish water. In Nigeria, mangrove swamps are typically found along the coastal areas of the Niger Delta, which falls within the tropical rainforest region.\nThe other options are not accurate:\nA. Sahel savanna: This region is too dry and far from the coast to support mangrove swamps.\nB. Sudan savanna: While this region has some rainfall, it's still too dry and not suitable for mangrove swamps.\nC. Guinea savanna: This region has more rainfall than the Sahel or Sudan savannas, but it's still not the primary location for mangrove swamps in Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1298",
    "text": "A biotic factor which affects the distribution and abundance of organisms in a terrestrial habitat is",
    "options": {
      "A": "temperature",
      "B": "competition",
      "C": "pH",
      "D": "light"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14575?exam_type=jamb&type=obj&page=260",
    "correct_answer": "B",
    "explanation": "Competition is considered a biotic factor that can significantly affect organisms in a terrestrial habitat, as it involves interactions between living organisms within an ecosystem, like plants and animals competing for resources like food, water, or space. Other factors such as sunlight, temperature and pH in the option are abiotic factors.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1299",
    "text": "In which of the following Nigeria states can mountain vegetation be found?",
    "options": {
      "A": "Taraba",
      "B": "Enugu",
      "C": "Bauchi",
      "D": "Plateau"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14576?exam_type=jamb&type=obj&page=260",
    "correct_answer": "A",
    "explanation": "Mountains can be found in Taraba, Niger, Borno, and Adamawa states in Nigeria.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1300",
    "text": "Which of the following factors can bring about competition in population?",
    "options": {
      "A": "dispersion",
      "B": "emigration",
      "C": "drought",
      "D": "mortality"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14577?exam_type=jamb&type=obj&page=260",
    "correct_answer": "C",
    "explanation": "Drought can lead to competition for limited resources such as water and food, which can bring about competition in a population.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1301",
    "text": "The theory which supports the view that the large muscles developed by an athlete will be passed on to the offspring was proposed by",
    "options": {
      "A": "Lamarck",
      "B": "Darwin",
      "C": "Mendel",
      "D": "Pasteur"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14578?exam_type=jamb&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "Jean-Baptiste Lamarck proposed the theory of inheritance of acquired characteristics, also known as Lamarckism. This theory suggests that characteristics or traits acquired by an individual during their lifetime, such as large muscles developed by an athlete, can be passed on to their offspring.However, this theory has been largely discredited by modern genetics and evolutionary biology, which support the theory of evolution through natural selection proposed by Charles Darwin (option B). Consequently, the correct answer is option A.\nThe other options are not correct:\nC. Mendel is known for his work on genetics and the discovery of the laws of inheritance.\nD. Pasteur is known for his work on vaccination, pasteurization, and germ theory, but not for a theory related to the inheritance of acquired characteristics.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1302",
    "text": "In lizards, the lowering of the gular fold is used to?",
    "options": {
      "A": "catch insects",
      "B": "attract mates",
      "C": "defend their territory",
      "D": "frighten enemies"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14579?exam_type=jamb&type=obj&page=261",
    "correct_answer": "B",
    "explanation": "Male anoles have a retractable gular fold that is used to attract mates and to chase off rivals.\nWhen a lizard intend to attract a mate, it will arch its back and lower its gularfold.\nThe gular fold also swells when the lizard is in aggressive mode.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1303",
    "text": "Example of a fish that aestivates is",
    "options": {
      "A": "shark",
      "B": "croaker",
      "C": "lung fish",
      "D": "cat fish"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14580?exam_type=jamb&type=obj&page=261",
    "correct_answer": "C",
    "explanation": "The African lungfish (Protopterus annectens) is a fish that aestivates. Aestivation is a state of torpor that some fish undergo during dry periods.\nDuring aestivation, African lungfish burrow into the mud and enter a state of torpor, without food or water. They can remain in this state for up to five years. Other fish that aestivate include catfish, mudskippers, and South American lungfish. These fish use burrows as aestivation chambers to protect themselves from drying out.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1304",
    "text": "In mammals, the organ directly on top of the kidney is the",
    "options": {
      "A": "thyroid gland",
      "B": "adrenal grand",
      "C": "pancreas",
      "D": "prostate gland"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14581?exam_type=jamb&type=obj&page=261",
    "correct_answer": "B",
    "explanation": "Adrenal glands, also known as suprarenal glands, are small, triangular-shaped glands located on top of both kidneys. Adrenal glands produce hormones that help regulate your metabolism, immune system, blood pressure, response to stress and other essential functions.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1305",
    "text": "The photosynthetic pigments include",
    "options": {
      "A": "chlorophyll and carotenoids",
      "B": "chloroplasts and cytochromes",
      "C": "melanin and haemoglobin",
      "D": "carotenoids and haemoglobin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14582?exam_type=jamb&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "Chlorophyll and carotenoid are photosynthetic pigments. Carotenoid is a crucial accessory pigment in plants and algae that helps capture light energy from the sun and transfer it to chlorophyll, thereby enhancing the efficiency of photosynthesis by expanding the range of wavelengths absorbed by the plant.\nCytochrome is not considered a photosynthetic pigment; it is a protein involved in the electron transport chain, not directly involved in capturing light energy for photosynthesis.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1306",
    "text": "Monocot stem differ from dicot stems in that monocot have",
    "options": {
      "A": "no cambium",
      "B": "no pith",
      "C": "fewer vascular bundles",
      "D": "phloems with parenchyma"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14583?exam_type=jamb&type=obj&page=262",
    "correct_answer": "A",
    "explanation": "Monocots do not have a vascular cambium, even though some of them, such as palms and the Joshua tree, exhibit secondary growth. Instead, they have a thickening meristem that produces secondary ground tissue.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1307",
    "text": "The opening and closing of the stoma are regulated by",
    "options": {
      "A": "transpiration",
      "B": "respiration",
      "C": "diffusion",
      "D": "osmosis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14587?exam_type=jamb&type=obj&page=262",
    "correct_answer": "D",
    "explanation": "The process that controls the opening and closing of the stoma is osmosis, which occurs within the specialized cells called \"guard cells\" that surround the stoma; when water flows into the guard cells, they swell and the stoma opens, while when they lose water, they shrink and the stoma closes.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1308",
    "text": "Stunted growth and poor root development are a result of a deficiency in",
    "options": {
      "A": "sulpur",
      "B": "phosphorus",
      "C": "calcium",
      "D": "iron"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14589?exam_type=jamb&type=obj&page=262",
    "correct_answer": "B",
    "explanation": "Stunted growth and poor root development are typically signs of a phosphorus deficiency in a plant. Phosphorus plays a crucial role in root development and overall plant growth, so when levels are low, the plant struggles to produce strong roots and exhibits stunted growth.\nAlso, calcium deficiency in plants can lead to stunted growth and poor development of roots, as calcium plays a crucial role in cell wall strength and integrity, particularly at growing root tips, which can be significantly impacted by its absence; resulting in reduced root extension and nutrient uptake.\nA deficiency in phosphorus is more likely to lead to stunted growth and poor development of roots compared to a calcium deficiency in plants; phosphorus plays a crucial role in cell division and root development, making it a key factor in overall plant growth.\nPhosphorus is vital for energy transfer within plants, and its deficiency directly impacts root growth and development, leading to stunted root systems and hindering nutrient uptake. While calcium is important for cell wall structure and stability, its deficiency primarily affects the tips of young leaves and shoots, causing symptoms like leaf curling and marginal browning, rather than significantly impacting root development in the same way as phosphorus.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1309",
    "text": "The pancreas secretes enzymes for the digestion of",
    "options": {
      "A": "fats, proteins and carbohydrates",
      "B": "fats, vitamins and cellulose",
      "C": "fats, carbohydrates and vitamins",
      "D": "protein, cellulos and minerals"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14591?exam_type=jamb&type=obj&page=262",
    "correct_answer": "A",
    "explanation": "The correct answer is A. Fats, proteins, and carbohydrates.\nThe pancreas secretes digestive enzymes into the small intestine to break down:\n- Fats: pancreatic lipase - Break down triglycerides into fatty acids and glycerol\n- Proteins: pancreatic amylase, trypsin, and chymotrypsin -  Break down proteins into amino acids\n- Carbohydrates: pancreatic amylase - Break down carbohydrates into simple sugars\nThe other options are not correct:\nB. Vitamins are not broken down by pancreatic enzymes, and cellulose is broken down by microbial enzymes in the large intestine.\nC. Vitamins are not broken down by pancreatic enzymes.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1310",
    "text": "Pineapple is an example of",
    "options": {
      "A": "a dehiscent fruit",
      "B": "an aggregate fruit",
      "C": "a composite fruit",
      "D": "a simple fruit"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14592?exam_type=jamb&type=obj&page=262",
    "correct_answer": "C",
    "explanation": "A pineapple is a multiple fruit, which means it's technically a berry that develops from many fused flowers. It's also known as a composite or sorosis fruit.\nThe pineapple fruit ripens five to six months after flowering begins. The pineapple fruit is juicy, sweet, and can be pale cream to yellow in colour. The scales on the outside of a pineapple are individual flowers that have fused together. The plant is a small shrub with a short stem and a rosette of waxy leaves. The flowers of the pineapple plant are hermaphrodite, meaning they have both male and female parts, but are self-sterile.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1311",
    "text": "The correct sequence of the movement of urea during urine formation is",
    "options": {
      "A": "glomerulus → Bowman's capsule→ Convoluted tubules → Henle's loop → collecting tube",
      "B": "glomerulus → Bowman''s capsule→ Convoluted tubules → Henle's loop → convoluted tubule→ collecting tubule",
      "C": "convoluted tubules → glomerulus → Henle's loop→ Bowman's capsule →collecting tubules",
      "D": "convoluted tubule → Bowman's capsule → Henle's loop →glomerulus → collecting tubule"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14594?exam_type=jamb&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "The correct answer is B. Glomerulus-Bowman's capsule-convoluted tubules-Henle's loop-convoluted tubules-collecting tubules.\nThis sequence accurately reflects the path that urea and other waste products take during urine formation.\nHere's a step-by-step explanation of the correct sequence of urea movement during urine formation:\n1.Glomerulus: The journey of urea begins in the glomerulus, a cluster of tiny blood vessels in the kidney. Here, the blood is filtered, and urea, a waste product, passes through the glomerular filter into the nephron.\n2.Bowman's capsule: The filtered blood, including urea, collects in the Bowman's capsule, a cup-like structure surrounding the glomerulus.\n3.Convoluted tubules(proximal): From the Bowman's capsule, the filtrate (including urea) flows into the convoluted tubules. Here, some reabsorption and secretion occur, helping to regulate the amount of urea in the urine.\n4.Henle's loop: The filtrate then passes through Henle's loop, a U-shaped structure that helps concentrate the urine. Water and electrolytes are reabsorbed, increasing the concentration of urea.\n5.Convoluted tubules (Distal):The concentrated urea then enters the distal convoluted tubule, where further reabsorption occurs.\n6.Collecting tubules: Finally, the concentrated urine, containing urea, flows into the collecting tubules. Here, the final adjustments to the urine are made, and it is transported to the renal pelvis, then to the bladder, and eventually excreted.\nThe other options are incorrect and do not accurately reflect the sequence of urine formation.",
    "year": "2007"
  },
  {
    "number": "1312",
    "text": "The waste product of plants used in the conversion of hide to leather is",
    "options": {
      "A": "gum",
      "B": "alkaloid",
      "C": "tannin",
      "D": "resin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14596?exam_type=jamb&type=obj&page=263",
    "correct_answer": "C",
    "explanation": "Tannin is an acidic chemical compound that comes from tree bark. It's used in the process of tanning, which is the final step in turning animal skins into leather. Tannin is used to convert hides into leather. Historically, vegetable based tanning used tannin, an acidic chemical compound derived from the bark of certain trees, in the production of leather.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1313",
    "text": "Which of the following uses diffusion as the principal method of gaseous exchange?",
    "options": {
      "A": "lizard",
      "B": "grasshopper",
      "C": "rat",
      "D": "earthworm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14597?exam_type=jamb&type=obj&page=263",
    "correct_answer": "D",
    "explanation": "Earthworms primarily rely on diffusion as their main method of gaseous exchange, taking in oxygen and releasing carbon dioxide through their moist skin. Unlike many animals, earthworms lack lungs or gills, the specialized organs used for respiration in other creatures. Instead, they breathe through their skin, which serves as the primary surface for gas exchange.\nThe earthworm's skin must be kept moist for efficient gas exchange. This is because gases, like oxygen and carbon dioxide, dissolve in water and can then diffuse across the skin's surface.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1314",
    "text": "Which of the following has the most primitive respiratory system?",
    "options": {
      "A": "snail",
      "B": "fish",
      "C": "insect",
      "D": "mouse"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14599?exam_type=jamb&type=obj&page=263",
    "correct_answer": "A",
    "explanation": "Evolutionary trend of respiratory system from simple to complex\nDiffusion through skin/cell → gills → tracheal tubes → book lungs → lungs\nSome groups of snails that live in freshwater respire using gills, whereas other groups need to reach the surface to breathe air. In addition, some are amphibious and have both gills and a lung.\nSnails have a very primitive respiratory system, which includes:\n- A simple body surface that allows for gas exchange\n- A mantle cavity that contains a small amount of water, which helps with gas exchange\n- No lungs or tracheae\nThis type of respiratory system is often referred to as \"cutaneous respiration\" or \"diffusion-based respiration,\" where oxygen diffuses directly into the body tissues.\nIn contrast:\n- Fish (B) have gills, which are more complex and efficient for gas exchange in aquatic environments.\n- Insects (C) have a tracheal system, which includes tubes that bring oxygen directly to cells.\n- Mouse (D) has lungs and a complex respiratory system adapted for terrestrial life.\nSo, snails have the most primitive respiratory system among the options.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1315",
    "text": "A water medium is necessary for fertilization in",
    "options": {
      "A": "fungi",
      "B": "conifers",
      "C": "ferns",
      "D": "angiosperms"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14601?exam_type=jamb&type=obj&page=263",
    "correct_answer": "C",
    "explanation": "Ferns and some conifers require water for fertilization because sperm cells of ferns are flagellated and need water to swim to the egg cell for fertilization.\nIn contrast, fungi do not require water for fertilization as they produce via spores or other mechanisms. Also, angiosperms (flowering plants) do not require water for fertilization as pollen grains are transferred through the air or by pollinators, and fertilization takes place within the plant.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1316",
    "text": "The chromosomes of members of the kingdom Monera are within the",
    "options": {
      "A": "nucleoplasm",
      "B": "cytoplasm",
      "C": "nucleus",
      "D": "nucleolus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14602?exam_type=jamb&type=obj&page=264",
    "correct_answer": "B",
    "explanation": "The chromosomes of monerans are located in the cytoplasm of the cell in a region called the nucleoid.\nMonerans are prokaryotic organisms, which means they lack a true nucleus. However, they also do not have nucleolus. The DNA of monerans is circular and made of a double helical molecule. The DNA is not contained within a membrane-bound nucleus, but is instead found in the cytoplasm. Some species of bacteria have additional rings of DNA called plasmids. Plasmids replicate along with the bacterial chromosome and carry genes for antibiotic resistance.\nIn summary, monerans do not have nucleolus and nucleoplasm because they lack a true nucleus. Instead, their DNA is found in a region of the cytoplasm called the nucleoid.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1317",
    "text": "The process of shedding the exoskeleton of an arthropod is known as",
    "options": {
      "A": "metamorphosis",
      "B": "instar formation",
      "C": "ecdysis",
      "D": "tagmosis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14604?exam_type=jamb&type=obj&page=264",
    "correct_answer": "C",
    "explanation": "Metamorphosis is a biological process that involves a major change in an organism's form or structure. It can occur in many animals, including insects, amphibians, fish, and crustaceans.\nInstar formation is the developmental stage of an arthropod between molts. It occurs until the arthropod reaches sexual maturity.\nEcdysis is the process of shedding an animal's outer layer or cuticle. It's also known as molting, sloughing, or shedding.\nTagmosis is the evolutionary process by which segments of an arthropod's body are grouped together into larger, functional units called tagmata.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1318",
    "text": "Which of the following is common to the mosquito, housefly and blackfly?",
    "options": {
      "A": "they undergo complete metamorphosis",
      "B": "they are parasites of man",
      "C": "their immature stages are aquatic",
      "D": "their adults have two pairs of wings"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14606?exam_type=jamb&type=obj&page=264",
    "correct_answer": "A",
    "explanation": "Blackflies, houseflies, and mosquitos undergo complete metamorphosis, meaning they go through distinct stages of egg, larva, pupa, and adult in their life cycle. This type of life cycle involves a distinct pupal stage where the organism significantly changes its form before emerging as an adult. E.g Insects like butterflies, beetles, bees, ants, and most flies, including houseflies and mosquitos, all exhibit complete metamorphosis.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1319",
    "text": "An accurate identification of a rapist can be carried out by conducting a",
    "options": {
      "A": "RNA  analysis",
      "B": "DNA analysis",
      "C": "blood group text",
      "D": "behavioural traits test"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14608?exam_type=jamb&type=obj&page=264",
    "correct_answer": "B",
    "explanation": "Each person's DNA is different, except for identical twins. This means that DNA can be used to accurately identify a perpetrator, similar to the way we use fingerprints. DNA evidence can be collected from blood, saliva, sweat, urine, skin tissue, and semen.\nBiological evidence such as semen, blood, vaginal secretions, saliva, vaginal epithelial cells may be identified and genetically typed by a crime lab.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1320",
    "text": "which of the following is true of cloning?",
    "options": {
      "A": "it is welcomed as an ethical and morally sound science",
      "B": "only one cell of the original organism is needed to initiate the process",
      "C": "the clone is similar to but not exactly like the original organism",
      "D": "it involves the asexual multiplication of the tissues of the original organism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14609?exam_type=jamb&type=obj&page=264",
    "correct_answer": "D",
    "explanation": "Cloning is the process of creating a genetic copy of a cell or organism. The copy is called a clone. Cloning involves the asexual replication of the genetic makeup of an organism. This process can occur naturally or artificially. It'sasexualbecause all the genes in the neworganismare from the same source, rather than being a mixture of the genes from two individuals.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1321",
    "text": "An example of a sex linked trait is the",
    "options": {
      "A": "ability to grow long hair in females",
      "B": "colour of the skin in humans",
      "C": "ability to roll the tongue",
      "D": "possession of facial hair in adult humans"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14610?exam_type=jamb&type=obj&page=265",
    "correct_answer": "D",
    "explanation": "The correct answer is D. Possession of facial hair in adult humans.\nSex-linked traits are characteristics influenced by genes located on the sex chromosomes (X and Y). Facial hair in humans is a sex-linked trait because:\n- The gene controlling facial hair growth is located on the X chromosome.\n- Males, with their XY chromosomes, are more likely to inherit the dominant allele for facial hair growth.\n- Females, with their XX chromosomes, would need to inherit two copies of the dominant allele (one from each X chromosome) to express facial hair growth.\nThe other options are not sex-linked traits:\nA. Ability to grow long hair in females is influenced by multiple genes, but it's not sex-linked.\nB. Colour of the skin in humans is influenced by multiple genes and is not sex-linked.\nC. Ability to roll the tongue is an autosomal dominant trait, meaning it's not linked to the sex chromosomes.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1700",
    "text": "Use the diagram above to answer this question. The type of protective adaptation exhibited by the animal is",
    "options": {
      "A": "disruptive colouration",
      "B": "flash colouration",
      "C": "countershading colouration",
      "D": "warning colouration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31267?exam_type=jamb&type=obj&page=340",
    "correct_answer": "C",
    "explanation": "The correct answer is C. Countershading colouration.\nAfrican rats often have a darker color on their backs (dorsal side) and a lighter color on their bellies (ventral side). This coloration pattern is an example of countershading, which helps to:\n- Reduce visibility by breaking up the outline of the body\n- Create a sense of volume and depth, making it harder for predators to detect the rat's shape and movement. Countershading is a type of protective coloration that helps animals blend in with their surroundings and avoid detection.\nThe other options are not the best fit:\nA. Disruptive colouration involves bold, contrasting patterns that break up an animal's outline, making it harder to see. While African rats may have some disruptive patterns, countershading is a more accurate description.\nB. Flash colouration refers to bright, striking colours used for communication, mating, or warning. African rats do not typically exhibit flash colouration.\nD. Warning colouration involves bright, conspicuous colors that signal to predators that an animal is toxic, distasteful, or otherwise unpalatable. African rats do not typically exhibit warning colouration.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1701",
    "text": "Use the diagram above to answer this question. The structure labelled l is",
    "options": {
      "A": "photosensitive",
      "B": "radiosensitive",
      "C": "chemoreceptive",
      "D": "tactile"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31268?exam_type=jamb&type=obj&page=341",
    "correct_answer": "D",
    "explanation": "The correct answer is D. Tactile.\nVibrissae, also known as whiskers, are specialized hairs found on the faces of many mammals, including rats. They are highly sensitive to touch and play a crucial role in:\n- Spatial awareness and navigation\n- Detecting objects and obstacles\n- Measuring distances and textures\nRats use their vibrissae to gather information about their environment and make precise movements.\nThe other options are not accurate:\nA. Photosensitive refers to sensitivity to light, which is not a characteristic of vibrissae.\nB. Radiosensitive refers to sensitivity to radiation, which is also not relevant to vibrissae.\nC. Chemoreceptive refers to sensitivity to chemical stimuli, such as smells or tastes. While rats have a keen sense of smell, their vibrissae are not chemoreceptive.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1702",
    "text": "Use the diagram above to answer this question.Insulin is produced by the endocrine organ labelled",
    "options": {
      "A": "IV",
      "B": "III",
      "C": "II",
      "D": "I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31272?exam_type=jamb&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "Insulin is produced by the pancreas gland; specifically, by the beta cells within the pancreas. The pancreas is a gland located behind the stomach, and its primary function is to regulate blood sugar levels by producing insulin and glucagon hormones.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1703",
    "text": "Use the diagram above to answer this question. The function of the structure labelled l is to",
    "options": {
      "A": "stimulate the development of secondary sexual characters",
      "B": "prepare the body for any emergency",
      "C": "maintain proper glucose concentration in the blood",
      "D": "regulate the activities of other endocrine glands"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31273?exam_type=jamb&type=obj&page=341",
    "correct_answer": "D",
    "explanation": "The part labelled I is the Pituitary gland. The pituitary gland produces hormones that regulate many bodily functions, including growth, metabolism, reproduction, and more. It's often called the \"master gland\" because of its role in controlling other glands.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1704",
    "text": "Use the diagram above to answer this question.Oxygenated blood is pumped to the entire body from the part labelled",
    "options": {
      "A": "IV",
      "B": "lll",
      "C": "ll",
      "D": "l"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31275?exam_type=jamb&type=obj&page=341",
    "correct_answer": "A",
    "explanation": "RIGHT ATRIUM   (II)LEFT ATRIUM    (I)RIGHT VENTRICLE (III)LEFT VENTRICLE (IV)\n- The part labelled iv is the LEFT VENTRICLE\n-The left atrium receives the now oxygen-rich blood from the lungs and pumps it into the left ventricle. The left ventricle pumps the oxygen-rich blood to the body through a large network of arteries.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1705",
    "text": "Use the diagram above to answer this question. The part labelled l is the",
    "options": {
      "A": "pulmonary artery",
      "B": "vena cava",
      "C": "aorta",
      "D": "bicuspid valve"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31276?exam_type=jamb&type=obj&page=341",
    "correct_answer": "A",
    "explanation": "See diagram above\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1706",
    "text": "Use the diagram above to answer this question.The part labelled lV is responsible for",
    "options": {
      "A": "osmoregulation",
      "B": "respiration",
      "C": "ingestion",
      "D": "locomotion"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31279?exam_type=jamb&type=obj&page=342",
    "correct_answer": "A",
    "explanation": "The part labelled IV is the contractile vacuole of the paramecium(See diagram).\nThe contractile vacuole's function is to remove excess water from a cell through a process called osmoregulation. This organelle helps maintain the cell's water balance and protects the cell from rupturing.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1707",
    "text": "Use the diagram above to answer this question. The organelle responsible for sexual reproduction is",
    "options": {
      "A": "ll",
      "B": "l",
      "C": "lV",
      "D": "lll"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31281?exam_type=jamb&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "The part of a paramecium used for reproduction is the micronucleus. While paramecium has two nuclei, the larger macronucleus controls daily functions, while the smaller micronucleus is responsible for storing genetic material and is involved in sexual reproduction. The part labelled III is the micronucleus.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1708",
    "text": "Use the diagram above to answer this question.\n\nThe process illustrated is",
    "options": {
      "A": "gametogenesis",
      "B": "sporulation",
      "C": "sexual reproduction in Spirogyra",
      "D": "sexual reproduction in Rhizopus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31284?exam_type=jamb&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "Rhizopus, also known as bread mold, reproduces sexually when two compatible hyphae fuse. This process produces diploid zygospores, which germinate into new mycelia.\nSteps in sexual reproduction\nCompatible hyphae come into contactSmall outgrowths called progametangia formThe progametangia mature and the common wall disappearsThe contents of the progametangia mix, fusing (+) and (-) strainsDiploid nuclei formThe zygospore enlarges and secretes a five-layered structureThe zygospore enters a resting periodThe zygospore germinates, producing germ sporangiophores or promyceliumThe promycelium develops a germ sporangium at the tip, releasing sporesEach spore germinates to form a new mycelium.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1709",
    "text": "Use the diagram above to answer this question.\n\nThe structure labelled l is the",
    "options": {
      "A": "sporangium",
      "B": "hypha",
      "C": "zygospore",
      "D": "conidiospore"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31286?exam_type=jamb&type=obj&page=342",
    "correct_answer": "C",
    "explanation": "The part labelled I is the zygospore.\nA zygospore in Rhizopus is a thick-walled, resting spore formed through sexual reproduction when two compatible hyphae (male and female) fuse together, creating a structure that contains multiple nuclei which then fuse to form diploid nuclei, essentially acting as the \"seed\" for a new Rhizopus individual; it's a key characteristic of this fungus and is considered a key identifying feature of the Zygomycete phylum to which Rhizopus belongs.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1710",
    "text": "Use the diagram above to answer this question.\n\nIf the dogs are offspring of a monohybird cross and the gene G for grey head is dominant cross over its allele g, the individual whose genotype is likely to be gg is",
    "options": {
      "A": "ll",
      "B": "l",
      "C": "IV",
      "D": "lll"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31287?exam_type=jamb&type=obj&page=342",
    "correct_answer": "C",
    "explanation": "The dog( with non- grey head)  in iv must be homozygous recessive and the genotype is likely to be gg.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1711",
    "text": "Use the diagram above to answer this question.\n\nWhich of the following will be true of dog ll which lost its tail in an accident if it mates with dog lll.",
    "options": {
      "A": "None of its offspring will be born without a tail",
      "B": "3/4 of its offspring will be born without tails",
      "C": "All its offspring will be born without tails",
      "D": "1/4 of its offspring will  be born without tails"
    },
    "answer_url": "https://myschool.ng/classroom/biology/31289?exam_type=jamb&type=obj&page=343",
    "correct_answer": "A",
    "explanation": "If a dog that had its tail surgically removed due to an accident is bred with a dog with a long tail, none of their offspring will be born without tails; the genetic information for tail development is still present in the \"tailless\" dog, even though it cannot physically express it due to the previous surgery, so all puppies will inherit the potential for a tail from the long-tailed parent.\nRemoving a physical trait like a tail through surgery or accident does not change the genetic makeup of the animal, meaning they can still pass on the genes for that trait to their offspring. If a dog with a naturally occurring \"bobtail\" (genetically short tail) were bred with a long-tailed dog, there might be a chance for some puppies to inherit the bobtail gene and have shorter tails, but this scenario is different from a dog that had its tail surgically removed.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1729",
    "text": "In the diagram, it shows that the organisms are?",
    "options": {
      "A": "hermaphrodite",
      "B": "viviparous",
      "C": "oviparous",
      "D": "ovoviviparous"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37164?exam_type=jamb&type=obj&page=346",
    "correct_answer": "C",
    "explanation": "Oviparous animals are those that reproduce by laying eggs. They include animals like birds, most reptiles, most amphibians, most fishes.\nViviparous animals are the animals that give birth directly to their kind. These individuals grow up and live. Oviparous animals are animals that do not give birth to their kind. Instead, they lay eggs that are either fertilised or unfertilised.\nOvoviviparous means producing eggs that hatch inside the mother's body, rather than being laid outside. It's a reproductive strategy that's seen in some fishes and reptiles.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1730",
    "text": "The breeding posture illustrated in the diagram is known as",
    "options": {
      "A": "mating",
      "B": "amplexus",
      "C": "courtship display",
      "D": "reproductive swimming"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37165?exam_type=jamb&type=obj&page=346",
    "correct_answer": "B",
    "explanation": "Amplexus defines the mating position of frogs and toads, in which the male clasps the female about the back.\nAmplexus is a type of mating behavior exhibited by some externally fertilizing species in which a male grasps a female with his front legs as part of the mating process, and at the same time or with some time delay, he fertilizes the eggs as they are released from the female's body.\n\"Mating\" refers to the general act of sexual reproduction between two organisms, while \"amplexus\" is a specific mating posture used by frogs where the male clasps onto the female's back, aligning their cloacae to facilitate external fertilization; essentially, amplexus is a type of mating behavior unique to frogs, focused on positioning for egg fertilization, rather than the broader term of mating itself.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1731",
    "text": "In the diagram, the experiment demonstrates",
    "options": {
      "A": "geotropism",
      "B": "thigmotropism",
      "C": "phototropism",
      "D": "hydrotropism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37170?exam_type=jamb&type=obj&page=347",
    "correct_answer": "A",
    "explanation": "Charles Darwin was one of the first to scientifically document that roots showpositive gravitropismand stems shownegative gravitropism. That is, roots grow in the direction of gravitational pull (i.e., downward) and stems grow in the opposite direction (i.e., upwards).\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1732",
    "text": "In the diagram, the part marked I will contain a high concentration of",
    "options": {
      "A": "ascorbic acid",
      "B": "abscisic acid",
      "C": "ethylene",
      "D": "auxin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37171?exam_type=jamb&type=obj&page=347",
    "correct_answer": "D",
    "explanation": "Abscisic acid (ABA) is found in the roots and leaves of plants, including seedlings. ABA is a plant hormone that helps plants respond to environmental stress and developmental processes.\nAscorbic acid, also known as vitamin C, is found in all cell compartments of plants, including the cell wall, chloroplasts, and cytosol.\nEthylene is found in all parts of a plant, including seedlings.\nAuxin alters the plant wall plasticity making it easier for the plant to grow upwards. Auxin is a plant hormone found in the roots of seedlings. Auxin is produced in the tips of the roots and shoots, and it can diffuse to other parts of the plant.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1733",
    "text": "In the diagram, the organelle responsible for heredity is",
    "options": {
      "A": "iii",
      "B": "iv",
      "C": "ii",
      "D": "i"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37174?exam_type=jamb&type=obj&page=347",
    "correct_answer": "A",
    "explanation": "The nucleus of a cell contains DNA, which is the organelle responsible for heredity. The nucleus is the cell's command center, controlling the cell's growth, division, and other functions.\nThere is an explanation video availablebelow.",
    "year": "2007"
  },
  {
    "number": "1734",
    "text": "In the diagram, the part labelled I is the",
    "options": {
      "A": "nuclear membrane",
      "B": "cell wall",
      "C": "endoplasmic recticulum",
      "D": "plasmellema"
    },
    "answer_url": "https://myschool.ng/classroom/biology/37175?exam_type=jamb&type=obj&page=347",
    "correct_answer": "B",
    "explanation": "The part labelled I is the cell wall(See digram above).\nThere is an explanation video availablebelow.",
    "year": "2007"
  }
]