[
  {
    "number": "768",
    "text": "Ihyā' 'Ulūm ad-dīn is the title of a book written by",
    "options": {
      "A": "Ibn Rushd",
      "B": "ar-Rāzī",
      "C": "al-Ghazālī",
      "D": "ibn Sīna"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64641?exam_type=jamb&type=obj&page=154",
    "correct_answer": "C",
    "explanation": "al - Ghazali . Al -Ghazâlî (c. 1056-1111) was one of the most prominent and influential philosophers, theologians, jurists, and mystics of Sunni Islam. He wrote ūlūm ad-din.",
    "year": "2019"
  },
  {
    "number": "769",
    "text": "Zakatul-fitr is not permissible on",
    "options": {
      "A": "Maize",
      "B": "kolanut",
      "C": "Rice",
      "D": "Millet"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64643?exam_type=jamb&type=obj&page=154",
    "correct_answer": "B",
    "explanation": "Zakat al-Fitr is a charity taken for the poor a few days before the end of fasting in the Islamic holy month of Ramadan. One cannot use kolanut as Zakat al-Fitr.",
    "year": "2019"
  },
  {
    "number": "770",
    "text": "One of the ways by which Islamic civilization was manifested in West Africa was",
    "options": {
      "A": "recruitment of Muslim medical personnel to man health institutions",
      "B": "construction of palaces based on Arab technology",
      "C": "the employment of scholars of Arabic as envoys by kings and emperors",
      "D": "establishment of universities to train scientists"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64646?exam_type=jamb&type=obj&page=154",
    "correct_answer": "C",
    "explanation": "Islamic civilization was manifested through employment of Scholars, of Arab as envoys by the king's Islam.",
    "year": "2019"
  },
  {
    "number": "771",
    "text": "According to Hadīth 31 of an-Nawawi, man will be loved by 'Allāℎ if he is",
    "options": {
      "A": "Kind to his neighbours",
      "B": "Obedient to the prophets",
      "C": "Indifferent to the world",
      "D": "Steadfast in prayers"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64649?exam_type=jamb&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "Hadith 31- \"Detach yourself from the world and Allah will love you. Detach yourself from what people possess and they will love you.\" The message in this Hadith is that if we can stay away from the worldly things, like Drinking alcohol, idolatry, fornication, e.t.c Allah will love you more.",
    "year": "2019"
  },
  {
    "number": "772",
    "text": "The worst vice prevalent during the Jahiliyyah period was",
    "options": {
      "A": "Cowardice",
      "B": "Disloyalty",
      "C": "Insincerity",
      "D": "vengeance"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64654?exam_type=jamb&type=obj&page=155",
    "correct_answer": "B",
    "explanation": "Jāhiliyyah, in Islam, the period preceding the revelation of the Qurʾān to the Prophet Muhammad. In Arabic the word means \"ignorance,\" or \"barbarism,\" and indicates a negative Muslim evaluation of pre-Islamic life and culture in Arabia as compared to the teachings and practices of Islam.",
    "year": "2019"
  },
  {
    "number": "773",
    "text": "One of the factors which helped the spread of Islam in West Africa was",
    "options": {
      "A": "the existence of clans and kingdoms",
      "B": "the establishment of many schools",
      "C": "effective trade relationship",
      "D": "the building of a mosque in Timbuktu"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64656?exam_type=jamb&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "The introduction of Islam to West Africa, wasn't violence or forced, it was done in an orderly and peaceful manner, through making friends with them, entering into trading business with them. Through that, they were able to gain there trust and Islam was introduced and taught to them.",
    "year": "2019"
  },
  {
    "number": "774",
    "text": "One of the most outstanding developments after the Hijrah was the",
    "options": {
      "A": "increase in cooperation with the Jews",
      "B": "emergence of a new religion",
      "C": "emergence of the Muslim",
      "D": "increase in hostilities against the Muslims"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64657?exam_type=jamb&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "The Hegira is the migration or journey of the Islamic prophet Muhammad and his followers from Mecca to Yathrib, later renamed by him Medina, in the year 622.Muslims ummah is a theory that no matter where you come from, as long as you are a Muslim, you are a member of a worldwide family.Prophet Muhammud migration (Hegira) brought about this development.",
    "year": "2019"
  },
  {
    "number": "775",
    "text": "Who among the prophets of 'Allāh was sent to his people to warn against deceit in term of measurement and weight",
    "options": {
      "A": "Shuaib (S.)",
      "B": "Nuh (A.S)",
      "C": "Salih (A.S)",
      "D": "Hud (A.S)"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64658?exam_type=jamb&type=obj&page=155",
    "correct_answer": "A",
    "explanation": "The chiefs of those who disbelieved among his people said to their people: \"If you follow Shu'aib be sure then you will be the losers!\"Then he (shu'aib) turned from them and said: \"O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I sorrow for the disbelieving people's (destruction).\" (7:85-93 Quran)",
    "year": "2019"
  },
  {
    "number": "776",
    "text": "Who among the four rightly guided caliphs introduced the systems of Bayr at māl?",
    "options": {
      "A": "'Umar b. al-Khattāb",
      "B": "'Ali b. ' Abī Tālib.",
      "C": "'Uthmān b. 'Affān",
      "D": "Abū Bakr as Siddīq"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64659?exam_type=jamb&type=obj&page=156",
    "correct_answer": "A",
    "explanation": "Bayt al-mal ( ﺑﻴﺖ ﺍﻟﻤﺎﻝ ) is an Arabic term that is translated as \"House of money\" or \"House of Wealth.\" Historically, it was a financial institution responsible for the administration of taxes in Islamic states , particularly in the early Islamic Caliphate . It served as a royal treasury for the caliphs and sultans , managing personal finances and government expenditures. Further, it administered distributions of zakat revenues for public works.",
    "year": "2019"
  },
  {
    "number": "777",
    "text": "The verse above, is an expression of man's absolute",
    "options": {
      "A": "dependence on 'Allāℎ",
      "B": "obedience to 'Allāℎ",
      "C": "loyalty to 'Allāℎ",
      "D": "humility to 'Allāℎ"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64660?exam_type=jamb&type=obj&page=156",
    "correct_answer": "C",
    "explanation": "The verse speaks about man loyalty to Almighty Allah, and man we forever praise, worship, pray and and preach his glory.",
    "year": "2019"
  },
  {
    "number": "778",
    "text": "Fount (of abundance) was given to the Prophet (S.A.W) and made known to him in sūrah",
    "options": {
      "A": "al-Takāthur",
      "B": "Al-Kawthar",
      "C": "an-Nasr",
      "D": "al-Mā' ūn"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64661?exam_type=jamb&type=obj&page=156",
    "correct_answer": "B",
    "explanation": "Surah Al-kawthar \"Do you know what Al-Kawthar is?\" They replied, \"Allah and His Messenger know best.\" He said: \"It is a river granted to me by my Lord, the Almighty, the All-Powerful in Paradise, in which is great goodness; its drinking vessels are as (limitless as) the heavenly bodies. It refuses to allow one of the slaves to drink, and the Prophet will say: 'Oh, my Lord! He is one of my community.' But it will be said to him: 'You know nothing of the innovations (in religion) that they practiced after you.\" You can check the Holy Qu'ran to read the full verse.",
    "year": "2019"
  },
  {
    "number": "779",
    "text": "The Makkan forces were not successful at the battle of Khandaq because they",
    "options": {
      "A": "ran out of supplies",
      "B": "were not familiar with the strategy of the Muslims",
      "C": "were not properly coordinated",
      "D": "were afraid of another defeat"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64662?exam_type=jamb&type=obj&page=156",
    "correct_answer": "B",
    "explanation": "The battle of khandaq was a battle of wits, the Muslims were out numbered but they used a defensive strategy of digging a trench(khandaq) which was used to trap most of the Arab. The siege was a \"battle of wits\", in which the Muslims tactically overcame their opponents while suffering very few casualties. Efforts to defeat the Muslims failed, and Islam became influential in the region. As a consequence, the Muslim army besieged the area of the Banu Qurayza tribe , leading to their surrender.The defeat caused the Meccans to lose their trade and much of their prestige.",
    "year": "2019"
  },
  {
    "number": "780",
    "text": "The first man on earth, Adam (A.S), was exalted above other creatures because of his",
    "options": {
      "A": "Insight",
      "B": "knowledge",
      "C": "Intelligence",
      "D": "Obedience"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64668?exam_type=jamb&type=obj&page=156",
    "correct_answer": "B",
    "explanation": "when Allah created man, he created him in his own image, and he gave him more knowledge and authority over all the other creatures. He gave made man the custodian of other creatures created by him.",
    "year": "2019"
  },
  {
    "number": "781",
    "text": "The term al-Mutawātir refers to Hadīth narrated by",
    "options": {
      "A": "large number of narrators",
      "B": "the six sound collectors",
      "C": "Bukhari and Muslim",
      "D": "the Prophet's closest companions"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64679?exam_type=jamb&type=obj&page=157",
    "correct_answer": "A",
    "explanation": "Al- Mutawatir is an Arabic word uptake which means \"to be lowered from person to person\". This term is used in the study of Ulum al-Quran and Mustalah Hadith. According to the hadith scholars, the above hadith is narrated by more than one hundred Prophet's companions with a hundred different sanad.",
    "year": "2019"
  },
  {
    "number": "782",
    "text": "In the Islamic law of inheritance, the share of the mother of the deceased who has no children is",
    "options": {
      "A": "1/3",
      "B": "1/639",
      "C": "1/2",
      "D": "1/4"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64680?exam_type=jamb&type=obj&page=157",
    "correct_answer": "A",
    "explanation": "the Islamic law of inheritance, the share of the mother of the deceased who has no children is 1/3. When a person dies, and he/she has no child, the mother of the deceased is able to take 1/3 of the deceased property.",
    "year": "2019"
  },
  {
    "number": "783",
    "text": "In sūrah al-Qāri'ah, mankind is compared to",
    "options": {
      "A": "humiliated beasts",
      "B": "laden camels",
      "C": "scattered moths",
      "D": "pampered creatures"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64681?exam_type=jamb&type=obj&page=157",
    "correct_answer": "C",
    "explanation": "Surah 101 Al Qari'ah \"The day of Noise and Clamour:What is the Day of Noise and Clamour?And what will explain to thee, what the Day of Noise and Clamour is?It is a Day whereon men will be like moths scattered about,And the mountains will like carded wool.Then, he whose balance of good deeds will be found heavy,Will be in a Life of good pleasure and satisfaction.But he whose balance of good deeds will be found light - Will have his home in a bottomless Pit.And what will explain to thee what this is? It is a Fire blazing fiercely!\"",
    "year": "2019"
  },
  {
    "number": "784",
    "text": "Jihād against carnal self is a",
    "options": {
      "A": "minor jihād",
      "B": "compulsory jihād",
      "C": "major jihād",
      "D": "desirable jihād"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64682?exam_type=jamb&type=obj&page=157",
    "correct_answer": "C",
    "explanation": "The phrase internal Jihad or greater Jihad refers to the efforts of a believer to live their Muslim faith as well as possible. All religious people want to live their lives in the way that will please their God. Major jihad is a struggle between oneself to live a holy life.",
    "year": "2019"
  },
  {
    "number": "785",
    "text": "According to Islamic teachings, angels are",
    "options": {
      "A": "of divine nature",
      "B": "a class of jinns",
      "C": "like human beings",
      "D": "loyal servants of Allah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64683?exam_type=jamb&type=obj&page=157",
    "correct_answer": "D",
    "explanation": "Angels are believed to be celestial beings, created from a luminous origin by God . They have different functions, including praising God in heavens, interacting with humans ordinary life, and carrying laws of nature. Islam acknowledges the concept of angels both as anthropomorphic and abstract. Belief in angels is one of the sixarticles of faith in Islam. The Quran is the principal source for the Islamic concept of angels, but more extensive features of angels appear in hadiths , Mi'raj literature, Islamic theology and Islamic philosophy . The angels differ from other spiritual creatures in their attitude as creatures of virtue in contrast to impure demons and morally ambivalent jinn .",
    "year": "2019"
  },
  {
    "number": "786",
    "text": "The Jahiliyyah practice that was gradually phased out is",
    "options": {
      "A": "Adultery",
      "B": "gambling",
      "C": "alcoholism",
      "D": "Usury"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64685?exam_type=jamb&type=obj&page=158",
    "correct_answer": "C",
    "explanation": "Abolishing Alcoholism is one of the reform that was introduced during Jāhiliyyah. It was made known that Allah frowns at alcoholism and we Muslims must not take alcohol, because it is a sin.",
    "year": "2019"
  },
  {
    "number": "787",
    "text": "According to Qur'ān 4:48, to set up partners with Allah is a great offense which Allah will not forgive",
    "options": {
      "A": "even if He forgives all other sins",
      "B": "except the Prophet (S.A.W) intercedes",
      "C": "until He has forgiven all other sins",
      "D": "except the offender repents"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64687?exam_type=jamb&type=obj&page=158",
    "correct_answer": "A",
    "explanation": "Qu'ran 4:48 \"Surely Allah does not forgive that a partner be ascribed to Him, although He forgives any other sins for whomever He wills. He who associates anyone with Allah in His divinity has indeed forged a mighty lie and committed an awesome sin.\" It is a great sin if one create or ascribe any other good or partner to Allah. Allah forgives all sins, but he won't forgive this.",
    "year": "2019"
  },
  {
    "number": "788",
    "text": "'Still less can their knowledge comprehend the hereafter ...' Q. 27:66).This verse above of the Qur'ān implies that",
    "options": {
      "A": "man's comprehension of the expectations in the Hereafter is a always on the decrease",
      "B": "most men do not believe in the Hereafter",
      "C": "man's knowledge of the Hereafter can only be partial",
      "D": "it is difficult to deceive in the Hereafter"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64688?exam_type=jamb&type=obj&page=158",
    "correct_answer": "B",
    "explanation": "(27:66) Nay, but they have lost their knowledge of the Hereafter. They are steeped in doubt and uncertainty about it: rather they are blind to it. After warning the people about their basic errors with regard to Divinity, it is being said that the reason why these people are involved in these errors is not that they have reached this conclusion after serious thought and deliberation that there also exist other beings who are Allah's associates in His Divinity, but the actual reason is that they have never considered this matter seriously. As they are unaware of the Hereafter, or are in doubt about it, or are blind to it, their heedlessness of the Hereafter has developed in them an utterly irresponsible attitude. They are not at all serious about the universe and the real problems of their own lives. They do not bother to know what reality is and whether their philosophy of life accords with that reality or not. For, according to them, in the end the polytheist and the atheist, the monotheist and the agnostic, all will become one with the dust after death, and nothing will bear any fruit.The theme of the Hereafter is contained in this sentence of the preceding verse: \"They do not know when they will be raised back to life.\" In that sentence it was said that those who are made deities, the angels, jinns, prophets, saints, etc., do not themselves know when will be the Resurrection. Here three things have been said about the common polytheists and the atheists: (1) They do not at all know whether there will be any Hereafter or not; (2) this lack of information on their part is not due to the reason that they were never informed of this, but because they did not believe in the information given to them and doubted its authenticity; and (3) they never bothered to consider with due thought and seriousness the arguments that were advanced about the coming of the Hereafter, but they preferred to remain blind to it.",
    "year": "2019"
  },
  {
    "number": "789",
    "text": "Where the husband and wife mutually agree to termite their marriage contract without anything against each other, such a dissolution is termed",
    "options": {
      "A": "mubāra'ah",
      "B": "ilā'",
      "C": "Khul",
      "D": "Faskh"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64690?exam_type=jamb&type=obj&page=158",
    "correct_answer": "A",
    "explanation": "Mubāra'ah. A type of divorce under Islamic law whereby the parties mutually agree to dissolve their marriage. The husband and wife will have a mutual agreement on a good term that they want to end it.",
    "year": "2019"
  },
  {
    "number": "790",
    "text": "The importance of knowledge of isnād and matn lies in the fact that",
    "options": {
      "A": "both were taught by the Prophet (S.W)",
      "B": "they make it possible to understand Hadīth",
      "C": "the two make it easy to memorize Hadītℎ",
      "D": "the two make it easy to identify fault in Hadīth"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64691?exam_type=jamb&type=obj&page=158",
    "correct_answer": "D",
    "explanation": "it is also called science of hadith, orscience of hadith criticism or hadith criticism. It consists of several religious scholarly disciplines used in the study and evaluation of the Islamic hadith - i.e. the record of the words, actions, and the silent approval of the Islamic prophet, Muhammad, by Muslim scholars. Determining authenticity of hadith is enormously important in Islam because along with the Quran , the Sunnah of the Islamic prophet-his words, actions, and the silent approval-are considered divine revelation ( wahy ), and the record of them (i.e. hadith) provides the basis of Islamic law ( Sharia ).",
    "year": "2019"
  },
  {
    "number": "791",
    "text": "The statement in Hadīth 25 above gave rise to the explanation as to the different ways by which",
    "options": {
      "A": "pilgrimage can be performed",
      "B": "Prayers can be offered",
      "C": "fasting can be observed",
      "D": "alms can be given"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64692?exam_type=jamb&type=obj&page=159",
    "correct_answer": "D",
    "explanation": "this Hadith, brought about giving of charity \"Has not Allah made things for you to give in charity? Truly every tasbeehah [saying: 'subhanAllah'] is a charity, and every takbeerah [saying: 'Allahu akbar'] is a charity, and every tahmeedah [saying: 'al-hamdu lillah'] is a charity, and every tahleelah [saying: 'laa ilaha illaAllah'] is a charity. And commanding the good is a charity, and forbidding an evil is a charity, and in the bud`i [sexual act] of each one of you there is a charity.\"",
    "year": "2019"
  },
  {
    "number": "792",
    "text": "The man who analyzed the first encounter the Prophet (S.A.W) with Angel Jibril was",
    "options": {
      "A": "Hatīb b. Abī Balta'a",
      "B": "Arqam b. Arqam",
      "C": "Waraqah b. Nawfal",
      "D": "'Uthmān b. 'Affān"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64694?exam_type=jamb&type=obj&page=159",
    "correct_answer": "C",
    "explanation": "Waraqah ibn Nawfal. Warqah ibn Nawfal ibn Asad ibn Abd-al-Uzza ibn Qusayy Al-Qurashi (Arabic ﻭﺭﻗﻪ ﺑﻦ ﻧﻮﻓﻞ ﺑﻦ ﺃﺳﺪ ﺑﻦ ﻋﺒﺪ ﺍﻟﻌﺰّﻯ ﺑﻦ ﻗﺼﻲ ﺍﻟﻘﺮﺷﻲ ) was an Arab priest and the paternal first cousin of Khadija bint Khuwaylid, the first wife of the Islamic prophet Muhammad.",
    "year": "2019"
  },
  {
    "number": "793",
    "text": "From the above, the goal of luqmān's counsel to his son:... As contained in sūrah 31:13 is to",
    "options": {
      "A": "Encourage goodness to parents",
      "B": "Discourage pride",
      "C": "Warn against finding partners for Allah",
      "D": "Uphold the principle of justice"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64696?exam_type=jamb&type=obj&page=159",
    "correct_answer": "C",
    "explanation": "O my son! Join not in worship others with Allah.Allah tells us how Luqman advised his son. His full name was Luqman bin `Anqa' bin Sadun, and his son's name was Tharan, according to a saying quoted by As-Suhayli.Allah describes him in the best terms, and states that he granted him wisdom. Luqman advised his son, the closest and most beloved of all people to him, who deserved to be given the best of his knowledge. So, Luqman started by advising him to worship Allah Alone, and not to associate anything with Him. Read Surah 31:13 for full text.",
    "year": "2019"
  },
  {
    "number": "794",
    "text": "'It is most hateful in the sight of Allah that you say that which you do not' (Q. 61:3). The main teaching of the verse above is honesty in",
    "options": {
      "A": "Words and deeds",
      "B": "Words",
      "C": "Deeds and worship",
      "D": "deeds"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64698?exam_type=jamb&type=obj&page=159",
    "correct_answer": "A",
    "explanation": "It was reported that some of them said 'I fought while he did not, and I attacked while he did not' and 'I did such and such' but he did not. So Allah (swt) revealed this verse reprimanding them in general without specifying the matter for which they were reprimanded. Therefore, the reprimand is for anyone who says something but does not do it.'It is deeply abhorrent to Allah that you should say what you do not do.'",
    "year": "2019"
  },
  {
    "number": "795",
    "text": "An aspect of the Nigerian culture which may be regarded as shirk is\nbetween boys and girls",
    "options": {
      "A": "worship of ancestors",
      "B": "signing and dancing in public",
      "C": "ceremonies involving social interaction between boys and girls",
      "D": "excessive spending at burial ceremonies"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64707?exam_type=jamb&type=obj&page=159",
    "correct_answer": "A",
    "explanation": "Shirk means \"making a partner [of someone]\" in Islam , idolatry, polytheism, and the association of God with other deities. It is a sin to serve any idol before Almighty Allah, before Allah is the only powerful and most Holy.",
    "year": "2019"
  },
  {
    "number": "796",
    "text": "The period of custody of a baby girl after her mother has been divorced lasts until she is",
    "options": {
      "A": "Married",
      "B": "10years old",
      "C": "5years old.",
      "D": "Mature"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64712?exam_type=jamb&type=obj&page=160",
    "correct_answer": "A",
    "explanation": "when a woman is divorced and she has a baby girl, she only has the custody of the girl till she is married. After the girl get married, the woman has no custody over her.",
    "year": "2019"
  },
  {
    "number": "797",
    "text": "The Muslim soldier who introduced Islam into Tripoli was",
    "options": {
      "A": "Sa'ād b. Abi Waqās",
      "B": "'Uqbah b. Nāfī",
      "C": "'Uqbah b. Sacad",
      "D": "'Amar b. al ās"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64719?exam_type=jamb&type=obj&page=160",
    "correct_answer": "B",
    "explanation": "ʿUqba ibn Nāfiʿ ( Arabic : ﻋﻘﺒﺔ ﺑﻦ ﻧﺎﻓﻊ ), also referred to as Oqba ibn Nafi, Uqba bin Nafe, Uqba ibn al Nafia, or Akbah; 622-683) was an Arab general serving the Rashidun Caliphate since the Reign of Umar and later on the Umayyad Caliphate during the reigns of Muawiyah I and Yazid I , leading the Muslim conquest of the Maghreb , including present-day Algeria, Tunisia , Libya(Tripoli Is the capital of Libya) andMorocco .",
    "year": "2019"
  },
  {
    "number": "798",
    "text": "The Prophet (S.A.W) enjoins that if anyone sees an abomination, the least thing to do is to",
    "options": {
      "A": "turn his eyes away",
      "B": "condemn it in public",
      "C": "change it with his hands",
      "D": "hate it in his heart"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64727?exam_type=jamb&type=obj&page=160",
    "correct_answer": "D",
    "explanation": "Prophet Muhammud enjoins Muslims that when they see an abomination, they should avoid and run away from it, even the least they could do is to hate it in their heart.",
    "year": "2019"
  },
  {
    "number": "799",
    "text": "In the hadīth that ends with '...piety is based right here ...', the Prophet (S.A.W.) meant the",
    "options": {
      "A": "City of Makkah",
      "B": "Hand",
      "C": "Heart",
      "D": "City of al-Madīnah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64729?exam_type=jamb&type=obj&page=160",
    "correct_answer": "C",
    "explanation": "Piety is here\" - and he pointed to his chest three times. \"It is enough of evil for a person to hold his brother Muslim in contempt. As a muslims our exterior beauty, skin colour, clothes should not be our major concern but also what his in our heart, we should try and clean our heart of evil thoughts.",
    "year": "2019"
  },
  {
    "number": "800",
    "text": "Asmā' ar - rijāl is a term used by scholars of",
    "options": {
      "A": "Usūl",
      "B": "History",
      "C": "jurisprudence",
      "D": "Hadīth"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64731?exam_type=jamb&type=obj&page=160",
    "correct_answer": "D",
    "explanation": "`Ilm al- Rijāl ; literally meaning 'Knowledge of Men' , but more commonly understood as the Science of Narrators) refers to a discipline of Islamic religious studies within hadith terminology in which the narrators of hadith are evaluated.",
    "year": "2019"
  },
  {
    "number": "801",
    "text": "'If ye do it not, take notice of war from 'Allah and His Apostle: But if ye turn back,ye shall have your capital sums ...' (Q.2:279) The quotation above warns against",
    "options": {
      "A": "Usury",
      "B": "gambling",
      "C": "Fraud",
      "D": "cheating"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64734?exam_type=jamb&type=obj&page=161",
    "correct_answer": "A",
    "explanation": "Quaran 2:279 \"But if you fail to do so, then be warned of war from Allah and His Messenger. If you repent even now, you have the right of the return of your capital; neither will you do wrong nor will you be wronged",
    "year": "2019"
  },
  {
    "number": "802",
    "text": "Ahmad bab, one of the early West African 'Ulamā', was based in",
    "options": {
      "A": "Timbuktu",
      "B": "Borno",
      "C": "Mali",
      "D": "Sokoto"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64735?exam_type=jamb&type=obj&page=161",
    "correct_answer": "A",
    "explanation": "Timbuktu is a city in Mali, situated 20 km north of the Niger River. The town is the capital of the Timbuktu Region, one of the eight administrative regions of Mali. It had a population of 54,453 in the 2009 census",
    "year": "2019"
  },
  {
    "number": "803",
    "text": "Q.4:34 enjoins the wife not only to be obedient but also to",
    "options": {
      "A": "endure all difficultie",
      "B": "defend her rights",
      "C": "maintain her chastity",
      "D": "protect her home"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64737?exam_type=jamb&type=obj&page=161",
    "correct_answer": "C",
    "explanation": "Men look after women, because Allah has made the one of them to excel the other, and because they spend of their property (for the support of women). So good women are the obedient, guarding in secret that which Allah hath guarded. As for those from whom ye fear rebellion, admonish them and banish them to beds apart, and scourge them . Then if they obey you, seek not a way against them. Lo! Allah is ever High, Exalted, Great.",
    "year": "2019"
  },
  {
    "number": "804",
    "text": "Ignorance of religious rites and duties is not excusable in Islam because",
    "options": {
      "A": "it is obligatory on all Muslims to seek knowledge",
      "B": "most Muslims can read and write Arabic",
      "C": "books of Islamic jurisprudence have been translated into many languages",
      "D": "the Islamic system of education is highly developed all over the world"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64740?exam_type=jamb&type=obj&page=161",
    "correct_answer": "A",
    "explanation": "Ignorance is the absence of common sense and basic knowledge. Ignorance is the attribute of the arrogant, egoistic and selfish people. When people indulge in self importance only and are being arrogant, being egoistic, being selfish and just care about worldly status are good example of ignorant people. These attributes make them deaf, dumb and blind so they can not differentiate between true and false, good and bad, right and wrong and just follow whims and desires blindly.",
    "year": "2019"
  },
  {
    "number": "805",
    "text": "Marriage is referred to in Q. 4:21 as",
    "options": {
      "A": "mirhāq",
      "B": "khitbah",
      "C": "Nikāh",
      "D": "Ijbar"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64745?exam_type=jamb&type=obj&page=161",
    "correct_answer": "A",
    "explanation": "mirhāq \"And how could you take it [back] while you have gone in unto each other, they have taken from you a firm and strong covenant (Mithaq) Q. 4:21",
    "year": "2019"
  },
  {
    "number": "806",
    "text": "The prophet whose wife was impious and consequently suffered the same calamity with the unbelievers was",
    "options": {
      "A": "Mūsa",
      "B": "Lūt",
      "C": "Yūsuf",
      "D": "Shu'aib"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64747?exam_type=jamb&type=obj&page=162",
    "correct_answer": "B",
    "explanation": "Prophet let was sent to Sodom and Gomorrah to preach to the people to turn away from their sexual immorality (men were sleeping with men, women were sleeping with women), the people of Sodom and Gomorrah, refused to listen to lūt warning. They even assaulted him, then Allah sent an angel to tell lot to leave with his family away from there because Allah wants to destroy the city.Allah had decreed that the city of Sodom should perish. An earthquake rocked the town. It was as if a mighty power had lifted the entire city and flung it down in one jolt. A storm of stones rained on the city. Everyone and everything was destroyed, including Lūt's wife.",
    "year": "2019"
  },
  {
    "number": "807",
    "text": "Fard and Harām in the scope of sharī'ah mean",
    "options": {
      "A": "permissible and punishable",
      "B": "obligatory and prohibited",
      "C": "compulsory and disliked",
      "D": "tolerable and abominable"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/64749?exam_type=jamb&type=obj&page=162",
    "correct_answer": "B",
    "explanation": "fard \" means \"obligation\". ... For example, fard prayer, wajib prayer, sunnah mu'akkadah prayer, sunnah ghayr-mu'akkadah prayer, nafl prayer, harām prayer, or makrūh tahrēman prayer",
    "year": "2019"
  }
]