[
  {
    "number": "203",
    "text": "Increase in the number of people living below the poverty line in Africa is particularly because",
    "options": {
      "A": "The largest proportion of Africa's populations are unemployed",
      "B": "Of the prevalence of corruption",
      "C": "Of the problem of insecurity scaring away investors",
      "D": "A vast majority of its populants have chosen to be unproductive"
    },
    "answer_url": "https://myschool.ng/classroom/history/55234?exam_type=jamb&type=obj&page=41",
    "correct_answer": "A",
    "explanation": "It is largely and logically smart to trace Africa's poverty increase to the widespread unemployment rate of the youth - the largest proportion of the African population. N.B: as much as almost all of the options are right, the emphasis in the question is on 'particularly'.",
    "year": "2019"
  },
  {
    "number": "204",
    "text": "The First and Second World Wars were between ... respectively",
    "options": {
      "A": "1939-1945, 1914-1918",
      "B": "1914-1918, 1939-1945",
      "C": "1914-1919, 1932-1942",
      "D": "1914-1919, 1939-1945"
    },
    "answer_url": "https://myschool.ng/classroom/history/55235?exam_type=jamb&type=obj&page=41",
    "correct_answer": "B",
    "explanation": "The First and Second World War were between 1914-1918 and 1939-1945 respectively.",
    "year": "2019"
  },
  {
    "number": "205",
    "text": "The main motive behind imperialism has been aforetime categorised as primarily",
    "options": {
      "A": "to colonise less developed states",
      "B": "the socio-economic transformation agenda for Africa",
      "C": "to expand socio-cultural territories of the Western powers",
      "D": "being to obtain and control a supply of raw materials for industries"
    },
    "answer_url": "https://myschool.ng/classroom/history/55237?exam_type=jamb&type=obj&page=41",
    "correct_answer": "D",
    "explanation": "The historical motivation for imperialism by the Western Powers has been to obtain and control the abundant raw materials, resources of the developing States.This particular feature of socio-economic dominion differentiates it from Colonialism as a concept.",
    "year": "2019"
  },
  {
    "number": "206",
    "text": "The most immediate reason for the declaration, by Ojukwu, of Eastern Nigeria as an independent State of Biafra was that",
    "options": {
      "A": "The Gowon-led coup strictly targeted the Igbos",
      "B": "The wanted the freedom for the Igbos at all cost",
      "C": "Of the creation of twelve States by Gowon to dismantle any secessionist agenda",
      "D": "corruption and oppression was too prevalent in Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55239?exam_type=jamb&type=obj&page=42",
    "correct_answer": "C",
    "explanation": "Ojukwu, being Governor of the Eastern Region, immediately declared it an independence State of Biafra seeing as Gowon created twelve states in May 1976 without consultation. This, Ojukwu considered as the last straw.",
    "year": "2019"
  },
  {
    "number": "207",
    "text": "Igbo's active resistance to the British Colonial rule is particularly because of the",
    "options": {
      "A": "impression that the British officials favoured the Northerners",
      "B": "maladministration of the British Indirect rule Policy",
      "C": "regressive taxation of their society",
      "D": "egalitarian nature of their society"
    },
    "answer_url": "https://myschool.ng/classroom/history/55241?exam_type=jamb&type=obj&page=42",
    "correct_answer": "D",
    "explanation": "The Igbos challenged the British imperial rule as the system of governance did not sit well with the egalitarian nature of their society where no one is designated out-rightly as a political leader.",
    "year": "2019"
  },
  {
    "number": "208",
    "text": "The Colony and Protectorate of Lagos and the Protectorate of Southern Nigeria were merged in ... to form",
    "options": {
      "A": "1906, Colony and Protectorate of Southern Nigeria",
      "B": "1901, Colony and Protectorate of Southern Nigeria",
      "C": "1906, Lagos Colony and Southern Nigeria Protectorate",
      "D": "1901, Colony and Protectorate of Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55499?exam_type=jamb&type=obj&page=42",
    "correct_answer": "A",
    "explanation": "1906, the Colony and Protectorate of Southern Nigeria is the correct answer. The amalgation of 1914 produced the Colony and Protectorate of Nigeria.",
    "year": "2019"
  },
  {
    "number": "209",
    "text": "The major administrative change made immediately after the 1914 Amalgamation was the?",
    "options": {
      "A": "introduction of a direct taxation system",
      "B": "creation of districts for political convenience",
      "C": "imposition of warrant chiefs in the Eastern Region",
      "D": "division of Nigeria into provinces"
    },
    "answer_url": "https://myschool.ng/classroom/history/55500?exam_type=jamb&type=obj&page=42",
    "correct_answer": "D",
    "explanation": "Division of Nigeria into provinces is the correct answer. The only administrative change made upon the amalgamation of 1914 was the division of the territory into provinces headed by provincial commissioners.",
    "year": "2019"
  },
  {
    "number": "210",
    "text": "The particular incident that led to Macaulay's imprisonment, twice, by the colonial power was",
    "options": {
      "A": "his criticism of British rule through the Lagos Daily News",
      "B": "his constant opposition to the expansion of the British rule",
      "C": "the humiliation of the British officials through his successful defense of Eleko in London",
      "D": "the attempt to silence British officials through the platform of the NNDP"
    },
    "answer_url": "https://myschool.ng/classroom/history/55502?exam_type=jamb&type=obj&page=42",
    "correct_answer": "C",
    "explanation": "In retaliation to the successful defence of Eshugbayi Eleko as the rightful king of Lagos and the humiliation this brought to the British officials, Macaulay was jailed twice by the colonial power thereafter.",
    "year": "2019"
  },
  {
    "number": "211",
    "text": "The London Constitutional Conference of 1957 was targeted at",
    "options": {
      "A": "increasing wider participation of the people in their Regional legislature",
      "B": "ensuring the speedy growth of federalism in Nigeria",
      "C": "imputing the voice of the people in their Independence Constitution",
      "D": "preparing ground works for the self-governance and inclusive development of Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55503?exam_type=jamb&type=obj&page=43",
    "correct_answer": "D",
    "explanation": "Preparing ground works for the self-governance and inclusive development of Nigeria is the correct answer. The Conference, among other things, deliberated on the proposed dates for the independence of each of the regions, increased membership of the House of Representatives, creation of the Prime Minister's office etc for Nigeria.",
    "year": "2019"
  },
  {
    "number": "212",
    "text": "The colonial investments in extractive industries invariably led to the",
    "options": {
      "A": "urbanization of towns and cities in Nigeria",
      "B": "arrival of slave trading in Nigeria and Africa",
      "C": "motivation of a continued colonial rule",
      "D": "uneven development of the regions in Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55506?exam_type=jamb&type=obj&page=43",
    "correct_answer": "A",
    "explanation": "The colonialists invested in raw materials and industries for their extraction employed both skilled and unskilled labour. All of these activities led to the urbanization of the vicinities around these industries.",
    "year": "2019"
  },
  {
    "number": "213",
    "text": "The Vice President of Nigeria during the 2nd Republic was ... under the platform of the",
    "options": {
      "A": "Humphrey Nwosu, National Party of Nigeria",
      "B": "Alex Ekwueme, National Party of Nigeria",
      "C": "Adisa Akinloye, Unity Party of Nigeria",
      "D": "Tafawa Balewa, National Party of the Nigerians and the Cameroon"
    },
    "answer_url": "https://myschool.ng/classroom/history/55508?exam_type=jamb&type=obj&page=43",
    "correct_answer": "B",
    "explanation": "Alex Ifeanyichukwu Ekwueme was the first Vice President of Nigeria in the Second Republic (1979-1983) under the platform of the National Party of Nigeria (NPN).",
    "year": "2019"
  },
  {
    "number": "214",
    "text": "The end of the Era of Princes in Ethiopia was a key factor in",
    "options": {
      "A": "decentralising state power in the hands of Provincial heads",
      "B": "centralising power in the hands of the Emperors of Ethiopia",
      "C": "the conquest of Southern Ethiopia",
      "D": "motivating the Italo-Egyptian invasion of Ethiopia"
    },
    "answer_url": "https://myschool.ng/classroom/history/55510?exam_type=jamb&type=obj&page=43",
    "correct_answer": "B",
    "explanation": "The end of the Zamana Masaf∂nt (Era of Princes) led to the centralisation of state power in the hands of the Emperors of Ethiopia. This consolidation of power helped in confronting the Italo-Egyptian invasion in the 19th Century.",
    "year": "2019"
  },
  {
    "number": "215",
    "text": "The division of the Sokoto Caliphate into Emirates was largely due to",
    "options": {
      "A": "the autocratic directive of Dan Fodio",
      "B": "the rivalry that persisted between the Hausa Jihadists and the Fulani scholars",
      "C": "geographical reasons",
      "D": "economical factors"
    },
    "answer_url": "https://myschool.ng/classroom/history/55512?exam_type=jamb&type=obj&page=43",
    "correct_answer": "C",
    "explanation": "Geographical reasons is the correct answer. The Sokoto Caliphate because of its large size was divided into the Western Emirates under the authority of Sokoto and the Eastern Emirates which remained more or less autonomous.",
    "year": "2019"
  },
  {
    "number": "216",
    "text": "Decree ... was the Unitarism Policy of the Major General Aguiyi Ironsi",
    "options": {
      "A": "No 34 of 1966",
      "B": "No 35 of 1967",
      "C": "No 36 of 1966",
      "D": "No 37 of 1967"
    },
    "answer_url": "https://myschool.ng/classroom/history/55516?exam_type=jamb&type=obj&page=44",
    "correct_answer": "A",
    "explanation": "Decree No 34 of 1966 is the correct answer. It was labelled as the Unification Decree for the adoption of a Unitary system of government in Nigeria.",
    "year": "2019"
  },
  {
    "number": "217",
    "text": "All but one of the following triggered the Mahdiyya Movement in Sudan",
    "options": {
      "A": "the foreign government's growing reliance on European Christians",
      "B": "the Sudanese of governmental efforts to suppress the lucrative slave trade",
      "C": "unpleasant immigration policy of the foreign government",
      "D": "heavy taxation"
    },
    "answer_url": "https://myschool.ng/classroom/history/55518?exam_type=jamb&type=obj&page=44",
    "correct_answer": "C",
    "explanation": "Unpleasant immigration policy of the foreign government is the correct answer. For reasons of heavy taxation which led to famine, depopulation etc, the foreign government's increased reliance on European Christians including its fight against slave trade, among related other reasons, led tp the Madhiyya revolution.",
    "year": "2019"
  },
  {
    "number": "218",
    "text": "One important characteristic of both recent and earlier Islamic reform movements is the emphasis on the",
    "options": {
      "A": "mediation of others for understanding the Koran and traditions of the prophet",
      "B": "use of African languages as a medium of communication",
      "C": "decline in the use of educational resource institutes",
      "D": "rigidity of the use of Arabic language"
    },
    "answer_url": "https://myschool.ng/classroom/history/55527?exam_type=jamb&type=obj&page=44",
    "correct_answer": "B",
    "explanation": "The use of African languages as a medium of communication is the correct answer. Islamic reformers, both past and present, actively support the translation of the holy texts into Swahili, Hausa, Fulfude, Wolof, Bambara and Yoruba.",
    "year": "2019"
  },
  {
    "number": "219",
    "text": "All the following except one were the motivating reasons behind the Great Trek",
    "options": {
      "A": "the fear that the emigration might lead to a decline of civilisation",
      "B": "insecurity about the conflict on the Eastern frontier of South Africa",
      "C": "restoration of economic, cultural and political unity independent of the British power",
      "D": "threat of liberalism by the new colonial regime"
    },
    "answer_url": "https://myschool.ng/classroom/history/55531?exam_type=jamb&type=obj&page=44",
    "correct_answer": "A",
    "explanation": "The fear that the emigration might lead to a decline of civilization is the correct answer, as this was expressed by the Dutch Reformed Church in opposition to the Great Trek, seeing also as being an act of godlessness.",
    "year": "2019"
  },
  {
    "number": "220",
    "text": "The central agenda of the Muhammad Ali's hegemonic rule was the",
    "options": {
      "A": "enslavement of the Sudanese",
      "B": "the exploitation of natural resources for development finance in Egypt",
      "C": "annexation of Sudan as an Ottoman-Egyptian Colony",
      "D": "political conquest of Sudan"
    },
    "answer_url": "https://myschool.ng/classroom/history/55532?exam_type=jamb&type=obj&page=44",
    "correct_answer": "B",
    "explanation": "Muhammad Ali and his successors sought after Sudan's natural and human resources to finance Egyptian modernizing projects, build a new army and develop agricultural and industrial enterprises.",
    "year": "2019"
  },
  {
    "number": "221",
    "text": "The most remarkable acheivement of the Buhari's Military regime is the",
    "options": {
      "A": "War Against Intolerance",
      "B": "Green Revolution Programme",
      "C": "War Against Indiscipline",
      "D": "Structural Adjustment Programme"
    },
    "answer_url": "https://myschool.ng/classroom/history/55534?exam_type=jamb&type=obj&page=45",
    "correct_answer": "C",
    "explanation": "War Against Indiscipline (WAI) is the correct answer. A programme instituted in 1984 to tackle social maladjustment and widespread corruption in Nigeria.",
    "year": "2019"
  },
  {
    "number": "222",
    "text": "One of the following persons was not arrested over the May Day riots",
    "options": {
      "A": "Arisekola Alao",
      "B": "Comrade Ola Oni",
      "C": "Chief Bola Ige",
      "D": "Lam Adesina"
    },
    "answer_url": "https://myschool.ng/classroom/history/55535?exam_type=jamb&type=obj&page=45",
    "correct_answer": "A",
    "explanation": "Arisekola Alao is the correct answer. On May 13, 1998 under the Abacha's regime, Comrade Ola Oni, a legendary radical lecturer and activist, Chief Bola Ige, Lam Adesina were notable persons arrested over the May Day riots in Ibadan. They were arraigned before the Chief Magistrate's Court, Iyaganku, Ibadan.",
    "year": "2019"
  },
  {
    "number": "223",
    "text": "Imperialist powers in Africa inbuilt antagonism by taking advantage of the cultural diversity of the people through the...",
    "options": {
      "A": "Policy of Assimilation",
      "B": "Divide-and-Rule Policy",
      "C": "Indignant Policy",
      "D": "Policy of Association"
    },
    "answer_url": "https://myschool.ng/classroom/history/55536?exam_type=jamb&type=obj&page=45",
    "correct_answer": "B",
    "explanation": "The Divide and Rule Policy is the correct answer. The imperialist powers made conscious efforts to create and/or turn to its own advantage of the ethnic, cultural, tribal or religious differences within the population of their subjugated colonies. The effects of this still lingers in Nigeria and even among African countries today.",
    "year": "2019"
  },
  {
    "number": "224",
    "text": "... was the only significant imperial power in the Northern half of Africa at the end of the 18th century",
    "options": {
      "A": "Ottoman Turkey",
      "B": "Italo-Egyptian Empire",
      "C": "Ottoman-Egyptian",
      "D": "Portuguese Empire"
    },
    "answer_url": "https://myschool.ng/classroom/history/55538?exam_type=jamb&type=obj&page=45",
    "correct_answer": "A",
    "explanation": "Ottoman Turkey is the correct answer. Its dependencies in Egypt, Tripoli, Tunis and Algiers were admittedly almost self-governing, but they did at least contribute some revenue to the sultans in Istanbul.",
    "year": "2019"
  },
  {
    "number": "225",
    "text": "The concern of Mary Slessor was primarily with",
    "options": {
      "A": "expanding the spread of colonialism under the pretext of christian missionary activities",
      "B": "eliminating the tribal superstitious practice of killing of triplets only",
      "C": "introducing the people to European culture and religion",
      "D": "eliminating the tribal superstitious practice of killing of twin babies"
    },
    "answer_url": "https://myschool.ng/classroom/history/55539?exam_type=jamb&type=obj&page=45",
    "correct_answer": "D",
    "explanation": "Eliminating the tribal superstitious practice of killing of twin babies is the correct answer. This was the primary concern of Mary Slessor, a Presbyterian missionary from Scotland to alter the thinking of the people as it relates to the taboo of giving birth to twin babies.",
    "year": "2019"
  },
  {
    "number": "226",
    "text": "The inception of state creation in the Nigerian military era is traceable to the regime of",
    "options": {
      "A": "Aguiyi Ironsi",
      "B": "Murtala/Obasanjo",
      "C": "Yakubu Gowon",
      "D": "Ibrahim Babangida"
    },
    "answer_url": "https://myschool.ng/classroom/history/55541?exam_type=jamb&type=obj&page=46",
    "correct_answer": "C",
    "explanation": "Yakubu Gowon is the correct answer. He created 12 states for Nigeria on May, 27 1967. This initiative further placed Nigeria on the pathway to the adoption of a true federal system.",
    "year": "2019"
  },
  {
    "number": "227",
    "text": "Early centres of civilization in Nigeria reveal the history of",
    "options": {
      "A": "descendants of the notable tribes and culture",
      "B": "scientific and technological developments",
      "C": "slave trading and colonialism",
      "D": "precolonial societies"
    },
    "answer_url": "https://myschool.ng/classroom/history/55542?exam_type=jamb&type=obj&page=46",
    "correct_answer": "B",
    "explanation": "Scientific and technological developments is the correct answer. The history of the early centres of civilization presents us with the discovery and use of woods, irons and other scientific objects for the creation of notable figures, and provision of utilities in the early Nigerian societies. Notable are the Nok Culture, Ife Civilization and the Benin Crafts and Artworks.",
    "year": "2019"
  },
  {
    "number": "228",
    "text": "All but one of the following played vital roles in the expansion of the missionary movements into Africa",
    "options": {
      "A": "the regeneration of the African people",
      "B": "the anti-slavery agenda",
      "C": "humanitarian conscience for Africa",
      "D": "the prevalence of western education"
    },
    "answer_url": "https://myschool.ng/classroom/history/55543?exam_type=jamb&type=obj&page=46",
    "correct_answer": "D",
    "explanation": "The prevalence of western education is the correct answer. The European interest in expanding missionary works into Africa are as a result of the need to introduce legitimate commerce i.e putting an end to slave trade, eliminating superstitious beliefs and practices through Christianity and civilization, etc. Western education only came as a consequence of the missionary activities.",
    "year": "2019"
  },
  {
    "number": "229",
    "text": "The .... was the programme initiated to institutionalise the local government system in Nigeria",
    "options": {
      "A": "Local Government Reform of 1976",
      "B": "Local Government Reform of 1979",
      "C": "Municipal Local Authority Reform of 1976",
      "D": "Municipal Local Authority Reform of 1979"
    },
    "answer_url": "https://myschool.ng/classroom/history/55544?exam_type=jamb&type=obj&page=46",
    "correct_answer": "A",
    "explanation": "The Local Government Reform of 1976 is the correct answer. It was a nationwide undertaking by the military government of Murtala/Obasanjo Regime as part of its intention to return power to the civilians and ensure active participation of the people in own affairs especially at the grassroots level.",
    "year": "2019"
  },
  {
    "number": "230",
    "text": "One critical factor that led to the Mfecane was the",
    "options": {
      "A": "ageing population in Southern Africa",
      "B": "war-created refugee problems",
      "C": "apartheid regime in South Africa",
      "D": "decline in the growth of civilization"
    },
    "answer_url": "https://myschool.ng/classroom/history/55545?exam_type=jamb&type=obj&page=46",
    "correct_answer": "B",
    "explanation": "The war-created refugee problems is the correct answer. Refugee problems created by the wars is one of the major factors that led to the Mfecane, e.g. when Zwide attacked Sobhuza it led to the Ngwane moving their place in the Pongola valley and into an unknown region where they became invaders and raiders looking a new homeland to build the Swazi composite.",
    "year": "2019"
  },
  {
    "number": "231",
    "text": "The Centenary Anniversary of Nigeria was done to commemorate Nigeria's",
    "options": {
      "A": "Independence ceremony of October 1st 1960",
      "B": "Amalgamation of January 1st 1914",
      "C": "Republican Achievements of May 29th 1999",
      "D": "Amalgamation of February 1st, 1914"
    },
    "answer_url": "https://myschool.ng/classroom/history/55546?exam_type=jamb&type=obj&page=47",
    "correct_answer": "B",
    "explanation": "Amalgamation of January 1st 1914 is the correct answer. On January 1st 2014, former President Ebele Jonathan inaugurated the celebration of Nigeria's Statehood and amalgation of January 1st 1914.",
    "year": "2019"
  },
  {
    "number": "232",
    "text": "Presently, about 65% of Africa's population is constituted by the",
    "options": {
      "A": "youths",
      "B": "age",
      "C": "teenagers",
      "D": "retired uniformed men"
    },
    "answer_url": "https://myschool.ng/classroom/history/55547?exam_type=jamb&type=obj&page=47",
    "correct_answer": "A",
    "explanation": "Youths is the correct answer. Recent statistics from the United Nations Department of Economic and Social Affairs (UNDESA) reveals that about 65% of Africa's population is constituted by the youths.",
    "year": "2019"
  },
  {
    "number": "233",
    "text": "The first African female President of the United Nations General Assembly is",
    "options": {
      "A": "Elizabeth Rhoda",
      "B": "Angie Brooks",
      "C": "Queen Nziga",
      "D": "Sirleaf Johnson"
    },
    "answer_url": "https://myschool.ng/classroom/history/55548?exam_type=jamb&type=obj&page=47",
    "correct_answer": "B",
    "explanation": "Angie Brooks is the correct answer. She was a Liberian diplomat and jurist, notable for being the only African female President of the United Nations General Assembly thus far.",
    "year": "2019"
  },
  {
    "number": "234",
    "text": "All except one of the following motivated the scramble for Africa",
    "options": {
      "B": "an avenue for em-broadening foreign relations with Africa",
      "C": "the need to boost the Western Economies",
      "D": "that the colonies would gain access to superior European goods and influence"
    },
    "answer_url": "https://myschool.ng/classroom/history/55549?exam_type=jamb&type=obj&page=47",
    "correct_answer": "B",
    "explanation": "The imperialists were for every other reasons interested in Africa, except that they thought of it as an avenue to smoothen foreign relations with African States.",
    "year": "2019"
  },
  {
    "number": "235",
    "text": "The Nigerian Civil war ...",
    "options": {
      "A": "lasted from 5th July, 1967 - 12th January, 1970",
      "B": "was fought in actual essence to reintegrate and reunify Nigeria",
      "C": "became inevitable because the Igbo felt that Nigeria may sooner or later divide",
      "D": "lasted from 7th July, 1967 - 14th January, 1970"
    },
    "answer_url": "https://myschool.ng/classroom/history/55550?exam_type=jamb&type=obj&page=47",
    "correct_answer": "B",
    "explanation": "The Nigerian Civil War which lasted from 6th July, 1967 - 12th January, 1970 was fought as a result of the Gowon-Government's efforts to counter the struggle by the Igbos from breaking away from Nigeria. A reason for reintegration and reunification of Nigeria.",
    "year": "2019"
  },
  {
    "number": "236",
    "text": "King Jaja of Opobo was forcibly removed for ...",
    "options": {
      "A": "conspiracy against the British colonialists",
      "B": "his obstruction of commerce",
      "C": "the attempt to declare the freedom of his people from colonial rule",
      "D": "his resistance to slave trading"
    },
    "answer_url": "https://myschool.ng/classroom/history/55551?exam_type=jamb&type=obj&page=48",
    "correct_answer": "B",
    "explanation": "In 1887, King Jaja of Opobo was forcibly removed and exiled for obstruction of commerce.",
    "year": "2019"
  },
  {
    "number": "237",
    "text": "The head of the administration of the Protectorate of Northern Nigeria was titled",
    "options": {
      "A": "High Commissioner",
      "B": "Governor-General",
      "C": "Lieutenant General",
      "D": "Emir"
    },
    "answer_url": "https://myschool.ng/classroom/history/55552?exam_type=jamb&type=obj&page=48",
    "correct_answer": "A",
    "explanation": "High Commissioner is the correct answer. Lord Lugard was appointed as the High Commissioner of the Northern Protectorate in 1900.",
    "year": "2019"
  },
  {
    "number": "238",
    "text": "An inquiry into the need for a People-led and informed Constitution was central to ... regime",
    "options": {
      "A": "Lyttleton's",
      "B": "Clifford's",
      "C": "Richard's",
      "D": "Macpherson's"
    },
    "answer_url": "https://myschool.ng/classroom/history/55553?exam_type=jamb&type=obj&page=48",
    "correct_answer": "C",
    "explanation": "Arthur Richard had as his main priority a need to promote unity in Nigeria and ensure greater participation of the people in their own affairs. This was as a matter of fact, the surrounding essence of his 1946 Constitution.",
    "year": "2019"
  },
  {
    "number": "239",
    "text": "All the following except one spurred the nationalist drives in British West Africa",
    "options": {
      "A": "the existence of diverse political parties",
      "B": "the adoption of the policy of Assimilation",
      "C": "the tolerance of nationalist newspapers",
      "D": "unfair socio-political environment"
    },
    "answer_url": "https://myschool.ng/classroom/history/55554?exam_type=jamb&type=obj&page=48",
    "correct_answer": "B",
    "explanation": "The adoption of the policy of Assimilation is the correct answer. This Policy was directly adopted in the French West African Colonies and it slowed down the pace of nationalism unlike in the British West African colonies.",
    "year": "2019"
  },
  {
    "number": "240",
    "text": "The Lyttleton Constitution is often remarkable for all the following reasons except",
    "options": {
      "A": "the introduction of a federal structure for Nigeria",
      "B": "the grant of real legislative powers to the regional legislature",
      "C": "recognition of the need to appoint Premiers in the regions",
      "D": "the establishment of a public service commission"
    },
    "answer_url": "https://myschool.ng/classroom/history/55555?exam_type=jamb&type=obj&page=48",
    "correct_answer": "D",
    "explanation": "The establishment of a public service commission is the correct answer. This was a distinct achievement of the John Macpherson's 1951 Constitution.",
    "year": "2019"
  },
  {
    "number": "241",
    "text": "Colonialism is often regarded as a double-edged sword particularly because",
    "options": {
      "A": "the infrastructure built from West African forced labour was also designed to exploit their natural resources",
      "B": "educational institutions were built which contributed to human capacity development",
      "C": "the raods built by the Europeans lead to the urbanization of West African towns and cities",
      "D": "the European investment in the extractive industry developed trade and commerce"
    },
    "answer_url": "https://myschool.ng/classroom/history/55556?exam_type=jamb&type=obj&page=49",
    "correct_answer": "A",
    "explanation": "Although colonial rule contributed to social development as investments and infrastructures were built, however, 'the infrastructure built from West African forced labour was also designed to exploit natural resources. A double-edged sword situation.",
    "year": "2019"
  },
  {
    "number": "242",
    "text": "The Nigerian Second Republic adopted a/an ... system of governance",
    "options": {
      "A": "West-Minster",
      "B": "British-styled Presidential",
      "C": "American-styled Presidential",
      "D": "Confederal"
    },
    "answer_url": "https://myschool.ng/classroom/history/55558?exam_type=jamb&type=obj&page=49",
    "correct_answer": "C",
    "explanation": "American-styled Presidential system is the correct answer. The British Parliamentary system was jettisoned for this witnessing Alhaji Shehu Shagari as the Executive President of Nigeria.",
    "year": "2019"
  },
  {
    "number": "243",
    "text": "The repeated attempts by Egypt and Italy to colonize Ethiopia led to the",
    "options": {
      "A": "end of the Era of Princes in Ethiopia",
      "B": "conquest of Southern Ethiopia",
      "C": "expansion of the colonial tendencies to pacify Ethiopia",
      "D": "battle of Adwa"
    },
    "answer_url": "https://myschool.ng/classroom/history/55559?exam_type=jamb&type=obj&page=49",
    "correct_answer": "D",
    "explanation": "The Battle of Adwa is the correct answer. The battle was led by Emperor Menelik II of Ethiopia and the Ethiopian forces defeated the Italo-Egyptian invaders on March 1, 1896.",
    "year": "2019"
  },
  {
    "number": "244",
    "text": "Historically, the Yorubas came into prominence as a result of",
    "options": {
      "A": "their artworks and sculptures made to honour the gods",
      "B": "the impact of their language and cultural aspects",
      "C": "the settlement of the British colony in 1901",
      "D": "their trading in guns with the Portugese"
    },
    "answer_url": "https://myschool.ng/classroom/history/55561?exam_type=jamb&type=obj&page=49",
    "correct_answer": "D",
    "explanation": "The Yorubas who originated from Ile-Ife, arose and became quite popular and remarkable by their trading with the Portugese, which gave them a large supply of guns.",
    "year": "2019"
  },
  {
    "number": "245",
    "text": "Oba Ewuare of Benin Kingdom is credited with having",
    "options": {
      "A": "successfully opposed British imperialism",
      "B": "successfully managed monopoly over trade which the British found irksome",
      "C": "succeeded Ovonramwen",
      "D": "transformed Benin city into a city-state"
    },
    "answer_url": "https://myschool.ng/classroom/history/55562?exam_type=jamb&type=obj&page=49",
    "correct_answer": "D",
    "explanation": "Oba Ewuare is notable for having transformed Benin city into a City-State from a military fortress built by the Ogisos, protected by moats and walls. His era is notable, being the first Golden Age Oba.",
    "year": "2019"
  },
  {
    "number": "246",
    "text": "The Royal Niger Company was influential in the formation of Colonial Nigeria because it",
    "options": {
      "A": "enabled the British Empire to establish control over and above its German competitor",
      "B": "paved way for the emergence of the National African Company",
      "C": "served as a means of economic development and investment in Nigeria",
      "D": "encouraged the adoption of the Indirect Rule Policy"
    },
    "answer_url": "https://myschool.ng/classroom/history/55563?exam_type=jamb&type=obj&page=50",
    "correct_answer": "A",
    "explanation": "The Royal Niger Company enabled the British Empire to establish control over the lower Niger against the German competition led by Bismarck in the 1890s.Its company-controlled territories were made Protectorates and later amalgamated as the Colony and Protectorate of Nigeria.",
    "year": "2019"
  },
  {
    "number": "247",
    "text": "Which one of the following is incorrect?",
    "options": {
      "A": "Sarkin Fada was the head of Palace workers in the Hausa/Fulani Empire",
      "B": "The Ajeles properly governed the districts in the Old Oyo Empire",
      "C": "The Alkali Courts were headed by the Hakimis in the Hausa/Fulani Empire",
      "D": "The Igbo precolonial era was acephalous in nature"
    },
    "answer_url": "https://myschool.ng/classroom/history/55565?exam_type=jamb&type=obj&page=50",
    "correct_answer": "C",
    "explanation": "The Alkali Courts were headed by the Alkali judges in the Hausa/Fulani Empire not the Hakimis, who were actually the head of districts.",
    "year": "2019"
  },
  {
    "number": "248",
    "text": "Under the chairmanship of ... the Economic Community of West African States (ECOWAS) was formed",
    "options": {
      "A": "Yakubu Gowon",
      "B": "Chief Olusegun Obasanjo",
      "C": "Murtala Muhammed",
      "D": "Aguiyi Ironsi"
    },
    "answer_url": "https://myschool.ng/classroom/history/55568?exam_type=jamb&type=obj&page=50",
    "correct_answer": "A",
    "explanation": "Yakubu Gowon is the correct answer. West African leaders under the chairmanship of President Yakubu Gowon, met in Lagos in May 1975 to create the ECOWAS.",
    "year": "2019"
  },
  {
    "number": "249",
    "text": "Unarguably, the abolition of the slave trade in Britain directly stimulated the",
    "options": {
      "A": "penetration of European merchants capital into Nigeria",
      "B": "spread of missionary activities into Nigeria",
      "C": "growth of nationalist movements in Nigeria",
      "D": "pace of the amalgamation of Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55570?exam_type=jamb&type=obj&page=50",
    "correct_answer": "A",
    "explanation": "Penetration of European merchants capital into Nigeria is the correct answer. As slave trade was abolished, legitimate trade started and this encouraged the European merchants agenda for imperialism (i.e to establish industries, extract and trade natural resources) to smoothly penetrate Nigeria.",
    "year": "2019"
  },
  {
    "number": "250",
    "text": "The connections between Kano and the province of Nupe was notable in the reign of Kano's",
    "options": {
      "A": "Sarkin Dauda",
      "B": "Sarkin Ruwa",
      "C": "Sarkin Fada",
      "D": "Sarkin Yandoka"
    },
    "answer_url": "https://myschool.ng/classroom/history/55573?exam_type=jamb&type=obj&page=50",
    "correct_answer": "A",
    "explanation": "Sarkin Dauda is the correct answer. In the reign of Kano's Sarkin Dauda (c. 1421-38), the connection between Kano and Nupe was visible and the major power between them was Zaria, which conquered a large expanse of land.",
    "year": "2019"
  },
  {
    "number": "251",
    "text": "In 17th Century, the Dutch settlers largely relied on ... to build up South Africa",
    "options": {
      "A": "natural resources",
      "B": "government proceeds",
      "C": "black South African slaves",
      "D": "basic social infrastructures"
    },
    "answer_url": "https://myschool.ng/classroom/history/55575?exam_type=jamb&type=obj&page=51",
    "correct_answer": "C",
    "explanation": "Black South African slaves is the correct answer. Apartheid system was rooted in the enslavement of the black South Africans as instruments to build up South Africa. This was in the 17th Century. At the end of slave trade in 1863, the base was shifted to the discovery of diamonds and gold.",
    "year": "2019"
  },
  {
    "number": "252",
    "text": "A Policy central to the Kanem-Borno Empire was that of",
    "options": {
      "A": "the British hegemony",
      "B": "imperial expansion and firearms trading",
      "C": "nomadic orientation of its people",
      "D": "state-led land reforms"
    },
    "answer_url": "https://myschool.ng/classroom/history/55576?exam_type=jamb&type=obj&page=51",
    "correct_answer": "B",
    "explanation": "Imperial expansion and firearms trading is the correct answer. Kanem-Borno Empire believed in the expansion of its imperial territories and in the same vein, traded in firearms and horses for the purpose of creating a sophisticated cavalry.",
    "year": "2019"
  },
  {
    "number": "253",
    "text": "All the following except one led to the re-emergence of old trade patterns under Omani rule",
    "options": {
      "A": "availability of capital from India",
      "B": "increased demand for slaves",
      "C": "attack on the Portuguese in the 1640s",
      "D": "willingness of Africans in the interior to take slaves to the coast"
    },
    "answer_url": "https://myschool.ng/classroom/history/55584?exam_type=jamb&type=obj&page=51",
    "correct_answer": "C",
    "explanation": "Attack on the Portugese in the 1649s is the correct answer as this attack was carried as a revenge on the Portuguese who had sought to control their strategic position of the Straits of Hormuz at the entrance of the Persian Gulf.",
    "year": "2019"
  },
  {
    "number": "254",
    "text": "In Sierra Leone, the ... was the first established Christian Church for British freed slaves among others",
    "options": {
      "A": "Methodists",
      "B": "Roman Catholics",
      "C": "Church Missionary Society",
      "D": "Anglican Church"
    },
    "answer_url": "https://myschool.ng/classroom/history/55593?exam_type=jamb&type=obj&page=51",
    "correct_answer": "C",
    "explanation": "The Church Missionary Society (CMS) is the correct answer. The CMS, an offshoot of the Anglican Church was the first to become firmly established mainly among the freed slave settlers from Britain, Nova, Scotia and other parts of the New World.",
    "year": "2019"
  },
  {
    "number": "255",
    "text": "One critical factor which spurred the abrupt termination of the Nigerian fledging democracy in the First Republic was the",
    "options": {
      "A": "nationwide corruption by the politicians",
      "B": "urge for sectional military representation in government",
      "C": "issue of tribalism and nepotism",
      "D": "use of the soldiers to quell civil unrests and riots"
    },
    "answer_url": "https://myschool.ng/classroom/history/55595?exam_type=jamb&type=obj&page=51",
    "correct_answer": "A",
    "explanation": "The correct answer is the nationwide corruption by the politicians. This gave the military coup plotters the leverage to overthrow the ruling government. N.B: The question tests your knowledge on what most importantly inspired the military disruption of the Nigerian growing democracy in the 1st Republic.",
    "year": "2019"
  },
  {
    "number": "256",
    "text": "The Mahdiyya Movement in Sudan overthrew the ...",
    "options": {
      "A": "Italo-Egyptian Regime in the early 1880s",
      "B": "Italo-Egyptian Regime in the early 1890s",
      "C": "Ottoman-Egyptian Regime in the early 1880s",
      "D": "Ottoman-Egyptian Regime in the early 1890s"
    },
    "answer_url": "https://myschool.ng/classroom/history/55596?exam_type=jamb&type=obj&page=52",
    "correct_answer": "C",
    "explanation": "Ottoman-Egyptian Regime in the early 1880s is the correct answer. In Sudan, the Mahdiyya Movement was the revolutionary movement that overthrew the Ottoman-Egyptian regime which conquered Sudan in 1820-1822.",
    "year": "2019"
  },
  {
    "number": "257",
    "text": "... has primarily led to the growth of Islamic reform movements in many sub-Saharan African countries",
    "options": {
      "A": "The crisis of modernisation of the 20th Century",
      "B": "The new discoveries on the inadequacies of Islam",
      "C": "The shift in the belief and religious system of Islam",
      "D": "The rigidity in the use of Arabic language"
    },
    "answer_url": "https://myschool.ng/classroom/history/55598?exam_type=jamb&type=obj&page=52",
    "correct_answer": "A",
    "explanation": "The crisis of modernisation of the 20th century is the correct answer. Islamic reform movements developed majorly in response to the challenges of social development (e.g. the Mosques are often known as platforms for criticism of the shortcomings of the African government regimes), educational reform (e.g. training as religious scholars), and the popularisation of Islamic values.",
    "year": "2019"
  },
  {
    "number": "258",
    "text": "One of the following is attributable to the Great Trek",
    "options": {
      "A": "the expansion of white communities in South Africa",
      "B": "the agitation for black-white equality in South Africa",
      "C": "the annexation of white communities by the Africans",
      "D": "restriction of movement of the whites in South Africa"
    },
    "answer_url": "https://myschool.ng/classroom/history/55602?exam_type=jamb&type=obj&page=52",
    "correct_answer": "A",
    "explanation": "The expansion of white communities in South Africa is the correct answer. The Great Trek was a movement of Dutch-speaking colonists up into the interior of Southern Africa in search of land to establish their own homeland, independent of British rule.",
    "year": "2019"
  },
  {
    "number": "259",
    "text": "Khedive Ismail appointed British officers in Sudan in order to",
    "options": {
      "A": "obtain recognition for his government",
      "B": "introduce heavy taxation",
      "C": "rebuild the Sudanese territories",
      "D": "fight against lucrative slave trade"
    },
    "answer_url": "https://myschool.ng/classroom/history/55604?exam_type=jamb&type=obj&page=52",
    "correct_answer": "D",
    "explanation": "Fight against lucrative slave trade is the correct answer. The British officers - Samuel Baker and Charles Gordon were appointed by Khedive Ismail in order to spread Ottoman-Egyptian control over the upper reaches of the White Nile and fight against the slave trade.",
    "year": "2019"
  },
  {
    "number": "260",
    "text": "The ... headed under the Chairmanship Muhammadu Buhari was the governing body in Nigeria",
    "options": {
      "A": "Armed Forces Ruling Council",
      "B": "Supreme Military Council",
      "C": "Provisional Ruling Council",
      "D": "Transitional Military Council"
    },
    "answer_url": "https://myschool.ng/classroom/history/55606?exam_type=jamb&type=obj&page=52",
    "correct_answer": "B",
    "explanation": "The Supreme Military Council is the correct answer. The Provisional Ruling Council was adopted by Abacha and the Armed Forces ruling Council by Babangida.",
    "year": "2019"
  },
  {
    "number": "261",
    "text": "The National Democratic Coalition (NADECO) was formed",
    "options": {
      "A": "in 1993, to press for the re-validation of the June 12, 1993 Presidential election",
      "B": "in 1994, to solicit funds in preparation for the transition into Civilian rule",
      "C": "in 1994, to press for the re-validation of the June 12, 1993 Presidential election",
      "D": "in 1993, to advocate for the violation of human rights under the Abacha's regime"
    },
    "answer_url": "https://myschool.ng/classroom/history/55608?exam_type=jamb&type=obj&page=53",
    "correct_answer": "C",
    "explanation": "The correct answer is May 15, 1994, the NADECO was established to press for the revalidation of the June 12, 1993 Presidential election and the reinstallation of all democratic structures.",
    "year": "2019"
  },
  {
    "number": "262",
    "text": "All the following except one are the communes of the colony of Senegal where the Policy of Assimilation was applied",
    "options": {
      "A": "Saint Louis",
      "B": "Rufisque",
      "C": "Goree",
      "D": "Kaolack"
    },
    "answer_url": "https://myschool.ng/classroom/history/55610?exam_type=jamb&type=obj&page=53",
    "correct_answer": "D",
    "explanation": "Kaolack is the correct answer. The four communes of the then colony of Senegal where the Policy of Assimilation were extended include Saint Louis, Goree, Rofisque and Dakar.",
    "year": "2019"
  },
  {
    "number": "263",
    "text": "The system of imperial military rule had its deepest roots in ...",
    "options": {
      "A": "Ethiopia",
      "B": "Egypt",
      "C": "Sierra Leone",
      "D": "Gambia"
    },
    "answer_url": "https://myschool.ng/classroom/history/55612?exam_type=jamb&type=obj&page=53",
    "correct_answer": "B",
    "explanation": "Egypt is the correct answer. The Ottoman Power conquered the Sultanate in 1517 and took over as the operating institution since the 13th century. Upon this, the system of military rule had its deepest roots in Egypt.",
    "year": "2019"
  },
  {
    "number": "264",
    "text": "Traditionally, the Efik people have accounts of their migration from the territory",
    "options": {
      "A": "Igbo and Nupe",
      "B": "Ibibio and Igbo",
      "C": "Uruan and Ibibio",
      "D": "Biase and Annang"
    },
    "answer_url": "https://myschool.ng/classroom/history/55617?exam_type=jamb&type=obj&page=53",
    "correct_answer": "B",
    "explanation": "Ibibio and Igbo is the correct answer. Although the actual origins of the Efik people are unknown. However, historical oral traditions provide accounts of their migration from Igbo and Ibibio territory (to the North-west of Calabar) to their present location.",
    "year": "2019"
  },
  {
    "number": "265",
    "text": "Regionalism notable with ... may be said to have laid the foundational basis for the latter state creation in Nigeria",
    "options": {
      "A": "Authur Richard",
      "B": "John Macpherson",
      "C": "Oliver Lyttleton",
      "D": "Hugh Clifford"
    },
    "answer_url": "https://myschool.ng/classroom/history/55620?exam_type=jamb&type=obj&page=53",
    "correct_answer": "A",
    "explanation": "Authur Richard is the correct answer. The 1946 Richard Constitution established three regional councils, one each in the North, East and West. This historically forms one of the basic foundational existence upon the Nigerian Federal structure relied subsequently in terms of states creation during the military era.",
    "year": "2019"
  },
  {
    "number": "266",
    "text": "The Ife Civilization is most remarkable for its",
    "options": {
      "A": "use of terra cotta and bronze heads",
      "B": "multiplicity of idols and gods",
      "C": "its discovery of terra cotta (burnt clay)",
      "D": "use of carved woods and ivory"
    },
    "answer_url": "https://myschool.ng/classroom/history/55621?exam_type=jamb&type=obj&page=54",
    "correct_answer": "A",
    "explanation": "Use of terra cotta and bronze heads is the correct answer. Objects such as stools and figures were carved on hard stone called quartz while animal and humanity figures were carved from granite and decorated with iron nails.",
    "year": "2019"
  },
  {
    "number": "267",
    "text": "Baptists, Methodists and the ... were among the first to engage in the Liberiian Christian Mission",
    "options": {
      "A": "Presbyterian Church",
      "B": "United Church of Christ",
      "C": "Catholic Christian Mission",
      "D": "Episcopal Church"
    },
    "answer_url": "https://myschool.ng/classroom/history/55623?exam_type=jamb&type=obj&page=54",
    "correct_answer": "D",
    "explanation": "Episcopal Church is the correct answer. The Baptists, Methodists and Episcopalians were among the first to engage in Liberian Mission as a result of the missionary fervour that gripped Western Europe and America in the 19th Century.",
    "year": "2019"
  },
  {
    "number": "268",
    "text": "The Swazi composite is the modern ...",
    "options": {
      "A": "Swaziland",
      "B": "Southern Zibabwe",
      "C": "Zulu Kingdom",
      "D": "Southeastern Botswana"
    },
    "answer_url": "https://myschool.ng/classroom/history/55627?exam_type=jamb&type=obj&page=54",
    "correct_answer": "A",
    "explanation": "Swaziland is the correct answer. The Swazi composite is also now what modern Swaziland is, which means that some modern day countries in Southern and Central Africa can trace their roots to the Mfecane.",
    "year": "2019"
  },
  {
    "number": "269",
    "text": "One of the following is not credited with the General Obasanjo's military regime",
    "options": {
      "A": "the Universal Primary Education Program",
      "B": "the Operation Feed the Nation",
      "C": "the Festival of Arts and Culture",
      "D": "the Structural Adjustment Programme"
    },
    "answer_url": "https://myschool.ng/classroom/history/55629?exam_type=jamb&type=obj&page=54",
    "correct_answer": "D",
    "explanation": "The Structural Adjustment programme is the correct answer. It was a Programme inaugurated during the Ibrahim Babangida's regime.",
    "year": "2019"
  },
  {
    "number": "270",
    "text": "The Colony and Protectorate of Nigeria was the resultant merger of the",
    "options": {
      "A": "Colony of Lagos and the Southern Protectorate",
      "B": "Colony and Protectorate of Southern Nigeria and the Northern Protectorate",
      "C": "Northern Protectorate and the Colony of Western Nigeria",
      "D": "Colony of Western Nigeria and the Protectorate of Southern and Northern Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/history/55632?exam_type=jamb&type=obj&page=54",
    "correct_answer": "B",
    "explanation": "Colony and Protectorate of Southern Nigeria and the Northern Protectorate were the constituents of the area that later became Colony and Protectorate of Nigeria upon the amalgamation of Lord Lugard on January 1st 1914.",
    "year": "2019"
  }
]