[
  {
    "number": "499",
    "text": "Wastage of agricultural products during the harvesting period is mainly due to inadequate?",
    "options": {
      "A": "storage and processing facilities",
      "B": "implementation of government policies on agriculture",
      "C": "agricultural education and extension",
      "D": "transport facilities"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71380?exam_type=jamb&type=obj&page=100",
    "correct_answer": "A",
    "explanation": "Wastage of agricultural products during the harvesting period is mainly due to inadequate storage and processing facilities. Without proper storage and processing facilities, harvested crops can easily spoil or get damaged, leading to wastage. While transport facilities, agricultural education and extension, and implementation of government policies on agriculture can also contribute to wastage, they are not the main cause.",
    "year": "2024"
  },
  {
    "number": "500",
    "text": "Gneiss is a metamorphic rock formed from?",
    "options": {
      "A": "Granite",
      "B": "Slate",
      "C": "Shale",
      "D": "Sandstone"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71381?exam_type=jamb&type=obj&page=100",
    "correct_answer": "A",
    "explanation": "Gneiss is a metamorphic rock that is formed from granite. Metamorphic rocks are formed from the transformation of existing rock types in a process called metamorphism, which means 'change in form'. The original rock (protolith) is subjected to heat and pressure causing profound physical and/or chemical change. In this case, the protolith is granite.",
    "year": "2024"
  },
  {
    "number": "501",
    "text": "The type of soil with a particle size of 0.02 to",
    "options": {
      "A": "Clay",
      "B": "silt",
      "C": "fine sand",
      "D": "coarse sand"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71382?exam_type=jamb&type=obj&page=101",
    "correct_answer": "A",
    "explanation": "The type of soil with a particle size of 0.02 to 0.002 mm is clay. Clay particles are the smallest of the three main soil particles (sand, silt, and clay). They are less than 0.002 mm in diameter and are known for their ability to hold water and nutrients.",
    "year": "2024"
  },
  {
    "number": "502",
    "text": "When a piece of land is leased to a farmer, the land is said to be",
    "options": {
      "A": "Purchase on loan",
      "B": "given to him as subsidy",
      "C": "given as a gift",
      "D": "allocated on a rental basis"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71383?exam_type=jamb&type=obj&page=101",
    "correct_answer": "D",
    "explanation": "When a piece of land is leased to a farmer, it means the farmer is given the right to use the land for a specified period in exchange for payment. This is known as renting or allocation on a rental basis. It is not a subsidy, loan, or gift.",
    "year": "2024"
  },
  {
    "number": "503",
    "text": "Which of the following does not fit into the agricultural use of land",
    "options": {
      "A": "crop production",
      "B": "animal production",
      "C": "forest establishment",
      "D": "mining"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71384?exam_type=jamb&type=obj&page=101",
    "correct_answer": "D",
    "explanation": "Mining is not typically considered an agricultural use of land. While it does involve the use of land, it does not involve the cultivation of plants or the rearing of animals, which are the primary activities associated with agriculture.",
    "year": "2024"
  },
  {
    "number": "504",
    "text": "Which of the following group of basic amenities should be provided in rural areas for improved agricultural productivity?",
    "options": {
      "A": "Roads, airport and recreation centers.",
      "B": "water, electricity and health care centres",
      "C": "electricity, guest houses and water",
      "D": "health care centres, water and airport"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71385?exam_type=jamb&type=obj&page=101",
    "correct_answer": "B",
    "explanation": "The provision of basic amenities such as water, electricity, and health care centres in rural areas can significantly improve agricultural productivity. Access to clean water is essential for both crop irrigation and livestock rearing.\nElectricity can power machinery and equipment that can increase the efficiency of farming practices. Health care centres can provide medical services to rural populations, ensuring that they are healthy and able to work on their farms. The other options, such as guest houses, airports, and recreation centers, while beneficial in some ways, are not as directly linked to agricultural productivity.",
    "year": "2024"
  },
  {
    "number": "505",
    "text": "The provision of farm inputs to farmers by the government can best be described as",
    "options": {
      "A": "credit",
      "B": "subsidy",
      "C": "capital",
      "D": "loan"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71386?exam_type=jamb&type=obj&page=101",
    "correct_answer": "B",
    "explanation": "The provision of farm inputs to farmers by the government can best be described as a subsidy. A subsidy is a form of financial aid or support extended to an economic sector (or institution, business, or individual) generally with the aim of promoting economic and social policy. In this case, the government is providing financial aid to farmers in the form of farm inputs to promote agricultural activities.",
    "year": "2024"
  },
  {
    "number": "506",
    "text": "Which of the following is an example of igneous rock?",
    "options": {
      "A": "granite",
      "B": "sandstone",
      "C": "limestone",
      "D": "gneiss"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71387?exam_type=jamb&type=obj&page=102",
    "correct_answer": "A",
    "explanation": "Igneous rocks are formed from the solidification of magma or lava. The given options are types of rocks. Among them, granite is an example of an igneous rock. Gneiss is a type of metamorphic rock, while limestone and sandstone are types of sedimentary rocks.",
    "year": "2024"
  },
  {
    "number": "507",
    "text": "The replacement of traditional farming methods with modern methods is a step in agricultural development",
    "options": {
      "A": "diversification",
      "B": "education",
      "C": "expansion",
      "D": "development"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71388?exam_type=jamb&type=obj&page=102",
    "correct_answer": "D",
    "explanation": "The replacement of traditional farming methods with modern methods is a step in agricultural development. This is because the introduction of modern methods such as mechanization, use of improved seeds, fertilizers, and pesticides, among others, improves productivity and efficiency in agriculture, hence leading to its development.",
    "year": "2024"
  },
  {
    "number": "508",
    "text": "The most active agent of physical weathering in arid legions is",
    "options": {
      "A": "water",
      "B": "temperature",
      "C": "wind",
      "D": "ice"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71389?exam_type=jamb&type=obj&page=102",
    "correct_answer": "D",
    "explanation": "The most active agent of physical weathering in arid legions is wind. In arid regions, where there is little vegetation to protect the soil and rocks from the wind, it can cause significant erosion and weathering. This process is known as deflation, where the wind blows and removes the small particles of soil and rock, leaving behind larger particles and rocks.",
    "year": "2024"
  },
  {
    "number": "509",
    "text": "A biotic factor influencing agricultural production is",
    "options": {
      "A": "predator",
      "B": "soil structure",
      "C": "wind",
      "D": "rainfall"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71390?exam_type=jamb&type=obj&page=102",
    "correct_answer": "A",
    "explanation": "Biotic factors are living or once-living organisms in the ecosystem. Predators are living organisms that can influence agricultural production by preying on the crops or the pests that affect the crops.",
    "year": "2024"
  },
  {
    "number": "510",
    "text": "Which of the following statements is not correct about the land use act?",
    "options": {
      "A": "Government has control over unused land",
      "B": "land cannot be used for any purpose",
      "C": "it aims at re-allocation of land for farming purposes",
      "D": "it does not lead to land fragmentation"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71391?exam_type=jamb&type=obj&page=102",
    "correct_answer": "B",
    "explanation": "The statement 'land cannot be used for any purpose' is not correct about the Land Use Act. The Land Use Act is a policy that gives the government control over land in the country with the aim of ensuring equitable use and management. It does not prohibit the use of land; rather, it regulates how land is used to ensure it is used for the benefit of all citizens an to prevent land fragmentation.",
    "year": "2024"
  },
  {
    "number": "511",
    "text": "Which of the following defines agriculture?",
    "options": {
      "A": "a way of life by which farmers produced food",
      "B": "the raising of crops to satisfy human needs",
      "C": "the science and art of farming to satisfy human needs",
      "D": "the raising of farm animals by rural communities"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71392?exam_type=jamb&type=obj&page=103",
    "correct_answer": "C",
    "explanation": "Agriculture is defined as the science and art of farming to satisfy human needs. It involves the cultivation of plants and the rearing of animals for food, fiber, medicinal plants, and other products used to sustain and enhance human life. Therefore, the option 'the science and art of farming to satisfy human needs' is the most comprehensive and accurate definition of agriculture.",
    "year": "2024"
  },
  {
    "number": "512",
    "text": "Which of the following uses of land should be given more attention in Nigeria for self-sufficiency in food production?",
    "options": {
      "A": "building of research centi-es",
      "B": "establishment of wildlife",
      "C": "establishment of agriculture and forestry",
      "D": "construction of roads"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71393?exam_type=jamb&type=obj&page=103",
    "correct_answer": "C",
    "explanation": "The establishment of agriculture and forestry directly contributes to food production. Agriculture involves the cultivation of plants and the rearing of animals for food, fiber, medicinal plants, and other products used to sustain and enhance human life. Forestry, on the other hand, involves the management of forests for the production of timber and non-timber forest products. Both of these uses of land contribute significantly to food production.",
    "year": "2024"
  },
  {
    "number": "513",
    "text": "Food shortage can be minimized by",
    "options": {
      "A": "hoarding",
      "B": "natural hazards",
      "C": "illegal exportation of farm produce",
      "D": "efficient pest control services"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71394?exam_type=jamb&type=obj&page=103",
    "correct_answer": "D",
    "explanation": "Food shortage can be minimized by efficient pest control services. This is because pests can destroy crops and reduce the amount of food produced. By controlling pests, we can ensure that crops are not destroyed and that food production is maximized. Natural hazards, illegal exportation of farm produce, and hoarding do not help to minimize food shortage",
    "year": "2024"
  },
  {
    "number": "514",
    "text": "The horizon of the soil profile that encourages the greatest level of microbial activity is",
    "options": {
      "A": "D -horizon",
      "B": "A-horizon",
      "C": "C-horizon",
      "D": "B-horizon"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71395?exam_type=jamb&type=obj&page=103",
    "correct_answer": "B",
    "explanation": "The A-horizon, also known as the topsoil, is the layer of soil that encourages the greatest level of microbial activity. This is because it contains the highest amount of organic matter and nutrients, which are essential for microbial growth and activity.",
    "year": "2024"
  },
  {
    "number": "515",
    "text": "The roles of government in the development of agriculture include the following except",
    "options": {
      "A": "provision of subsidies",
      "B": "establishment of farm settlements",
      "C": "training of farmers children",
      "D": "recommending loans"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71397?exam_type=jamb&type=obj&page=103",
    "correct_answer": "D",
    "explanation": "The government plays a significant role in the development of agriculture through various means such as recommending loans, providing subsidies, and establishing farm settlements. However, training of farmers' children is not a direct role of the government in agricultural development. This is more related to the education sector, although agricultural education can be promoted by the government.",
    "year": "2024"
  },
  {
    "number": "516",
    "text": "Igneous rocks formed within the crust are called",
    "options": {
      "A": "plutonic",
      "B": "volcanic",
      "C": "stratified",
      "D": "guartzite"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71399?exam_type=jamb&type=obj&page=104",
    "correct_answer": "A",
    "explanation": "Plutonic rocks form from magma that cools and solidifies within the crust of the Earth, as opposed to volcanic rocks, which form from lava that cools on the Earth's surface.",
    "year": "2024"
  },
  {
    "number": "517",
    "text": "Which of the following processes does not lead to the physical disintegration of rock?",
    "options": {
      "A": "expansion and contraction of rock minerals",
      "B": "formation of cracks and cervices in the rocks",
      "C": "heating and cooling of rock surface",
      "D": "rapid cooling and solidification of rocks"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71401?exam_type=jamb&type=obj&page=104",
    "correct_answer": "D",
    "explanation": "The physical disintegration of rock, also known as physical or mechanical weathering involves the breakdown of rocks and soils through direct contact with atmospheric conditions, such as heat, water, ice, and pressure. The rapid cooling and solidification of rocks is not a process that leads to the physical disintegration of rock. Instead, it is a process that leads to the formation of igneous rocks. When magma or lava cools and solidifies rapidly, it forms a type of igneous rockknown as extrusive igneous rock.",
    "year": "2024"
  },
  {
    "number": "518",
    "text": "Which of the following soil water is tightly held to the surface of the soil particles?",
    "options": {
      "A": "capillary water",
      "B": "superfluous water",
      "C": "hygroscopic water",
      "D": "gravitational water"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71402?exam_type=jamb&type=obj&page=104",
    "correct_answer": "C",
    "explanation": "Hygroscopic water is the type of soil water tightly held to the surface of the soil particles. It is held by absorption and is not available to plants because it is held too tightly for the roots to absorb. It is also not affected by gravity.",
    "year": "2024"
  },
  {
    "number": "519",
    "text": "Which of the following processes will not lead to the loss of nutrients from the soil?",
    "options": {
      "A": "leaching",
      "B": "harvesting",
      "C": "erosion",
      "D": "mulching"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71403?exam_type=jamb&type=obj&page=104",
    "correct_answer": "D",
    "explanation": "Mulching does not lead to the loss of nutrients from the soil. Instead, it helps to conserve soil moisture, reduce erosion, and contribute to the health of the soil by decomposing into organic matter. The other options are erosion, harvesting, and leaching all lead to nutrient loss from the soil.",
    "year": "2024"
  },
  {
    "number": "520",
    "text": "Which of the following will not lead to loss of nitrogen compound from the soil?\n\n.",
    "options": {
      "A": "burning",
      "B": "crop removal",
      "C": "lodging",
      "D": "leaching"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71404?exam_type=jamb&type=obj&page=104",
    "correct_answer": "C",
    "explanation": "Lodging refers to the falling over of crops, usually due to wind or heavy rain. This does not lead to a loss of nitrogen compounds from the soil. Nitrogen loss from the soil can occur through crop removal, burning, and leaching. Leaching is the process where nutrients are washed out from the soil by rain or irrigation.\nBurning can lead to the loss of nitrogen and it can volatilize and escape into the atmosphere. Crop removal can also lead to nitrogen loss as the nutrient is taken upby the plants and removed when the crop is harvested",
    "year": "2024"
  },
  {
    "number": "521",
    "text": "The factors that affect the number and the activities of soil micro-organisms include the following except",
    "options": {
      "A": "soil moisture",
      "B": "top biography",
      "C": "degree of soil acidity",
      "D": "soil aeration"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71405?exam_type=jamb&type=obj&page=105",
    "correct_answer": "B",
    "explanation": "The number and activities of soil micro-organisms are influenced by factors such as soil moisture, soil aeration, and degree of soil acidity. However, topography, which refers to the physical features of land, does not directly affect the number and activities of soil micro-organisms. Therefore, the correct answer is 'topography'.",
    "year": "2024"
  },
  {
    "number": "523",
    "text": "The most important factor that determines the rate of agricultural development in a country is the",
    "options": {
      "A": "number of machinery available in the country",
      "B": "readiness of farmers to adopt viable agricultural research results",
      "C": "quantity of herbicides used in the country",
      "D": "provision of raw materials for industries"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71407?exam_type=jamb&type=obj&page=105",
    "correct_answer": "B",
    "explanation": "The most important factor that determines the rate of agricultural development in a country is the readiness of farmers to adopt viable agricultural research results. This is because the adoption of new and improved farming techniques and practices can significantly increase agricultural productivity and efficiency, leading to increased agricultural development. The other options do not directly determine the rate of agricultural development.",
    "year": "2024"
  },
  {
    "number": "524",
    "text": "Although clay soil is rich in nutrients, they are not good for most agricultural crop production because they do not release their nutrients are too compact and poorly aerated contain too much iron, aluminum, and boron lose their nutrient too readily after rain",
    "options": {
      "A": "do not release nutrients",
      "B": "are too compact or poorly aerated",
      "C": "contains too much iron,aluminum and boron",
      "D": "lose their nutrient readily after rain"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71408?exam_type=jamb&type=obj&page=105",
    "correct_answer": "B",
    "explanation": "Clay soils are not good for most agricultural crop production because they are too compact and poorly aerated. Clay particles are very small and tightly packed together, which limits the amount of air and water that can penetrate the soil This can lead to poor root growth and reduced nutrient uptake by plants.",
    "year": "2024"
  },
  {
    "number": "525",
    "text": "The following are characteristics of quartz except",
    "options": {
      "A": "having cleavage",
      "B": "being granular",
      "C": "being glass-like",
      "D": "having shiny surface"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71429?exam_type=jamb&type=obj&page=105",
    "correct_answer": "A",
    "explanation": "Quartz is a mineral that is known for its hardness and glass-like appearance. It does not have cleavage, which is the ability of a mineral to break along flat surfaces. This characteristic is not present in quartz, hence the correct answer is 'having cleavage",
    "year": "2024"
  },
  {
    "number": "526",
    "text": "Financial assistance from the government to the farmers is usually in the following forms except",
    "options": {
      "A": "tax",
      "B": "loans",
      "C": "credit",
      "D": "subsidy"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71430?exam_type=jamb&type=obj&page=106",
    "correct_answer": "A",
    "explanation": "Financial assistance from government to farmers is usually in the form of loans, credit, and subsidies. These are all financial support that help farmers manage their finances and improve their farming practices. Tax, on the other hand, is not a form of financial assistance but a financial obligation that farmers, like all citizens, are required to pay to the government.",
    "year": "2024"
  },
  {
    "number": "527",
    "text": "The replacement of traditional farming methods with modern methods is a step in agricultural",
    "options": {
      "A": "expansion",
      "B": "education",
      "C": "development",
      "D": "diversification"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71431?exam_type=jamb&type=obj&page=106",
    "correct_answer": "C",
    "explanation": "The replacement of traditional farming methods with modern methods is a step in agricultural development. This is because the introduction of modern methods such as mechanization and, use of improved seeds, fertilizers, and pesticides, among others, improves productivity and efficiency in agriculture, hence leading to its development.",
    "year": "2024"
  },
  {
    "number": "528",
    "text": "In the nitrogen cycle , nitrite is oxidized to nitrate by",
    "options": {
      "A": "nitrobacter",
      "B": "nitrosomonas",
      "C": "azotobacter",
      "D": "rhizobium"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71432?exam_type=jamb&type=obj&page=106",
    "correct_answer": "A",
    "explanation": "In the nitrogen cycle, nitrite is oxidized to nitrate by the bacteria Nitrobacter This process is known as nitrification.Nitrosomonas is involved in the first step of nitrification, which is the oxidation of ammonia to nitrite. Azotobacter and Rhizobium are nitrogen-fixing bacteria, they convert atmospheric nitrogen into a form that plants can use.",
    "year": "2024"
  },
  {
    "number": "529",
    "text": "A characteristic feature of subsistence agriculture is",
    "options": {
      "A": "diseases control",
      "B": "supply of labour by farm families",
      "C": "wholesale of farm harvest",
      "D": "purchasing of seeds for planting"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71433?exam_type=jamb&type=obj&page=106",
    "correct_answer": "B",
    "explanation": "A characteristic feature of subsistence agriculture is the supply of labor by farm families. Subsistence agriculture is a type of farming where the farmers focus on growing enough food to feed themselves and their families. The output is mostly for local requirements with little or no surplus trade. The labour in subsistence farming is often provided by the family members.",
    "year": "2024"
  },
  {
    "number": "530",
    "text": "Which of the following is not correct about the importance of agriculture?",
    "options": {
      "A": "provision of the raw materials for agro-based industries",
      "B": "serving as main source of foreign exchange",
      "C": "supply of food",
      "D": "provision of employment"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71434?exam_type=jamb&type=obj&page=106",
    "correct_answer": "B",
    "explanation": "Agriculture is not the main source of foreign exchange for many countries, especially those with a diversified economy. While it can contribute to foreign exchange through the export of agricultural products, it is not the main source. The main sources of foreign exchange are usually industries like oil and gas, manufacturing, and services.",
    "year": "2024"
  },
  {
    "number": "531",
    "text": "The alternate heating and cooling of rocks will result in",
    "options": {
      "A": "sublimation",
      "B": "solidification",
      "C": "fragmentation",
      "D": "molten magma"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71435?exam_type=jamb&type=obj&page=107",
    "correct_answer": "C",
    "explanation": "Thermal weathering is a type of physical or mechanical weathering. The alternate heating and cooling cause the rocks tc expand and contract. Over time, this can cause the rocks to crack and eventually break apart, a process known as fragmentation.",
    "year": "2024"
  },
  {
    "number": "532",
    "text": "The main aim of wildlife management is to",
    "options": {
      "A": "provide lots of cheap protein",
      "B": "reduce the population of trypanosome parasites.",
      "C": "generate foreign exchange through exportation of meat",
      "D": "prevent extinction of species"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71436?exam_type=jamb&type=obj&page=107",
    "correct_answer": "D",
    "explanation": "Wildlife management is the process of keeping wild species and the ecosystems they inhabit healthy and vibrant. The main aim of wildlife management is to ensure the survival of all species and to maintain the balance of ecosystems. This includes preventing the extinction of species.",
    "year": "2024"
  },
  {
    "number": "533",
    "text": "Government laws and reforms are aimed at\n\n \n \n.",
    "options": {
      "A": "discouraging investment in agriculture",
      "B": "increasing agriculture production",
      "C": "controlling farm profits",
      "D": "encouraging importation of agriculture pmduce"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71437?exam_type=jamb&type=obj&page=107",
    "correct_answer": "B",
    "explanation": "Government laws and reforms in the agricultural sector are primarily aimed at increasing agricultural production. This can be achieved through a variety of means, such as providing subsidies to farmers, implementing policies that encourage sustainable farming practices, and investing in agricultural research and development. While controlling farm profits,discouraging investment in agriculture, and encouraging the importation of agricultural produce may be the effects of certain policies, they are not the primary aim of government laws and reforms",
    "year": "2024"
  },
  {
    "number": "534",
    "text": "Plant breeders aim at obtaining the following except",
    "options": {
      "A": "adaptation to pollination",
      "B": "tolerance to climate extremes",
      "C": "uniformity in the time of maturity",
      "D": "resistance of pest"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71438?exam_type=jamb&type=obj&page=107",
    "correct_answer": "A",
    "explanation": "Plant breeders aim at obtaining tolerance to climate extremes, resistance to pests, and uniformity in the time of maturity, However, adaptation to pollination is not a direct aim of plant breeding. Pollination is a natural process that occurs in plants and is not something that plant breeders aim to adapt or modify.",
    "year": "2024"
  },
  {
    "number": "535",
    "text": "Weed plants which grow on other plants without deriving nutrients from them are called",
    "options": {
      "A": "epiphytes",
      "B": "saprophytes",
      "C": "decomposers",
      "D": "sedge"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71439?exam_type=jamb&type=obj&page=107",
    "correct_answer": "A",
    "explanation": "Weed plants that grow on other plants without deriving nutrients from them are called epiphytes. Epiphytes are plant that grow on other plants, but unlike parasites, they do not derive nutrients from their hosts. They only use the host plants for physical support. Sedge is a type of grass-like plant, decomposers are organisms that break down dead or decaying organisms, and saprophytes are organisms that feed on decaying organic matter.",
    "year": "2024"
  },
  {
    "number": "536",
    "text": "Gummosis is caused by a",
    "options": {
      "A": "fungus",
      "B": "nematoda",
      "C": "virus",
      "D": "bacterium"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71440?exam_type=jamb&type=obj&page=108",
    "correct_answer": "A",
    "explanation": "Gummosis is a disease in plants, particularly fruit trees, where sap oozes from the bark, resulting in the formation of amber-like gum deposits. It is primarily caused by fungal infections, hence the correct answer is 'fungus'.",
    "year": "2024"
  },
  {
    "number": "537",
    "text": "New-born animals should be fed with colostrum because it",
    "options": {
      "A": "provides them permanent immunity against diseases",
      "B": "contains antibodies protecting them against diseases",
      "C": "is easily digested",
      "D": "is the first milk produced before birth"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71441?exam_type=jamb&type=obj&page=108",
    "correct_answer": "B",
    "explanation": "Colostrum is the first form of milk produced by the mammary glands of mammals (including many humans) immediately following delivery of the newborn. New-born animals should be fed with colostrum because it contains antibodies that protect them against diseases. These antibodies are produced by the mother and passed to the baby, providing the baby with a temporary immunity against diseases.",
    "year": "2024"
  },
  {
    "number": "538",
    "text": "One of the peculiarities of the intestine tract of a fowl is the possession of",
    "options": {
      "A": "oesophageal groove",
      "B": "cloaca",
      "C": "large intestine",
      "D": "stomach"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71442?exam_type=jamb&type=obj&page=108",
    "correct_answer": "B",
    "explanation": "One of the peculiarities of the intestine tract of a fowl is the possession of a cloaca. The cloaca is a common chamber and outlet into which the intestinal, urinary, and genital tracts open. It is used to expel wastes and lay eggs in birds.",
    "year": "2024"
  },
  {
    "number": "539",
    "text": "Which of the following group of crops can be attacked by smut diseases?",
    "options": {
      "A": "sugarcane, maize and banana",
      "B": "guinea corn, sugarcane and rubber",
      "C": "maize, guinea corn and yam",
      "D": "rice, maize and guinea corn"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71443?exam_type=jamb&type=obj&page=108",
    "correct_answer": "D",
    "explanation": "Smut diseases are a type of fungal disease that primarily affects grains and grasses, including crops like maize, rice, and guinea corn. Therefore, the correct answer is 'rice, maize and guinea corn'. Sugarcane can also be affected by smut, but banana and rubber are not typically susceptible to this type of disease.",
    "year": "2024"
  },
  {
    "number": "540",
    "text": "Which of the following feedstuff does not contain phosphorus?",
    "options": {
      "A": "limestone",
      "B": "fish meal",
      "C": "blood meal",
      "D": "oyster shell"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71444?exam_type=jamb&type=obj&page=108",
    "correct_answer": "D",
    "explanation": "Oyster shell does not contain phosphorous. Phosphorous is an essential mineral for animals, it is found in many feed stuff including blood meal, limestone, and fish meal. However, oyster shell is primarily composed of calcium carbonate and does not contain significant amounts of phosphorous.",
    "year": "2024"
  },
  {
    "number": "541",
    "text": "An accessory sex gland in bull is",
    "options": {
      "A": "thyroid gland",
      "B": "prostrate gland",
      "C": "pancreatic gland",
      "D": "pituitary gland"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71445?exam_type=jamb&type=obj&page=109",
    "correct_answer": "B",
    "explanation": "In male mammals, the prostate gland is an accessory sex gland that contributes fluid to the ejaculate. The prostate gland is not unique to bulls but is found in all male mammals.",
    "year": "2024"
  },
  {
    "number": "542",
    "text": "Gestation period is defined as the time",
    "options": {
      "A": "of release of ovum from the ovary",
      "B": "of fusion of the sperm and the egg",
      "C": "of the birth of the young animal",
      "D": "between conception and parturition"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71446?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "The gestation period is defined as the time between conception (fertilization of the egg by the sperm) and parturition (birth). It is the period during which an embryo develops into a fetus inside the mother's body.",
    "year": "2024"
  },
  {
    "number": "543",
    "text": "Which of the following livestock endoparasite is a hermaphmdite?",
    "options": {
      "A": "trypanosome",
      "B": "roundworm",
      "C": "liverfluke",
      "D": "tapeworm"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71447?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "Tapeworms are hermaphrodites, meaning they have both male and female repmductive organs. This allows them to self fertilize and produce eggs without needing a mate. Liver flukes, trypanosomes, and roundworms are not hermaphmdites",
    "year": "2024"
  },
  {
    "number": "544",
    "text": "Which of the following is not a characteristic of a good pasture?",
    "options": {
      "A": "provision of balance nutrients",
      "B": "high stem to leaf ratio",
      "C": "high quality of grass",
      "D": "ability to withstand trampling"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71448?exam_type=jamb&type=obj&page=109",
    "correct_answer": "B",
    "explanation": "A high stem to leaf ratio is not a characteristic of a good pasture. In fact, it is the opposite. A good pasture should have low stem to leaf ratio. This is because the leaves of the plants are more nutritious and palatable to animals than the stems. Therefore, a pasture with a high proportion of leaves to stems will pmvide better nutrition for grazing animals.",
    "year": "2024"
  },
  {
    "number": "545",
    "text": "The water-snail is important in the life cycle of",
    "options": {
      "A": "coccidium",
      "B": "tapeworm",
      "C": "roundworm",
      "D": "liver fluke"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71449?exam_type=jamb&type=obj&page=109",
    "correct_answer": "D",
    "explanation": "The liver fluke is a parasitic worm that requires two hosts to complete its life cycle. The first host is a snail, usually a water snail, where the fluke undergoes several developmental stages. The second host is a mammal, usually a sheep or a cow, where the fluke matures and reproduces",
    "year": "2024"
  },
  {
    "number": "546",
    "text": "Which of the following will not be affected by an excessive amount of water content in feeds?",
    "options": {
      "A": "improving quality of such feeds",
      "B": "decrease in nutritive value",
      "C": "encouraging growth of molds",
      "D": "formation of toxic products"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71458?exam_type=jamb&type=obj&page=110",
    "correct_answer": "A",
    "explanation": "Excessive amounts of water content in feeds do not improve their quality. Instead, it can lead to a decrease in nutritive value, formation of toxic products, and growth of molds.",
    "year": "2024"
  },
  {
    "number": "547",
    "text": "Andropogon gayanus is commonly called",
    "options": {
      "A": "guinea grass",
      "B": "spear grass",
      "C": "gamba grass",
      "D": "elephant grass"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71460?exam_type=jamb&type=obj&page=110",
    "correct_answer": "C",
    "explanation": "Andropogon gayanus is commonly called 'gamba grass'. This is a species of grass native to Africa, but it has been introduced to other parts of the world. It is a tall, perennial grass that is often used for and hay production.",
    "year": "2024"
  },
  {
    "number": "548",
    "text": "The correct sequence of the components of a goat's stomach is",
    "options": {
      "A": "rum en - reti culum - abomasum -omasum",
      "B": "rum en - reti culum - omasum - abomasum",
      "C": "reti culum - rum en - omasum - abomasum",
      "D": "reti culum - omasum - abomasum - rum en"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71461?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "The correct sequence of the components of a goat's stomach is rumen-reticulum-omasum-abomasum. The rumen is the first part of the stomach and is where the fermentation of food occurs. The reticulum is the second part and works with the rumen to further break down food. The omasum is the third part and absorbs water and nutrients. The abomasum is the fourth and final part and is similar to a human stomach.",
    "year": "2024"
  },
  {
    "number": "549",
    "text": "The tree species commonly planted for pulpwood is",
    "options": {
      "A": "albizia",
      "B": "gmelina",
      "C": "tactona",
      "D": "cassia"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71463?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "Gmelina is a tree species commonly planted for pulpwood. Pulpwood is the raw material used in the production of paper and gmelina is often used because it grows quickly and provides high-quality pulp. The other options, cassia, albizia, and tactona, are not typically used for pulpwood.",
    "year": "2024"
  },
  {
    "number": "550",
    "text": "A major symptom of onion/twister is",
    "options": {
      "A": "motting of leaves",
      "B": "appearance of dark brown spots on leaves",
      "C": "rottening of buds",
      "D": "rottening of roots"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71464?exam_type=jamb&type=obj&page=110",
    "correct_answer": "B",
    "explanation": "A major symptom of onion/twister is the appearance of dark brown spots on leaves. Onion/twister is a disease that affects onion plants, causing the leaves to twist and curl",
    "year": "2024"
  },
  {
    "number": "551",
    "text": "Air sacs are present in",
    "options": {
      "A": "rabbit",
      "B": "goat",
      "C": "poultry",
      "D": "cattle"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71465?exam_type=jamb&type=obj&page=111",
    "correct_answer": "D",
    "explanation": "Air sacs are present in poultry. Air sacs are part of the respiratory system in birds. They allow for a continuous flow of air through the lungs, which is more efficient than the in-and-out flow of air seen in mammals",
    "year": "2024"
  },
  {
    "number": "552",
    "text": "The foot and mouth disease of cattle is caused by a",
    "options": {
      "A": "virus",
      "B": "fungus",
      "C": "nematode",
      "D": "bacterium"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71467?exam_type=jamb&type=obj&page=111",
    "correct_answer": "A",
    "explanation": "The foot and mouth disease of cattle is caused by a virus. Foot-and-mouth disease (FMD) is a severe, highly contagious-viral disease of cattle and swine. It also affects sheep, goats, deer, and other cloven-hooved ruminants. FMD is not recognized as a zoonotic disease.",
    "year": "2024"
  },
  {
    "number": "522",
    "text": "The diagram above illustrates a reproductive process in a farm animal, study the process and answer the questions:",
    "options": {
      "A": "gestation",
      "B": "heat",
      "C": "ovulation",
      "D": "lactation"
    },
    "answer_url": "https://myschool.ng/classroom/agricultural-science/71406?exam_type=jamb&type=obj&page=105",
    "correct_answer": null,
    "explanation": "Gestation refers to the period of pregnancy or the time it takes for female animals to carry and develop their offspring before maturity.",
    "year": "2024"
  }
]