[
  {
    "number": "950",
    "text": "The only Sūrah in the Glorious Qur'an which must be recited in every obligatory prayer is",
    "options": {
      "A": "al-Baqārah",
      "B": "al-Alaq",
      "C": "al-Fātīhah",
      "D": "al-Ikhlās"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65636?exam_type=jamb&type=obj&page=190",
    "correct_answer": "C",
    "explanation": "Al-Fātiḥah (Arabic: الْفَاتِحَة‎, \"The Opening\" or \"The Opener\") is the first chapter (sūrah) of the Quran. Its seven verses (āyāt) are a prayer for the guidance, lordship, and mercy of God.This chapter has an essential role in Islamic prayer (salāt). The primary literal meaning of the expression \"al-Fātiḥah\" is \"The Opener,\" which could refer to this Surah being \"the opener of the Book\" (Fātiḥat al-kitāb), to its being the first Surah recited in full in every prayer cycle (rakʿah), or to the manner in which it serves as an opening for many functions in everyday Islamic life.",
    "year": "2013"
  },
  {
    "number": "952",
    "text": "The verse above in sūrah al-Lahab means",
    "options": {
      "A": "no profit to him from all his power and business",
      "B": "no profit to him from all his military and economic powers",
      "C": "no profit to him from all his wealth and gains",
      "D": "no profit to him from all his property and children"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65638?exam_type=jamb&type=obj&page=191",
    "correct_answer": "C",
    "explanation": "This Surah has 5 verses. This Surah has two names Surah Lahab اللهب and Masad المسد . It takes its name from verse 1 and 5 where the word \"اللهب\" and \"المسد\" meaning \"The Flame\" and \"Palm Fiber\" appears respectively. This Surah was revealed in Mecca most probably in a later stage of Muhammad's preaching in Mecca when persecution of him and his followers had started.FROM SAHIH INTERNATIONAL;His wealth will not avail him or that which he gained.",
    "year": "2013"
  },
  {
    "number": "953",
    "text": "One important lesson taught in Suratul Kawthar is that Muslims should",
    "options": {
      "A": "always fulfil their promises",
      "B": "protect themselves when the need arises",
      "C": "accept whatever calamity that befall them",
      "D": "worship Allah and sacrifice"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65639?exam_type=jamb&type=obj&page=191",
    "correct_answer": "D",
    "explanation": "'Therefore turn in prayer to your Lord and sacrifice to Him only\". Ref: Q: 108:2.8 Productivity Lessons From Surah Al-KawtharAyah 1: Verily (innaa) we gave you( 'ataynaakal) the abundant good (al-Kawthar)1. Change your way of thinking: be thankful2. Benefit from the prophet.Ayah 2: So pray ( fasalli) to your Lord ( li Rabbika ) and sacrifice (wanhar )3. Treat your salah as your life-saver.4. Make sacrifice a part of your day.Ayah 3: Indeed ( inna) your enemy ( shaani'aka ) he ( huwa) is cut off ( al abtar)5. Dealing with ridicule.6. Don't take pride in children.7. Always believe in the promise of Allah and live by it.8. Say bismillah.",
    "year": "2013"
  },
  {
    "number": "955",
    "text": "Suratul Mā'ūn discusses the privilege to be enjoyed by the",
    "options": {
      "A": "givers",
      "B": "travelers",
      "C": "the wealthy",
      "D": "the needy"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65641?exam_type=jamb&type=obj&page=191",
    "correct_answer": "D",
    "explanation": "Sūrat al-Māʻūn ( Arabic: ﺳﻮﺭﺓ ﺍﻟﻤﺎﻋﻮﻥ , \"Small Kindnesses, Almsgiving, Acts of Kindness, and Have You Seen\") is the 107th sura of the Qur'an with 7 ayat.*Lessons from Sūrah 107 - Sūratul Mā'ūnﺑﺴﻢ ﺍﻟﻠﻪ ﺍﻟﺮﺣﻤﻦ ﺍﻟﺮﺣﻴﻢ1. Do not turn away the orphan.2. Feed the poor, and encourage others in feeding them.3. Those who are neglectful of their ṣalāh face doom in the Hereafter.4. Ostentation is an act of the people who are doomed.5. Do not refrain from giving in charity items that are very affordable and easy for you to acquire, yet important in daily life.",
    "year": "2013"
  },
  {
    "number": "956",
    "text": "The victory of the Roman Empire over the Persian Empire after the Persians had defeated the Romans as stated in the Glorious Qur'an (Q. 30: 2-3) is an evidence of the",
    "options": {
      "A": "beauty of the words of the Glorious Qur'an",
      "B": "historical nature of the Glorious Qur'an",
      "C": "simplicity of the wordings of the Glorious Qur'an",
      "D": "authenticity of the Glorious Qur'an"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65642?exam_type=jamb&type=obj&page=192",
    "correct_answer": "D",
    "explanation": "The 30th Sura of the Holy Quran, named Rome, opens with the declaration of a prophecy about the ultimate success of the Romans over the Persians. The prophecy was made at a time when the tide of the Persian conquest was sweeping away everything before its irresistible onrush and the degradation and humiliation of the Romans had sunk to its lowest depths",
    "year": "2013"
  },
  {
    "number": "958",
    "text": "The Qur'an is different from other revealed Books because",
    "options": {
      "A": "it is a prayer book only",
      "B": "barren women can be helped through it",
      "C": "both spiritual, moral and social values are found in it",
      "D": "one can use it for protection only."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65644?exam_type=jamb&type=obj&page=192",
    "correct_answer": "C",
    "explanation": "Unlike any other book, the Quran is taught by God (Q55:1-2); He teaches us what we need at the time we need it. This is why we read the Quran hundreds of times without getting bored. We can read a novel, for example, only once. But the Quran can be read an infinite number of times, and we derive new and valuable information from it every time.The Quran is a singular source of knowledge and wisdom. It is the best source of information. It sheds light on why some things are the way they are, and enables us to understand the meaning of things, in order to be able to look past appearance and make judicious decisions.[Q16:89] ...We have revealed to you this book to provide explanations for everything, and guidance, and mercy, and good news for the submitters (Muslims).",
    "year": "2013"
  },
  {
    "number": "959",
    "text": "Prophet Muhammad (SAW) did not hand-over the Glorious Qur'an to his companions in an arranged form and in a single written volume because",
    "options": {
      "A": "he did not want only the Quraish to inherit the book",
      "B": "the revelation did not come in one piece but at intervals",
      "C": "many tribes would want to take over its distribution",
      "D": "there was no need for it."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65645?exam_type=jamb&type=obj&page=192",
    "correct_answer": "B",
    "explanation": "The prophet Muhammad (pbuh) was illiterate so whenever he received revelation of the Quran one of the scribes would write the verses down on materials like parchment, animal skin, leather, bones and stone tablets. The Prophet (pbuh) would check that the verses had been written correctly by asking the scribe to recite the verses back to him. Some of his scribes were: Abu Bakr-as-Siddeeq, Uthman ibn Affan, Ali ib Abi Talib, Abu Salama, Zayd ibn Thabit etc.By the time the Prophet Muhammad (pbuh) passed away in 632 CE the complete Quran had been written down on various materials. The Quranic fragments were then used to prepare a complete master copy of the Quran during the Caliphate of Uthman ibn Affan. Zayd ibn Thabit was instructed to compile a master copy of the Quran from all the loose material. Muhammad (pbuh) had read the Quran in a certain order which was memorised by many people during his life. Zayd requested every companion of the Prophet (pbuh) to bring him their written verses of the Quran. He only accepted written material which had been dictated by the Prophet (pbuh) himself.",
    "year": "2013"
  },
  {
    "number": "960",
    "text": "The correct meaning of tafsir is the",
    "options": {
      "A": "detailed explanation and commentary of the Glorious Qur'an",
      "B": "scientific application of the contents of the Glorious Qur'an to human life",
      "C": "true reflections on the contents of the Glorious Qur'an",
      "D": "practical application of the contents of the Glorious Qur'an"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65646?exam_type=jamb&type=obj&page=192",
    "correct_answer": "A",
    "explanation": "Tafsir (Arabic : ﺗﻔﺴﻴﺮ, romanized : Tafsīr,literally 'interpretation' [taf.ˈsiːr] ) is the Arabic word for exegesis, usually of the Quran . An author of a tafsir is a mufassir ( Arabic: ﻣُﻔﺴّﺮ; plural: Arabic :ﻣﻔﺴّﺮﻭﻥ , romanized : mufassirūn). A Quranic tafsir attempts to provide elucidation, explanation, interpretation, context or commentary for clear understanding and conviction of God's will.Principally, a tafsir deals with the issues of linguistics , jurisprudence , and theology . In terms of perspective and approach, tafsir can be broadly divided into two categories, namely tafsir bi-al-ma'thur (received tafsir), which is transmitted from the early days of Islam through the Islamic prophet Muhammad and his companions , and tafsir bi-al-ra'y (lit. tafsir by opinion), which is arrived through personal reflection or independent rational thinking.",
    "year": "2013"
  },
  {
    "number": "962",
    "text": "Tajwid as one of the science of the Glorious Qur'an is important because",
    "options": {
      "A": "it allows for the understanding of history of the Glorious Qur'an",
      "B": "it provides the basis for the deeper understanding of the Glorious Qur'an",
      "C": "it provides the knowledge of correct pronunciation and recitation of the Glorious Qur'an",
      "D": "it increases the ability to recite and communicate in Arabic"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65648?exam_type=jamb&type=obj&page=193",
    "correct_answer": "C",
    "explanation": "The purpose of TajweedThe Qur'an is the word of Allah, and its every syllable is from Allah. Its recitation must be taken very seriously. The purpose of the science of Tajweed, in essence, is to make the reciter proficient in reciting the Qur'an, observing the correct pronunciation of every letter with the rulings and characteristics which apply to it, without any exaggeration or deficiency. Through this, the reciter can recite the Qur'an according to the way of the Prophet, sallallaahu 'alaihi wa sallam, who received it from Jibreel who received it from Almighty Allah in the Classical Arabic language.",
    "year": "2013"
  },
  {
    "number": "963",
    "text": "The gradual spiritual and moral development of Muslims was the wisdom behind the",
    "options": {
      "A": "compilation of the Glorious Qur'an",
      "B": "standardization of the Glorious Qur'an",
      "C": "preservation of the Glorious Qur'an",
      "D": "piecemeal revelation of the Glorious Quran"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65649?exam_type=jamb&type=obj&page=193",
    "correct_answer": "D",
    "explanation": "The Quran was revealed piecemeal (25:32) during a period of 23years (609-632 C.E.), the shorter chapters generally, and some ofthe larger ones, being revealed entire and at one time, while therevelation of the majority of the larger chapters and some of theshorter chapters extended over many years. The practice was thatwhen a chapter was revealed in parts, the Holy Prophet specified,under Divine guidance, the place of the verse revealed, and thusthe arrangement of verses in each chapter was entirely his work.Similarly, later on when a considerable portion had beenrevealed, the arrangement of the chapters was also the work of theHoly Prophet himself.",
    "year": "2013"
  },
  {
    "number": "964",
    "text": "The verse above is in relation to the",
    "options": {
      "A": "standardization of the Glorious Qur'an",
      "B": "preservation of the Glorious Qur'an .",
      "C": "compilation of the Glorious Qur'an",
      "D": "arrangement of the Glorious Qur'an"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65650?exam_type=jamb&type=obj&page=193",
    "correct_answer": "B",
    "explanation": "And the earth, We have spread it and [We] cast therein firm mountains and [We] caused to grow therein of every thing well-balanced.(Qur'an 15:19)",
    "year": "2013"
  },
  {
    "number": "965",
    "text": "The battle that served as a pointer to the compilation of the Glorious Qur'an was fought at",
    "options": {
      "A": "Khandaq",
      "B": "Uhud",
      "C": "Tabūk",
      "D": "Yamāmah."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65651?exam_type=jamb&type=obj&page=193",
    "correct_answer": "D",
    "explanation": "During the time of Caliph Abu Bakr, when 70 people who knew the Quran by heart (qari), were killed in the Battle of Yamama, Umar ibn al-Khattab became concerned and appealed to Abu Bakr in order to compile the Quran into a book.Abu Bakr formed a delegation under the leadership of Zaid ibn Thabit, one of the leading scribes.This delegation of 12 people, including famous figures such as Uthman ibn Affan, Ali ibn Abi Talib, Talha ibn Ubaydullah, Abdullah ibn Masood, Ubayy ibn Kab, Khalid ibn al-Walid, Hudhaifah and Saleem, came together in Umar's house and collected all the materials on which verses from the Quran were written.",
    "year": "2013"
  },
  {
    "number": "966",
    "text": "The committee that standardized the Glorious Qur'an is made up of",
    "options": {
      "A": "Six people",
      "B": "Five people",
      "C": "Four people",
      "D": "Three people"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65652?exam_type=jamb&type=obj&page=194",
    "correct_answer": "C",
    "explanation": "It is believed upon Hudhayfah's request Uthman obtained the sheets of the Quran from Ḥafṣa and appointed a commission consisting of Zayd and three prominent Meccans, and instructed them to copy the sheets into several volumes based on the dialect of Quraysh, the main tribe of Mecca.\"Uthman bin Affan appointed a panel of four people to carry out the standardization of the Holy Qur`an. They include;1.Zaid bin Thābit;2.Abdullahi bin Zubair;3. Sa'ad bin Al-ÁS4.Abdul-Rahman bin Hārith\"",
    "year": "2013"
  },
  {
    "number": "967",
    "text": "A characteristic common to Makkan chapters is that, they",
    "options": {
      "A": "are long",
      "B": "address the people of the Book",
      "C": "contain a lot of oaths",
      "D": "make references to battles"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65653?exam_type=jamb&type=obj&page=194",
    "correct_answer": "C",
    "explanation": "The Makkan Chapters are those which were revealed in Makkah. This refers to everything revealed before the Migration to Madinah, even if the verse was revealed while the Prophet (ﷺ) was outside of the city of Makkah.The Makkan Chapters are those which were sent down to address the people of Makkah. The Makkan verses are distinguished by strength and sternness in addressing the people because the people would turn away and show arrogance, so this suited their state. Read for example Al-Mudaththir and Al-Qamar. The Makkan verses are usually shorter, and are strong with their argument against the deniers (i.e. the idolators) and are appropriate to their condition at the time. Read At-Toor as an example.",
    "year": "2013"
  },
  {
    "number": "968",
    "text": "The permission to marry up to four wives in Islam is aimed at",
    "options": {
      "A": "bearing more children",
      "B": "treating them equally",
      "C": "reducing the number of unmarried women",
      "D": "preventing adultery"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65654?exam_type=jamb&type=obj&page=194",
    "correct_answer": "D",
    "explanation": "The verse most commonly referred to with the topic of polygamy is Verse 3 of Surah 4 An-Nisa (Women). A translation by Yusuf Ali is shown below:If ye fear that ye shall not be able to deal justly with the orphans, Marry women of your choice, Two or three or four; but if ye fear that ye shall not be able to deal justly (with them), then only one, or (a captive) that your right hands possess, that will be more suitable, to prevent you from doing injustice.- Qur'an, Sura 4 (An-Nisa), Ayah 3",
    "year": "2013"
  },
  {
    "number": "969",
    "text": "The Prophet (SAW)7 said, 'Of all things lawful, divorce is the most hateful to Allah' because it exposes the parties to",
    "options": {
      "A": "Reconciliation",
      "B": "Provocation",
      "C": "Hardship",
      "D": "Arbitration"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65655?exam_type=jamb&type=obj&page=194",
    "correct_answer": "B",
    "explanation": "Although Shari'ah Law permits divorce, in the Hadith, Abdullah ibn Umar reported that the Prophet Muhammad said, The most detestable of lawful things before Allah is divorce. So although divorce is allowed, Muslims should try to avoid it, if possible.This means that many Muslims who experience marital difficulties will try to resolve their issues. It is also because they have made a contract before God, called a nikah, to remain together for life and divorce would mean breaking that contract.",
    "year": "2013"
  },
  {
    "number": "970",
    "text": "Imam Malik was born in",
    "options": {
      "A": "Syria",
      "B": "Makkah",
      "C": "Madinah",
      "D": "Egypt"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65656?exam_type=jamb&type=obj&page=194",
    "correct_answer": "C",
    "explanation": "Malik ibn Anas, the founding figure of the Maliki school of jurisprudence, also known as \"the school of the people of Madinah,\" was born at Madinah at the height of the Umayyad khilafah. Although Madinah had by his time long lost the political importance it had once had, the town remained the chief center of transmitted information about Islam in all the lands of the khilafah, because it was the original setting of the Prophet's mission in the crucial last ten years of his life, because the overwhelming majority of Muhammad's Companions had continued to reside there after his death, and because their descendants were still living there in Malik's time.",
    "year": "2013"
  },
  {
    "number": "971",
    "text": "Allah's pleasure in this world and the hereafter can be obtained through",
    "options": {
      "A": "Physical exercises",
      "B": "Writing Qur'an on a slate",
      "C": "Shari'a",
      "D": "Oratory"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65657?exam_type=jamb&type=obj&page=195",
    "correct_answer": "C",
    "explanation": "Sharia (Arabic: شريعة), Islamic law, or redundantly Sharia law is a religious law forming part of the Islamic tradition.It is derived from the religious precepts of Islam, particularly the Quran and the hadith. In Arabic, the term sharīʿah refers to God's immutable divine law and is contrasted with fiqh, which refers to its human scholarly interpretations",
    "year": "2013"
  },
  {
    "number": "972",
    "text": "Lending out money with interest in Islam is",
    "options": {
      "A": "Sadaqah",
      "B": "Ribā",
      "C": "Kharaj",
      "D": "Jizyah"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65658?exam_type=jamb&type=obj&page=195",
    "correct_answer": "B",
    "explanation": "Riba is the unjustified increment in borrowing or lending money, paid in kind or in money above the amount of loan, as a condition imposed by the lender or voluntarily by the borrower. Riba defined in this way is called in fiqh riba al-duyun (debt usury). (Abdel-Rahman Yousri Ahmad).Riba (Arabic: ربا ,الربا، الربٰوة‎ ) can be roughly translated as \"usury\", or unjust, exploitative gains made in trade or business under Islamic law. Riba is mentioned and condemned in several different verses in the Qur'an (3:130, 4:161, 30:39 and perhaps most commonly in 2:275-2:280). It is also mentioned in many hadith.",
    "year": "2013"
  },
  {
    "number": "973",
    "text": "The similarity between the Jihad of Uthman b. Fodio and the Prophet's hijrah in 622 C. E was the",
    "options": {
      "A": "strength of their followers",
      "B": "inspiration from Allah",
      "C": "display of bid'ah",
      "D": "envy of non-believers."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65659?exam_type=jamb&type=obj&page=195",
    "correct_answer": "B",
    "explanation": "Hijrah, (Arabic: \"Migration\" or \"Emigration\") the Prophet Muhammad's migration (622 CE) from Mecca to Yathrib (Medina) upon invitation in order to escape persecution.Uthman Dan Fodio's appeal to justice and morality rallied the outcasts of Hausa society. He found his followers among the Fulbe and Fulani. The Fulbe and Fulani were primarily cattle pastoralists. These pastoralist communities were led by the clerics living in rural communities who were Fulfude speakers and closely connected to the pastoralists. The Fulani would later hold the most important offices of the new states. Hausa peasants, runaway slaves, itinerant preachers, and others also responded to Uthman's preaching. His jihad served to integrate a number of peoples into a single religio-political movement.They were both inspired by Allah.",
    "year": "2013"
  },
  {
    "number": "980",
    "text": "The companion who introduced Islam to North Africa through Egypt was",
    "options": {
      "A": "Amr b. As",
      "B": "Abu Musa",
      "C": "Ibn Ishaq",
      "D": "Ibn Suleiman"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65666?exam_type=jamb&type=obj&page=196",
    "correct_answer": "A",
    "explanation": "Amr ibn al-As al-Sahmi (Arabic: عمرو بن العاص‎, romanized: ʿAmr ibn al-ʿĀṣ al-Sahmī; c. 573 - 664) was the Arab commander who led the Muslim conquest of Egypt and served as its governor in 640-646 and 658-664. The son of a wealthy Qurayshite, Amr embraced Islam in c. 629 and was assigned important roles in the nascent Muslim community by the Islamic prophet Muhammad. The first caliph Abu Bakr (r. 632-634) appointed Amr as a commander of the conquest of Syria. He conquered most of Palestine, to which he was appointed governor, and led the Arabs to decisive victories over the Byzantines at the battles of Ajnadayn and Yarmouk in 634 and 636",
    "year": "2013"
  },
  {
    "number": "981",
    "text": "The outcome of the Prophet's visit to Cave Hira was",
    "options": {
      "A": "compilation of the Glorious Qur'an",
      "B": "revelation of the Glorious Quran",
      "C": "award of chieftaincy title by the Makkan aristocrats",
      "D": "his resolve to migrate to Madinah."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65667?exam_type=jamb&type=obj&page=197",
    "correct_answer": "B",
    "explanation": "Muhammad's first revelation was an event described in Islamic tradition as taking place in 610 AC, during which the Islamic prophet, Muhammad was visited by the angel Jibrīl, known as Gabriel in English, who revealed to him the beginnings of what would later become the Qur'an.\nThe event took place in a cave called Hira, located on the mountain Jabal an-Nour, near Mecca. As for the exact date of this event, it has been calculated to be on Friday, the 17th of Ramadan at night, i.e. August 6, 610 C.E. - when Muhammad was 40 lunar years, 6 months and 12 days of age, i.e. 39 Gregorian calendar years, 3 months and 22 days.[1] [2] 6 August 610 (Julian) was actually a Thursday. The proleptic Gregorian calendar is two days ahead in the sixth century and three days ahead in the seventh.",
    "year": "2013"
  },
  {
    "number": "983",
    "text": "One of the importance of the first revelation was the",
    "options": {
      "A": "description of the Arabian peninsula to the Prophet (SAW)",
      "B": "dissemination of knowledge",
      "C": "explanation of knowledge",
      "D": "description of the steps of acquiring knowledge."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65669?exam_type=jamb&type=obj&page=197",
    "correct_answer": "B",
    "explanation": "Ref: (Q 96: 1-5)(96:1) Recite in the name of your Lord Who created.(96:2) created man from a clot of congealed blood.(96:3) Recite: and your Lord is Most Generous.(96:4) Who taught by the pen.(96:5) taught man what he did not know.",
    "year": "2013"
  },
  {
    "number": "984",
    "text": "Zakat is an economic system that de-emphasize",
    "options": {
      "A": "accumulation of wealth",
      "B": "poverty",
      "C": "helping others",
      "D": "employment"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65670?exam_type=jamb&type=obj&page=197",
    "correct_answer": "B",
    "explanation": "Zakat on wealth is based on the value of all of one's possessions.It is customarily 2.5% (or 1/40) of a Muslim's total savings and wealth above a minimum amount known as nisab, but Islamic scholars differ on how much nisab is and other aspects of zakat.According to Islamic doctrine, the collected amount should be paid to the poor and the needy, Zakat collectors, recent converts to Islam, those to be freed from slavery, those in debt, in the cause of Allah and to benefit the stranded traveller.",
    "year": "2013"
  },
  {
    "number": "985",
    "text": "'O Allah! Lord of power (and rule), Thou giveth power to whom thou pleaseth, and thou strippest off power from whom thou pleaseth ...' Q.3:26 The verse above describes Allah's political power as most",
    "options": {
      "A": "Complex",
      "B": "Liberal",
      "C": "Severe",
      "D": "Sovereign"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65671?exam_type=jamb&type=obj&page=197",
    "correct_answer": "D",
    "explanation": "Qur'an 3;26Say, \"O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.",
    "year": "2013"
  },
  {
    "number": "987",
    "text": "The core of Muhammad's (SAW) da'awah in Makkah was on",
    "options": {
      "A": "the unity of Allah",
      "B": "business transaction",
      "C": "divine punishment of wrongdoers",
      "D": "Sincere brotherhood"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65673?exam_type=jamb&type=obj&page=198",
    "correct_answer": "A",
    "explanation": "Muhammad's mission involves preaching monotheism. The Qur'an demands Muhammad to proclaim and praise the name of his Lord and instructs him not to worship idols or associate other deities with God but to only worship the one God.According to the Qur'an, one of the main roles of Muhammad is to warn the unbelievers of their eschatological punishment (Qur'an 38:70, Qur'an 6:19). Sometimes the Qur'an does not explicitly refer to the Judgement Day but also provides examples from the history of some extinct communities and warns Muhammad's contemporaries of similar calamities (Qur'an 41:13)",
    "year": "2013"
  },
  {
    "number": "988",
    "text": "The battle of Badr was fought in the 2nd year after Hijrah in",
    "options": {
      "A": "622 H",
      "B": "624 A.H",
      "C": "625 A.H",
      "D": "632 A.H"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65674?exam_type=jamb&type=obj&page=198",
    "correct_answer": "B",
    "explanation": "The Battle of Badr (Arabic: غزوة بدر‎), also referred to as The Day of the Criterion (Arabic: يوم الفرقان) in the Qur'an and by Muslims, was fought on Tuesday, 13 March 624 CE (17 Ramadan, 2 AH), near the present-day city of Badr, Al Madinah Province in Saudi Arabia. Muhammad, commanding an army of his Sahaba, defeated an army of the Quraysh led by Amr ibn Hishām, who was later given the kunyah \"Abu Jahl\" by Muhammad. The battle marked the beginning of the six-year war between Muhammad and his tribe in what is now known as the Muslim-Quraish War. Prior to the battle, the Muslims and the Meccans had fought several smaller skirmishes in late 623 and early 624.",
    "year": "2013"
  },
  {
    "number": "990",
    "text": "The Arabs worshiped idols during the Jahiliyya period because",
    "options": {
      "A": "They were ignorant of God's existence",
      "B": "there were Prophets among them",
      "C": "they believed that the idols will intercede",
      "D": "they believed that the idols will not intercede"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65676?exam_type=jamb&type=obj&page=198",
    "correct_answer": "C",
    "explanation": "Arabian polytheism, the dominant form of religion in pre-Islamic Arabia, was based on veneration of deities and spirits. Worship was directed to various gods and goddesses, including Hubal and the goddesses al-Lāt, al-'Uzzā, and Manāt, at local shrines and temples such as the Kaaba in Mecca. Deities were venerated and invoked through a variety of rituals, including pilgrimages and divination, as well as ritual sacrifice. Different theories have been proposed regarding the role of Allah in Meccan religion. Many of the physical descriptions of the pre-Islamic gods are traced to idols, especially near the Kaaba, which is said to have contained up to 360 of them.",
    "year": "2013"
  },
  {
    "number": "991",
    "text": "One of the peculiarities of Sahih Bukhari is that a hadith are sorted according to",
    "options": {
      "A": "Topic",
      "B": "Chapters",
      "C": "Records",
      "D": "Biographies"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65677?exam_type=jamb&type=obj&page=199",
    "correct_answer": "B",
    "explanation": "Ṣaḥīḥ al-Bukhārī (Arabic: صحيح البخاري‎) is one of the Kutub al-Sittah (six major hadith collections) of Sunni Islam, compiled by scholar Muhammad al-Bukhari. It was completed around 846 CE / 232 AH. Sunni Muslims view this as one of the two most trusted collections of hadith along with Sahih Muslim.The Arabic word sahih translates as authentic or correct. Sahih al-Bukhari, together with Sahih Muslim is known as Sahihayn.",
    "year": "2013"
  },
  {
    "number": "992",
    "text": "One of the two compilers of Hadith that deals with legal traditions of permissions and prohibitions is",
    "options": {
      "A": "Abu Daud",
      "B": "Bukhari",
      "C": "Ibn Maja",
      "D": "Muslim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65678?exam_type=jamb&type=obj&page=199",
    "correct_answer": "C",
    "explanation": "Ibn Majah wrote numerous books topped by his well-known book of Hadith 'As-Sunan'. This book received high praise from the scholars of Hadith for his special approach and the fact that it included authentic Hadiths not found in the other books of Sunan or the Sahihs of Al-Bukhari and Muslim. He also compiled a great book in Tafsir, as mentioned, in Al-Bidayah wa An-Nihayah, but unfortunately it was lost. He also wrote a book of history that covered the era of the Prophet (S.A.W.) to his time. This book remained long after his demise, as stated by At-Tahir Al-Maqdisi and Ibn Khallikan but it was also lost.",
    "year": "2013"
  },
  {
    "number": "994",
    "text": "One of the moral lessons in Q.17:23 apart from obedience to parents is",
    "options": {
      "A": "Resilience",
      "B": "Repentance",
      "C": "Perseverance",
      "D": "Honesty"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65681?exam_type=jamb&type=obj&page=199",
    "correct_answer": "C",
    "explanation": "(17:23) Your Lord has decreed:(i) Do not worship any but Him;(ii) Be good to your parents; and should both or any one of them attain old age with you, do not say to them even \"fie\" neither chide them, but speak to them with respect.This commandment is very comprehensive. It prohibits not only the worship of anyone except Allah but also implies that one should obey and serve and submit to Allah alone without question. One should accept His commandments and law alone to be worthy of obedience and His authority to be supreme above all.",
    "year": "2013"
  },
  {
    "number": "995",
    "text": "The Jews were admonished to avoid mixing truth with falsehood in",
    "options": {
      "A": "Q.2:285",
      "B": "Q.2:177",
      "C": "Q.2:45",
      "D": "Q.2:42"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65682?exam_type=jamb&type=obj&page=199",
    "correct_answer": "D",
    "explanation": "Qur'an 2:42 SaysAnd do not mix the truth with falsehood or conceal the truth while you know [it].For the proper understanding of this verse we need to recall that in the time of the Prophet the Jews of Arabia were more learned than the Arabs. In fact, there were some Jewish scholars of Arabia whose fame had spread even beyond the confines of that land. It was natural in such circumstances that, when the Prophet began to preach his message, the ignorant Arabs should approach the Jews and ask their opinion of the Prophet and his teachings, particularly as the Jews also believed in Prophets and Scriptures. We find that this inquiry was often made by the Makkans, and continued to he addressed to the Jews after the Prophet arrived in Madina.In reply to this query, however, the Jewish religious scholars never told the candid truth. It was impossible for them to say that the doctrine of monotheism preached by Muhammad was incorrect, that there was any error in his teachings regarding the Prophets, the Divine Scriptures, the angels and the Next Life and that there was any error in the principles of moral conduct which the Prophet propounded. At the same time, however, they were not prepared to make a straightforward affirmation of the truth of his teachings. In short, they neither categorically denied the Truth nor were prepared to accept it with open hearts.Instead, they tried to plant insidious doubts in the minds of everybody who enquired about the Prophet and his mission.\nIt is this attitude of the Jews to which the Qur'an alludes when it asks them not to overlay the truth with falsehood.",
    "year": "2013"
  },
  {
    "number": "996",
    "text": "The minimum number of witnesses in an Islamic marriage is",
    "options": {
      "A": "four males",
      "B": "three males",
      "C": "two males",
      "D": "one male"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65683?exam_type=jamb&type=obj&page=200",
    "correct_answer": null,
    "explanation": "For marriage a minimum of two witnesses is required. These witnesses are not for the bride or for the groom, but they are the witnesses for the marriage of the couple for whom they accept to be the witnesses.Nikah(marriage ceremony) is both a legal ceremony and a public ceremony. According to the Shari`ah, there should be two witnesses for all important legal contracts.Nikahas a public ceremony should also be done in the presence of many people (or at least two as the minimum), so that more people know that this man and this woman have come together as a legally married couple.",
    "year": "2013"
  },
  {
    "number": "998",
    "text": "The term, Shari'ah refers to",
    "options": {
      "A": "A path",
      "B": "Wisdom",
      "C": "Passion",
      "D": "An idea"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65685?exam_type=jamb&type=obj&page=200",
    "correct_answer": "A",
    "explanation": "Sharia (also known as \"Shariah\" or \"Shari'a\") is an Islamic religious law that governs not only religious rituals but also aspects of day-to-day life in Islam. Sharia, literally translated, means \"the way.\"In the Quran, šarīʿah and its cognate širʿah occur once each, with the meaning \"way\" or \"path\".[25] The word šarīʿah was widely used by Arabic-speaking Jews during the Middle Ages, being the most common translation for the word torah in the 10th-century Arabic translation of the Torah by Saʿadya Gaon.",
    "year": "2013"
  },
  {
    "number": "999",
    "text": "One of the scholars reported to have been imprisoned by his non compromising stance was",
    "options": {
      "A": "Shafi'i",
      "B": "Abu-Hanifah",
      "C": "Hambali",
      "D": "Māliki b. Anas"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65686?exam_type=jamb&type=obj&page=200",
    "correct_answer": "B",
    "explanation": "In 763, al-Mansur, the Abbasid monarch offered Abu Hanifa the post of Chief Judge of the State, but he declined the offer, choosing to remain independent. His student Abu Yusuf was later appointed Qadi Al-Qudat (Chief Judge of the State) by the Caliph Harun al-Rashid.In his reply to al-Mansur, Abū Ḥanīfah said that he was not fit for the post. Al-Mansur, who had his own ideas and reasons for offering the post, lost his temper and accused Abū Ḥanīfah of lying.\"If I am lying,\" Abū Ḥanīfah said, \"then my statement is doubly correct. How can you appoint a liar to the exalted post of a Chief Qadi (Judge)?\" Incensed by this reply, the ruler had Abū Ḥanīfah arrested, locked in prison and tortured. He was never fed nor cared for. Even there, the jurist continued to teach those who were permitted to come to him.\nOn the 15 Rajab 150(August 15, 767), Abū Ḥanīfah died in prison",
    "year": "2013"
  },
  {
    "number": "1000",
    "text": "The entrenchment of an Islamic economic system is aimed at",
    "options": {
      "A": "controlling the world funds",
      "B": "restricting the unlawful acquisition of wealth",
      "C": "restricting men to particular occupations",
      "D": "promoting equitable distribution of wealth."
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65687?exam_type=jamb&type=obj&page=200",
    "correct_answer": "D",
    "explanation": "Because al-adl (justice and fairness) is a basic value of the Islamic economic order, distributive justice is a major concern of the system. Equitable distribution of income and wealth is therefore an objective by itself. Operationally, this is accomplished through certain institutions which form the backbone of the social security in Islam. Examples are a bound.",
    "year": "2013"
  },
  {
    "number": "1001",
    "text": "One of the major consequences of ribā is that, it makes people",
    "options": {
      "A": "wealth",
      "B": "lazy",
      "C": "smart",
      "D": "parasitic"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65688?exam_type=jamb&type=obj&page=201",
    "correct_answer": "B",
    "explanation": "Riba is forbidden because of the harmful effects that result from it, such as: Economic effects, e.g., keeping money idle and unproductive, and swelling the ranks of the poor; Social effects, e.g., cutting ties, creating enmity and hatred between the poor and the rich, and spreading corruption and promiscuity caused by need; Psychological and spiritual effects, e.g., arrogance, looking down on others, hard-heartedness and exploiting the needs of the poor.The above describes the effects of Riba on the individual level. On the state level, countries are weakened, their resources fall under the control of others, they end up following their enemies' desires, they are robbed of their natural wealth and their problems get even worse. This is what we see happening in reality. We ask Allaah to keep us safe and sound..",
    "year": "2013"
  },
  {
    "number": "1002",
    "text": "What differentiates Hadith Qudsi from Hadith Nabawi is the",
    "options": {
      "A": "place and manner of application",
      "B": "condition under which the two are narrated",
      "C": "wording and teaching intended",
      "D": "chain and reliability of the narrator"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65689?exam_type=jamb&type=obj&page=201",
    "correct_answer": "C",
    "explanation": "Hadith qudsi: those words of God which are not in quran or in which Gibrael did not bring revelation and was directly revealed on the Prophet (peace be upon him)Hadith nabawi: those words in which the saying or action of Prophet (peace be upon him) is mentioned",
    "year": "2013"
  },
  {
    "number": "1004",
    "text": "One of the peculiarities of Sahih Bukhari is that hadiths are sorted according to",
    "options": {
      "A": "Topic",
      "B": "Chapters",
      "C": "Records",
      "D": "Biographies"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65691?exam_type=jamb&type=obj&page=201",
    "correct_answer": "B",
    "explanation": "Ṣaḥīḥ al-Bukhārī (Arabic: صحيح البخاري‎) is one of the Kutub al-Sittah (six major hadith collections) of Sunni Islam, compiled by scholar Muhammad al-Bukhari. It was completed around 846 CE / 232 AH. Sunni Muslims view this as one of the two most trusted collections of hadith along with Sahih Muslim.The Arabic word sahih translates as authentic or correct. Sahih al-Bukhari, together with Sahih Muslim is known as Sahihayn.",
    "year": "2013"
  },
  {
    "number": "1005",
    "text": "One of the two compilers of Hadith that deals with legal traditions of permissions and prohibitions is",
    "options": {
      "A": "Abu Daud",
      "B": "Bukhari",
      "C": "Ibn Maja",
      "D": "Muslim"
    },
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/65692?exam_type=jamb&type=obj&page=201",
    "correct_answer": "C",
    "explanation": "Ibn Majah wrote numerous books topped by his well-known book of Hadith 'As-Sunan'. This book received high praise from the scholars of Hadith for his special approach and the fact that it included authentic Hadiths not found in the other books of Sunan or the Sahihs of Al-Bukhari and Muslim. He also compiled a great book in Tafsir, as mentioned, in Al-Bidayah wa An-Nihayah, but unfortunately it was lost. He also wrote a book of history that covered the era of the Prophet (S.A.W.) to his time. This book remained long after his demise, as stated by At-Tahir Al-Maqdisi and Ibn Khallikan but it was also lost.",
    "year": "2013"
  }
]