[
  {
    "number": "1",
    "text": "Power differs from influence in that it is",
    "options": {
      "A": "persuasive while influence is directive",
      "B": "coercive while influence is harmful",
      "C": "coercive while influence is persuasive",
      "D": "arrogant while influence is corruptive"
    },
    "answer_url": "https://myschool.ng/classroom/government/42?exam_type=jamb&type=obj",
    "correct_answer": "C",
    "explanation": "Power differs from influence in that it is coercive while influence is persuasive.\nInfluence can be defined as the ability to create an impact on the beliefs and actions of an individual. Influence evokes respect. Those under the influence keep working in the desired manner even in the absence of the influential person.\npower is the ability of a person or a group of persons to enforce his or their decisions on other people by use of sanctions, punishment, or penalties against disobedience. On the other hand, through persuasion and conviction, an individual could be made to accept and obey the views of other persons.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "2",
    "text": "The standing committee of a legislature is one",
    "options": {
      "A": "whose member stand while delibrating",
      "B": "that has statutory responsibities",
      "C": "that perform adhoc functions",
      "D": "that has legislators as members."
    },
    "answer_url": "https://myschool.ng/classroom/government/44?exam_type=jamb&type=obj",
    "correct_answer": "B",
    "explanation": "A standing committee is a permanent committee within a legislature that is tasked with specific responsibilities defined by law, referred to as statutory responsibilities. These committees handle ongoing matters like reviewing bills, conducting hearings and making recommendations to the full legislature.\nAd hoc committees are temporary and created for specific tasks, while standing committees are permanent and handle ongoing duties.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "3",
    "text": "Where the constitution is supreme, unconstitutional acts of the executive and the legislature can be checked by the courts through",
    "options": {
      "A": "recall",
      "B": "judicial review",
      "C": "vote of no confidence",
      "D": "impeachment."
    },
    "answer_url": "https://myschool.ng/classroom/government/48?exam_type=jamb&type=obj",
    "correct_answer": "B",
    "explanation": "Where the constitution is supreme, unconstitutional acts of the executive and the legislature can be checked by the courts through judicial review.Judicial Review is the judicial power to declare any actions of the executive and the legislature unconstitutional, null and void.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "4",
    "text": "The central decision-making organ of a confederation is made up of",
    "options": {
      "A": "technocrats appointed by the units",
      "B": "politicians elected from the confederal constituencies",
      "C": "politicians nominated by the government of member states",
      "D": "representatives of pressure groups."
    },
    "answer_url": "https://myschool.ng/classroom/government/52?exam_type=jamb&type=obj",
    "correct_answer": "C",
    "explanation": "The central decision-making organ of a confederation is made up of politicians nominated by governments of member states.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "5",
    "text": "Which of the following is true of a parliamentary system of government?",
    "options": {
      "A": "clear seperation of government organs.",
      "B": "strict operation of bicameral legislature.",
      "C": "removal of government by impeachment.",
      "D": "adherence to majority rule."
    },
    "answer_url": "https://myschool.ng/classroom/government/55?exam_type=jamb&type=obj",
    "correct_answer": "D",
    "explanation": "Adherence to majority rule is true of a parliamentary system of government.This is so due to the fact that the party having a majority in the legislature controls both the executive and the legislature from where the Prime Minister and ministers of his cabinet are chosen. The stability of this system also depends upon the ruling party controlling a reasonable majority in the parliament.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "6",
    "text": "A major feature of authoritarianism is that government is",
    "options": {
      "A": "consensual",
      "B": "personalized",
      "C": "centralized",
      "D": "decentralized."
    },
    "answer_url": "https://myschool.ng/classroom/government/57?exam_type=jamb&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "A major feature of authoritarianism is that government is centralized. It should be remembered that authoritarianism is a form of government in which the state controls or directs everything.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "7",
    "text": "The central point of capitalism, as expounded by Karl Marx, is that",
    "options": {
      "A": "capitalist profit is the surplus value obtained from workers labour",
      "B": "workers are inherently incapable of being owners of their labour",
      "C": "capitalists shall always increase worker earning capacity through wages",
      "D": "capitslists shall always readily consent to workers welfare demands."
    },
    "answer_url": "https://myschool.ng/classroom/government/62?exam_type=jamb&type=obj&page=2",
    "correct_answer": "A",
    "explanation": "The central point of capitalism as expounded by Kari Marx is that capitalists' profit is the surplus value obtained from workers' labour.According to Marx, workers produce more than what they get from employers. The capitalist employers buy the services of labour cheaply, but they sell the goods produced by labour at a rate higher than the amount spent for the payment of wages and the maintenance of the factory. They appropriate this excess as profit.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "8",
    "text": "A constitution that requires a plebiscite or a referendum to be amended is",
    "options": {
      "A": "rigid",
      "B": "unwritten",
      "C": "flexible",
      "D": "written"
    },
    "answer_url": "https://myschool.ng/classroom/government/63?exam_type=jamb&type=obj&page=2",
    "correct_answer": "A",
    "explanation": "Plebiscite; the direct vote of all the members of an electorate on an important public question such as a change in the constitution.\nA referendum;is a direct and universal vote in which an entire electorate is invited to vote on a particular proposal and can have nationwide or local forms.\nA rigid Constitution;is a constitution that is difficult or slow to change usually because of a prescribed process of amendment that is detailed and lengthy in execution.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "9",
    "text": "An important function of a constitution is that it",
    "options": {
      "A": "provide a framework  for the study of government",
      "B": "facilities cross-fertilization of ideas of governance",
      "C": "serves as the fountain head of authority for the exercise of power",
      "D": "promotes citizen participation in government and administration."
    },
    "answer_url": "https://myschool.ng/classroom/government/76?exam_type=jamb&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "An important function of a constitution is that it serves as the fountain head of authority for the exercise of power, Constitutions prescribe how the power of the sate is to be allocated between the various organs of government. Most constitutions define the limits of a government's authority thereby establishing the various rights of a state's citizens.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "10",
    "text": "when a bill passed by the legislature is vetoed by the executive, the action underscores the principle",
    "options": {
      "A": "probity and accountability",
      "B": "separation of powers",
      "C": "collective responsibility",
      "D": "checks and balances."
    },
    "answer_url": "https://myschool.ng/classroom/government/78?exam_type=jamb&type=obj&page=2",
    "correct_answer": "D",
    "explanation": "When a bill passed by the legislature is vetoed by the executive the action underscores the principle of checks and balances.The doctrine or principle of checks and balances advocates the use of one organ of government to check the activities of the other organs. When the executive vetoes the bill passed by the legislature, and the executive has checked the activities of the legislature, thereby putting the principles of the checks and balances into practice.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "11",
    "text": "In the legislative process, a bill is a",
    "options": {
      "A": "motion accepted for debate",
      "B": "motion rejected after debate",
      "C": "proposal before the legislature",
      "D": "law pass by the legislature."
    },
    "answer_url": "https://myschool.ng/classroom/government/80?exam_type=jamb&type=obj&page=3",
    "correct_answer": "C",
    "explanation": "A bill is a formal proposal for new legislation or an amendment to existing legislation. It is introduced and presented for consideration by a legislative body, such as a parliament or congress, with the goal of becoming law if approved through the legislative process.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "12",
    "text": "One of the advantages of a bicameral over a unicameral legislature is that it",
    "options": {
      "A": "is cheap to maintain",
      "B": "promotes social equality",
      "C": "takes less time for the bills to be passed",
      "D": "prevents the passage of ill-considered bills."
    },
    "answer_url": "https://myschool.ng/classroom/government/81?exam_type=jamb&type=obj&page=3",
    "correct_answer": "D",
    "explanation": "One of the advantages of a bicameral over a unicameral legislature is that it prevents the passage of ill-considered bills.According to J.C. Anyaele (1991) the second Chamber checks and prevents hasty and ill-considered passage of bills as done in a unicameral legislature.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "13",
    "text": "The fundamental rights of citizens include rights to",
    "options": {
      "A": "free education, employment and freedom of thought",
      "B": "life, speech and association",
      "C": "life, liberty and property",
      "D": "association,property and social security."
    },
    "answer_url": "https://myschool.ng/classroom/government/82?exam_type=jamb&type=obj&page=3",
    "correct_answer": "B",
    "explanation": "The fundamental rights of citizens include rights to life,speech and association.J. U. Anyaele (1991) enumerated some rights such as:1. Right to life which no body shall intentionally deprive a citizen.2. Right to peaceful assembly and association.3. Right to freedom of expression and press.\nother rights include;\nThe right to dignity of personThe right to fair hearingThe right to freedom of movementThe right from freedom of discriminationThe right to personal libertyThe right to vote and be voted for during an electionThe right to private family lifeRight to ownership of properties\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "14",
    "text": "The manipulation of boundaries of constituencies in order to win more seats is called",
    "options": {
      "A": "devolution",
      "B": "rigging",
      "C": "gerrymandering",
      "D": "delimitation"
    },
    "answer_url": "https://myschool.ng/classroom/government/83?exam_type=jamb&type=obj&page=3",
    "correct_answer": "C",
    "explanation": "The manipulation of boundaries of constituencies in order to win more seats is called gerrymandering.According to Ofoegbu (1999) Gerry-mandering constituencies is the process of deliminating constituencies to favour a particular political party or candidate in the election.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "15",
    "text": "One argument against a multi-party system is the",
    "options": {
      "A": "encouragement of opposition and instability",
      "B": "banning of interest groups",
      "C": "inability to attract foreign assistance",
      "D": "high cost of conducting elections."
    },
    "answer_url": "https://myschool.ng/classroom/government/87?exam_type=jamb&type=obj&page=3",
    "correct_answer": "A",
    "explanation": "In amulti-party system, the presence of many political parties can lead toincreased oppositionandpolitical instability, as parties may constantly oppose one another and create fragmentation within the political landscape. This can make it difficult to form strong, stable governments and may lead to frequent changes in leadership, which could hinder effective governance.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "16",
    "text": "Associational interest groups are organized to",
    "options": {
      "A": "further the interest of members",
      "B": "specifically lobby the government",
      "C": "support the government",
      "D": "achieve goals affecting other associations."
    },
    "answer_url": "https://myschool.ng/classroom/government/91?exam_type=jamb&type=obj&page=4",
    "correct_answer": "A",
    "explanation": "Associational interest groups are organized to further the interests of members.Pressure Groups, or interest groups, are defined as organizations or associations of people who seek to influence government policies and actions and people in authority positions to the benefit of their members. It could also be defined as an organized social interest group formed with the main aim of pursuing its interest and influencing government policies to the benefit of its members.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "17",
    "text": "Public opinion is a view that is",
    "options": {
      "A": "held by the majority",
      "B": "active in the public realm",
      "C": "widely publicized",
      "D": "no longer a secret."
    },
    "answer_url": "https://myschool.ng/classroom/government/94?exam_type=jamb&type=obj&page=4",
    "correct_answer": "A",
    "explanation": "Public opinion is a view that is held by the majority. As far as public opinion is concerned, the view must be held and expressed by the majority of the society.According to G. A. I. Ofoegbu (1999), public opinion is the believes, values and attitudes which are commonly held and expressed by majority of the people on a given issue.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "18",
    "text": "The political neutrality of civil servants implies that they",
    "options": {
      "A": "are not allowed to join any organisation or group",
      "B": "have no dealings with politicians",
      "C": "are not allowed to be involved in partisan politics",
      "D": "are not allowed to vote."
    },
    "answer_url": "https://myschool.ng/classroom/government/97?exam_type=jamb&type=obj&page=4",
    "correct_answer": "C",
    "explanation": "The political neutrality of civil servants implies that they are not allowed to be involved in partisan politics.Political Neutrality is one of the main characteristics of Civil Service. This means that civil servants are not involved in partisan politics. They are there to serve any government that comes into power .\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "19",
    "text": "The idea of making the civil service permanent, neutral and anonymous is to",
    "options": {
      "A": "enhance efficiency in administration",
      "B": "ensure loyalty and support",
      "C": "prevent opposition to government",
      "D": "make civil servants a functional elite."
    },
    "answer_url": "https://myschool.ng/classroom/government/101?exam_type=jamb&type=obj&page=4",
    "correct_answer": "A",
    "explanation": "The idea of making the civil service permanent, neutral and anonymous is to enhance efficiency in administration.When a civil servant is made to enjoy secured appointment, he must definitely stand good chance to have good measure of expert knowledge and intelligence. When he is not neutral, his political views will definitely interfere with his official work. This will eventually create no conducive atmosphere for efficiency.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "20",
    "text": "The western zone of the Sokoto caliphate was administered from",
    "options": {
      "A": "kebbi",
      "B": "Ilorin",
      "C": "Bida",
      "D": "Gwandu"
    },
    "answer_url": "https://myschool.ng/classroom/government/104?exam_type=jamb&type=obj&page=4",
    "correct_answer": "D",
    "explanation": "The Western zone of the Sokoto caliphate was administered from Gwandu - Othman Dan Fodio divided the Fulani empire into two- the Eastern and Western sections. The Eastern section included Kano, Katsina, Zaria, Bauchi, Gombe and Yola with Sokoto as its capital while Ilorin, Kontagoro and Argungu with Gwandu as its capital were included in the Western section.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "21",
    "text": "Some pre-colonial Nigerian societies are described as stateless because",
    "options": {
      "A": "they had no formal governmental institutions",
      "B": "they had no definite political boundaries",
      "C": "their population was too small",
      "D": "they were not independent."
    },
    "answer_url": "https://myschool.ng/classroom/government/109?exam_type=jamb&type=obj&page=5",
    "correct_answer": "A",
    "explanation": "Some pre-colonial Nigerian societies are described as stateless because they had no formal governmental institutions.For instance, the Igbos unlike Yorubas and the Fulanis have a complex and complicated system of administration in pre-colonial era. There was no sort of central authority, what they had was a diffusion of political authority into different groups.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "22",
    "text": "The method used by the British to facilitate the administration of Southern Nigeria was",
    "options": {
      "A": "persuation",
      "B": "dialogue",
      "C": "divide and rule",
      "D": "trade association."
    },
    "answer_url": "https://myschool.ng/classroom/government/112?exam_type=jamb&type=obj&page=5",
    "correct_answer": "C",
    "explanation": "There is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "23",
    "text": "A major function of the warrant chiefs was to",
    "options": {
      "A": "prevent tribal wars",
      "B": "supervise native courts and markets",
      "C": "stop ritual killings",
      "D": "take charge of local administration."
    },
    "answer_url": "https://myschool.ng/classroom/government/115?exam_type=jamb&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "A major function of the warrant Chiefs was to take charge of local administration.The chiefs were the heads of the administration of their various communities.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "24",
    "text": "After 1945, the demand of African nationalists changed from reform to independence because",
    "options": {
      "A": "colonial rule became less oppressive",
      "B": "colonial rule was in disarray",
      "C": "the second world war boosted their morale",
      "D": "the second world war enhanced colonial rule."
    },
    "answer_url": "https://myschool.ng/classroom/government/119?exam_type=jamb&type=obj&page=5",
    "correct_answer": "C",
    "explanation": "After 1945, the demand of African nationalists changed from reform to independence because the second World War boosted their morale.The war exposed the myth surrounding white supremacy. The ex-soldiers from West African saw that the whites were not as strong as they portrayed themselves to Nigerians and in fact that coming back from the war they assorted their rights and joined the nationalists in the struggle for independence.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "25",
    "text": "When Nigeria achieved independence in 1960, the head of state was the",
    "options": {
      "A": "president",
      "B": "prime minister",
      "C": "Governor-General",
      "D": "Queen of England."
    },
    "answer_url": "https://myschool.ng/classroom/government/121?exam_type=jamb&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "When Nigeria achieved independence in 1960, the Head of state was the Governor-General, representing the queen of England.One of the main provisions of the constitution of 1960 was that the governor general was made the constitutional ceremonial Head of state and a representative of the Queen of England.\nThis means the queen was the head of state but appointed a representative in the person of the governor-general to stand in for her, in her absence.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "39",
    "text": "The central legislature of Nigeria became bicameral in",
    "options": {
      "A": "1960",
      "B": "1951",
      "C": "1959",
      "D": "1963"
    },
    "answer_url": "https://myschool.ng/classroom/government/146?exam_type=jamb&type=obj&page=8",
    "correct_answer": "A",
    "explanation": "The central legislature of Nigeria became bicameral in 1960.  Macpherson Constitution of 1951 created two chambers of regional legislatures known as the House of Chiefs and the House of Assembly in the Northern and Western regions. Coming then to the independence constitution of 1960, bicameral legislatures were adopted in both the federal and regional government including the Eastern region.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "40",
    "text": "Which of these constitutions recognized local government as a third tier of government in Nigeria?",
    "options": {
      "A": "1946 Constitution.",
      "B": "1960 Constitution.",
      "C": "1963 Constitution.",
      "D": "1979 Constitution."
    },
    "answer_url": "https://myschool.ng/classroom/government/151?exam_type=jamb&type=obj&page=8",
    "correct_answer": "D",
    "explanation": "There is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "41",
    "text": "Under the 1963 constitution, items not listed in the exclusive and concurrent list were within the exclusive competence of the",
    "options": {
      "A": "Executive",
      "B": "federal parliament",
      "C": "regional legislatures",
      "D": "judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/154?exam_type=jamb&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "Under the 1963 constitution, items not listed in the exclusive and concurrent list were within the exclusive competence of the regional legislatures.Sir Oliver Lyttleton constitution of 1954 classified government powers into three:1. Exclusive powers - matters where only the federal or central government can legislate only.2. Concurrent powers - matters where both the federal government and regional (state) can legislate andResidual 0powers reserved for the regional legislature only.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "42",
    "text": "Before Nigeria became a republic, the highest body charged with the administrator of justice was the",
    "options": {
      "A": "Privy council",
      "B": "High court",
      "C": "Supreme  court",
      "D": "Court of appeal"
    },
    "answer_url": "https://myschool.ng/classroom/government/157?exam_type=jamb&type=obj&page=9",
    "correct_answer": "A",
    "explanation": "Before Nigeria became a republic, the highest body charged with the administration of justice was the Privy council. one of the features of the Republican Constitution of 1963 is that the supreme court of Nigeria became the highest court in Nigeria. Appeal cases stopped going to the privy council in London\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "43",
    "text": "The equivalent of the commissioner at the local government level is the",
    "options": {
      "A": "Executive chairman",
      "B": "Secretary",
      "C": "Councilor",
      "D": "Supervisory councillor"
    },
    "answer_url": "https://myschool.ng/classroom/government/162?exam_type=jamb&type=obj&page=9",
    "correct_answer": "D",
    "explanation": "The equivalent of a commissioner at the local government level is the supervisory Councillor. At the state level, a commissioner is the highest or completely in-charge of a particular ministry. For instance, the commissioner for education. He does not come in through election but through the appointment by the government of the state. Coming to the local government level, the supervisory Councillor for education as well as any other supervisory Councillor is appointed to the Executive Chairman of the local government subject to the approved of the Councillors.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "44",
    "text": "The Independent National Electoral Commission has the power to prepare and maintain the register of",
    "options": {
      "A": "Political parties",
      "B": "Constituencies",
      "C": "Voters",
      "D": "Electoral candidates."
    },
    "answer_url": "https://myschool.ng/classroom/government/165?exam_type=jamb&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "The Independent National Electoral Commission has the power to prepare and maintain the register of voters. One of functions of the body is registration of voters, compilation of voters register and updating of same from time to time.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "45",
    "text": "The president of Nigeria is advised on the sovereignty and territorial integrity of the country by the",
    "options": {
      "A": "National Secrurity Council",
      "B": "National Defense Council",
      "C": "Council of state",
      "D": "Federal Executive Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/243?exam_type=jamb&type=obj&page=9",
    "correct_answer": "B",
    "explanation": "The powers of the President with respect to national security, both internal and external, are enormous as he is in complete control of the matter. He is the chairman of both the National Security Council and the National Defense Council and he appoints their members except the ex official members. The totality of the role of the National Defense Council is “to advise the President on matters relating to the defense of the sovereignty and territorial integrity of Nigeria”\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "46",
    "text": "The Nigerian Youth Movement collapsed as the result of",
    "options": {
      "A": "its failure to win election",
      "B": "shortage of funds to run its affairs",
      "C": "the harassment of its leadership by government.",
      "D": "the breakup of its leadership."
    },
    "answer_url": "https://myschool.ng/classroom/government/247?exam_type=jamb&type=obj&page=10",
    "correct_answer": "D",
    "explanation": "The Nigerian Youth Movement collapsed as the result of the breakup of its leadership. The movement was in no distant time torn apart by leadership crisis. The crisis split the movement into factions. the two principal contestant were Ernest Ikoli and S.A Akorisanya\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "47",
    "text": "The first restructure of the Nigerian Federation took place with the",
    "options": {
      "A": "creation of mid-west Region in 1963",
      "B": "abolition of federalism in 1966",
      "C": "military counter-coup in 1966",
      "D": "creation of states in 1967"
    },
    "answer_url": "https://myschool.ng/classroom/government/248?exam_type=jamb&type=obj&page=10",
    "correct_answer": "A",
    "explanation": "The first restructure of the Nigerian Federation took place with the creation of mid-west Region in 1963.The creation of mid-west Region which came into effect on October 1, 1963 was one of the provisions of 1963 constitution. With that the mid-western Region was carried out from the western Region. Nigeria then had four Regions and no more three.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "48",
    "text": "The land use decree of 1978 vested the ownership of land in Nigeria in the",
    "options": {
      "A": "local chiefs",
      "B": "local governments",
      "C": "state governments",
      "D": "federal governments"
    },
    "answer_url": "https://myschool.ng/classroom/government/251?exam_type=jamb&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "TheLand Use Decree of 1978(later revised as the Land Use Act) vested the ownership of land inNigeria's state governments. According to the decree, all land in urban and rural areas is held in trust by the state governors, who are responsible for managing it on behalf of the citizens. The goal was to ensure better land administration and allocation across the country.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "49",
    "text": "The main source of financing local government in Nigeria is",
    "options": {
      "A": "internal revenue generation",
      "B": "statutory revenue allocation",
      "C": "special state grants",
      "D": "grants-in-aid"
    },
    "answer_url": "https://myschool.ng/classroom/government/253?exam_type=jamb&type=obj&page=10",
    "correct_answer": "B",
    "explanation": "In Nigeria, the main source of financing for local governments isstatutory revenue allocation. This refers to the funds allocated to local governments by the federal government, which come from a share of the country's national revenue. These allocations are distributed based on the principles set out in the Nigerian Constitution and the revenue-sharing formula.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "50",
    "text": "The most remarkable legacy of the 1976 Local Government Reform in Nigeria was the introduction of",
    "options": {
      "A": "the office of sole administrators",
      "B": "caretaker management committees",
      "C": "uniformity in struture and functions",
      "D": "the third tier of government."
    },
    "answer_url": "https://myschool.ng/classroom/government/256?exam_type=jamb&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "The most remarkable legacy of the 1976 Local Government Reform in Nigeria was the introduction of uniformity in structure and functions.In February 1976 Federal Military Government issued a degree establishing a uniform Local Government Structure throughout the country. The measure is significant in a away in the sense that the first time in the history of Nigeria a national rather than Region/state approach was adopted toward Local Government.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "51",
    "text": "The Murtala/Obasanjo regime in Nigeria increased the number of states from",
    "options": {
      "A": "4 to 12",
      "B": "12 to 19",
      "C": "19 to 20",
      "D": "30 to 36"
    },
    "answer_url": "https://myschool.ng/classroom/government/258?exam_type=jamb&type=obj&page=11",
    "correct_answer": "B",
    "explanation": "The Murtala/Obasanjo regime in Nigeria increased the number of states from 12 to 19.Gowon created 12 states but the Murtala/Obasanjo regime created additional seven states bring the total number to 19\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "52",
    "text": "The major factor that influenced the formulation of Nigerian foreign policy in the First Republic was",
    "options": {
      "A": "geographical location",
      "B": "the colonial legacy",
      "C": "economic consideration",
      "D": "the parliamentary system"
    },
    "answer_url": "https://myschool.ng/classroom/government/261?exam_type=jamb&type=obj&page=11",
    "correct_answer": "B",
    "explanation": "The major factor that influenced the formulation of Nigerian foreign policy in the First Republic was the colonial legacy.According to J.U. Anyaele (1994), we can rightly agree that the colonial legacy fore-ordained our foreign policy initially. This is one of the major reasons why the Balewa Administration maintains close relations mainly with Britain and other commonwealth countries.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "53",
    "text": "The Barclay's Bank and the British Petroleum Company in Nigeria were nationalised in the late 1970's for transacting business with",
    "options": {
      "A": "France",
      "B": "South Africa",
      "C": "Portugal",
      "D": "Libya"
    },
    "answer_url": "https://myschool.ng/classroom/government/919?exam_type=jamb&type=obj&page=11",
    "correct_answer": "B",
    "explanation": "The Barclays Bank and the British Petroleum Company in Nigeria were nationalized in the late 1970s for transacting business with South Africa.It was Obasanjo's Administration that chased Britain's arrogance over Zimbabwe's Independence.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "54",
    "text": "South-South cooperation is a major policy plan on which Nigeria bases her relations with",
    "options": {
      "A": "developed countries",
      "B": "countries of the southern hemisphere",
      "C": "developing countries",
      "D": "member countries of OAU"
    },
    "answer_url": "https://myschool.ng/classroom/government/920?exam_type=jamb&type=obj&page=11",
    "correct_answer": "C",
    "explanation": "South-South cooperation refers to the collaboration between countries in the Global South, primarily focused on mutual development, technical exchange and sharing of resources and knowledge to address common challenges. Nigeria, as a developing country, engages in South-South cooperation with other developing nations, rather than with developed countries.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "55",
    "text": "Nigeria's recognition of the Popular Movement for the Liberation of Angola to lead that country was made under",
    "options": {
      "A": "General Yakubu Gowon",
      "B": "General Murtala Mohammed",
      "C": "General Muhammadu Buhari",
      "D": "General Ibrahim Babangida"
    },
    "answer_url": "https://myschool.ng/classroom/government/921?exam_type=jamb&type=obj&page=11",
    "correct_answer": "B",
    "explanation": "Nigeria's recognition of the popular movement for the liberation of Angola to lead that country was made under General Murtala Muhammed.According to J. U Anyaele (1994) Martala's administration's recognition of Agostintion Neto's popular movement for the liberation of Angola (MPLA) at the expenses of us and South Africa's support of UNITA and FNLA played a decisive role in Angolan independence\"\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "56",
    "text": "The first Nigerian Permanent Representative to the United Nations was",
    "options": {
      "A": "Alhaji Yusuf Maitama Sule",
      "B": "General Joseph Garba",
      "C": "Professor Ibrahim Gambari",
      "D": "Chief Samuel Adebo"
    },
    "answer_url": "https://myschool.ng/classroom/government/922?exam_type=jamb&type=obj&page=12",
    "correct_answer": "D",
    "explanation": "The first Nigerian Permanent Representative to the United Nations is Jaja Wachukwu but the first among the options provided is Samuel Adebo.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "57",
    "text": "In 1981, Nigeria participated in an Organization of African Unity peace-keeping force to replace Libyan forces in",
    "options": {
      "A": "Somalia",
      "B": "Chad",
      "C": "Ethiopia",
      "D": "Zaire"
    },
    "answer_url": "https://myschool.ng/classroom/government/923?exam_type=jamb&type=obj&page=12",
    "correct_answer": "B",
    "explanation": "In 1981, Nigeria participated in an Organization of African Unity peace-keeping force to replace Libyan forces in Chad.\nFive African nations formally agreed to the the deployment of peacekeeping troops in Chad. the first such force assembled by the Organization of African Unity.\nPresident Goukouni Oueddei of Chad met with Kenya's President, Daniel arap Moi, and officials from four of the six African nations that have pledged to contribute troops to the force. The O.A.U. soldiers willreplace Libyan troops that have withdrawn.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "58",
    "text": "During the Civil War, the major power that expressed moral support for Biafra's self-determination was",
    "options": {
      "A": "France",
      "B": "China",
      "C": "the United States",
      "D": "Great Britain"
    },
    "answer_url": "https://myschool.ng/classroom/government/924?exam_type=jamb&type=obj&page=12",
    "correct_answer": "A",
    "explanation": "During the Civil War, the major power that expressed moral support for Biafra's self determination was France.France gave both financial and material assistance to Biafra.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "59",
    "text": "Nigeria's withdrawal from the Edinburgh Commonwealth Games in July 1986 was in protest against British",
    "options": {
      "A": "support for UNITA rebels in Angola",
      "B": "supply of arms to Rhodesia",
      "C": "failure to impose sanctions on South Africa",
      "D": "negative utterances on Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/government/925?exam_type=jamb&type=obj&page=12",
    "correct_answer": "C",
    "explanation": "Nigeria's withdrawal from the Edinburgh Commonwealth Games in July 1986 was in protest against British failure to impose sanctions on South Africa.She, Britain did not support but in Apartheid regime in South Africa.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "60",
    "text": "The major demand of the Third World countries on the United Nations in recent times is the",
    "options": {
      "A": "expansion of the permanent membership of the security Council",
      "B": "post of the Secretary-General of the organization",
      "C": "withdrawal of the veto power from the security council",
      "D": "enforcement of resolutions on the super powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/927?exam_type=jamb&type=obj&page=12",
    "correct_answer": "A",
    "explanation": "The major demand of the Third World countries on the United Nations in recent times is the expansion of the permanent membership of the Security Council.One of the achievements of the O.A.U. is provision of one voice. As a result of now able to speak with one at the United Nations General Assembly as well as its other organs such as the Security\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "61",
    "text": "Which of the following is the function of the Council of the Ministers of the O.A.U",
    "options": {
      "A": "Cordinating of the general policy of the organization",
      "B": "Directing the finances of the organization",
      "C": "Preparing the agenda of the organization's meetings",
      "D": "Reviewing the functions and activities of other organs of the organizations"
    },
    "answer_url": "https://myschool.ng/classroom/government/928?exam_type=jamb&type=obj&page=13",
    "correct_answer": "C",
    "explanation": "Preparing the agenda of the organisation's meeting is the function of the council of Ministers of the O.A.U.The Council of Ministers is the body which is composed of the foreign ministers of member countries. it meets about twice a year but extra-ordinary meetings may be called if and such a request is approved by two-thirds of the members.One of the responsibilities is preparing the agenda for the summit i.e the Assembly of Heads of State and Government\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "62",
    "text": "The Economic Community of West African States has made progress in the area of",
    "options": {
      "A": "free movement of persons and right of residence",
      "B": "increased trade among members",
      "C": "political integretion of the region",
      "D": "providing financial aid to members"
    },
    "answer_url": "https://myschool.ng/classroom/government/960?exam_type=jamb&type=obj&page=13",
    "correct_answer": "B",
    "explanation": "The Economic Community of West African States has made impressive progress in the area of increased trade among members.One of the achievements of ECOWAS is Trade Liberalisation which has contributed immensely to the promotion of trade tariffs and customs duties for trading activities within the Community.\nThere is an explanation video availablebelow.",
    "year": "2001"
  },
  {
    "number": "1758",
    "text": "Nigeria's departure from pro-west policy during the Murtala Muhammed regime was as a result of",
    "options": {
      "A": "the economic interest of the West in Nigeria",
      "B": "Nigeria's increased international influence",
      "C": "the growing trade between Nigeria and the East",
      "D": "Nigeria's concern for decolonization in Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/40379?exam_type=jamb&type=obj&page=352",
    "correct_answer": "D",
    "explanation": "Nigeria departure from pro-west policy during the Murata Mohammed regime was a result of Nigeria's concern for decolonization in Africa.Among the regime's achievements was its spectacular support for decolonization and self-determination as epitomized by its recognition of Agostino Neto's Popular Movement for the Liberation of Angola (MPLA)\nThere is an explanation video availablebelow.",
    "year": "2001"
  }
]