[
  {
    "number": "1210",
    "text": "The organelle common to both plant and animal cells is the",
    "options": {
      "A": "centrioles",
      "B": "plasmalemma",
      "C": "cell wall",
      "D": "chloroplast"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14394?exam_type=jamb&type=obj&page=242",
    "correct_answer": "A",
    "explanation": "Centrioles are primarily found in animal cells, where they play a crucial role in cell division by organizing microtubules and forming the spindle fibers that separate chromosomes. While centrioles are generally absent in higher plants, they can be found in some lower plants and in the male gametes of certain plant species.\nThe plasmalemma, also known as the cell membrane or plasma membrane, is a biological membrane that separates the cell's interior from the external environment, regulating the movement of materials and facilitating communication.The plasmalemma (or cell membrane) is a common structure found in both plant and animal cells, but not regarded as an organelle, rather the outer boundary of the cell, separating the inside from the outside environment, and it's a membrane, not an organelle.\nCell walls are a defining feature of plant cells, but are absent in animal cells. Plant cells have a rigid cell wall surrounding the cell membrane, which provides structural support and protection. Also, a cell wall is not considered an organelle, but rather a non-membrane-bound, extracellular structure that provides support and protection to cells, particularly in plants, fungi, and bacteria.\nPlant cells have chloroplast and cell walls, whereas animal cells do not. Plant cells must be rigid to maintain their posture, and they require chlorophyll, which is found in the chloroplast, for food production.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1211",
    "text": "Which of the following is likely to have a higher concentration of the mitochondria?",
    "options": {
      "A": "Sperm cell",
      "B": "white blood cell",
      "C": "Egg cell",
      "D": "Red blood cell"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14395?exam_type=jamb&type=obj&page=243",
    "correct_answer": "A",
    "explanation": "Sperm cells are likely to have a higher concentration of mitochondria than white blood cells, red blood cells or even the egg cells because sperm require a significant amount of energy for motility, while white blood cells have a more diverse range of energy needs.\nSperm cells, specifically in their midpiece, contain a high concentration of mitochondria, which are the \"powerhouses\" of the cell, producing the energy (ATP) needed for the sperm to swim and travel towards the egg.\nMitochondria, often called the \"powerhouses of the cell,\" are organelles that generate energy in the form of ATP (adenosine triphosphate) through cellular respiration, a process that breaks down glucose and other molecules to produce energy.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1212",
    "text": "The hyphal wall of fungi is rigid owing to the",
    "options": {
      "A": "cell wall",
      "B": "lignin",
      "C": "cellulose",
      "D": "chitin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14396?exam_type=jamb&type=obj&page=243",
    "correct_answer": "D",
    "explanation": "The rigidity of fungal hyphal walls is primarily attributed to chitin, a complex polysaccharide, along with other polysaccharides like glucans, and proteins, which together form a robust structural framework.\nThis is a major structural component of fungal cell walls, similar to how it forms the exoskeleton of insects and crustaceans. Chitin is a homopolymer of β-1,4-linked N-acetylglucosamine units, providing significant strength and rigidity.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1213",
    "text": "Angiosperms and gymnosperms belong to the class",
    "options": {
      "A": "schizophyta",
      "B": "spermatophyta",
      "C": "pteridophyta",
      "D": "bryophyta"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14398?exam_type=jamb&type=obj&page=243",
    "correct_answer": "B",
    "explanation": "Both angiosperms (flowering plants) and gymnosperms (conifers, cycads, etc.) are considered to be part of the group of seed-bearing plants, often referred to as \"spermatophytes\" or \"seed plants\".\nSpermatophytes (Seed Plants) broadly refers to the group of plants that produce seeds as their reproductive structure.\nAngiosperms are flowering plants, characterized by having their seeds enclosed within a fruit (e.g., apples, berries, nuts).\nGymnosperms are plants that produce \"naked seeds,\" meaning their seeds are not enclosed within a fruit, and are often found on cones (e.g., pine cones).\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1214",
    "text": "An example of radially symmetric organism is",
    "options": {
      "A": "planera",
      "B": "Hydra",
      "C": "tape worm",
      "D": "round worm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14399?exam_type=jamb&type=obj&page=243",
    "correct_answer": "B",
    "explanation": "Hydra exhibits radial symmetry, meaning its body can be divided into two equal halves along any plane passing through a central axis. This type of symmetry is characterized by body parts arranged around a central axis, like spokes on a wheel.  Hydra, a cnidarian (like jellyfish and sea anemones), has a simple, tubular body with tentacles surrounding the mouth, a feature typical of radially symmetrical organisms.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1215",
    "text": "The leech and the earthworm belong to the",
    "options": {
      "A": "molluscs",
      "B": "crustaceans",
      "C": "arachnides",
      "D": "annelids"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14400?exam_type=jamb&type=obj&page=243",
    "correct_answer": "D",
    "explanation": "Both leeches and earthworms belong to the phylum Annelida, which is characterized by segmented bodies, also known as segmented worms.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1216",
    "text": "I. Rattus rattus II. Agama agama III. Bufo regularis IV. tilipia zilli\nthe order of evolutionary advancement to the above vertebrates is",
    "options": {
      "A": "I, II, III, IV",
      "B": "I, IV, III, II",
      "C": "II, III, IV, I",
      "D": "IV, III, II, I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14402?exam_type=jamb&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "The evolutionary advancement of vertebrates generally follows this order: jawless fish, bony fish, amphibians (the first tetrapods), reptiles, birds (evolved from reptiles), and mammals.\nFrom the question, it follows this order Tilipia zilli (redbelly tilapia) → Bufo regularis (African toad) → Agama agama(red-headed lizard)→ Rattus rattus( black rat)\ni.e  IV, III, II, I\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1217",
    "text": "From the diagram above the angle between the parts labelled II and III is the",
    "options": {
      "A": "bud",
      "B": "node",
      "C": "internode",
      "D": "axil"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14405?exam_type=jamb&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "In plants, an axil refers to the angle where a leaf or branch joins the stem or another branch, and it's often the location where buds, and potentially new shoots or flowers, develop.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1218",
    "text": "The part of the plant where photosynthesis is least likely to take place is",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14406?exam_type=jamb&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "The roots are generally the least suitable place for photosynthesis to occur because they are typically underground, lacking sunlight and the necessary chlorophyll for photosynthesis.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1219",
    "text": "The stage in the life history of a moth responsible for the destruction of agricultural crops is the",
    "options": {
      "A": "nymph",
      "B": "imago",
      "C": "pupa",
      "D": "caterpillar"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14408?exam_type=jamb&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "Caterpillars damage plants by chewing on flowers, leaves, shoots and fruit, and can also bore into wood. Tree-boring caterpillars damage and stress a tree by feeding on the inner bark and cambium tree layer. A large enough population will kill the tree. A caterpillar is thelarval stageof butterflies and moths.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1220",
    "text": "The blackfly is a vector of",
    "options": {
      "A": "malaria",
      "B": "trypanosomiasis",
      "C": "onchocerciasis",
      "D": "yellow fever"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14409?exam_type=jamb&type=obj&page=244",
    "correct_answer": "C",
    "explanation": "Blackflies (Simulium spp.) are vectors of the parasitic nematode Onchocerca volvulus, which causes onchocerciasis, also known as \"river blindness\".\nBlackflies are the intermediate host for the Onchocerca volvulus larvae, and they transmit the parasite to humans when they bite.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1221",
    "text": "The transition from amphibians to mammals involves the limb becoming arranged to support the weight more effectively requiring modifications in the",
    "options": {
      "A": "collar bones and coccyx",
      "B": "pectoral and pelvic girdles",
      "C": "scapulae and clavicles",
      "D": "vertebrae and sternum"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14410?exam_type=jamb&type=obj&page=245",
    "correct_answer": "B",
    "explanation": "The evolution of limbs played a crucial role in the transition from amphibians to mammals, as it allowed for better terrestrial locomotion and support for body weight, with early amphibians having sprawling limbs, while mammals evolved more adducted limbs.\nThe earliest amphibians, evolving from lobe-finned fish, had limbs that were adapted for both aquatic and terrestrial life, with a sprawling posture similar to reptiles. As amphibians spent more time on land, their limbs evolved to support their weight and facilitate movement on land. The synapsid-mammal transition is characterized by a shift from sprawling limb posture to more adducted limbs, which are positioned closer to the body's midline.\nThe pectoral girdle, also known as the shoulder girdle, consists of the clavicle (collarbone) and scapula (shoulder blade). It is designed for flexibility and a wide range of motion, allowing the arms to move in many directions while the pelvic girdle connects the lower limbs (legs) to the axial skeleton, supporting the body's weight and transferring it to the lower limbs.\nThe pelvic girdle, also known as the hip girdle, consists of two hip bones (also called coxal bones), each formed by the fusion of the ilium, ischium, and pubis, along with the sacrum and coccyx.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1222",
    "text": "The main function of the caudal fin in Tilapia is to",
    "options": {
      "A": "propel it forward in water",
      "B": "steer it while changing direction",
      "C": "balance it in water",
      "D": "enable it to float in water"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14411?exam_type=jamb&type=obj&page=245",
    "correct_answer": "A",
    "explanation": "The primary function of the caudal fin (or tail fin) in Tilapia, like in most fishes, is to propel the fish forward through the water and to assist in steering and maneuvering. The caudal fin acts as the main engine, pushing water backward to generate forward thrust.\nTilapia, like most fish, primarily uses its pectoral fins for steering and changing direction, along with its caudal (tail) fin for propulsion. It uses its pectoral and pelvic fins, along with its dorsal fin, for balancing and stability while swimming.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1223",
    "text": "In the root vascular system, the stele is directly surrounded by the",
    "options": {
      "A": "pericycle",
      "B": "cortex",
      "C": "endodermis",
      "D": "parenchyma"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14412?exam_type=jamb&type=obj&page=245",
    "correct_answer": "C",
    "explanation": "In the root vascular system, the stele is directly surrounded by the Endodermis, the cortex's innermost layer. It acts as a boundary between the cortex and stele.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1224",
    "text": "From the diagram above the part labelled IV represents the",
    "options": {
      "A": "colon",
      "B": "ileum",
      "C": "caecum",
      "D": "duodenum"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14413?exam_type=jamb&type=obj&page=245",
    "correct_answer": "D",
    "explanation": "The duodenum, the first part of the small intestine, plays a crucial role in digestion and nutrient absorption, receiving partially digested food from the stomach and mixing it with bile and pancreatic enzymes to further break down nutrients before absorption begins.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1225",
    "text": "From the diagram above, The bile is stored in the part labelled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14415?exam_type=jamb&type=obj&page=245",
    "correct_answer": "B",
    "explanation": "Bile, produced by the liver, is stored in the gallbladder, a small, pear-shaped organ located beneath the liver.\nThe gall bladder is the part labelled II.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1226",
    "text": "The only vein that carriers pure oxygenated blood is the",
    "options": {
      "A": "renal vein",
      "B": "pulmonary vein",
      "C": "hepatic vein",
      "D": "sciatic vein"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14416?exam_type=jamb&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "The pulmonary veins are the only veins in the body that carry oxygen-rich (or oxygenated) blood, bringing it from the lungs back to the heart.\nTypically, veins carry deoxygenated blood (blood that has given up oxygen to the body's tissues) back to the heart. The pulmonary veins are an exception to this rule, as they transport oxygenated blood from the lungs to the left atrium of the heart.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1227",
    "text": "The function of the fluid - filled pericadium is to",
    "options": {
      "A": "reduce the friction caused by the pumping movements of the heart",
      "B": "supply the heart with organisms from attacking the heart",
      "C": "prevent disease organism from attacking the heart",
      "D": "reduce the intensity of the pumping"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14417?exam_type=jamb&type=obj&page=246",
    "correct_answer": "A",
    "explanation": "The fluid-filled pericardium, the sac surrounding the heart, functions to cushion and protect the heart from outside forces, reduce friction during heartbeats, and prevent excessive heart expansion. The pericardium, with its fluid-filled space, helps to limit the heart's ability to expand too much, which can occur when there's an overfilling of blood or other fluids, potentially leading to low cardiac output.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1228",
    "text": "The mammalian lung is made air tight by the",
    "options": {
      "A": "pleural cavity",
      "B": "mucous membrane",
      "C": "pleural membrane",
      "D": "diaphragm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14418?exam_type=jamb&type=obj&page=246",
    "correct_answer": "C",
    "explanation": "The pleural membrane, which surrounds each lung, creates an airtight seal, forming a closed space called the pleural cavity, which is essential for efficient breathing.\nThe pleura is a thin, moist membrane that envelops each lung and lines the inner surfaces of the chest wall and diaphragm.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1229",
    "text": "A test tube containing yeast in glucose solution containing alkaline pyrogallol. The bubbles of carbon (IV) oxide produced indicates that the yeast cells are",
    "options": {
      "A": "respiring in the absence of oxygen",
      "B": "liberating oxygen on their own",
      "C": "living and consuming oxygen",
      "D": "being killed by the alcohol produced"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14419?exam_type=jamb&type=obj&page=246",
    "correct_answer": "A",
    "explanation": "The bubbles of carbon (IV) oxide produced by yeast cells in a glucose solution containing pyrogallol indicate that the yeast cells are performing anaerobic respiration (fermentation), breaking down glucose to produce carbon dioxide and ethanol.\nYeast, like many microorganisms, can survive and reproduce in the absence of oxygen through a process called fermentation.During fermentation, yeast breaks down glucose (a type of sugar) into simpler molecules, such as ethanol and carbon dioxide, releasing energy in the process.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1230",
    "text": "The urinary tubules of the kidney function through",
    "options": {
      "A": "osmosis and diffusion",
      "B": "active transport and osmosis",
      "C": "ultrafiltration and selective reabsorption",
      "D": "active transport and cytoplasmic streaming"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14421?exam_type=jamb&type=obj&page=246",
    "correct_answer": "C",
    "explanation": "Urinary tubules, also called renal tubules, are tiny tubes within the kidneys that play a crucial role in filtering blood and forming urine, reabsorbing essential substances, and eliminating waste.\nThe urinary tubules of the kidney function through ultrafiltration and selective reabsorption to form urine. In the glomerulus, blood is filtered under pressure, forcing small molecules like water, electrolytes, glucose, and urea into the Bowman's capsule, forming the glomerular filtrate. As the filtrate flows through the renal tubules, the body selectively reabsorbs essential substances like water, glucose, amino acids, and electrolytes back into the bloodstream, while waste products remain in the filtrate to be excreted as urine.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1231",
    "text": "Excess water in plants is excreted as water vapour and droplets respectively through",
    "options": {
      "A": "respiration and guttation",
      "B": "transpiration and guttation",
      "C": "photosynthesis and guttation",
      "D": "guttation and condensation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14422?exam_type=jamb&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "Transpiration is the process where plants release water vapour into the atmosphere from their aerial parts, like leaves and stems, through tiny pores called stomata. Transpiration is essentially the evaporation of water from a plant's surface, similar to how humans sweat.\nWhen a plant absorbs more water than it can transpire (evaporate through stomata), the excess water, along with dissolved minerals and sugars, is pushed out through hydathodes. The process through which it does this is called guttation.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1232",
    "text": "When bacteria swim from cold to warm regions this is known as",
    "options": {
      "A": "negative chemotaxis",
      "B": "positive thermotaxis",
      "C": "positive phototaxis",
      "D": "negative phototaxis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14423?exam_type=jamb&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "Chemotaxis is the directed movement of cells or organisms towards or away from a chemical stimulus, playing a crucial role in processes like immune response, development, and bacterial behavior.\nThermotaxis is the directional movement of an organism in response to a temperature gradient.\nPositive thermotaxis refers to the movement of an organism towards a warmer temperature or heat source. Conversely, negative thermotaxis is the movement away from warmer areas or heat sources. Thermotaxis can be crucial for survival and reproduction in various organisms, helping them find optimal temperature conditions or respond to environmental cues.\nphototaxis refers to the directional movement of an organism, or part of an organism, in response to light, either toward (positive phototaxis) or away from (negative phototaxis) a light source.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1233",
    "text": "Hydrostatic skeleton is the type of supporting system found in",
    "options": {
      "A": "mammals",
      "B": "reptiles",
      "C": "oligochaetes",
      "D": "arthropods"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14424?exam_type=jamb&type=obj&page=247",
    "correct_answer": "C",
    "explanation": "Oligochaetes, like earthworms, possess a hydrostatic skeleton where the fluid-filled coelom provides support and facilitates movement through muscle contractions.\nA hydrostatic skeleton is a type of skeletal system where a fluid-filled cavity (the coelom) provides support and rigidity, allowing for movement through the coordinated contraction of muscles surrounding the cavity.\nWhile arthropods are known for their exoskeletons, hydrostatic skeletons are found in some arthropod larvae and during the molting process, but are not the primary form of skeletal support in adult arthropods.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1234",
    "text": "From the diagram above the structure labelled I originates from the",
    "options": {
      "A": "liver",
      "B": "kidney",
      "C": "small intestine",
      "D": "stomach"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14425?exam_type=jamb&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "The part labelled I is the ureter which transports the urine from the kidney straight to the bladder where the urine is stored before passing out through the urethra.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1235",
    "text": "From the diagram above Birth control by vasectomy is achieved by severing the structure labelled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14426?exam_type=jamb&type=obj&page=247",
    "correct_answer": "C",
    "explanation": "Vasectomy, also known as male sterilization, is a highly effective and permanent form of birth control for men achieved by surgically cutting or blocking the vas deferens, the tubes that carry sperm..\nThe Vas deferens is labelled III\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1236",
    "text": "The main function of the structure labelled I is to",
    "options": {
      "A": "store food for the young plant",
      "B": "pull the young shoot above the ground",
      "C": "store water for the seedling",
      "D": "protect the young plumule"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14428?exam_type=jamb&type=obj&page=248",
    "correct_answer": "A",
    "explanation": "The part labelled I is called the cotyledons. In many plants, the cotyledons are the first leaves to emerge from the seed and can even become photosynthetic, especially in epigeal germination (where the cotyledons emerge above ground).\nCotyledons, often called \"seed leaves,\" are embryonic leaves within a seed that store nutrients and provide initial nourishment for the developing seedling, especially before it can photosynthesize. It contains stored food reserves (like starch, fats, and proteins) that are essential for the seedling's early growth and development.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1237",
    "text": "The type of germination illustrated is termed",
    "options": {
      "A": "hypogeal",
      "B": "epicotyl",
      "C": "epigeal",
      "D": "hypocotyl"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14429?exam_type=jamb&type=obj&page=248",
    "correct_answer": "C",
    "explanation": "Seed germination can be broadly classified into two main types:epigeal(where cotyledons emerge above the soil) and hypogeal (where cotyledons remain below the soil). Additionally, there's vivipary, where seeds germinate while still attached to the parent plant.\nThe hypocotyl is the embryonic axis below the cotyledons (seed leaves), connecting the root (radicle) to the seed leaves, while the epicotyl is the embryonic axis above the cotyledons, developing into the shoot system.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1238",
    "text": "From the diagram above the structure labelled I is the",
    "options": {
      "A": "incus",
      "B": "malleus",
      "C": "hammer",
      "D": "stapes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14430?exam_type=jamb&type=obj&page=248",
    "correct_answer": "D",
    "explanation": "(See diagram above for reference purpose and better comprehension)\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1239",
    "text": "A function of the part labelled II is to",
    "options": {
      "A": "equalize pressure on both sides of the tympanum",
      "B": "conduct sound waves to the brain",
      "C": "help the animal maintain balance or posture",
      "D": "transform sound waves into electric impulses"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14431?exam_type=jamb&type=obj&page=248",
    "correct_answer": "A",
    "explanation": "The part labelled II is the eustachian tube and it's function is to balance or equalize air pressure between the middle ear and the outside environment, ventilate the middle ear, and protect it from nasopharyngeal secretions and sound pressures.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1240",
    "text": "Which of the following is a homostatic response in humans?",
    "options": {
      "A": "Withdrawing the hand from a hot object",
      "B": "The mouth getting watery when food is sighted",
      "C": "yawning owing to tiredness",
      "D": "shivering in a cold environment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14433?exam_type=jamb&type=obj&page=248",
    "correct_answer": "D",
    "explanation": "Shivering in a cold environment is a crucial homeostatic response because it's the body's involuntary mechanism to generate heat and maintain a stable internal temperature, preventing hypothermia.\nHomeostasis refers to the body's ability to maintain a stable internal environment, including temperature, despite external changes. The hypothalamus, a region in the brain, acts as the body's thermostat, monitoring temperature and initiating responses to maintain it. When the body temperature drops, sensory receptors in the skin and brain detect the cold and send signals to the hypothalamus. The hypothalamus responds by triggering shivering, an involuntary muscle activity that generates heat.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1241",
    "text": "From the diagram above the optimal temperature for breeding cockroaches is",
    "options": {
      "A": "15oC",
      "B": "19oC",
      "C": "24oC",
      "D": "33oC"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14434?exam_type=jamb&type=obj&page=249",
    "correct_answer": "C",
    "explanation": "Optimal temperature refers to the temperature range at which a biological system, like an enzyme or organism, functions most efficiently. From the graph, the optimal temperature is the highest temperature peak of the curve where the number of cockroaches is highest. Consequently, it is 24\\(^0\\)C.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1242",
    "text": "At which temperature will cockroaches not survive after 10 days",
    "options": {
      "A": "15oC",
      "B": "19oC",
      "C": "24oC",
      "D": "33oC"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14435?exam_type=jamb&type=obj&page=249",
    "correct_answer": "A",
    "explanation": "The temperature at which cockroaches will not survive after 10 days is 15\\(^0\\)C because the graph that hits the zero level, which shows all the cockroaches will die after 10days is the curve that has 15\\(^0\\)C.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1243",
    "text": "Evaporation and transpiration are respectively represented by the components labelled",
    "options": {
      "A": "I and II",
      "B": "II and III",
      "C": "III and IV",
      "D": "IV and I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14436?exam_type=jamb&type=obj&page=249",
    "correct_answer": "A",
    "explanation": "Evaporation is taking place in the part labelled I as the ocean is being evaporated to the cloud.\nTranspiration which takes place in the leaves of the plants is taking place in the part labelled II.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1244",
    "text": "The main reservoir of water in the circle is the",
    "options": {
      "A": "cloud",
      "B": "ground water",
      "C": "plant",
      "D": "ocean"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14437?exam_type=jamb&type=obj&page=249",
    "correct_answer": "D",
    "explanation": "While clouds are a crucial part of the water cycle, acting as a temporary storage location for water, they are not considered the major reservoir in the water cycle; that distinction belongs to the oceans. The oceans are by far the largest reservoir, holding about 97% of Earth's water.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1245",
    "text": "The Mambila plateau is a unique Nigerian biome located in",
    "options": {
      "A": "Plateau state",
      "B": "Borno state",
      "C": "Taraba state",
      "D": "Benue state"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14438?exam_type=jamb&type=obj&page=249",
    "correct_answer": "C",
    "explanation": "The Mambilla Plateau is located in the southeastern part of Taraba State of Nigeria under Sardauna local government area. The Mambilla Plateau constitutes one of Taraba State's largest local government areas.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1246",
    "text": "In Nigeria, the guinea savanna belt borders the",
    "options": {
      "A": "mangrove swamps and the sahel savanna",
      "B": "rainforests and the sudan savanna",
      "C": "desert and the sudan savanna",
      "D": "rainforests and the deserts"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14439?exam_type=jamb&type=obj&page=250",
    "correct_answer": "B",
    "explanation": "In Nigeria, the Guinea savanna belt acts as a transition zone, bordering both the rainforests to the south and the Sudan savanna to the north.\nThe Guinea savanna is a broad, transitional ecological zone that stretches across the middle of Nigeria, encompassing a significant portion of the country's land area. To the south, the Guinea savanna transitions into the dense, evergreen rainforests that characterize the coastal regions of Nigeria. As you move north, the Guinea savanna gives way to the Sudan savanna, which is characterized by shorter grasses and a more arid climate.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1247",
    "text": "The population density of Tridex in an abandoned square farm land of side 200 m was found to be 5 plants per m\\(^2\\). The population size of the plant on the farm is",
    "options": {
      "A": "40",
      "B": "1000",
      "C": "40000",
      "D": "200000"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14440?exam_type=jamb&type=obj&page=250",
    "correct_answer": "D",
    "explanation": "To estimate plant population size on farmland, you can use the formula: Plant Population density = \\(\\frac{(population size)}{(Area of habitat)}\\)\nGiven:\nPopulation density = 5\nArea of farmland = 200m x 200m = 40000m\\(^2\\)\nPopulation size = ?\nPopulation size = population density x Area of farmland\n= 40,000 x 5\n= 200,000\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1248",
    "text": "Secondary succession is much faster than primary succession because",
    "options": {
      "A": "pioneer colonizers are more in number",
      "B": "soil is already present",
      "C": "secondary seres require less nutrients",
      "D": "species competition is increased"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14441?exam_type=jamb&type=obj&page=250",
    "correct_answer": "B",
    "explanation": "Secondary succession is faster than primary succession because the soil and some remnants of previous life forms are already present, allowing for quicker recolonization and growth of new species.\nPrimary Successionbegins in an area where there is no soil or life, such as a newly formed volcanic island or a glacier retreat area. Pioneer species like lichens and mosses must first colonize the area, break down rock, and create soil, a process that can take hundreds or even thousands of years.\nSecondary Successionoccurs in areas where soil already exists and life previously existed, but has been disrupted by events like fire, storms, or abandonment. Since soil and some remnants of previous ecosystems are already present, the process of recolonization and ecosystem development is much faster, often taking only a few years to decades.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1249",
    "text": "which of the following is used to test for the presence of lime in a soil sample?",
    "options": {
      "A": "H2SO4(aq)",
      "B": "NaOH(aq)",
      "C": "HCl(aq)",
      "D": "HNO3(aq)"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14442?exam_type=jamb&type=obj&page=250",
    "correct_answer": "C",
    "explanation": "To test for lime (calcium carbonate) in soil, you can use hydrochloric acid (HCl), which reacts with the lime to produce carbon dioxide gas, indicated by fizzing or bubbling.\nThe chemical reaction between lime (calcium carbonate, CaCO\\(_3\\)) and hydrochloric acid (HCl) is:\nCaCO\\(_3\\) + 2HCl → CaCl\\(_2\\) + CO\\(_2\\) + H\\(_2\\)O.\nIn this reaction, calcium chloride (CaCl\\(_2\\)), carbon dioxide (CO\\(_2\\)), and water (H\\(_2\\)O) are produced.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1250",
    "text": "The importance of practising crop rotation in agriculture is to",
    "options": {
      "A": "maintain soil fertility",
      "B": "improve the nutritional value of crops",
      "C": "control soil erosion",
      "D": "ensure the growth of crops"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14444?exam_type=jamb&type=obj&page=250",
    "correct_answer": "A",
    "explanation": "Crop rotation in agriculture is the practice of planting different crops in a planned sequence on the same land, rather than continuously growing the same crop, to improve soil health, manage pests and diseases, and optimize nutrient balance.\nIt helps maintain and improve soil structure, fertility, and organic matter content. Different crops have varying nutrient needs, and rotating them allows for better nutrient cycling and prevents the depletion of specific nutrients in the soil. By optimizing soil health and nutrient availability, crop rotation can lead to higher yields and more productive farming practices.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1251",
    "text": "The recycling method of solid waste disposal is unsuitable for",
    "options": {
      "A": "organic matter",
      "B": "glass",
      "C": "plastic",
      "D": "metal scraps"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14445?exam_type=jamb&type=obj&page=251",
    "correct_answer": "A",
    "explanation": "Recycling, as a solid waste disposal method, is generally unsuitable for organic matter because it's designed primarily for materials that can be reprocessed into new products, while organic waste naturally decomposes and can be managed through composting or other biological processes.\nRecycling is a highly suitable method for disposing of metal scraps, as it allows for the recovery and reuse of valuable materials, reducing the need for raw materials and minimizing environmental impact.\nAlso, recycling is a suitable and beneficial method for the disposal of plastic waste, offering a way to reuse materials and reduce landfill waste and pollution.\nRecycling is a highly suitable and effective method for disposing of glass waste, as it allows for the reuse of the material and reduces the need for landfill space and raw materials.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1252",
    "text": "A non - renewable alternative source of energy is",
    "options": {
      "A": "wind generator",
      "B": "solar panels",
      "C": "nuclear energy",
      "D": "hydroelectric power"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14446?exam_type=jamb&type=obj&page=251",
    "correct_answer": "C",
    "explanation": "Nuclear energy is a non-renewable energy source because it relies on the finite, naturally occurring element uranium, which is not replenished at a rate that matches its consumption.\nNon-renewable resources, like fossil fuels (coal, oil, natural gas), are finite and cannot be replenished by natural processes within a human timescale. While nuclear energy is a clean energy source (not producing greenhouse gases like fossil fuels), it's not considered a renewable alternative because the fuel source (uranium) is not replenished naturally.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1253",
    "text": "Which of the following is the best explanation for a child who is phenotypically short and born of two tall parents",
    "options": {
      "A": "The father possesses a gene for shortness",
      "B": "The mother posesses a gene for shortness",
      "C": "Nature makes the child short",
      "D": "Both parents possess gene for shortness"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14447?exam_type=jamb&type=obj&page=251",
    "correct_answer": "D",
    "explanation": "Two tall parents can have a phenotypically short child if both parents carry a recessive gene for shortness, even though they themselves are tall, and the child inherits two copies of that recessive gene, one from each parent.\nWhile genetics play a significant role in determining height, it's not controlled by a single gene, but rather by multiple genes and their interactions. If we use the letters \"T\" for tall and \"t\" for short, the parents would be \"Tt\". The child could have TT (tall), Tt (tall), tT (tall) or tt (short).\nKindly note that although genetics are a major factor, other factors like nutrition, hormones, and medical conditions can also influence a child's height.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1254",
    "text": "A yellow maize is crossed with a white maize and the first filial generation produce yellow maize only. The white trait is said to exhibit",
    "options": {
      "A": "dominance",
      "B": "recessiveness",
      "C": "codominance",
      "D": "incomplete dominance"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14448?exam_type=jamb&type=obj&page=251",
    "correct_answer": "B",
    "explanation": "When a yellow maize is crossed with a white maize and only yellow maize is produced in the first filial generation, the white trait is said to exhibit recessiveness because recessive trait will only be expressed if an maize offspring inherits two copies of the recessive allele. In this case, the white trait is not expressed even though it is there but it is silenced by the dominant trait which is yellow. The reason yellow maize( dominant) was expressed.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1255",
    "text": "The association in which one member benefits and the other is relatively unaffected by the interaction is termed",
    "options": {
      "A": "symbiosis",
      "B": "parasitism",
      "C": "commensalism",
      "D": "mutualism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14449?exam_type=jamb&type=obj&page=251",
    "correct_answer": "C",
    "explanation": "The association where one member benefits while the other is relatively unaffected is called commensalism.\nCommensalism is a type of symbiotic relationship where one species benefits, and the other is neither harmed nor helped.\nExample:Cattle egrets and cattle are a good example, where the egrets benefit by eating insects stirred up by the cattle, while the cattle are not affected.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1256",
    "text": "When a peacock displays its colourful feathers, it is",
    "options": {
      "A": "ready for a fight",
      "B": "protecting itself from predators",
      "C": "protecting its mate from predators",
      "D": "courting  a female"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14450?exam_type=jamb&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "Male peacocks display their vibrant, colourful feathers, especially the iridescent tail feathers, as a visual display to attract and impress potential mates, signaling their health and fitness for courtship.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1257",
    "text": "When an animal has a dark-coloured dorsal surface and a light-colouration ventral surface, this is an adaptation called",
    "options": {
      "A": "concealment colouration",
      "B": "countershading",
      "C": "colour blending",
      "D": "disruptive colouration"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14451?exam_type=jamb&type=obj&page=252",
    "correct_answer": "B",
    "explanation": "Countershading is a form of camouflage where animals are darker on their upper surfaces (dorsal) and lighter on their lower surfaces (ventral), helping them appear flatter and blend into their environment by canceling out shadows.\nThe darker dorsal coloration absorbs light, while the lighter ventral coloration reflects it, creating a more uniform appearance and minimizing the contrast that would otherwise highlight the animal's shape and shadows.\nCountershading can also help an animal blend into its environment by matching the color and brightness of the sky above and the darker waters or ground below.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1258",
    "text": "The only caste in the termite colony whose members can feed themselves are the",
    "options": {
      "A": "reproductives",
      "B": "workers",
      "C": "nymphs",
      "D": "soldiers"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14452?exam_type=jamb&type=obj&page=252",
    "correct_answer": "B",
    "explanation": "Termite colonies are organized into a caste system with three main groups: workers (foraging and colony maintenance), soldiers (defense), and reproductives (for colony founding and continuation), each with specialized roles.\nThe workers are the most numerous caste and perform various tasks, including foraging for food and tending to the colony, and they feed themselves.\nThere is an explanation video availablebelow.",
    "year": "2005"
  },
  {
    "number": "1259",
    "text": "An evidence of a common ancestral for fishes, amphibians, reptiles, birds and mammals is the",
    "options": {
      "A": "possession of wings by birds and bats",
      "B": "cold-bloodedness of fishes, amphibians and reptile",
      "C": "presence of gill clefts in vertebrate embryos",
      "D": "possession of scale by fish and reptiles"
    },
    "answer_url": "https://myschool.ng/classroom/biology/14454?exam_type=jamb&type=obj&page=252",
    "correct_answer": "C",
    "explanation": "The evidence for a common vertebrate ancestor includes similarities in embryonic development (like gill slits and tails), shared anatomical features, and fossil evidence, all pointing to a shared evolutionary history.\nVertebrate embryos, even those of different species, exhibit striking similarities in their early stages, including the presence of gill slits (pharyngeal pouches) and a tail, even if these features are later lost in the adult form.\nComparative embryology as a field of study highlights the similarities in the early development of different vertebrate species, suggesting a common ancestor from which these features were inherited. For example, all vertebrate embryos have gill slits and tails, which are later lost in some species, such as humans, where the tail is reduced to the tailbone.\nThere is an explanation video availablebelow.",
    "year": "2005"
  }
]