[
  {
    "number": "1",
    "text": "Constitutionalism emphasises that those who govern the state should do so according to",
    "options": {
      "A": "laid down rules of public order",
      "B": "The dictates of political leader:",
      "C": "the direction of legal luminaries",
      "D": "The satisfaction of their egos",
      "E": "Their whims and caprices"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43320?exam_type=neco&type=obj",
    "correct_answer": "A",
    "explanation": "Constitutionalism emphasises that those who govern the state should do so according to established laws and constitutional principles and ensure that power is exercised within a framework of legal limits and public accountability. It promotes governance based on rules, not arbitrary decisions or the personal whims of political leaders",
    "year": "2001"
  },
  {
    "number": "2",
    "text": "Which is NOT a type of citizenship?",
    "options": {
      "A": "Conferment",
      "B": "indigenousness",
      "C": "marriage",
      "D": "naturalization",
      "E": "registration"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43323?exam_type=neco&type=obj",
    "correct_answer": "B",
    "explanation": "\"Indigenousness\" is not a type of citizenship. The main types of citizenship are: by birth, naturalisation, marriage/ registration and conferrment.",
    "year": "2001"
  },
  {
    "number": "3",
    "text": "Direct democracy succeeded in Athens because",
    "options": {
      "A": "the civil servants were properly trained",
      "B": "The institution government was well established",
      "C": "The population was small in size",
      "D": "The people were united and purposeful",
      "E": "The made use of professionals"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43325?exam_type=neco&type=obj",
    "correct_answer": "C",
    "explanation": "Direct democracy succeeded in Athens primarily because of the relatively small size of the population, which allowed citizens to directly participate in decision-making processes. In Athens, free male citizens could gather in the assembly to discuss and vote on laws, policies, and other matters of state. This direct participation was feasible because the city's population was manageable, making it possible for people to actively engage in governance.\nIn larger populations, this kind of direct involvement becomes impractical, which is why representative democracy is more common in modern states.",
    "year": "2001"
  },
  {
    "number": "4",
    "text": "An instrument for exercise of power for controlling, administering and managing the affairs of people based on laws is the",
    "options": {
      "A": "civil service",
      "B": "executive",
      "C": "government",
      "D": "judiciary",
      "E": "state"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43328?exam_type=neco&type=obj",
    "correct_answer": "C",
    "explanation": "A government is the instrument for the exercise of power for controlling, administering and managing the affairs of people based on laws. It is responsible for creating and enforcing laws, maintaining order and ensuring the welfare of its citizens. The government can take various forms (democracy, dictatorship, monarchy, etc.) but operates through institutions such as the executive, legislature and judiciary.",
    "year": "2001"
  },
  {
    "number": "5",
    "text": "How many delegates from Nigeria and Cameroon attended the London Constitutional Conference of 1953?",
    "options": {
      "A": "16",
      "B": "18",
      "C": "19",
      "D": "20",
      "E": "22"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43329?exam_type=neco&type=obj",
    "correct_answer": "C",
    "explanation": "At theLondon Constitutional Conference of 1953, there were19 delegatesfrom Nigeria and Cameroon. This conference was a significant event in the political history of Nigeria as it discussed the future constitutional structure of Nigeria, particularly the issues related to federalism and the participation of regions in governance.",
    "year": "2001"
  },
  {
    "number": "6",
    "text": "Primus inter pares’ is a term usually used to qualify the",
    "options": {
      "A": "electorate",
      "B": "President",
      "C": "Prime minister",
      "D": "Queen of England",
      "E": "Senate president"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43330?exam_type=neco&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "The term\"Primus inter pares\"is Latin for \"first among equals.\" It is commonly used to describe the role of thePrime Ministerin parliamentary systems. The Prime Minister is considered the first among the elected members of the government, but they are still considered equal to the other ministers in the Cabinet, despite holding the highest office in the executive branch.",
    "year": "2001"
  },
  {
    "number": "7",
    "text": "The 1993 general election had been judged as the best in Nigeria, yet it was inconclusive because",
    "options": {
      "A": "it was widely rigged",
      "B": "it produced no winner",
      "C": "one of the candidates resigned on the day of election",
      "D": "the election result was annulled",
      "E": "the result was inconclusive when it was announced"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43332?exam_type=neco&type=obj&page=2",
    "correct_answer": "D",
    "explanation": "The1993 general electionin Nigeria, widely regarded as one of the fairest and most transparent elections in the country's history, was indeed judged as the best. However, it was declaredinconclusivebecause theresult was annulledby the then military government under General Ibrahim Babangida, despite the fact that it appeared thatChief Moshood K.O. Abiolaof the Social Democratic Party (SDP) had won the election. The annulment led to widespread protests and a political crisis in Nigeria.",
    "year": "2001"
  },
  {
    "number": "8",
    "text": "Nigeria started to operate on a real federal structure with the introduction of the",
    "options": {
      "A": "1922 Clifford constitution",
      "B": "1946 Richards constitution",
      "C": "1953 London conference",
      "D": "1954 Lyttleton constitution",
      "E": "1963 Republican constitution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43383?exam_type=neco&type=obj&page=2",
    "correct_answer": "D",
    "explanation": "The1954 Lyttleton Constitutionis regarded as the point at which Nigeria began to operate a real federal structure. It introduced the establishment of regions (as distinct from earlier systems), with the creation of the Northern, Western, Eastern and Southern regions.",
    "year": "2001"
  },
  {
    "number": "9",
    "text": "The official termination of each session of a House of Assembly is known as",
    "options": {
      "A": "adjournment",
      "B": "Closure",
      "C": "Dissolution",
      "D": "prorogation",
      "E": "Summon"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43384?exam_type=neco&type=obj&page=2",
    "correct_answer": "D",
    "explanation": "A. Adjournment: Adjournment refers to a temporary suspension of proceedings within a session, typically to reconvene at a later time during the same session. It does not signify the official termination of a session.\nB. Closure: Closure is a procedural motion used to end debate on a specific matter being discussed in a legislative body. It is not used to terminate an entire session.\nC. Dissolution: Dissolution refers to the formal ending of a legislative body's term before elections. It signifies the end of the entire assembly, not just a session.\nD. Prerogation: Prorogation refers to the formal ending of a session of a legislative body by the authority of the monarch, governor, or president. It is different from dissolution, which refers to the end of the entire legislative body's term before elections.\nE. Summon: Summoning refers to the action of calling members to attend a session or meeting. It is not related to the termination of a session.",
    "year": "2001"
  },
  {
    "number": "10",
    "text": "On March 17, 1967, General Yakubu Gowon in an attempt to forestall the Eastern region of Nigeria from seceding and in response to various demands for states created",
    "options": {
      "A": "5 states federal structure",
      "B": "7 states federal structure",
      "C": "12 states federal structure",
      "D": "17 states federal structure",
      "E": "19 states federal structure"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43385?exam_type=neco&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "On March 17, 1967, General Yakubu Gowon, in an effort to prevent the secession of the Eastern region (which led to the Nigerian Civil War), created the12 statesfederal structure by splitting the existing regions.",
    "year": "2001"
  },
  {
    "number": "11",
    "text": "Power can be defined as the",
    "options": {
      "A": "ability to command obedience",
      "B": "authority to influence others",
      "C": "legitimate right to rule",
      "D": "right to command respect",
      "E": "right to apply sanctions"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43386?exam_type=neco&type=obj&page=3",
    "correct_answer": "A",
    "explanation": "Power is defined as the ability or capacity to influence others or control events. In political terms, it refers to the ability to command obedience, direct actions and influence the behaviour of others, whether through persuasion or force.",
    "year": "2001"
  },
  {
    "number": "12",
    "text": "The knowledge and belief which individuals possess about the political system is known as ....... Orientation.",
    "options": {
      "A": "Affective",
      "B": "cognitive",
      "C": "evaluative",
      "D": "parochial",
      "E": "participatory"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43391?exam_type=neco&type=obj&page=3",
    "correct_answer": "B",
    "explanation": "Cognitive orientationrefers to the knowledge and beliefs that individuals have about the political system. It involves understanding how the political system works, the roles of various institutions and the functioning of political processes.",
    "year": "2001"
  },
  {
    "number": "13",
    "text": "Decentralization has the following as merits EXCEPT that it",
    "options": {
      "A": "accommodates local differences",
      "B": "Allows for leadership training",
      "C": "allows for conflict of power",
      "D": "enhances political participation",
      "E": "Is a check on tyranny"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43393?exam_type=neco&type=obj&page=3",
    "correct_answer": "C",
    "explanation": "While decentralization has several advantages such as accommodating local differences, enhancing political participation, and being a check on tyranny,conflict of poweris adisadvantage. Decentralization is meant to distribute power more evenly to prevent the concentration of power in a central authority, but it can sometimes lead to conflicts between local and central authorities over jurisdiction and authority.",
    "year": "2001"
  },
  {
    "number": "14",
    "text": "One of the main features of the February 1976 Local Government Reform in Nigeria was the",
    "options": {
      "A": "election of a chairman",
      "B": "introduction of three arms of government",
      "C": "introduction of a speaker of the house",
      "D": "appointment of supervisory councilors",
      "E": "Uniform system of administration"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43399?exam_type=neco&type=obj&page=3",
    "correct_answer": "E",
    "explanation": "TheFebruary 1976 Local Government Reformin Nigeria introduced auniform system of administrationacross the country. This reform aimed to standardise local government structures and ensure uniformity in the way local governments operated. It also emphasised the establishment of local government councils with elected chairmen.",
    "year": "2001"
  },
  {
    "number": "15",
    "text": "Which type of democracy is Nigeria operating as a democratic state?",
    "options": {
      "A": "Classical",
      "B": "representative",
      "C": "restricted",
      "D": "socialist",
      "E": "twenty-first century"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43400?exam_type=neco&type=obj&page=3",
    "correct_answer": "B",
    "explanation": "Nigeria operates as arepresentative democracy, where citizens elect representatives to make decisions on their behalf. This type of democracy allows the people to influence government policy through elections, but the actual governance is carried out by elected officials, rather than the people directly.",
    "year": "2001"
  },
  {
    "number": "16",
    "text": "The Head of state or ceremonial president under the 1963 republican constitution was elected through",
    "options": {
      "A": "an open ballot",
      "B": "an open secret ballot",
      "C": "an option ballot",
      "D": "a head count",
      "E": "a secret ballot"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43401?exam_type=neco&type=obj&page=4",
    "correct_answer": "E",
    "explanation": "Under the1963 Republican Constitutionof Nigeria, the Head of State or Ceremonial President was elected by theNational Assemblythrough asecret ballot. This method ensured that the election was private and that voters could make their decision without outside influence.",
    "year": "2001"
  },
  {
    "number": "17",
    "text": "What is referred to as the fourth estate of the realm?",
    "options": {
      "A": "Civil service",
      "B": "executive",
      "C": "judiciary",
      "D": "legislature",
      "E": "press"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43406?exam_type=neco&type=obj&page=4",
    "correct_answer": "E",
    "explanation": "The term \"fourth estate\" refers to thepressormedia, which is considered a critical institution in society, alongside the three branches of government: the executive, judiciary and legislature. The press is seen as a watchdog that provides oversight to the public and holds the government accountable to the public.",
    "year": "2001"
  },
  {
    "number": "18",
    "text": "What is NOT a feature of a unitary system?",
    "options": {
      "A": "The constitution should be flexible",
      "B": "The people forming the society are homogenous",
      "C": "The question of secession does notaries",
      "D": "There is constitutional division of powers",
      "E": "there is only one source of authority"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43408?exam_type=neco&type=obj&page=4",
    "correct_answer": "D",
    "explanation": "In a unitary system, there is no constitutional division of powers between central and regional governments, as all powers are concentrated in the central government.",
    "year": "2001"
  },
  {
    "number": "19",
    "text": "What is NOT a function of the civil service?",
    "options": {
      "A": "the responsibility of advising ministers",
      "B": "maintaining a comprehensive record of all decisions and keeping all correspondence",
      "C": "preparing the annual budget",
      "D": "serving as an intermediary between the public and government",
      "E": "writing manifestoes for political parties"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43411?exam_type=neco&type=obj&page=4",
    "correct_answer": "E",
    "explanation": "Writing manifestoes for political parties is not a function of the civil service. The civil service is a non-partisan government body responsible for advising ministers, preparing the annual budget, maintaining records and serving as an intermediary between the public and the government. Writing political party manifestoes is the responsibility of political parties themselves, not the civil service.",
    "year": "2001"
  },
  {
    "number": "20",
    "text": "The imperial order-in-council which came into force on January 1, 1947, was generally referred to as the",
    "options": {
      "A": "Constitutional Conference",
      "B": "Lyttleton Constitution",
      "C": "Macpherson Constitution",
      "D": "Richards Constitution",
      "E": "Sir Arthur Richards Constitution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43414?exam_type=neco&type=obj&page=4",
    "correct_answer": "D",
    "explanation": "TheRichards Constitution(named after Sir Arthur Richards, who was the Governor of Nigeria at the time) was an imperial order-in-council that came into force on January 1, 1947. It was aimed at reorganising the administrative structure of Nigeria and provided for a legislative council with greater representation for the indigenous people.",
    "year": "2001"
  },
  {
    "number": "21",
    "text": "A multi-member constituency is used to facilitate the operation of",
    "options": {
      "A": "absolute majority",
      "B": "functional representation",
      "C": "Proportional representation",
      "D": "second ballot",
      "E": "simple majority"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43416?exam_type=neco&type=obj&page=5",
    "correct_answer": "C",
    "explanation": "A multi-member constituency is used to facilitateproportional representation. This system allows multiple representatives to be elected from a single constituency, with seats allocated in proportion to the number of votes each party or candidate receives.",
    "year": "2001"
  },
  {
    "number": "22",
    "text": "Which organ of government is responsible for the formulation and implementation of laws and policies?",
    "options": {
      "A": "Courts",
      "B": "executive",
      "C": "judiciary",
      "D": "legislature",
      "E": "senate"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43418?exam_type=neco&type=obj&page=5",
    "correct_answer": "B",
    "explanation": "The executive organ of government is responsible for the formulation and implementation of laws and policies. It includes the president or prime minister and other government officials who carry out the laws passed by the legislature and oversee the functioning of the government at various levels.",
    "year": "2001"
  },
  {
    "number": "23",
    "text": "The organisation that is responsible for the control of the senior personnel of local government in terms of appointment, transfer, promotion and termination is the",
    "options": {
      "A": "local government service commission",
      "B": "speaker of the house",
      "C": "state civil service chairman of local government",
      "D": "chairman of local government",
      "E": "federal civil service commission"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43426?exam_type=neco&type=obj&page=5",
    "correct_answer": "A",
    "explanation": "The Local Government Service Commission is responsible for the control of senior personnel in local governments, including matters of appointment, transfer, promotion and termination. This body ensures that the local government functions with appropriate staffing and administrative support.",
    "year": "2001"
  },
  {
    "number": "24",
    "text": "The amalgamation of the colony of Lagos and the southern protectorate took place in",
    "options": {
      "A": "1899",
      "B": "1903",
      "C": "1906",
      "D": "1912",
      "E": "1914"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43428?exam_type=neco&type=obj&page=5",
    "correct_answer": "C",
    "explanation": "The colony of Lagos and the Southern Protectorate were amalgamated in 1906, forming a larger administrative unit under British colonial rule. This was a step toward the eventual full amalgamation of the Northern and Southern Protectorates to form Nigeria in 1914.",
    "year": "2001"
  },
  {
    "number": "25",
    "text": "The existence of delegated legislation",
    "options": {
      "A": "encourages separation of power",
      "B": "Increases the work of parliament",
      "C": "Is another way of obtaining separation of power",
      "D": "Negates the principle of separation of power,",
      "E": "reduces the power of the executive"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43430?exam_type=neco&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "Delegated legislation refers to laws made by an executive authority under powers granted by a primary or parent legislation. It allows for the executive to make rules and regulations without the full involvement of the legislature. This process can potentially undermine the principle of separation of powers, as it concentrates legislative power in the hands of the executive. Although delegated legislation can help the executive manage the complexities of law implementation, it might erode the checks and balances that come with a clear division of powers between the branches of government.",
    "year": "2001"
  },
  {
    "number": "26",
    "text": "What did NOT give birth to the development of nationalism in Nigeria?",
    "options": {
      "A": "discrimination in employment exercises against Nigerians",
      "B": "key decisions were made by the Nigerians for the Europeans to carry out",
      "C": "Nigerian culture was tampered with",
      "D": "Nigerian were denied some facilities",
      "E": "the Nigerian economy was controlled by foreigners"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43431?exam_type=neco&type=obj&page=6",
    "correct_answer": "B",
    "explanation": "Nationalism in Nigeria developed in response to colonial injustices, including discrimination in employment, tampering with Nigerian culture, denial of certain facilities to Nigerians and the control of the Nigerian economy by foreigners. However, the idea that \"key decisions were made by the Nigerians for the Europeans to carry out\" is not one of the causes of nationalism in Nigeria. Instead, colonial powers made decisions with little or no input from Nigerians, which further fueled the desire for self-determination and independence.",
    "year": "2001"
  },
  {
    "number": "27",
    "text": "Sovereignty is known for the following apparent characteristics EXCEPT",
    "options": {
      "A": "absoluteness",
      "B": "Divisibility",
      "C": "Inalienability",
      "D": "permanence",
      "E": "Universality"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43433?exam_type=neco&type=obj&page=6",
    "correct_answer": "B",
    "explanation": "Sovereignty is characterized byabsoluteness,inalienability,permanenceanduniversality, meaning it is supreme, cannot be transferred or given away, remains constant, and applies universally to a state.Divisibilityis not a characteristic of sovereignty because sovereignty is indivisible—it cannot be divided among different entities without losing its fundamental nature.",
    "year": "2001"
  },
  {
    "number": "28",
    "text": "Public opinion is the sum total of views and feelings of citizens on matters relating to",
    "options": {
      "A": "the continent",
      "B": "the nation",
      "C": "parochial interest",
      "D": "sectionalism",
      "E": "self-interest"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43443?exam_type=neco&type=obj&page=6",
    "correct_answer": "B",
    "explanation": "Public opinion is the collective views and feelings of citizens on matters that affect the nation, such as politics, governance, laws, policies and national issues. It reflects the general attitudes, beliefs, and concerns of the public at large.",
    "year": "2001"
  },
  {
    "number": "29",
    "text": "What is NOT a fundamental human right?",
    "options": {
      "A": "Freedom from arbitrary arrest",
      "B": "freedom of movement",
      "C": "presumed guilty until found innocent",
      "D": "right to a fair trial",
      "E": "right to life"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43446?exam_type=neco&type=obj&page=6",
    "correct_answer": "C",
    "explanation": "This isnota fundamental human right. In fact, it is the opposite of a fundamental principle of justice, which is thepresumption of innocence. According to international human rights standards, individuals are presumed innocent until proven guilty in a court of law. The other options—freedom from arbitrary arrest,freedom of movement,right to a fair trial, andright to life—are all recognised as fundamental human rights.",
    "year": "2001"
  },
  {
    "number": "30",
    "text": "One remarkable achievement of Lord Lugard’s regime as Governor was the",
    "options": {
      "A": "establishment of a council of chiefs",
      "B": "establishment of one legislative council",
      "C": "establishment of the Nigerian Council",
      "D": "formation of the council of ministers",
      "E": "formation of the council of states"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43449?exam_type=neco&type=obj&page=6",
    "correct_answer": "C",
    "explanation": "One remarkable achievement of Lord Lugard’s regime as Governor of Nigeria was the establishment of theNigerian Councilin 1914. The council comprised 24 official members and  12 unofficial members (6 Europeans and 6 Africans (the Alaafin of Oyo, Emir of Kano and other traditional rulers)).",
    "year": "2001"
  },
  {
    "number": "31",
    "text": "One major problem that threatens Nigeria as a federation is over the adoption of an acceptable formula for",
    "options": {
      "A": "electioneering",
      "B": "post sharing",
      "C": "raising fund",
      "D": "revenue generation",
      "E": "revenue sharing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43451?exam_type=neco&type=obj&page=7",
    "correct_answer": "E",
    "explanation": "One of the major problems that threatens Nigeria as a federation is the adoption of an acceptable formula forrevenue sharing. The distribution of the country's resources, especially from oil revenues, among the federal, state and local governments has been a source of contention for many years.",
    "year": "2001"
  },
  {
    "number": "32",
    "text": "A Pressure group operates peacefully through",
    "options": {
      "A": "lobbying",
      "B": "Politicking",
      "C": "strikes",
      "D": "Ultimatums",
      "E": "Voting"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43457?exam_type=neco&type=obj&page=7",
    "correct_answer": "A",
    "explanation": "Pressure groups operate peacefully throughlobbying, which involves attempting to influence public policy or decision-makers by persuading law makers, government officials or other authorities to support their interests or concerns. This is a common and legal method used by pressure groups to effect change without resorting to more disruptive methods like strikes or ultimatums.",
    "year": "2001"
  },
  {
    "number": "33",
    "text": "The French federated their West African colonized territories with headquarters at",
    "options": {
      "A": "Bamako",
      "B": "Dakar",
      "C": "Goree",
      "D": "senegal",
      "E": "Bamako"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43458?exam_type=neco&type=obj&page=7",
    "correct_answer": "B",
    "explanation": "Dakar, located in Senegal, was the capital of French West Africa and served as the headquarters for the federation of French West African colonies. This federation included several French colonies in West Africa, such as Senegal, Mali, Côte d'Ivoire, and others.",
    "year": "2001"
  },
  {
    "number": "34",
    "text": "A zero party election occurs when",
    "options": {
      "A": "all candidates run independently",
      "B": "Candidates bribe their way through",
      "C": "only party candidates contest",
      "D": "there are no party symbols",
      "E": "Voters have no parties"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43461?exam_type=neco&type=obj&page=7",
    "correct_answer": "A",
    "explanation": "Azero-party electionrefers to a situation where there are no political parties involved, and all candidates run as independents. In this type of election, candidates do not represent any political party, and voters choose individuals based on their personal qualities or policies rather than party affiliation.",
    "year": "2001"
  },
  {
    "number": "35",
    "text": "Which of the following is permanent in international politics?",
    "options": {
      "A": "Bilateral relationship",
      "B": "economic aid",
      "C": "friendship",
      "D": "interest",
      "E": "peace"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43463?exam_type=neco&type=obj&page=7",
    "correct_answer": "D",
    "explanation": "In international politics,interestis considered permanent because countries often prioritise their national interests (economic, security, political, etc.) over time, regardless of changes in leadership, alliances or circumstances.",
    "year": "2001"
  },
  {
    "number": "36",
    "text": "The headquarters of the Organization of Petroleum Exporting Countries (OPEC) is in",
    "options": {
      "A": "Beijing",
      "B": "Cape Town",
      "C": "London",
      "D": "Washington",
      "E": "Vienna"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43466?exam_type=neco&type=obj&page=8",
    "correct_answer": "E",
    "explanation": "The headquarters of the Organization of Petroleum Exporting Countries (OPEC) is located inVienna, Austria.",
    "year": "2001"
  },
  {
    "number": "37",
    "text": "In a real mass party the highest policy making body in the party organizational hierarchy is the",
    "options": {
      "A": "national congress",
      "B": "National Executive Council",
      "C": "National secretary",
      "D": "national publicity department",
      "E": "Parliamentary Party Committee"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43469?exam_type=neco&type=obj&page=8",
    "correct_answer": "A",
    "explanation": "In a real mass party, the highest policy-making body is usually theNational Congress. It is where major decisions, including the party's policies, principles and leadership elections, are made. The national congress is composed of delegates from various levels of the party and serves as the ultimate authority on the party's direction and strategy.",
    "year": "2001"
  },
  {
    "number": "38",
    "text": "The charter of the United Nations Organization (U.N.O.) was signed by fifty nations at",
    "options": {
      "A": "Beijing",
      "B": "Geneva",
      "C": "Moscow",
      "D": "New York",
      "E": "San Francisco"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43474?exam_type=neco&type=obj&page=8",
    "correct_answer": "E",
    "explanation": "The Charter of the United Nations (U.N.O.) was signed by fifty nations onJune 26, 1945, inSan Francisco, California, USA. This event marked the founding of the United Nations.",
    "year": "2001"
  },
  {
    "number": "39",
    "text": "Which type of government is hereditary?",
    "options": {
      "A": "aristocracy",
      "B": "democracy",
      "C": "Fascism",
      "D": "monarchy",
      "E": "oligarchy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43491?exam_type=neco&type=obj&page=8",
    "correct_answer": "D",
    "explanation": "In amonarchy, the position of the ruler (king, queen, emperor, etc.) is passed down through family lines, meaning it is inherited.",
    "year": "2001"
  },
  {
    "number": "40",
    "text": "Habeas Corpus Act of 1679 originated from",
    "options": {
      "A": "Britain",
      "B": "China",
      "C": "Germany",
      "D": "India",
      "E": "Russia"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43495?exam_type=neco&type=obj&page=8",
    "correct_answer": "A",
    "explanation": "TheHabeas Corpus Act of 1679originated in Britain. It was a significant legal development that protected individuals from unlawful detention by ensuring that a person could not be held in custody without being brought before a court to determine the legality of their detention. This act laid the groundwork for principles of individual freedom and due process in English law and influenced similar protections in other countries.",
    "year": "2001"
  },
  {
    "number": "41",
    "text": "The power of the president to assent to bills is derived from the principle of",
    "options": {
      "A": "checks and balances",
      "B": "Fundamental freedom",
      "C": "political equality",
      "D": "Rule of law",
      "E": "Separation of power"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43498?exam_type=neco&type=obj&page=9",
    "correct_answer": "E",
    "explanation": "The power of the president to assent to bills is derived from the principle ofseparation of powers. This principle divides the government into three branches: the executive, the legislature and the judiciary, each with distinct powers and responsibilities. The president's role in assenting to bills is part of the executive branch's function, which checks and balances the legislative process. The president's assent is required for a bill to become law, ensuring a system of oversight within the separation of powers framework.",
    "year": "2001"
  },
  {
    "number": "42",
    "text": "Who was the electoral chairman who conducted the 1983 election?",
    "options": {
      "A": "Chief israel Esua",
      "B": "Chief Micheal Ani",
      "C": "Justice Victor Ovie-Wiskey",
      "D": "Prof Eme Awa",
      "E": "Prof Humphrey Nwosu"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43500?exam_type=neco&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "Justice Ovie Whisky was the chairman of the Federal Electoral Commission (FEDECO) who oversaw the 1983 general elections in Nigeria. His leadership during this period is notable, although the elections were controversial and marred by irregularities, ultimately leading to a military coup in December 1983.",
    "year": "2001"
  },
  {
    "number": "43",
    "text": "A constitution that is very flexible is _____ constitution",
    "options": {
      "A": "state",
      "B": "unwritten",
      "C": "written",
      "D": "rigid",
      "E": "none of the above"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43502?exam_type=neco&type=obj&page=9",
    "correct_answer": "B",
    "explanation": "An unwritten constitution is considered flexible because it is not contained in a single document. Instead, it is made up of statutes, conventions, judicial decisions, and practices. This allows for changes to be made relatively easily through ordinary legislation or by evolving political practices. In contrast, a rigid constitution, such as the written constitution of the United States, requires more formal procedures to amend, making it less flexible.",
    "year": "2001"
  },
  {
    "number": "44",
    "text": "The Nigerian/ Biafra civil war ended on",
    "options": {
      "A": "January 15, 1967",
      "B": "27-May-67",
      "C": "15-Jan-70",
      "D": "27-May-70",
      "E": "13-Jul-75"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43504?exam_type=neco&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "The Nigerian Civil War, also known as the Biafran War, officially ended on15 Jan 1970, with the formal surrender of Biafran forces. This marked the end of a brutal conflict that lasted from July 6, 1967, to January 15, 1970. The war was fought between the government of Nigeria and the secessionist state of Biafra, which declared independence in 1967.",
    "year": "2001"
  },
  {
    "number": "45",
    "text": "The Public Service Commission deals with the",
    "options": {
      "A": "ambassadors to foreign countries",
      "B": "Controller-general of customs",
      "C": "Permanent secretaries of ministers",
      "D": "police force",
      "E": "Supreme court judges"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43506?exam_type=neco&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "The Public Service Commission (PCS) is primarily responsible for the recruitment, promotion and disciplinary control of senior civil servants, including Permanent Secretaries, who are top administrative officers in various ministries. Other positions, such as ambassadors, customs officials, police officers, and Supreme Court judges, typically fall under different bodies, such as the Ministry of Foreign Affairs, Customs Service, Police Service Commission, or Judicial Service Commission.",
    "year": "2001"
  },
  {
    "number": "46",
    "text": "Which ideology emphasizes a classless society?",
    "options": {
      "A": "capitalism",
      "B": "communism",
      "C": "feudalism",
      "D": "totalitarianism",
      "E": "welfares"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43508?exam_type=neco&type=obj&page=10",
    "correct_answer": "B",
    "explanation": "Communism is an ideology that advocates for a classless society where resources and means of production are owned collectively. In a communist system, the goal is to eliminate class distinctions, with wealth and power distributed equally among all members of society, thereby achieving a classless, stateless and equitable social structure.",
    "year": "2001"
  },
  {
    "number": "47",
    "text": "‘Jamiyyar Mutanen Arewa', which is a cultural organization, metamorphosed into a political party called",
    "options": {
      "A": "Borno Youth Movement",
      "B": "Northern Element Progressive Union",
      "C": "Northern People's Congress",
      "D": "People's Redemption Party",
      "E": "United Middle Belt Congress"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43509?exam_type=neco&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "TheJamiyyar Mutanen Arewa, initially a cultural organisation representing northern Nigerian interests, later transformed into the Northern People's Congress (NPC). The NPC became a major political party in Nigeria, primarily representing the interests of the Northern Region during the colonial and post-colonial periods.",
    "year": "2001"
  },
  {
    "number": "48",
    "text": "Which part of Nigeria was declared an extension of Britain in 1861?",
    "options": {
      "A": "Calabar",
      "B": "Kaduna",
      "C": "Lagos",
      "D": "Lokoja",
      "E": "Oil rivers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43510?exam_type=neco&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "In 1861, Lagos was formally annexed by the British and declared a Crown Colony. This marked the beginning of formal British colonial rule in Nigeria.",
    "year": "2001"
  },
  {
    "number": "49",
    "text": "Who was NOT a victim of the January 15, 1966 coup in Nigeria?",
    "options": {
      "A": "Brigadier Maimalari Zachariah",
      "B": "Festus Okotie Eboh",
      "C": "Michael Okpara",
      "D": "Samuel Akintola",
      "E": "Tafawa Balewa"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/government/43512?exam_type=neco&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "Michael Okparawas not a victim of the January 15, 1966, coup. Michael Okpara, the Premier of the Eastern Region, survived the coup.",
    "year": "2001"
  }
]