[
  {
    "number": "1",
    "text": "You are dissatisfied with some practices in your school. Write a letter to your friend in another school discussing at least three of these practices and the improvement you desire.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50436?exam_type=waec&type=theory",
    "correct_answer": "Babs Fatunwa Senior Secondary School,\nP.O Box 226,\nOjodu\n27th May, 2018.\nDear Kingsley,\nI read your last letter with a great delight. It is indeed delightful to know that schools do share some similarities which may be positive ones or negative as it is in our case. In my own school too, there are some practices which have made my school to be notorious and which I would want to express my disapproval about. Just as you were disgusted about such practices in your school, I want to express dissatisfaction with some similar practices in my school.\nThe first nauseating practice is incessant fighting bordering on thuggery among students. It is a common practice even within my school compound to see two students fighting each other and other students would gather around them hailing and thus causing mayhem. In most cases, the fighters are inseparable and they would fight until one draws blood on the other. This intolerable habit at times is taken too far when the students in my school engage some unscrupulous ones from a nearby sister school. The in-house fighting practice is thereby exhibited outside in what has become thuggery for which my school has now become known. My school does not organise inter-house sport competitions because similar ones ended in violent thuggery.\nBullying as a practice common among students in my school has also become so prevalent that it has become a source of worry for peace-loving students like me. There is no day passing without one or two cases of bullying being reported to the school authorities. Junior students and those who have diminutive stature are at the great risk of being bullied and harassed within the school premises. They are extorted and forced to part with their money and belongings. In some cases, such extortions border on robbing the younger ones. Within the school premises, the junior students have become an endangered species as they are picked up for bullying by the senior students who are supposed to protect them. Similar to this, gambling, as a practice, is common among the students. This cuts across all the classes in the school as there are gamblers in junior classes as well as in the senior classes.\nAnother worrisome practice in my school is the lackadaisical attitude of teachers to their duties. All the practices I told you about earlier on are the results of the poor attitude of our teachers. They are negligent of their duties as many of them turn their faces from students' misbehaviours instead of correcting them. Their attitude to their main job of coming to teach in the class is not different. They sit down in their staffrooms during their lesson periods waiting for students to come and call them.\nThere is an urgent need for improvement because the school cannot make progress until there is a change. Kingsley, I am not happy that my school is notorious for all these objectionable practices of fighting, thuggery, gambling and unproductive attitude of teachers. I seriously desire an improvement with which the school can move forward.\nHow are you and your studies? I hope you are trying to cope with all the challenges that are coming your way. I trust you. Don't ever try join in those practices you discussed in your last letter but be one of t the agents of change and improvement as I am trying to be here. I know that we are going to succeed in the end.\nYours sincerely,\nChristopher.",
    "explanation": "Babs Fatunwa Senior Secondary School,\nP.O Box 226,\nOjodu\n27th May, 2018.\nDear Kingsley,\nI read your last letter with a great delight. It is indeed delightful to know that schools do share some similarities which may be positive ones or negative as it is in our case. In my own school too, there are some practices which have made my school to be notorious and which I would want to express my disapproval about. Just as you were disgusted about such practices in your school, I want to express dissatisfaction with some similar practices in my school.\nThe first nauseating practice is incessant fighting bordering on thuggery among students. It is a common practice even within my school compound to see two students fighting each other and other students would gather around them hailing and thus causing mayhem. In most cases, the fighters are inseparable and they would fight until one draws blood on the other. This intolerable habit at times is taken too far when the students in my school engage some unscrupulous ones from a nearby sister school. The in-house fighting practice is thereby exhibited outside in what has become thuggery for which my school has now become known. My school does not organise inter-house sport competitions because similar ones ended in violent thuggery.\nBullying as a practice common among students in my school has also become so prevalent that it has become a source of worry for peace-loving students like me. There is no day passing without one or two cases of bullying being reported to the school authorities. Junior students and those who have diminutive stature are at the great risk of being bullied and harassed within the school premises. They are extorted and forced to part with their money and belongings. In some cases, such extortions border on robbing the younger ones. Within the school premises, the junior students have become an endangered species as they are picked up for bullying by the senior students who are supposed to protect them. Similar to this, gambling, as a practice, is common among the students. This cuts across all the classes in the school as there are gamblers in junior classes as well as in the senior classes.\nAnother worrisome practice in my school is the lackadaisical attitude of teachers to their duties. All the practices I told you about earlier on are the results of the poor attitude of our teachers. They are negligent of their duties as many of them turn their faces from students' misbehaviours instead of correcting them. Their attitude to their main job of coming to teach in the class is not different. They sit down in their staffrooms during their lesson periods waiting for students to come and call them.\nThere is an urgent need for improvement because the school cannot make progress until there is a change. Kingsley, I am not happy that my school is notorious for all these objectionable practices of fighting, thuggery, gambling and unproductive attitude of teachers. I seriously desire an improvement with which the school can move forward.\nHow are you and your studies? I hope you are trying to cope with all the challenges that are coming your way. I trust you. Don't ever try join in those practices you discussed in your last letter but be one of t the agents of change and improvement as I am trying to be here. I know that we are going to succeed in the end.\nYours sincerely,\nChristopher.",
    "year": "2018"
  },
  {
    "number": "2",
    "text": "Write an article suitable for publication in a national newspaper on the high cost of living, suggesting at least three ways in which the government of your country can tackle the problem.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50437?exam_type=waec&type=theory",
    "correct_answer": "HIGH COST OF LIVING IN MY COUNTRY\nUndoubtedly, there is every need to improve the standard of living of citizens of this country. The cost of living is too high in Nigeria and many Nigerians are groaning under the heavy yoke of high cost of living. The bad economy which has engineered exorbitant cost of living has affected Nigerians, particularly the poor. There is high cost of feeding, accommodation, transportation, education and so on to the extent that every facet of life is affected. This pitiable condition is made worse by the crippling effects of unemployment in the country. This has multiplying effects on the standard of living of Nigerians which makes it imperative for the government to rise to the occasion and tackle the problem.\nThe first way of tackling the problem of high cost of living is government having interest in promoting agriculture in the Country. The first priority need of people is survival by feeding well. The cost of food items is too high and this is as a result of low production of food in the country. The farm has been abandoned to the old people by the youths who are not interested in farming. Therefore, the government should make farming attractive to the youths, thereby increasing food production which will bring about a drastic reduction in the prices of food items. This can be achieved if the government establishes farm settlements across the count,' and provides modern farming equipment like tractors plough and harvesters which will allow for high production of food in the country. When foodstuffs are cheap and affordable, Nigerians will be able to feed themselves and remain healthy.\nAnother way of improving the standard of living of Nigerians and reducing the high cost of living is empowering the youths to become self-reliant, productive and entrepreneurial. This will prevent them from becoming job seekers but job creators If the government establishes skill acquisition centres where the youths can acquire skills that can make them go into the production of essential goods and manufacturing of items like shoes, bags, machines and so on, the high cost of these items will come down and become affordable to Nigerians. By encouraging manufacturing, government can create wealth in the country and reduce the high cost of living.\nThe high cost of living in the country is an indication of the poor economy. In order to improve the economy of the country, the government has to do the needful by diversifying the economy. The government should invest in agriculture and manufacturing so that the country will become a great exporting one and not a dependant on imported goods. This will definitely improve the foreign earnings of the country and it will have positive effects on the standard of living of Nigerians.\nMoreover, the locally-made goods either in the agro-called sector or manufacturing sector should be protected by government by banning imported goods. This will encourage local production and manufacturing and Nigerians should be sensitised towards patronising foods and goods made in Nigeria If our locally-produced food and goods are patronised by Nigerians, it will bring about a large production and their prices will be cheap and affordable. This will thereby reduce the high cost of living in the country.\nlgwe Progress.",
    "explanation": "HIGH COST OF LIVING IN MY COUNTRY\nUndoubtedly, there is every need to improve the standard of living of citizens of this country. The cost of living is too high in Nigeria and many Nigerians are groaning under the heavy yoke of high cost of living. The bad economy which has engineered exorbitant cost of living has affected Nigerians, particularly the poor. There is high cost of feeding, accommodation, transportation, education and so on to the extent that every facet of life is affected. This pitiable condition is made worse by the crippling effects of unemployment in the country. This has multiplying effects on the standard of living of Nigerians which makes it imperative for the government to rise to the occasion and tackle the problem.\nThe first way of tackling the problem of high cost of living is government having interest in promoting agriculture in the Country. The first priority need of people is survival by feeding well. The cost of food items is too high and this is as a result of low production of food in the country. The farm has been abandoned to the old people by the youths who are not interested in farming. Therefore, the government should make farming attractive to the youths, thereby increasing food production which will bring about a drastic reduction in the prices of food items. This can be achieved if the government establishes farm settlements across the count,' and provides modern farming equipment like tractors plough and harvesters which will allow for high production of food in the country. When foodstuffs are cheap and affordable, Nigerians will be able to feed themselves and remain healthy.\nAnother way of improving the standard of living of Nigerians and reducing the high cost of living is empowering the youths to become self-reliant, productive and entrepreneurial. This will prevent them from becoming job seekers but job creators If the government establishes skill acquisition centres where the youths can acquire skills that can make them go into the production of essential goods and manufacturing of items like shoes, bags, machines and so on, the high cost of these items will come down and become affordable to Nigerians. By encouraging manufacturing, government can create wealth in the country and reduce the high cost of living.\nThe high cost of living in the country is an indication of the poor economy. In order to improve the economy of the country, the government has to do the needful by diversifying the economy. The government should invest in agriculture and manufacturing so that the country will become a great exporting one and not a dependant on imported goods. This will definitely improve the foreign earnings of the country and it will have positive effects on the standard of living of Nigerians.\nMoreover, the locally-made goods either in the agro-called sector or manufacturing sector should be protected by government by banning imported goods. This will encourage local production and manufacturing and Nigerians should be sensitised towards patronising foods and goods made in Nigeria If our locally-produced food and goods are patronised by Nigerians, it will bring about a large production and their prices will be cheap and affordable. This will thereby reduce the high cost of living in the country.\nlgwe Progress.",
    "year": "2018"
  },
  {
    "number": "3",
    "text": "Write a letter to the Chairman of the Environmental Protection Agency on the effects of illegal felling of trees and suggest ways to remedy the situation.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50438?exam_type=waec&type=theory",
    "correct_answer": "Babs Fafunwa Senior Secondary School\nP.0 Box 226\nOjodu\nLagos\n27th May, 2018.\nThe Chairman,\nEnvironmental Protection Agency,\nAbuja.\nDear Sir,\nEFFECTS OF ILLEGAL FELLING OF TREES\nAs the agency charged with the responsibility of promoting environmental protection in Nigeria, I would like to draw your attention to the depletion of our forests through illegal felling of trees and the devastating effects it has on our environment, otherwise we will continue to live in very unsafe surroundings which cannot continue to support our lives.\nIllegal felling of trees has many effects on our environment with its dire consequences. First and foremost, illegal felling of trees is responsible for the sudden and erratic changes in our weather which in some cases has led to serious drought. Nowadays, there has been change in the rainfall pattern which has made it difficult for our farmers to plan their farming schedules This has made farming risky for farmers as they often plan their crops at the drop of rain only to get stuck midway when the rain suddenly stops. Besides, trees have a great influence on rainfall which illegal felling of these trees destroys.\nSimilarly, trees conserve soil and prevent soil erosion. The soil surface covered by the leaves and branches of trees is protected from heavy rain which could wash it away Apart from this, the roots of trees have binding effects on soil particles and help in soil aeration and water absorption With the rampant illegal felling of trees, the soil loses its fertility and ability to produce bountiful harvest. Soil erosion results in a rapid decline in the productivity of soil. Thus, illegal felling of trees often leads to low food production\nMoreover, illegal felling of trees denies us the productive uses of trees. Trees like 'obeche' and 'iroko' can be sawn into planks and used to produce furniture, canoes, particle boards, fuelwood and paper. With the depletion of these trees illegally, we are denied of their productive uses. We are also denied of the medicinal substances obtainable from trees. The tree roots, barks and leaves are medicinal and with illegal felling of trees, humanity is denied the opportunity to enjoy the medicinal values of trees.\nUndoubtedly, illegal felling of trees has done more harm than good to our environment with the depletion of oxygen, destruction of shades and even the depletion of the ozone and it should not be allowed to continue. Your agency has to do something urgent to remedy the situation. First, your agency should encourage afforestation. More trees need to be planted so as to replace those that have been illegally felled. Nigerians should be encouraged to plant trees, at least one in a day. A day should be popularised to be a tree-planting day when Nigerians would be sensitised to set aside as the day they have to plant trees.\nFurthermore, Nigerians should be educated on the importance of trees to their environment. They should be told that trees could help to make the climate more comfortable for them and make the environment more habitable.\nLastly, stiffer penalties should be meted out to anybody caught engaging in illegal felling of trees. It this is done, it will serve as deterrent to others.\nYours faithfully,\nSignature\nEniafe Esther.",
    "explanation": "Babs Fafunwa Senior Secondary School\nP.0 Box 226\nOjodu\nLagos\n27th May, 2018.\nThe Chairman,\nEnvironmental Protection Agency,\nAbuja.\nDear Sir,\nEFFECTS OF ILLEGAL FELLING OF TREES\nAs the agency charged with the responsibility of promoting environmental protection in Nigeria, I would like to draw your attention to the depletion of our forests through illegal felling of trees and the devastating effects it has on our environment, otherwise we will continue to live in very unsafe surroundings which cannot continue to support our lives.\nIllegal felling of trees has many effects on our environment with its dire consequences. First and foremost, illegal felling of trees is responsible for the sudden and erratic changes in our weather which in some cases has led to serious drought. Nowadays, there has been change in the rainfall pattern which has made it difficult for our farmers to plan their farming schedules This has made farming risky for farmers as they often plan their crops at the drop of rain only to get stuck midway when the rain suddenly stops. Besides, trees have a great influence on rainfall which illegal felling of these trees destroys.\nSimilarly, trees conserve soil and prevent soil erosion. The soil surface covered by the leaves and branches of trees is protected from heavy rain which could wash it away Apart from this, the roots of trees have binding effects on soil particles and help in soil aeration and water absorption With the rampant illegal felling of trees, the soil loses its fertility and ability to produce bountiful harvest. Soil erosion results in a rapid decline in the productivity of soil. Thus, illegal felling of trees often leads to low food production\nMoreover, illegal felling of trees denies us the productive uses of trees. Trees like 'obeche' and 'iroko' can be sawn into planks and used to produce furniture, canoes, particle boards, fuelwood and paper. With the depletion of these trees illegally, we are denied of their productive uses. We are also denied of the medicinal substances obtainable from trees. The tree roots, barks and leaves are medicinal and with illegal felling of trees, humanity is denied the opportunity to enjoy the medicinal values of trees.\nUndoubtedly, illegal felling of trees has done more harm than good to our environment with the depletion of oxygen, destruction of shades and even the depletion of the ozone and it should not be allowed to continue. Your agency has to do something urgent to remedy the situation. First, your agency should encourage afforestation. More trees need to be planted so as to replace those that have been illegally felled. Nigerians should be encouraged to plant trees, at least one in a day. A day should be popularised to be a tree-planting day when Nigerians would be sensitised to set aside as the day they have to plant trees.\nFurthermore, Nigerians should be educated on the importance of trees to their environment. They should be told that trees could help to make the climate more comfortable for them and make the environment more habitable.\nLastly, stiffer penalties should be meted out to anybody caught engaging in illegal felling of trees. It this is done, it will serve as deterrent to others.\nYours faithfully,\nSignature\nEniafe Esther.",
    "year": "2018"
  },
  {
    "number": "4",
    "text": "You are the main speaker in a debate on the topic: Children of literate parents perform better in school than those of illiterate parents. Write your argument for or against the motion.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50441?exam_type=waec&type=theory",
    "correct_answer": "CHILDREN OF LITERATE PARENTS PERFORM BETTER IN SCHOOL THAN OF ILLITERATE PARENTS.\nChairman, Panel of Judges, Co-debaters, Ladies and Gentlemen, I am here to speak in support of the motion \"Children of literate parents perform better in school than those of illiterate parents\". When we say that children of literate parents perform better in school, what this means is that they do well academically than those of illiterate parents. Of course, children from literate homes perform better in their school work than those from illiterate homes. Intelligence is innate and it is often inherited or passed down from parents to children. A literate parent passes down intelligent quotient to his or her child. Definitely, literate parents have the tendency of having children with high intelligent quotient. The reverse is the case with illiterate parents who are not likely to produce children with high intelligent quotient going by simple biological law of genes transfer.\nSecondly, literate parents are more concerned and passionate about education. They are the ones that are always ready to send their children to school and back it up with all necessary academic equipment like books and educative software even with Internet facilities in their homes, all to make their children perform well in school. They often employ lesson teachers to give extra lesson to their children at home after school. Tell me why children from such homes won't perform better than those from illiterate homes? Illiterate parents are mostly not passionate about education. All they know is that their children are attending schools and they stop at that. Their children are not supported at home with lesson teachers, and educative facilities like the Internet. Some of them don't even bother about the progress of their children unlike literate parents who, apart from supporting their children, find time to sit down with their children to ascertain their progress in school. When their children have problem on their assignments or need some explanations, literate parents can offer assistance even when the lesson teacher is not around. An illiterate parent cannot offer such assistance because he or she is not educated.\nMoreover, children from literate homes usually have examples of educated predecessors to follow and emulate. Their parents are educated and so they cannot afford not to do well in school so that they can equal or even surpass their parents' academic achievements. Children from illiterate homes, on the other hand, have no such opportunity. They often think highly of themselves because they are presumed to have been better educated than their illiterate parents. This is further worsened by the fact that their illiterate parents always think highly of them and so tolerate their excesses. A child from an illiterate home can easily deceive his or her illiterate parents about his or her academic performance because the parents could not read and write. This is unthinkable in literate homes where the parents can analyse academic results and know whether their children are doing well in school or not.\nChairman, Panel of Judges, Ladies and Gentlemen, you will all agree with me that a child performs better in school when he or she can be appropriately monitored and supported with academic facilities both in school and at home and when such child comes from a literate home where he or she has somebody with a greater education qualifications to emulate and even surpass.\nI hope that I have been able to convince you with my well-articulated points that children of literate Parents perform better in school those of illiterate parents.",
    "explanation": "CHILDREN OF LITERATE PARENTS PERFORM BETTER IN SCHOOL THAN OF ILLITERATE PARENTS.\nChairman, Panel of Judges, Co-debaters, Ladies and Gentlemen, I am here to speak in support of the motion \"Children of literate parents perform better in school than those of illiterate parents\". When we say that children of literate parents perform better in school, what this means is that they do well academically than those of illiterate parents. Of course, children from literate homes perform better in their school work than those from illiterate homes. Intelligence is innate and it is often inherited or passed down from parents to children. A literate parent passes down intelligent quotient to his or her child. Definitely, literate parents have the tendency of having children with high intelligent quotient. The reverse is the case with illiterate parents who are not likely to produce children with high intelligent quotient going by simple biological law of genes transfer.\nSecondly, literate parents are more concerned and passionate about education. They are the ones that are always ready to send their children to school and back it up with all necessary academic equipment like books and educative software even with Internet facilities in their homes, all to make their children perform well in school. They often employ lesson teachers to give extra lesson to their children at home after school. Tell me why children from such homes won't perform better than those from illiterate homes? Illiterate parents are mostly not passionate about education. All they know is that their children are attending schools and they stop at that. Their children are not supported at home with lesson teachers, and educative facilities like the Internet. Some of them don't even bother about the progress of their children unlike literate parents who, apart from supporting their children, find time to sit down with their children to ascertain their progress in school. When their children have problem on their assignments or need some explanations, literate parents can offer assistance even when the lesson teacher is not around. An illiterate parent cannot offer such assistance because he or she is not educated.\nMoreover, children from literate homes usually have examples of educated predecessors to follow and emulate. Their parents are educated and so they cannot afford not to do well in school so that they can equal or even surpass their parents' academic achievements. Children from illiterate homes, on the other hand, have no such opportunity. They often think highly of themselves because they are presumed to have been better educated than their illiterate parents. This is further worsened by the fact that their illiterate parents always think highly of them and so tolerate their excesses. A child from an illiterate home can easily deceive his or her illiterate parents about his or her academic performance because the parents could not read and write. This is unthinkable in literate homes where the parents can analyse academic results and know whether their children are doing well in school or not.\nChairman, Panel of Judges, Ladies and Gentlemen, you will all agree with me that a child performs better in school when he or she can be appropriately monitored and supported with academic facilities both in school and at home and when such child comes from a literate home where he or she has somebody with a greater education qualifications to emulate and even surpass.\nI hope that I have been able to convince you with my well-articulated points that children of literate Parents perform better in school those of illiterate parents.",
    "year": "2018"
  },
  {
    "number": "5",
    "text": "Write a story to illustrate the saying: A bird in hand is worth two in the bush.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50443?exam_type=waec&type=theory",
    "correct_answer": "The import of the saying: 'a bird in hand is worth two in the bush\" was lost on me until after my secondary school education. The reality of the saying dawned on me fully when I had this terrible experience of losing an admission into a university in Nigeria simply because I was trying to get a better one.\nI had my secondary education with a relative ease. Throughout my secondary school days, I was rated the best. I always led other students in my class and at the end of every school year, I won awards and laurels. remembered our last social event in the school, our valedictory service; I was announced the best in almost all the subjects. When our WASSCE results were released, I had nine distinctions and was then ready for university admission.\nI wrote and passed the examination for admission into the university and I was offered admission to study medicine in one of the prestigious universities in the country. It was at this point in my life that I had an encounter with Mr Davies. Mr Davies happened to be an acquaintance of my father and known to own a travel agency-cum-tutorial school in our neighborhood. Before his plans for me were known to me, he had met and talked with my parents to persuade them to let him help me to study abroad My father in particular gave in to his sugar-coated persuasive talk and the process began.\nFew days after meeting with Mr Davies, my father called me to his sitting room where my mother had set down to await the beginning of the family meeting. \"Koye, I want you to study abroad. It is good that you have been offered admission into a university here but I think you should travel abroad to study\" I shifted on my seat and sat very well probably to hear correctly what my father was saying. Before I could say anything, my mother interrupted: \"There won't be any problem about that. Your father had discussed the plans with Mr Davies who had assured the two of us that he would assist to make it work out. In fact, It was Mr Davies' idea since he knows your brilliant performance in your examinations.\" I sat well on the chair and was almost lost in my thought. Then I came around and asked: \"Do you think this will be possible? Where will the money come from or Mr Davies will assist for free?\" All I could get as answers to my questions was that they had considered everything and had come to the conclusion that studying abroad was the best for me.\nAt first, I was thrilled by this sudden change in fortune. \"So I would have the opportunity to study abroad!\" I sometimes uttered to myself. For the time being, I disregarded the admission offered to study here in Nigeria and longed for when I would travel abroad. Mr Davies helped me to secure admission into a university in America though I knew that with my good result, that would not be a problem. The other processes should follow and my parents struggled so hard to get money to pay for each of the processes.\nI became worried after eight months into the plans and nothing positive came from Mr Davies. When it was one year after admission had been given to me and our plan to travel abroad fell through, I went to the university that gave me admission to see if I could resume schooling there but I was turned down. If I still had interest in the university, I should write another examination the following year. Everything stood at a standstill. I was disappointed and furious at the same time. When I got home, I made my feelings known to my parents who only worsened my situation by telling me that about two million Naira had been collected by Mr Davies and he was at large. This news multiplied my woes and with bile in my mouth, I said to my parents: \"You made me  forfeit my already obtained university admission. If I had insisted that I didn't want your plan, you would have called me a disobedient son. You can see now that \"a bird in hand is worth two in the bush.\"",
    "explanation": "The import of the saying: 'a bird in hand is worth two in the bush\" was lost on me until after my secondary school education. The reality of the saying dawned on me fully when I had this terrible experience of losing an admission into a university in Nigeria simply because I was trying to get a better one.\nI had my secondary education with a relative ease. Throughout my secondary school days, I was rated the best. I always led other students in my class and at the end of every school year, I won awards and laurels. remembered our last social event in the school, our valedictory service; I was announced the best in almost all the subjects. When our WASSCE results were released, I had nine distinctions and was then ready for university admission.\nI wrote and passed the examination for admission into the university and I was offered admission to study medicine in one of the prestigious universities in the country. It was at this point in my life that I had an encounter with Mr Davies. Mr Davies happened to be an acquaintance of my father and known to own a travel agency-cum-tutorial school in our neighborhood. Before his plans for me were known to me, he had met and talked with my parents to persuade them to let him help me to study abroad My father in particular gave in to his sugar-coated persuasive talk and the process began.\nFew days after meeting with Mr Davies, my father called me to his sitting room where my mother had set down to await the beginning of the family meeting. \"Koye, I want you to study abroad. It is good that you have been offered admission into a university here but I think you should travel abroad to study\" I shifted on my seat and sat very well probably to hear correctly what my father was saying. Before I could say anything, my mother interrupted: \"There won't be any problem about that. Your father had discussed the plans with Mr Davies who had assured the two of us that he would assist to make it work out. In fact, It was Mr Davies' idea since he knows your brilliant performance in your examinations.\" I sat well on the chair and was almost lost in my thought. Then I came around and asked: \"Do you think this will be possible? Where will the money come from or Mr Davies will assist for free?\" All I could get as answers to my questions was that they had considered everything and had come to the conclusion that studying abroad was the best for me.\nAt first, I was thrilled by this sudden change in fortune. \"So I would have the opportunity to study abroad!\" I sometimes uttered to myself. For the time being, I disregarded the admission offered to study here in Nigeria and longed for when I would travel abroad. Mr Davies helped me to secure admission into a university in America though I knew that with my good result, that would not be a problem. The other processes should follow and my parents struggled so hard to get money to pay for each of the processes.\nI became worried after eight months into the plans and nothing positive came from Mr Davies. When it was one year after admission had been given to me and our plan to travel abroad fell through, I went to the university that gave me admission to see if I could resume schooling there but I was turned down. If I still had interest in the university, I should write another examination the following year. Everything stood at a standstill. I was disappointed and furious at the same time. When I got home, I made my feelings known to my parents who only worsened my situation by telling me that about two million Naira had been collected by Mr Davies and he was at large. This news multiplied my woes and with bile in my mouth, I said to my parents: \"You made me  forfeit my already obtained university admission. If I had insisted that I didn't want your plan, you would have called me a disobedient son. You can see now that \"a bird in hand is worth two in the bush.\"",
    "year": "2018"
  },
  {
    "number": "6",
    "text": "Read the following passage carefully and answer the questions on it.\n \n      The crowd was massive. Men, women, boys and girls from every nook and cranny of the village had gathered under the big iroko tree. Also in the crowd was an American couple, tourists, who were enjoying their holiday. At the centre of the large circle of people was the magician who had the reputation of performing unbelievable feats. Everybody was impressed with the feats which went along with the hilarious drumming.\n      Then came the next item. The magician's three aides each took out a local gun while the magician danced even wilder. The gun-totting aides took up position in three different corners. The drumming became more frenzied and the magician performed more acrobatics. The people were not to wonder for long what the guns had to do with the whole show. One after the other, the aides aimed at the magician while he steadied himself to receive the shots. Each gun boomed with a loud report and the magician jumped up in celebration of his survival. The three shots seemingly got to him but he simply laughed to scorn the shooters.\n      The American tourist was more than mystified. He could not explain it. How could a man receive bullet shots in his chest and still remain unscathed? In disbelief he shouted \" This is amazing can't be explained But wait a minute. I II join the show myself.\" There and then, he went to his car took out his riffle and returned to the crowd \"I'm gonna get this guy!\" he proclaimed.\n      He took aim. The magician saw him out of the corner of his eye. He surveyed the scenario and decided that he was not prepared for this. Quickly, he showed a clean pair of heels. Tearing through the crowd he ran for dear life. Some thought this was still part of the show. but when the man would not return it was clear that he had bidden the audience a hasty farewell.\n      What the American and most others did not realise all the time was that the local guns had no bullets whatsoever only the gunpowder.\n(a) What suggests that the show was free?\n(b) What evidence is there that the performance was not a one-man show?\n(c) Why was the magician confident to receive the shots from his aides?\n(d) What did the American tourist set out to prove?\n(e) What might have happened if the American had completed his contemplated action?\n(f) ....he showed a clean pair of heels. What does this expression mean?\n(g) ... which went along with the hilarious drumming.\n(i) What is the grammatical name given to this expression as it is used in the passage?\n(ii) What is its function?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage. (i) feats (ii) aides 1 (iii) steadied (iv) mystified (v) unscathed (vi) hasty",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50447?exam_type=waec&type=theory&page=2",
    "correct_answer": "(a). The fact is that it took place in the open/under the big iroko tree.\n(b) The evidence is that apart from the magician, there were drummers and the magician's three aides.\n(c) This is because he knew that there were no bullets in the guns\n(d) He set out to prove that the magician was not bullet-proof after all.\n(e) The magician might have died\n(f) It means that the man ran away.\ng) (i) Relative/adjectival clause (ii) It qualifies/modifies (the noun) \"feats\".\n(h) (i) feats — stunts, acts, tricks. (ii) aides — assistants, helpers, supporters.\n(iii) steadied — stabilised, positioned, braced, readied, balanced, prepared\n(iv) mystified — puzzled, baffled, perplexed, astonished, stupefied, bewildered, bemused\n(v) unscathed — unharmed, unhurt, uninjured, safe (vi) hasty — quick, speedy, hurried, rushed.",
    "explanation": "(a). The fact is that it took place in the open/under the big iroko tree.\n(b) The evidence is that apart from the magician, there were drummers and the magician's three aides.\n(c) This is because he knew that there were no bullets in the guns\n(d) He set out to prove that the magician was not bullet-proof after all.\n(e) The magician might have died\n(f) It means that the man ran away.\ng) (i) Relative/adjectival clause (ii) It qualifies/modifies (the noun) \"feats\".\n(h) (i) feats — stunts, acts, tricks. (ii) aides — assistants, helpers, supporters.\n(iii) steadied — stabilised, positioned, braced, readied, balanced, prepared\n(iv) mystified — puzzled, baffled, perplexed, astonished, stupefied, bewildered, bemused\n(v) unscathed — unharmed, unhurt, uninjured, safe (vi) hasty — quick, speedy, hurried, rushed.",
    "year": "2018"
  },
  {
    "number": "7",
    "text": "Read the following passage carefully and answer the question on it.\n \n      Drug abuse is a menace in many countries The continued abuse of drugs usually leads to addiction. This problem is more common among youths The drugs that can be abused vary from prescribed medication to more controlled substances. Alcohol cigarette and controlled substances such as cocaine heroin, methamphetamine and so on are addictive drugs that are often used by many young people They can be smoked, swallowed, inhaled or injected into the bloodstream.\n      There are numerous adverse medical and psychological consequences associated with drug addiction Individuals have been known to suffer irreversible damage from the abuse of drugs. It can affect the central nervous system as well as cause memory loss, brain damage and depression.\n      Drug addicts may display psychotic behaviours, mood swings and may be predisposed to irascible decision making. They are also likely to suffer general health problems related to the lungs, heart and kidneys. In fact, the adverse behavioural and physical effects of drug addiction on the individual are enormous.\n      Apart from the problems for the individual the families of drug addicts are not spared Since addicts are usually incapable of functioning as 'normal' members of the society they abuse their families. They are prone to abusing spouses and children. There have been reports of children harming their parents because the latter did not give them money to buy drugs. Drugs addicts may eventually require expensive treatment and rehabilitation. These have huge cost implications that put a lot of pressure on the family budget. In addition their families face stigmatization in their communities.\n      The society at large also suffers. Drug addicts are more likely to be involved in criminal activities than people who are not. Many of the heinous crimes reported have been attributed to drug addiction. The abuse of alcohol is one of the reasons for the increasing number of road accidents. An increase in crime rate forces the government to commit huge resources to fighting crime resources that could have been used to provide more social amenities. Moreover, most criminal gangs are formed and thrive on money from drugs. Although the addicts have made the drug trade seemingly attractive and profitable no one should promote it.\n      Regardless of the apparently insurmountable nature of the problems associated with drug addiction some measures could be taken to curb this menace People need to be more educated on the effects of addiction on themselves and their families. Children must be taught in schools and at home the need to stay away from drugs. The law-enforcement agencies should also be better empowered and resourced to apprehend dealers in order to curtail the availability of drugs in circulation. Another step is to ensure that drug addicts receive early treatment. Such treatment should be based on the specific drug the individual is addicted to. While it may appear impossible to eliminate the problems of addiction, relentless efforts in taking the steps above will help to weaken the grip of drug abuse on our society\n(a) In three sentences, one for each state three categories of people that are affected by drug addiction and what they suffer.\n(b) In three sentences one for each, identify three ways to combat drug addiction in the society.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50448?exam_type=waec&type=theory&page=2",
    "correct_answer": "(a) (i) The individual suffers from medical and psychological problems (ii) The families of drug addicts suffer abuse, financial loss and stigmatisation (iii) The society suffers increased crime rate and accidents; deprivation of more social amenities.\n(b) (i) People should be (more) educated on the (negative) effects of drug addiction (ii) Law enforcement agencies should be empowered and equipped to arrest drug dealers. (iii) Early treatment should be provided for addicts.",
    "explanation": "(a) (i) The individual suffers from medical and psychological problems (ii) The families of drug addicts suffer abuse, financial loss and stigmatisation (iii) The society suffers increased crime rate and accidents; deprivation of more social amenities.\n(b) (i) People should be (more) educated on the (negative) effects of drug addiction (ii) Law enforcement agencies should be empowered and equipped to arrest drug dealers. (iii) Early treatment should be provided for addicts.",
    "year": "2018"
  },
  {
    "number": "254",
    "text": "Your parents want you to study a particular course but you know you do not have a flair for it. Write a letter to them, giving at least three reasons why a course of your course will suit you better.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56185?exam_type=waec&type=theory&page=51",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "255",
    "text": "Tourism is an area which has not been fully explored by the government to boost the economy of your country. Write an article suitable for publication in a national newspaper on the need to develop the tourism industry",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56186?exam_type=waec&type=theory&page=51",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "256",
    "text": "Write a letter to the Chairman of your Local Government Area discussing at least, three ways in which food production can be improved in the community.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56187?exam_type=waec&type=theory&page=52",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "257",
    "text": "You are the main speaker in a debate on the topic: Learning about the past has no value to those of us living today. Write your speech for or against the motion.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56188?exam_type=waec&type=theory&page=52",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "258",
    "text": "Write a story ending with the expression: ''Then, I realized that everyone is important in his or her own way.''",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56189?exam_type=waec&type=theory&page=52",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "259",
    "text": "Your sister has helped you to secure a good job in another city. Write a letter to her explaining why it will be impossible to take up the job offer.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56190?exam_type=waec&type=theory&page=52",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "260",
    "text": "Write an article suitable for publication in a national newspaper on street hawking, discussing the dangers and suggesting appropriate solutions.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56191?exam_type=waec&type=theory&page=52",
    "correct_answer": "THE DANGERS OF STREET HAWKING\nStreet hawking, a prevalent yet contentious aspect of urban life in Nigeria, continues to raise concerns regarding safety, health hazards and economic sustainability. The bustling streets filled with vendors selling various goods reflect a complex reality that demands attention, understanding and proactive measures to ensure the well-being of both hawkers and the public.\nOne of the primary dangers associated with street hawking is the risk of accidents. With crowded sidewalks, busy intersections and limited visibility, hawkers and pedestrians alike face potential harm from vehicular traffic. The lack of designated spaces for hawkers exacerbates this issue.\nMoreover, street hawking contributes to environmental challenges, as unsold goods and packaging materials often end up as litter and this contributes to pollution and sanitation issues. Additionally, the absence of proper waste disposal mechanisms further compounds these environmental concerns as it impact public health and hygiene negatively.\nFurthermore, the economic sustainability of street hawking raises questions about fair competition, taxation and regulation. Unregistered hawkers may operate without adhering to tax obligations or quality standards and this leads to disparities within the market and undermines businesses that comply with regulations.\nAddressing these challenges requires a multi-faceted approach that combines regulatory measures, infrastructure development and social support. Firstly, creating designated hawking zones with adequate space, amenities and safety measures can reduce congestion and minimize the risk of accidents. Implementing traffic management strategies and pedestrian-friendly infrastructure can further enhance safety for both hawkers and pedestrians.\nSecondly, promoting environmental awareness and enforcing waste management protocols can mitigate the environmental impact of street hawking. Initiatives such as waste collection drives, recycling programs and public education campaigns can encourage responsible waste disposal practices among hawkers and the public.\nAdditionally, fostering economic inclusivity through skill development programs, micro-enterprise support and access to formal markets can empower hawkers to transition from informal street vending to sustainable business ventures. Providing training on business management, financial literacy, and product quality standards can enhance their competitiveness while ensuring consumer safety and satisfaction.\nFurthermore, collaborative efforts involving government agencies, local authorities, businesses, community organizations and hawkers themselves are essential for implementing effective solutions and fostering a conducive environment for street vending. Dialogue, cooperation and mutual understanding can lead to innovative strategies that balance economic opportunities with social responsibility and environmental sustainability.\nIn conclusion, addressing the dangers associated with street hawking requires a holistic approach that prioritizes safety, environmental stewardship and economic empowerment. By implementing appropriate regulations, infrastructure improvements, environmental initiatives and economic support programs, we can create a harmonious urban landscape that benefits all stakeholders and promotes sustainable development.",
    "explanation": "THE DANGERS OF STREET HAWKING\nStreet hawking, a prevalent yet contentious aspect of urban life in Nigeria, continues to raise concerns regarding safety, health hazards and economic sustainability. The bustling streets filled with vendors selling various goods reflect a complex reality that demands attention, understanding and proactive measures to ensure the well-being of both hawkers and the public.\nOne of the primary dangers associated with street hawking is the risk of accidents. With crowded sidewalks, busy intersections and limited visibility, hawkers and pedestrians alike face potential harm from vehicular traffic. The lack of designated spaces for hawkers exacerbates this issue.\nMoreover, street hawking contributes to environmental challenges, as unsold goods and packaging materials often end up as litter and this contributes to pollution and sanitation issues. Additionally, the absence of proper waste disposal mechanisms further compounds these environmental concerns as it impact public health and hygiene negatively.\nFurthermore, the economic sustainability of street hawking raises questions about fair competition, taxation and regulation. Unregistered hawkers may operate without adhering to tax obligations or quality standards and this leads to disparities within the market and undermines businesses that comply with regulations.\nAddressing these challenges requires a multi-faceted approach that combines regulatory measures, infrastructure development and social support. Firstly, creating designated hawking zones with adequate space, amenities and safety measures can reduce congestion and minimize the risk of accidents. Implementing traffic management strategies and pedestrian-friendly infrastructure can further enhance safety for both hawkers and pedestrians.\nSecondly, promoting environmental awareness and enforcing waste management protocols can mitigate the environmental impact of street hawking. Initiatives such as waste collection drives, recycling programs and public education campaigns can encourage responsible waste disposal practices among hawkers and the public.\nAdditionally, fostering economic inclusivity through skill development programs, micro-enterprise support and access to formal markets can empower hawkers to transition from informal street vending to sustainable business ventures. Providing training on business management, financial literacy, and product quality standards can enhance their competitiveness while ensuring consumer safety and satisfaction.\nFurthermore, collaborative efforts involving government agencies, local authorities, businesses, community organizations and hawkers themselves are essential for implementing effective solutions and fostering a conducive environment for street vending. Dialogue, cooperation and mutual understanding can lead to innovative strategies that balance economic opportunities with social responsibility and environmental sustainability.\nIn conclusion, addressing the dangers associated with street hawking requires a holistic approach that prioritizes safety, environmental stewardship and economic empowerment. By implementing appropriate regulations, infrastructure improvements, environmental initiatives and economic support programs, we can create a harmonious urban landscape that benefits all stakeholders and promotes sustainable development.",
    "year": "2018"
  },
  {
    "number": "261",
    "text": "Your community lacks some basic amenities. Write a letter to the Local Government Administrator explaining the importance of such amenities and how their absence affects the lives of the people.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56192?exam_type=waec&type=theory&page=53",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "262",
    "text": "You have been invited to participate in a debate on the topic: Technology has eroded our values. Write your argument for or against the motion.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56193?exam_type=waec&type=theory&page=53",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "263",
    "text": "Write a story ending with the statement: \"I wish I had told the truth.\"",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/56194?exam_type=waec&type=theory&page=53",
    "correct_answer": "click here",
    "explanation": "click here",
    "year": "2018"
  }
]