[
  {
    "number": "73",
    "text": "Observe specimens A, B, C and D closely and use them to answer questions 1(a) to 1(e).\n(a)(i) Specimen A Into its division and class.\n(ii) State three observable features of specimen A which are characteristics of the class mentioned in 1(a)(i) above.\n(b) State the relationship between specimen A and: (i) specimen B; (ii) specimen C; (iii) specimen D.\n (c)(i) From. your observations of specimens B and C, what type of plant is specimen A? (ii) Suggest the agent of pollination ot specimen B.\n(iii) State two reasons for the answer in 1(c)(i) above.\n(d) Classify specimen D fully according to origin and structure.\n (e) Make a drawing 8 cm 10 cm long of specimen C and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60302?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "74",
    "text": "(a) Study specimens E and F carefully and use them to answer questions 2(a)(i) to 2(a)(ii).\n(i) State the Class to which each of specimens E and F belong.\n(ii) List four observable features each of specimens E and F. \n(iii) State how each of the observed features in 2(a)(i) adapt each of specimens E and F to their habitats. \n(b) Study specimen G and use it to answer questions 2(b)(i) to 2(b)(ii).\n(i) Classify specimen G into its phylum and class.\n(ii) State four observable features of specimen C. \n(iii) Name one habitat of specimen C.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60303?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "75",
    "text": "Study specimens L, M and N carefully and use them to answer questions 4(a) to 4(c).\n(a)(i) State the habitats of specimens L, M and N.\n(ii) State the modes of nutrition of specimens L. M and N.\n(iii) Explain how each of specimens Land M are adapted to their modes of feeding. \n(b)(i) Describe briefly the relationship that exists among specimens L, M and N.\n(ii) State two ways in which specimen M is of economic importance.\n (iii) State one way in which specimen M can be controlled.\n(c) Make a drawing 8cm - 10cm long of specimen M and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60304?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  }
]