[
  {
    "number": "21",
    "text": "Study specimens A (BONE), B (HORN), C (HOOF), D (WATER) and E (COWPEA) carefully and answer the following questions\n(a)(i) State one major feed nutrient in each of specimens A and E\n(ii) Mention three economic uses each of Specirnens A, B, and C\n(b)(i) State two functions of specimen D in farm animals\n(ii) Highlight two benefits that a farmer would derive if specimen E if included in a crop rotation program.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59731?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "22",
    "text": "Study specimens G (GOAT WEED), H (SIDA WEED), I (SPEAR GRASS), J (ELEPHANT GRASS), and K (PIG WEED) carefully and answer the following questions.\n(a) State the botanical names of each of specimens G,H, I, J, and K.\n(b) Give one reason why each of specimens 1, J, and K is difficult to control.\n(c) Mention two uses of specimen J.\n(d) State five ways in which specimens G, H, I, J, and K are of economic importance to farmers.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59732?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "23",
    "text": "Study specimens P ( Electric bulb) , Q (Garden fork), R (Hand trowel ) and S (knapsack sprayer) carefully and answer the following questions.\n(a) State two uses each of specimens P, Q, and R.\n(b) Mention three problems that may result from a poorly maintained specimen S.\n(c) List three protective devices that should be worn by a farmer when using specimen S.\n(d) State three precautions that should be taken when using specimens S.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59733?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "24",
    "text": "Study specimens V (EARTH WORM), W (PADDY RICE), X (GROUNDNUT SEEDS) and Y (MAIZE STEM BORER) carefully and answer the following questions.\n(a) State four ways in which specimen V is important in Agriculture.\n(b) Outline the steps involved in processing each of specimens W and X into polished rice and groundnut cake respectively.\n(c) Mention three measures used in controlling specimen Y on a farm",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59734?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  }
]