[
  {
    "number": "99",
    "text": "Your father insists that you must study medicine at the University, but you have an entirely different course in mind. Write a letter to him explaining why you prefer this other course and why he should allow you make your own choice.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51221?exam_type=waec&type=theory&page=20",
    "correct_answer": "Bluebell Senior High School,\nP.O Box 687,\nLagos.\n13th June, 2004.\nDear Dad,\nI am grateful for your last letter which was received last week. The content of the letter was understood and I can see that you really care for me. However, I can't be a good medical doctor because as you know, I'm soft-minded, and cannot stand the sight of blood. Besides, I believe I can fare better in engineering. I'm making this explanation, because I can see that you want me to choose medicine as a course to study at the university.\nI prefer to study mechanical engineering. First and foremost, I want you to know that mechanical engineers are not many in this country, and this is the reason our society needs them. On the other hand. medical doctors are many which makes medicine not to be as lucrative as mechanical engineering.\nIn Nigeria today, mechanical engineers are a hot cake because the government is planning to build more vehicle assembly plants to add to the existing ones. This policy thrust comes out of the need to have a Nigerian car. Definitely, after graduating as a mechanical engineer, I won't find it difficult to get a job. I also know that you wouldn't want me to come out of the university only to roam the streets in search of employment. That is why as a mechanical engineer, there will be jobs waiting for me.\nIn addition to this, I would prefer to study a course that I have aptitude for. I want you to remember that even as a small boy. I constructed toy cars and trucks automated with batteries. I remember that Mr. Ndu, your intimate friend then, always encouraged you to make sure that I become an engineer because of the potential he saw in me. Why are you now insisting that I must study medicine at the university?\nYou should allow me choose the course that I like. Parents, nowadays, don't choose courses for their children. It is old-fashioned and unacceptable, because from experience children, whose parents choose courses for, don't become successful in the long run. The fact is that such children never do well in life and they often go back to blame their parents for their failure.\nFinally, you are aware of the hatred that I have for hospitals. I hate to see blood and dead bodies and with my allergic tendency towards all these. do you think I can make a successful career in medicine? Daddy, I think you better let me be what I think I would be. a mechanical engineer.\nI would still want you to let me know your response. Convey my greetings to mummy. Joke and Tunde. I love them all.\nYours sincerely,\nBolu",
    "explanation": "Bluebell Senior High School,\nP.O Box 687,\nLagos.\n13th June, 2004.\nDear Dad,\nI am grateful for your last letter which was received last week. The content of the letter was understood and I can see that you really care for me. However, I can't be a good medical doctor because as you know, I'm soft-minded, and cannot stand the sight of blood. Besides, I believe I can fare better in engineering. I'm making this explanation, because I can see that you want me to choose medicine as a course to study at the university.\nI prefer to study mechanical engineering. First and foremost, I want you to know that mechanical engineers are not many in this country, and this is the reason our society needs them. On the other hand. medical doctors are many which makes medicine not to be as lucrative as mechanical engineering.\nIn Nigeria today, mechanical engineers are a hot cake because the government is planning to build more vehicle assembly plants to add to the existing ones. This policy thrust comes out of the need to have a Nigerian car. Definitely, after graduating as a mechanical engineer, I won't find it difficult to get a job. I also know that you wouldn't want me to come out of the university only to roam the streets in search of employment. That is why as a mechanical engineer, there will be jobs waiting for me.\nIn addition to this, I would prefer to study a course that I have aptitude for. I want you to remember that even as a small boy. I constructed toy cars and trucks automated with batteries. I remember that Mr. Ndu, your intimate friend then, always encouraged you to make sure that I become an engineer because of the potential he saw in me. Why are you now insisting that I must study medicine at the university?\nYou should allow me choose the course that I like. Parents, nowadays, don't choose courses for their children. It is old-fashioned and unacceptable, because from experience children, whose parents choose courses for, don't become successful in the long run. The fact is that such children never do well in life and they often go back to blame their parents for their failure.\nFinally, you are aware of the hatred that I have for hospitals. I hate to see blood and dead bodies and with my allergic tendency towards all these. do you think I can make a successful career in medicine? Daddy, I think you better let me be what I think I would be. a mechanical engineer.\nI would still want you to let me know your response. Convey my greetings to mummy. Joke and Tunde. I love them all.\nYours sincerely,\nBolu",
    "year": "2004"
  },
  {
    "number": "100",
    "text": "Write an article suitable for publication in a national newspaper on the benefits that will be derived from the government showing interest in agriculture.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51222?exam_type=waec&type=theory&page=20",
    "correct_answer": "THE BENEFITS THAT WILL BE DERIVED FROM THE GOVERNMENT SHOWING INTEREST IN AGRICULTURE\nAgriculture is one of the means by which the government of any country that is serious about feeding its populace and raking in foreign exchange can use to improve the living standard of its people as well as generate revenue. Nigeria can improve her economy by showing interest in agriculture. Unfortunately, the government of Nigeria is yet to show serious commitment in the area of agriculture which would have been a major source of revenue.\nObviously. there is a lot to benefit, if the government can show interest in agriculture. First, the major benefit of agriculture to the people of the country is the availability of cheap and quality food for all. If the government develops interest in agriculture, there would be adequate production of food in large quantities. Then, there will be food for all and sundry thereby solving the problem of malnutrition and acute poverty. As a result of this step, many Nigerians would have enough food on their tables and they would be healthy as well.\nAnother benefit to be derived from the government showing interest in agriculture is that there will be huge amount of money generated as revenue from the sales of the agricultural produce within the country and even through exportation. Exportation of excess agricultural produce will bring huge foreign exchange earning into the country, which the government could use to provide infrastructural facilities in the country.\nFurthermore, agricultural sector being the type that requires a large labour-force can also help to create employment for the large number of unemployed able-bodied men and women in the country. This can solve the problem of unemployment facing the country today. Since agriculture provides cheap food and employment, then the menace of crime in our society will be reduced to the barest minimum. When the government does everything necessary to boost agricultural production, there will be abundant food for people to eat, there will be employment and money will be in the pockets of the people to spend.\nAgriculture can also help improve the other sectors of the Nigerian economy. The agro-allied industries will have enough raw materials to carry out their production processes. This will go a long way to developing the economy. Finally, the country's dependence on crude oil will be drastically reduced, if the government can show interest in agriculture. Crude oil will no longer become the major source of government income and the violence that is the order of the day in our oil producing areas from time to time will be drastically reduced.\nNnadozie Chukwuka\nSS3C",
    "explanation": "THE BENEFITS THAT WILL BE DERIVED FROM THE GOVERNMENT SHOWING INTEREST IN AGRICULTURE\nAgriculture is one of the means by which the government of any country that is serious about feeding its populace and raking in foreign exchange can use to improve the living standard of its people as well as generate revenue. Nigeria can improve her economy by showing interest in agriculture. Unfortunately, the government of Nigeria is yet to show serious commitment in the area of agriculture which would have been a major source of revenue.\nObviously. there is a lot to benefit, if the government can show interest in agriculture. First, the major benefit of agriculture to the people of the country is the availability of cheap and quality food for all. If the government develops interest in agriculture, there would be adequate production of food in large quantities. Then, there will be food for all and sundry thereby solving the problem of malnutrition and acute poverty. As a result of this step, many Nigerians would have enough food on their tables and they would be healthy as well.\nAnother benefit to be derived from the government showing interest in agriculture is that there will be huge amount of money generated as revenue from the sales of the agricultural produce within the country and even through exportation. Exportation of excess agricultural produce will bring huge foreign exchange earning into the country, which the government could use to provide infrastructural facilities in the country.\nFurthermore, agricultural sector being the type that requires a large labour-force can also help to create employment for the large number of unemployed able-bodied men and women in the country. This can solve the problem of unemployment facing the country today. Since agriculture provides cheap food and employment, then the menace of crime in our society will be reduced to the barest minimum. When the government does everything necessary to boost agricultural production, there will be abundant food for people to eat, there will be employment and money will be in the pockets of the people to spend.\nAgriculture can also help improve the other sectors of the Nigerian economy. The agro-allied industries will have enough raw materials to carry out their production processes. This will go a long way to developing the economy. Finally, the country's dependence on crude oil will be drastically reduced, if the government can show interest in agriculture. Crude oil will no longer become the major source of government income and the violence that is the order of the day in our oil producing areas from time to time will be drastically reduced.\nNnadozie Chukwuka\nSS3C",
    "year": "2004"
  },
  {
    "number": "109",
    "text": "The poor state of the facilities in your school is causing the studens freat concern. As the Senior Prefect, write a letter to the chairman of the Board of Governors highlighting the problems and requesting him to come to the aid of the school.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51293?exam_type=waec&type=theory&page=22",
    "correct_answer": "Bluebell Senior High School,P. O. Box 687,Lagos.13th June, 2004.\nThe Chairman,Board of Governors,Bluebell Senior High School,Lagos.\nDear Sir,\nPOOR STATE OF FACILITIES IN BLUEBELL SENIOR HIGH SCHOOLI am writing in my capacity as the Senior Prefect of Bluebell Senior High School. In the first place, I wish to thank you very sincerely for the wonderful works you have been doing in our school since becoming the Chairman of the school's Board of Governors.However, on behalf of the entire student population of the school, I wish to place before you our request for certain amenities which we lack in our school. This has seriously threatened the development of our beloved school for a long time and we would be grateful if you could use your good position to provide them.In the first place, I must inform you that up till now, our school has no assembly hall. This situation has been like this for over a decade now. The importance of an assembly hall in a school cannot be over-emphasized. The students need a hall for the conduct of morning and afternoon prayers, meetings,' social activities and other co-curricular activities such as debates, quiz competitions and academic symposia. Definitely, the school needs a hall where such `activities will be held going by the population of the school. Sir, on many occasions we have had to assemble in the scorching sun or under the drizzle of rain.Similarly, I must bring to your notice that our school has no playing field, however small. After a day's hard work, students should be encouraged to do some exercises and urged to participate in games. We could not even hold our inter-house sports competition in the school. We always make use of fields belonging to other schools which, more often than not, causes a lot of trouble for us.In the same vein, it must be brought to your notice that our school has just a small library which is quite inadequate for the population of the school. What we have could not be called a library but a tiny reading room. There are no books to be borrowed by students and the seats provided there are grossly inadequate. The importance of the library in a school is so great that we cannot fold our arms on this issue. Obviously, the academic performance of the students will be enhanced if you could provide a bigger and adequately-equipped library for us.Finally Sir, I thank you once again for your contribution to the development of our school, and we are still expecting more. Thank you.Yours faithfully,(signature)Olutunde Ayorinde.",
    "explanation": "Bluebell Senior High School,P. O. Box 687,Lagos.13th June, 2004.\nThe Chairman,Board of Governors,Bluebell Senior High School,Lagos.\nDear Sir,\nPOOR STATE OF FACILITIES IN BLUEBELL SENIOR HIGH SCHOOLI am writing in my capacity as the Senior Prefect of Bluebell Senior High School. In the first place, I wish to thank you very sincerely for the wonderful works you have been doing in our school since becoming the Chairman of the school's Board of Governors.However, on behalf of the entire student population of the school, I wish to place before you our request for certain amenities which we lack in our school. This has seriously threatened the development of our beloved school for a long time and we would be grateful if you could use your good position to provide them.In the first place, I must inform you that up till now, our school has no assembly hall. This situation has been like this for over a decade now. The importance of an assembly hall in a school cannot be over-emphasized. The students need a hall for the conduct of morning and afternoon prayers, meetings,' social activities and other co-curricular activities such as debates, quiz competitions and academic symposia. Definitely, the school needs a hall where such `activities will be held going by the population of the school. Sir, on many occasions we have had to assemble in the scorching sun or under the drizzle of rain.Similarly, I must bring to your notice that our school has no playing field, however small. After a day's hard work, students should be encouraged to do some exercises and urged to participate in games. We could not even hold our inter-house sports competition in the school. We always make use of fields belonging to other schools which, more often than not, causes a lot of trouble for us.In the same vein, it must be brought to your notice that our school has just a small library which is quite inadequate for the population of the school. What we have could not be called a library but a tiny reading room. There are no books to be borrowed by students and the seats provided there are grossly inadequate. The importance of the library in a school is so great that we cannot fold our arms on this issue. Obviously, the academic performance of the students will be enhanced if you could provide a bigger and adequately-equipped library for us.Finally Sir, I thank you once again for your contribution to the development of our school, and we are still expecting more. Thank you.Yours faithfully,(signature)Olutunde Ayorinde.",
    "year": "2004"
  },
  {
    "number": "110",
    "text": "You are the chief speaker in a debate on the topic \"Wealth is more important than health,\" Write your speech for or against the topic.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51295?exam_type=waec&type=theory&page=22",
    "correct_answer": "HEALTH IS MORE IMPORTANT THAN WEALTHGood day, Mr. Chairman, Panel of Judges, Ladies and Gentlemen. I am standing before you to oppose the motion which states that wealth is more important than health. I would rather say that health is more important than wealth. Being healthy refers to a state of physical and psychological well-being of an individual, devoid of sickness, while being wealthy refers to opulence, affluence or a state of being rich. It is better to be healthy than to be rich with one ailment or the other, because of the following reasons.First and foremost, there is a wise saying which states that \"Health is wealth.\" There is no adage that is truer than this. Health is indeed wealth because anybody that is healthy has everything. He has the freedom and the agility to go about his business to earn a living. His hope of getting money, which is what wealth is all about, is sustained by his health. On the other hand, an unhealthy person is tied down to his sick bed. He would not be able to go about his business as he is being restrained by the sickness in his body. A visit to our various hospitals will confirm to you that if your have health you have everything.In addition to this, while wealth can be acquired, health cannot be acquired just as you acquire money. Good health is maintained and sustained by good and simple hygienic living. It is also a gift from God, which to some extent nobody can claim he has worked for. Health is not about what you can say in terms of being smart or the ability to cut corners in order to get it as you could do to get wealth.Furthermore, health is a major prerequisite to making money. It is an important factor necessary to make wealth. If a person desires to make wealth and he has no health, he is incapacitated. However, a healthy man has the ability to make wealth because his healthy body can supply the energy he needs to put into his business for wealth creation. It always gets to a point in the life of an unhealthy rich man when he would wish that all his money should go so that he could be healthy. This shows how important good health is in the life of a person.Mr. Chairman and my audience, is it not because you are healthy that you are here? Can somebody that is sick or ill be in our midst? Obviously no, because such person will either be in an hospital or his sick bed in his house. Whereas health is wealth, wealth is not health. I believe that with my few points, I have been able to convince you that health is more important than wealth:",
    "explanation": "HEALTH IS MORE IMPORTANT THAN WEALTHGood day, Mr. Chairman, Panel of Judges, Ladies and Gentlemen. I am standing before you to oppose the motion which states that wealth is more important than health. I would rather say that health is more important than wealth. Being healthy refers to a state of physical and psychological well-being of an individual, devoid of sickness, while being wealthy refers to opulence, affluence or a state of being rich. It is better to be healthy than to be rich with one ailment or the other, because of the following reasons.First and foremost, there is a wise saying which states that \"Health is wealth.\" There is no adage that is truer than this. Health is indeed wealth because anybody that is healthy has everything. He has the freedom and the agility to go about his business to earn a living. His hope of getting money, which is what wealth is all about, is sustained by his health. On the other hand, an unhealthy person is tied down to his sick bed. He would not be able to go about his business as he is being restrained by the sickness in his body. A visit to our various hospitals will confirm to you that if your have health you have everything.In addition to this, while wealth can be acquired, health cannot be acquired just as you acquire money. Good health is maintained and sustained by good and simple hygienic living. It is also a gift from God, which to some extent nobody can claim he has worked for. Health is not about what you can say in terms of being smart or the ability to cut corners in order to get it as you could do to get wealth.Furthermore, health is a major prerequisite to making money. It is an important factor necessary to make wealth. If a person desires to make wealth and he has no health, he is incapacitated. However, a healthy man has the ability to make wealth because his healthy body can supply the energy he needs to put into his business for wealth creation. It always gets to a point in the life of an unhealthy rich man when he would wish that all his money should go so that he could be healthy. This shows how important good health is in the life of a person.Mr. Chairman and my audience, is it not because you are healthy that you are here? Can somebody that is sick or ill be in our midst? Obviously no, because such person will either be in an hospital or his sick bed in his house. Whereas health is wealth, wealth is not health. I believe that with my few points, I have been able to convince you that health is more important than wealth:",
    "year": "2004"
  },
  {
    "number": "111",
    "text": "Write a story on the topic: \"An experience I'd love to have again.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51297?exam_type=waec&type=theory&page=23",
    "correct_answer": "AN EXPERIENCE I WOULD LOVE TO HAVE AGAINIf you have not experienced a public disgrace during which you are regarded as an outcast and a bastard by the people of the community which you had always regarded as yours, you may not know the import of what happened to me. I was brought up among the people of a tribe called Tango in The Gambia. My mother belonged to this tribe and I had lived all my life among the people. I grew up to know everything a child needed to know about the people and at the age of nineteen,I was initiated into the cult of adulthood as the tradition of the people demanded.I lived with my mother and her brother who I had always thought was my biological father. I behaved like an adult from the tribe of my mother and I related with other adults of my age until one day an incident happened which made me realize that I did not belong to the tribe.Wuse was a girl that I had loved all my life. I knew her when she was a little child and we grew up together to love each other. We were so intimate that all the people in our community knew that we were made for each other. I had even proposed to her and there was a plan to make my intention to marry her known to her family. Wuse was, no doubt, a charming lady who had become suddenly the cynosure of all eyes in the community.One day, my mother called me and told me that I could not marry it Wuse because the son of the king was planning marry her. I was annoyed with my mother, and I promised to fight out even if the whole community was in support to plan of the son of the king to marry Wuse.I was summoned to the King's palace and warned to stop visiting Wuse. I was not frightened by the King's warning as I was resolute in my decision to marry Wuse, even if it demanded that I flouted the king's order. This caused a lot of furore in the community, and the elders in the community called me one day to tell me that I should forget the idea of marrying Wuse because a bastard who did not belong to the community could not stand against the wish of the king.The pronouncement of the elders of the community made me to go back home in annoyance. I called my mother and demanded to know who I was. She told me that her brother who I had been regarding as my father was not my biological father and that my real father was a Nigerian who came to The Gambia to trade, and that soon after my birth, he decided to leave me behind and went back to Nigeria.She told me his name and gave me his picture, and soon after the search for my father began. I traveled down to Nigeria and started the search for my father in the eastern part of the country where he came from. I was fortunate to see him after a long search. You can imagine how happy I was when I finally met him. He had grown so old and senile that to stand up was no longer easy. But his facial appearance and physical features gave him out as my father. He was happy to see me and so were his people who welcomed me as they would welcome a lost son. What an experience! But unfortunately, my father died in the evening of the same day while holding me in his arms, almost suffocating me with his fatherly warmth. On the day he was buried, I looked up the sky and wept. I missed his warm embrace of the previous day; it was an experience I would have loved to have again.",
    "explanation": "AN EXPERIENCE I WOULD LOVE TO HAVE AGAINIf you have not experienced a public disgrace during which you are regarded as an outcast and a bastard by the people of the community which you had always regarded as yours, you may not know the import of what happened to me. I was brought up among the people of a tribe called Tango in The Gambia. My mother belonged to this tribe and I had lived all my life among the people. I grew up to know everything a child needed to know about the people and at the age of nineteen,I was initiated into the cult of adulthood as the tradition of the people demanded.I lived with my mother and her brother who I had always thought was my biological father. I behaved like an adult from the tribe of my mother and I related with other adults of my age until one day an incident happened which made me realize that I did not belong to the tribe.Wuse was a girl that I had loved all my life. I knew her when she was a little child and we grew up together to love each other. We were so intimate that all the people in our community knew that we were made for each other. I had even proposed to her and there was a plan to make my intention to marry her known to her family. Wuse was, no doubt, a charming lady who had become suddenly the cynosure of all eyes in the community.One day, my mother called me and told me that I could not marry it Wuse because the son of the king was planning marry her. I was annoyed with my mother, and I promised to fight out even if the whole community was in support to plan of the son of the king to marry Wuse.I was summoned to the King's palace and warned to stop visiting Wuse. I was not frightened by the King's warning as I was resolute in my decision to marry Wuse, even if it demanded that I flouted the king's order. This caused a lot of furore in the community, and the elders in the community called me one day to tell me that I should forget the idea of marrying Wuse because a bastard who did not belong to the community could not stand against the wish of the king.The pronouncement of the elders of the community made me to go back home in annoyance. I called my mother and demanded to know who I was. She told me that her brother who I had been regarding as my father was not my biological father and that my real father was a Nigerian who came to The Gambia to trade, and that soon after my birth, he decided to leave me behind and went back to Nigeria.She told me his name and gave me his picture, and soon after the search for my father began. I traveled down to Nigeria and started the search for my father in the eastern part of the country where he came from. I was fortunate to see him after a long search. You can imagine how happy I was when I finally met him. He had grown so old and senile that to stand up was no longer easy. But his facial appearance and physical features gave him out as my father. He was happy to see me and so were his people who welcomed me as they would welcome a lost son. What an experience! But unfortunately, my father died in the evening of the same day while holding me in his arms, almost suffocating me with his fatherly warmth. On the day he was buried, I looked up the sky and wept. I missed his warm embrace of the previous day; it was an experience I would have loved to have again.",
    "year": "2004"
  },
  {
    "number": "112",
    "text": "Read the following passage carefully and answer the questions on it. \n\n      When Eze was invited to spend his Easter holidays with Uncle Chike in Lagos, he jumped for joy! He had always pictured Lagos as a wonderland of bright lights, paved roads, elegant people riding by in their expensive cars, and beautiful residential quarters. This invitation was the wonderful opportunity for him to leave his small village for the first time and experience first-hand the good life of the city that he had imagined so much about! \n      The fateful day came and Eze, happy as a lark, bid an excited good-bye to his family. The first leg of his trip started modestly in the back of the rickety lorry that plied the dirt road linking his village to the rest of the world, but Eze was sure that he would later ride triumphantly into Lagos on one of those legendary luxury buses that he admired so much. This was also an experience to look forward to!  \n      When he arrived in Lagos, it was almost dark. The first things that struck him as he alighted from the bus were the teeming crowd with their desperate unsmiling faces, the deafening noise of the ceaseless traffic, the polluted air with its acrid smell of exhaust fumes and decay, the endless rows of dirty and crumbling concrete buildings, and the filth everywhere. What a sharp contrast with the city he had built up in his imagination! But surely there must still be much to look forward to. Back in the village, Uncle Chike was regarded as a well-to-do trader. So Eze was further surprised and disappointed to find that he lived in a single room in a sleazy part of the city. At night, it got hot and stuffy, but they dared not open the windows as this would bring an invasion  of mosquitoes. \n      Eze woke up the next morning feeling clammy, but he could still not have a bath. As his uncle took him to a shack across the street for a hurried  breakfast of thin tea and mouldy bread, he explained that they usually bought water from a mobile tanker that had not come for some time. Eze was still recovering from his surprise at this information when they rushed off for his uncle s market stall, and he had his first unpleasant ride in one of the notorious molue buses of the city. \n      As they struggled down from the bus, shoving against the solid mass of desperate, bad-tempered commuters, Eze thought of his village, and the city suddenly lost whatever was left of its attraction  for him. True, the village was small; life there was monotonous, and it lacked some essential amenities_ But it was peaceful; you drank clean water and ate what you wanted fresh; you moved about freely and breathed clean air; and everyone was friendly and helpful. Greatly disillusioned with the city, Eze longed to return to his beloved village! \n(a) State two experiences that Eze looked forward to. \n(b) Mention any two features of the city that Eze noticed at once \n(c) What two discoveries surprised and disappointed Eze when he arrived in the city? \n(d) Mention any two experiences in the city that Eze found unpleasant. \n(e) What conclusion did Eze draw from his experiences in. the city? \n(f) \" as a lark ...\" What figure of speech is contained in this expression? \n(g) \"When he arrived. in Lagos,...\" (i) What grammatical name is given to this expression as it is used in the passage? \n(ii) What is its function? . \n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage. (i) pictured; (ii) stuffy; (iii) invasion; (iv) hurried; (v) attraction; (vi) monotonous.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51303?exam_type=waec&type=theory&page=23",
    "correct_answer": "(a)(i) The good life of the city, (ii) A ride in a luxury bus.\n(b)(i) The large number of (desperate) people. (ii) The deafening noise of ceaseless (endless) traffic/ the noise of traffic/ the ceaseless traffic. (iii) Pollution / Decay (iv) Many dirty and 1 or crumbling (concrete) buildings. (v) Filth (everywhere)\n(c)(i) The city of Lagos was not as beautiful as he had imagined. (ii) His uncle lived in only one room (iii) His uncle lived in an unpleasant part of the city.\n(d)(i) He had a hot and / or stuffy night. (ii) There was no water for him to have a bath. (iii) He had a poor breakfast. (iv) He had an unpleasant ride in a molue bus/He encountered unpleasant fellow passengers in a molue bus.\n(e) (i) He concluded that life in his village was better than life in Lagos / the city of Lagos / the city.\n(f)The expression functions as simile\n(g)(i) The expression when he arrived in Lagos\" is an adverbial clause (of time) (ii) It modifies (the verb) \"was\" (h)(l) pictured - imagined thought of (ii) stuffy - airless. (iii) invasion - attack, influx, (iv) hurried- quick, rushed, hasty, (v) attraction - fascination, charm, allure lure. appeal, (vi) monotonous - dull. boring, uninterested, unexciting, drab. humdrum",
    "explanation": "(a)(i) The good life of the city, (ii) A ride in a luxury bus.\n(b)(i) The large number of (desperate) people. (ii) The deafening noise of ceaseless (endless) traffic/ the noise of traffic/ the ceaseless traffic. (iii) Pollution / Decay (iv) Many dirty and 1 or crumbling (concrete) buildings. (v) Filth (everywhere)\n(c)(i) The city of Lagos was not as beautiful as he had imagined. (ii) His uncle lived in only one room (iii) His uncle lived in an unpleasant part of the city.\n(d)(i) He had a hot and / or stuffy night. (ii) There was no water for him to have a bath. (iii) He had a poor breakfast. (iv) He had an unpleasant ride in a molue bus/He encountered unpleasant fellow passengers in a molue bus.\n(e) (i) He concluded that life in his village was better than life in Lagos / the city of Lagos / the city.\n(f)The expression functions as simile\n(g)(i) The expression when he arrived in Lagos\" is an adverbial clause (of time) (ii) It modifies (the verb) \"was\" (h)(l) pictured - imagined thought of (ii) stuffy - airless. (iii) invasion - attack, influx, (iv) hurried- quick, rushed, hasty, (v) attraction - fascination, charm, allure lure. appeal, (vi) monotonous - dull. boring, uninterested, unexciting, drab. humdrum",
    "year": "2004"
  },
  {
    "number": "113",
    "text": "Read the following passage carefully and answer the questions on it. \n\n      It is no longer news that the social and economic problems of African countries continue to worsen. What we experience daily  are the vicious consequences of unemployment, inadequate health and educational facilities, urban squalor resulting from a population bursting at the seams  and, most frightening of all, the rate at which crime is rising It is also no longer news that many Africans now see ''checking out\" of their countries for other supposedly better ones abroad as the only solution to the problems. In this regard, the United State, Britain, Canada, Germany and Italy are the hot favourites. Most of these Africans are usually so desperate to leave that they fall easy prey to all sorts of passport and visa fraud, and often end up smuggling themselves abroad at all costs. In such countries, they have to do all manner of menial jobs, sometimes resorting to criminal activities, and are often cut off completely from families and relations back home. Young girls who have been enticed  with assurances of a rosy future often end up in forced prostitution, with all its unpleasant consequences! \n      Is \"checking out\". the ideal solution to Africa's social and economic problems? Of course not! What is baffling is why Africans cannot see abandoning their countries as a step that holds out  no solution at all. All that they achieve, in fact, is the substitution of one set of problems for another! \n      What then should we do? We must look inwards for a more realistic solution. First, we must develop the will to tackle our problems. Where there is a will, it is said, there is a way. If we abandon our problems instead of tackling them on, we will simply be leaving an unpleasant legacy for future generations. Secondly, we must orient ourselves tows res self-reliance and self-employment, instead of looking helplessly to our embattled government for salaried employment, \n      Finally, we must seek a long-term solution by addressing the population question. It is obvious that Africa's outsize population is at the root of the problems. The question we should ask ourselves is. if the average family size in America or Britain were to be as large as the average African family, would these countries still be as attractive to us as they are now? The big puzzle is that we have adopted the white man's lifestyle in all other respects, but have made an exception of family size. \n(a) Mention two sequences of the usual desperation of Africans to leave their countries. \n(b) The writer argues that escaping abroad is not the ideal solution to Africa's problems. Quote one sentence from the passage that sums up the writer's recommended solution. \n(c)According to the writer, why should Africans solve their problems rather than avoid them? \n(d) What does the writer consider the most serious cause of African's problems? \n(e) What does the writer imply by using the word \"supposedly\" in the second paragraph? \n(f) \"What we experience daily . \" (i) What grammatical name is given to this expression as it is used in the passage? \n(ii) What is its function? \n(g) \" a population bursting at the seams \" What figure of speech is contained in this expression? \n(h) For each of the following words or phrases. find another word or phrase which means the same and which can replace it as it is used in the passage. (i) prey' (ii) enticed: (iii) ideal; (iv) holds out; (v) tackle: (vi) head-on.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51305?exam_type=waec&type=theory&page=23",
    "correct_answer": "(a)(i) They fall victim to (passport and visa) fraud (ii) They smuggle themselves out of their countries.\n(b) \"We must look inwards for a more realistic solution.\"\n(c) To avoid leaving an unpleasant legacy (for future generations).\n(d) Its large or outsize population. Or Its over-population\n(e) The author implies that these countries are no better than African countries.\n(f)(i) \"What we experience daily\" in the passage is a noun clause I nominal clause (ii) It functions as Subject of (the verb)\"are\"\n(g) \"... a population bursting at the seams \" in the passage is a metaphor\n(h)(i) Prey - victim, (ii) enticed - lured. attracted, seduced, (iii) ideal- best, perfect, most suitable, most appropriate, (iv) holds out - offers, proffers. promises, (v) tackle - face. confront, deal with, battle with, grapple with, (vi) head-on - directly, with determination, in earnest, earnestly, seriously, squarely",
    "explanation": "(a)(i) They fall victim to (passport and visa) fraud (ii) They smuggle themselves out of their countries.\n(b) \"We must look inwards for a more realistic solution.\"\n(c) To avoid leaving an unpleasant legacy (for future generations).\n(d) Its large or outsize population. Or Its over-population\n(e) The author implies that these countries are no better than African countries.\n(f)(i) \"What we experience daily\" in the passage is a noun clause I nominal clause (ii) It functions as Subject of (the verb)\"are\"\n(g) \"... a population bursting at the seams \" in the passage is a metaphor\n(h)(i) Prey - victim, (ii) enticed - lured. attracted, seduced, (iii) ideal- best, perfect, most suitable, most appropriate, (iv) holds out - offers, proffers. promises, (v) tackle - face. confront, deal with, battle with, grapple with, (vi) head-on - directly, with determination, in earnest, earnestly, seriously, squarely",
    "year": "2004"
  },
  {
    "number": "114",
    "text": "Read the following passage carefully and answer the questions on it. \n\n      For some, grass is just the green stuff outside the house that they have to mow. For farmers and football players, it is indispensable. For children it is the ideal playground. And those who live in most urban areas assume they have very little to do with grass of any sort. However, almost all of us have daily contact with some type of grass and the product made from it. \n      Grass makes up a major part of the vegetation that covers the earth And no wonder, since it is one of the most adaptable plant groups on earth, growing in polar regions and deserts in tropical rain forests, and on wind-swept mountain slopes. Entire vegetation areas are dominated by grass. \n      Unlike many other plants, grass grows, not at the tip but in growth areas above the nodes. New shoots might start from stems growing horizontally on or under the ground. So when the lawn mower or the cow cuts away the tip, or fire rages through a field. grass keeps growing whereas many other plants stop Furthermore. with most grasses, if the - stem is bent over by the wind or trodden underfoot, it can raise itself erect by growing faster on the side facing the ground. For these reasons, grass usually recovers quickly after being damaged. which gives it an edge over other plants in the fight for sunlight. \n      Grass is not only the most abundant but also the most important flowering plant family on earth. A botanist once described grass as the foundation of our food it is \"like a dam protecting mankind from famine.\" Try to remember what you ate today. Did you start with a bowl of cereal made with millet. rice, oats, or sorghum? Well, then, you ate grass seeds. Or perhaps you had a roll or other kind of bread. The flour used was made from grass kernels - wheat, rye, barley, and other grains are all grasses Cornflakes and other corn products are no exception. as corn or maize is a grass too. You had sugar in your tea or coffee? More than half of all sugar is made from sugarcane, a grass. \n      Grass is not only good for food, however. If your house has walls made of clay and straw, it is grass that gives them the necessary strength. In different parts of the world. roofs are thatched with grass. One of the advantages of such roofs is that they keep the interior of the buildings cool regardless of the external temperature. \n      Grass covers and adorns much of the earth. Apart from the beautiful, peaceful, and relaxing sight of a green meadow or a well-kept lawn, grass is a major oxygen supplier, because of the sheer mass of the green vegetation that it produces.\n      Finally, its fine roots perform the all-important function of protecting the soil from erosion. Keeping its versatility in mind we are not surprised to learn that the usage and cultivation of grass has a long history. The next time you see a waving cornfield, a lush green meadow, or just humble blades of grass growing between stones in a sidewalk, you might stop and think of this marvelous and most versatile plant family! \n(a) In two sentences, one for each, summarize the two reasons why grass forms a major part of the earth's vegetation. \n(b) In four sentences, one for each, summarize the four ways in which grass is useful to humans.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51307?exam_type=waec&type=theory&page=23",
    "correct_answer": "(a)(i) Grass is an adaptable plant Or Grass grows/can grow everywhere on earth (ii) Grass recovers quickly.\n(b)(i)Grass serves as food (for humans)/ Grass is a source of food. (ii) Grass is used for building houses\n(iii) Grass supplies oxygen. (iv) Grass adorns/ beautifies the earth (environment).\n(v) Grass or the roots of grass prevent / check erosion",
    "explanation": "(a)(i) Grass is an adaptable plant Or Grass grows/can grow everywhere on earth (ii) Grass recovers quickly.\n(b)(i)Grass serves as food (for humans)/ Grass is a source of food. (ii) Grass is used for building houses\n(iii) Grass supplies oxygen. (iv) Grass adorns/ beautifies the earth (environment).\n(v) Grass or the roots of grass prevent / check erosion",
    "year": "2004"
  }
]