[
  {
    "number": "55",
    "text": "Using the diagram as a guide, carry out the following instructions:\n\nFix a plain sheet of paper on the drawing board.\nPlace the rectangular glass prism on the paper and trace its outline, ABCD. Remove the prism.\nDraw a normal NMP to meet AB and DC at M and P respectively such that |AM| =|DP| = 2.0cm.\nTrace the ray PQ with two pins, P\\(_{1}\\), and P\\(_{2}\\), at P and Q respectively such that angle MPQ = i = 5º.\nReplace the prism on its outline. Trace the emergent ray with two other pins P\\(_{3}\\) and P\\(_{4}\\) such that they lie in a straight line with P\\(_{2}\\) and the image of P\\(_{1}\\) viewed through the glass prism.\nMeasure and record \\(\\theta\\), the angle between the emergent ray and the face AB of the glass prism.\nEvaluate cos \\(\\theta\\) and sin i.\nRepeat the procedure for four other values of i= 10°, 15°, 20°, and 25°. Tabulate your readings.\nPlot a graph of cos \\(\\theta\\) on the vertical axis against sin i on the horizontal axis.\nDetermine the slope of the graph.\nState two precautions taken to ensure accurate results.  Attach your traces to your answer booklet\n\n(b)i. State the laws of refraction of light.\nii. Explain what is meant by the statement the refractive index of a material is 1.65.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60110?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "56",
    "text": "Measure and record the length XY of the resistance wire provided.\nConnect the circuit shown in the diagram.\nWith R= O\\(\\Omega\\), close the key, K. Read and record the current 1\\(_{o}\\) and the voltage drop V\\(_{o}\\) across the resistance wire.\nSetting R = 1\\(\\Omega\\). close the key. Read and record the current, I, and the corresponding voltage drop, V across the wire.\nRepeat the procedure for five other values of R= 5, 10, 20, 40, and 60\\(\\Omega\\). Tabulate your readings.\nPlot a graph of V on the vertical axis against 1 on the horizontal axis.\nDetermine the slope of the graph\nState two precautions taken to ensure accurate results.\n\n(b)i. Mention and state the law on which the experiment in (a) is based.\nii. A piece of resistance vire of diameter 0.2 mm and resistance m has a resistivity of 8.8 x 10\\(^{-7}\\)\\(\\Omega\\)m, calculate the length of the Wire. [\\(\\pi\\) =\\(\\frac{22}{7}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60111?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  }
]