[
  {
    "number": "55",
    "text": "All your burette readings (initial and final), as well as the size of your pipette, must be recorded but no account or expeimental procedure is required. All calculations must be done in your answer book.\nA is 0.125 mol dm\\(^3\\) H\\(_2\\)SO\\(_4\\). B is a solution containing X g dm\\(^{-3}\\) of NaOH.\n(a) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portions of B using methyl orange as indicator. Record the volume of your pipette. Tabulate your burette readings and calculate the average volume of A used. The equation for the reaction involved in the titration is H\\(_2\\)SO\\(_4\\) +2NaOH\\(_{(aq)}\\) \\(\\to\\) Na\\(_2\\)SO\\(_4\\) + 2H\\(_2\\)O\\(_{(l)}\\)\n(b) From your results and the information provided above, calculate the;\n(i) amount of H\\(_2\\)SO\\(_4\\) in the average volume of A used\n(ii) Concentration of B in mol dm\\(^{-3}\\)\n(iii) value of X.\n[H = 1: O = 16; Na = 23]\n \n(c) Describe briefly a suitable laboratory procedure for obtaining pure water from the titration mixture. (No diagram is required)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60106?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "56",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely recorded and for accurate inferences. All tests, observations, and inferences must be clearly entered in your answer book, in ink, at the i.itne time they are made.\nC is a sample of copper (II) tetraoxosulphate (VI) crystals. Carry out the following exercises on C. Record your observations and identify any gases evolved. State the conclusion you draw from the result of each test.\n(a) Put half of C in a test tube and heat strongly\n(b) Make solution of about 10 cm\\(^{-3}\\) with the sécond half of C and divide it into three portions\n(i) To the first portion, add Sodium hydroxide solution in drops and then in excess. Heat the mixture\n(ii) To the second portion, add aqueous ammonia in drops and then in excess followed by few drops of moderately concentrated HCI.\n(iii) To the third portion, add all the zinc dust provided and stir thoroughly until there is a visible change.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60108?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "57",
    "text": "(a) Suggest how the following liquid reagents can be suitably stored in the laboratory   \n(i) X which fumes in moist air; \n(ii) Y which is slowly decomposed by sunlight in ordinary reagent bottles.\n \n(b) State what is observed when aqueous ammonia is added to:\n(i) litmus paper;\n(ii) Pb(NO\\(_3\\))\\(_2\\) solution in drops until in excess\n(iii) freshly precipitated AgCI in excess.\n \n(c) A salt sample was suspected to be either Na\\(_2\\)CO\\(_2\\) or NaHCO\\(_3\\). A student who was required to identify it tested a portion for solubility in water and then for effect on litmus paper.\n(i) What was observed in each case?\n(ii) Give the reason why the student's procedure was unsuitable\n(iii) Describe briefly how you would have identified the salt.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60109?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  }
]