[
  {
    "number": "135",
    "text": "(a) Name two farm animals possessing specimen A.\n(b) State two methods of removing specimen A from the animals possessing it.\n(c) Mention three methods of rearing specimen B.\n(d) State six characteristic features which would make a farmer decide to cull specimen B.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/63760?exam_type=waec&type=practical&page=27",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "136",
    "text": "(a) State each of the disease conditions observed on specimens C and D and their causative agents.\n(b) Explain the mode of transmission of the diseases on each of specimens C and D. (C) State two effects of each of the diseases on specimens C and D and two control measures of each.\n(d) Name two other diseases of specimen D.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/63769?exam_type=waec&type=practical&page=28",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "137",
    "text": "(a) State four effects of specimen E on farm animals\n(b) Name the primary and intermediate host of specimen E,\n(c) State three adaptive features of specimen F which enable it to survive in Its host\n(d) State three control measures of each of specimens E and F in livestock management",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/63772?exam_type=waec&type=practical&page=28",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "138",
    "text": "(a) ldentify specimens G, H and I.\n(b) Give two observable physical properties of each.\n(c) State two main nutrients supplied by each of the specimens H and l.\n(d) State two methods of application of specimen C on the field.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/63773?exam_type=waec&type=practical&page=28",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  }
]