[
  {
    "number": "59",
    "text": "AFRICAN DRAMA; Athol Fugard: Sizwe Bansi is Dead.\nDiscuss the dramatic techniques used in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52576?exam_type=waec&type=theory&page=12",
    "correct_answer": "The Dramatic Technique used in the play is mimicry.\nMimicry is used as a vehicle of comedy. The effect of mimicry is brought out in the narratives of Styles and Buntu. Through the use of mimicry, Styles and Buntu are able to act the roles of their characters without losing the thread of their narratives and also sustain the attention of the audience.  Another techniques is the use of the dramatic monologue. Most of what Styles tells the audience in the first half of the play is said in monologue. Every aspect of his narrative is dramatized and gives us an indication of setting and time.Flashback is extensively used in the play. Flashback not only provides background information to the action of stage, but, also provides insight into the seamy side of apartheid.Symbolism is also used in the play.\n(a) Styles' photographic studio symbolizes the place where the dreams of the downtrodden blacks are recreated to give them a sense of self importance and meaning in life. The camera is a symbol of art. Through it the neglected dreams, aspirations and history of the black South African are captured and maintained.\n(b) There is also the symbol of the newspaper which reinforces those images captured by the camera.\n(c) Candidates may also refer to the symbolic presentation of the war on cockroaches as well as the passbook. Both enact the dehumanization of the blacks by the whites.\nThe epistolary style is another technique used. This is seen in Sizwe's letter to his wife, Nowetu. It is mnemoni and helps to record as well as recreate the apartheid experience. Comedy is also used to ridicule the racist regime and its assumed sense of white supremacy. There is comedy the mimicry of Styles and Buntu, in the speech of \"Bass\" Bradley to the black workers at Ford Motors, in the war on xckroaches, in the infectious laughter of Styles and in the use of invectives.",
    "explanation": "The Dramatic Technique used in the play is mimicry.\nMimicry is used as a vehicle of comedy. The effect of mimicry is brought out in the narratives of Styles and Buntu. Through the use of mimicry, Styles and Buntu are able to act the roles of their characters without losing the thread of their narratives and also sustain the attention of the audience.  Another techniques is the use of the dramatic monologue. Most of what Styles tells the audience in the first half of the play is said in monologue. Every aspect of his narrative is dramatized and gives us an indication of setting and time.Flashback is extensively used in the play. Flashback not only provides background information to the action of stage, but, also provides insight into the seamy side of apartheid.Symbolism is also used in the play.\n(a) Styles' photographic studio symbolizes the place where the dreams of the downtrodden blacks are recreated to give them a sense of self importance and meaning in life. The camera is a symbol of art. Through it the neglected dreams, aspirations and history of the black South African are captured and maintained.\n(b) There is also the symbol of the newspaper which reinforces those images captured by the camera.\n(c) Candidates may also refer to the symbolic presentation of the war on cockroaches as well as the passbook. Both enact the dehumanization of the blacks by the whites.\nThe epistolary style is another technique used. This is seen in Sizwe's letter to his wife, Nowetu. It is mnemoni and helps to record as well as recreate the apartheid experience. Comedy is also used to ridicule the racist regime and its assumed sense of white supremacy. There is comedy the mimicry of Styles and Buntu, in the speech of \"Bass\" Bradley to the black workers at Ford Motors, in the war on xckroaches, in the infectious laughter of Styles and in the use of invectives.",
    "year": "2006"
  },
  {
    "number": "60",
    "text": "AFRICAN DRAMA Athol Fugard: Sizwe Bansi is Dead\nComment on the theme of the search for identity in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52578?exam_type=waec&type=theory&page=12",
    "correct_answer": "Comment on the theme of the search for identity in the play.central to the play is the theme of the search for identity. The cruel system of apartheid pitched against the black man has not only destroyed him psychologically, it has succeeded in eroding the fundamental aspects of his personality that go to make up his identity - self-respect, pride, dignity, status, etc.\nMost of the characters in the play are caught up in the complex web of character denigration to the point where they have accepted it as a way of life or at most look for corrupt ways around their predicament. Zola houses Sizwe illegally and when caught in one of the police raids is forced to go and live with Buntu. Buntu is compelled by economic exigencies to father only one child who does not even live with them because his wife works as a live-in maid and only mimes over for weekends. Outa Jacob's sad story of labour, rejection and death adds to the tale of woe for the Blackman, and Sizwe Bansi's coming over to Port Elizabeth is also fated to go through similar, if not worse, experiences, even after the corrupt acquisition of Robert's passbook. If Styles is redeemed by his singular act of setting up his own office in order to regain his self-respect, Zola, Buntu, Sizwe and others are doomed to follow the path of Outa Jacob.\nThe encounter of Sizwe and Buntu with the dead body of Robert Zwelinzima highlights the theme of the search for identity. The crucial point here is that the passbook has been used as a tool of denying the Blackman of an identity. The Blackman is no longer a living being with a personality and an identity, he is a piece of information kept in a computer. So the death of Robert Zwelinzima and the resurrection of Sizwe in his stead symbolizes the death of the identity of every Blackman in South Africa and their concomitant existences as ghosts. Buntu tells Sizwe: When his little child calls you 'Boy' You a man circumcised with a wife and four children Isn't that a ghost? .... Be a real ghost\" the point here is that a man's identity encompasses his dignity, self-respect and pride which if he is bereft of, he :eases to exist. Sizwe's confusion in asking Buntu \"I'm all mixed up. Who am I?\" is quite significant in bringing out the identity crisis that faces every South African. Style's photographic studio is very important in restoring the denigrated image or identity of the black man. Quite significantly, it is the Blackman's picture which is used to represent his identity in his passbook; therefore, the pictures Styles takes of the Blackman are a complementary effort to rebuild the image of the Blackman and place him in the ght perspective in the history of South Africa. Styles himself tells us: This world and its laws allows us nothing, except ourselves. There is nothing we can leave behind when we die except ale memory of ourselves\" there is certainly a distinction between the way the Blackman wants to be regarded and the way he is perceived by the white man. It is this, more than anything else, that forms the basis of the identity crisis in the play.",
    "explanation": "Comment on the theme of the search for identity in the play.central to the play is the theme of the search for identity. The cruel system of apartheid pitched against the black man has not only destroyed him psychologically, it has succeeded in eroding the fundamental aspects of his personality that go to make up his identity - self-respect, pride, dignity, status, etc.\nMost of the characters in the play are caught up in the complex web of character denigration to the point where they have accepted it as a way of life or at most look for corrupt ways around their predicament. Zola houses Sizwe illegally and when caught in one of the police raids is forced to go and live with Buntu. Buntu is compelled by economic exigencies to father only one child who does not even live with them because his wife works as a live-in maid and only mimes over for weekends. Outa Jacob's sad story of labour, rejection and death adds to the tale of woe for the Blackman, and Sizwe Bansi's coming over to Port Elizabeth is also fated to go through similar, if not worse, experiences, even after the corrupt acquisition of Robert's passbook. If Styles is redeemed by his singular act of setting up his own office in order to regain his self-respect, Zola, Buntu, Sizwe and others are doomed to follow the path of Outa Jacob.\nThe encounter of Sizwe and Buntu with the dead body of Robert Zwelinzima highlights the theme of the search for identity. The crucial point here is that the passbook has been used as a tool of denying the Blackman of an identity. The Blackman is no longer a living being with a personality and an identity, he is a piece of information kept in a computer. So the death of Robert Zwelinzima and the resurrection of Sizwe in his stead symbolizes the death of the identity of every Blackman in South Africa and their concomitant existences as ghosts. Buntu tells Sizwe: When his little child calls you 'Boy' You a man circumcised with a wife and four children Isn't that a ghost? .... Be a real ghost\" the point here is that a man's identity encompasses his dignity, self-respect and pride which if he is bereft of, he :eases to exist. Sizwe's confusion in asking Buntu \"I'm all mixed up. Who am I?\" is quite significant in bringing out the identity crisis that faces every South African. Style's photographic studio is very important in restoring the denigrated image or identity of the black man. Quite significantly, it is the Blackman's picture which is used to represent his identity in his passbook; therefore, the pictures Styles takes of the Blackman are a complementary effort to rebuild the image of the Blackman and place him in the ght perspective in the history of South Africa. Styles himself tells us: This world and its laws allows us nothing, except ourselves. There is nothing we can leave behind when we die except ale memory of ourselves\" there is certainly a distinction between the way the Blackman wants to be regarded and the way he is perceived by the white man. It is this, more than anything else, that forms the basis of the identity crisis in the play.",
    "year": "2006"
  },
  {
    "number": "61",
    "text": "AFRICAN DRAMA; Joe De Graft Sons and Daughters \n\"Our society is sold on money: nothing is worth anything unless it brings money.\" How does this state ment reflect an aspect of the conflict in the play?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52580?exam_type=waec&type=theory&page=13",
    "correct_answer": "\"Our society is sold on money nothing is worth anything unless it brings money\". How does this state-ment reflect an aspect of the conflict in the play?\nThis statement is made by Aaron Ofosu, one of the youngest children of James Ofosu, out of frustration and anger. James Ofosu who is the father, is not well educated but is hardworking, determined and a self-made businessman. He -Las great plans for his children, Aaron and Maanan. The conflict begins when Aaron and Maanan reject their father's choice for them to become \"professional men and women\". James views this rejection as disobedience. Aaron wants to be an artist and Maanan a dancer. According to their father, painting or Art is not work and frowns on it. He also disapproves of Maanan taking up dancing as a career. He is therefore disappointed because he works hard \"to give them the best profession that any rich man's children can have\". His main reason for rejecting Aaron's choice to become an artist is money. His son will not make enough money if he is a painter. In Maanan's case, dancing is for illiterate girls and women. As a loving and caring father, he has spent a lot of money on her education, paying boarding fees at Achimota, one of the most expensive and prestigious boarding schools in Ghana. In his opinion, Art and Dancing are not respectable professions. He does not have half of the opportunities that he is now offering to his son and so he feels disappointed that Aaron does not appreciate his efforts to fit him into \"a respectable profession\". Teaching is not a respectable profession either, for, teachers are not paid for their services:\n\"the measure of a man's importance in any community is how much that community is prepared to pay him for his services\"\nHe also adds:\"the first lesson that anybody who wants to get on in life must learn is, Yes, money. Money is what matters, money is power! Money rules the world\" James is not convinced that there could be money in painting, when his first son mentions that Portrait Painters make quite a lot of money. In the end, he is persuaded to change his mind when he hears over the radio that a painting has been bought for two hundred and twenty pounds! In the end, the play upholds the children's view that one should do what one loves to do and not for money.",
    "explanation": "\"Our society is sold on money nothing is worth anything unless it brings money\". How does this state-ment reflect an aspect of the conflict in the play?\nThis statement is made by Aaron Ofosu, one of the youngest children of James Ofosu, out of frustration and anger. James Ofosu who is the father, is not well educated but is hardworking, determined and a self-made businessman. He -Las great plans for his children, Aaron and Maanan. The conflict begins when Aaron and Maanan reject their father's choice for them to become \"professional men and women\". James views this rejection as disobedience. Aaron wants to be an artist and Maanan a dancer. According to their father, painting or Art is not work and frowns on it. He also disapproves of Maanan taking up dancing as a career. He is therefore disappointed because he works hard \"to give them the best profession that any rich man's children can have\". His main reason for rejecting Aaron's choice to become an artist is money. His son will not make enough money if he is a painter. In Maanan's case, dancing is for illiterate girls and women. As a loving and caring father, he has spent a lot of money on her education, paying boarding fees at Achimota, one of the most expensive and prestigious boarding schools in Ghana. In his opinion, Art and Dancing are not respectable professions. He does not have half of the opportunities that he is now offering to his son and so he feels disappointed that Aaron does not appreciate his efforts to fit him into \"a respectable profession\". Teaching is not a respectable profession either, for, teachers are not paid for their services:\n\"the measure of a man's importance in any community is how much that community is prepared to pay him for his services\"\nHe also adds:\"the first lesson that anybody who wants to get on in life must learn is, Yes, money. Money is what matters, money is power! Money rules the world\" James is not convinced that there could be money in painting, when his first son mentions that Portrait Painters make quite a lot of money. In the end, he is persuaded to change his mind when he hears over the radio that a painting has been bought for two hundred and twenty pounds! In the end, the play upholds the children's view that one should do what one loves to do and not for money.",
    "year": "2006"
  },
  {
    "number": "62",
    "text": "AFRICAN DRAMA; Joe De Graft Sons and Daughters \nDiscuss the character and role of Hannah in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52581?exam_type=waec&type=theory&page=13",
    "correct_answer": "The character and role of Hannah in the play Hannah Ofosu is the wife of James and the mother of George, Aaron and Maanan. Hannah typifies the traditional African woman, homely, courteous and concerned about her children's welfare. Unlike her husband James, Hannah readily copes with the generation gap between parents and their children in the light of social change.\nHannah is loving and shows understanding towards the children and their personal problems especially with regards to their choice of career. She accommodates their friend, Awere, whom James does not want to see around the house, harbouring the belief that Awere is a bad influence on Aaron. Hannah is very observant. It takes her 'eagle eyes' to detect that Maanan is not happy working in Lawyer Bonu's office and this presents her as a caring mother. Maanan confildes in her by pouring out her heart about Bonu's harassment.\nAs a caring and loving wife, she welcomes her husband home warmly, taking his briefcase, offering him a glass of water and asking after his business. All this affirm her role as a caring respectful wife. For example, she makes sure the family's meals are ready on time and she is tolerant enough to put up with her husband's domineering elder sister, Fosuwa, but not to the detriment of her family's interest. Her assertiveness is highlighted in the way she defends the innocent relationship between Maanan and Awere against aunt Fosuwa's insinuations that they are lovers.\nShe is independent-minded and therefore complains about living in the same family house with the extended gift relations, especially the nosy aunt Fosuwa. She wants a cordial relationship between the children and their father and so it takes time to make James understand the youth and their problems. Her roles in the play.\nThrough Hannah, the, conflict in the play is resolved as she discovers the true identity of Lawyer Bonu. She provides a conducive home atmosphere for both her husband and the children to argue out their points to a meaningful conclusion. Indeed, she is the 'shoulder' on which all lean to air and resolve their divergent views.\nShe is used by the playwright to actualize the theme of the play, that is, that a balance can be struck between Bol two different generations in the light of rapid social change. `.ha Having played the role of a trouble shooter, she is an example of the ideal traditional mother and wife.",
    "explanation": "The character and role of Hannah in the play Hannah Ofosu is the wife of James and the mother of George, Aaron and Maanan. Hannah typifies the traditional African woman, homely, courteous and concerned about her children's welfare. Unlike her husband James, Hannah readily copes with the generation gap between parents and their children in the light of social change.\nHannah is loving and shows understanding towards the children and their personal problems especially with regards to their choice of career. She accommodates their friend, Awere, whom James does not want to see around the house, harbouring the belief that Awere is a bad influence on Aaron. Hannah is very observant. It takes her 'eagle eyes' to detect that Maanan is not happy working in Lawyer Bonu's office and this presents her as a caring mother. Maanan confildes in her by pouring out her heart about Bonu's harassment.\nAs a caring and loving wife, she welcomes her husband home warmly, taking his briefcase, offering him a glass of water and asking after his business. All this affirm her role as a caring respectful wife. For example, she makes sure the family's meals are ready on time and she is tolerant enough to put up with her husband's domineering elder sister, Fosuwa, but not to the detriment of her family's interest. Her assertiveness is highlighted in the way she defends the innocent relationship between Maanan and Awere against aunt Fosuwa's insinuations that they are lovers.\nShe is independent-minded and therefore complains about living in the same family house with the extended gift relations, especially the nosy aunt Fosuwa. She wants a cordial relationship between the children and their father and so it takes time to make James understand the youth and their problems. Her roles in the play.\nThrough Hannah, the, conflict in the play is resolved as she discovers the true identity of Lawyer Bonu. She provides a conducive home atmosphere for both her husband and the children to argue out their points to a meaningful conclusion. Indeed, she is the 'shoulder' on which all lean to air and resolve their divergent views.\nShe is used by the playwright to actualize the theme of the play, that is, that a balance can be struck between Bol two different generations in the light of rapid social change. `.ha Having played the role of a trouble shooter, she is an example of the ideal traditional mother and wife.",
    "year": "2006"
  },
  {
    "number": "63",
    "text": "NON-AFRICAN DRAMA; Nikolai Gogol: The Government Inspector \nDiscuss the theme of corruption in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52582?exam_type=waec&type=theory&page=13",
    "correct_answer": "The theme of corruption in the play\nIn this play, a penniless young traveler is mistaken for a government inspector from St. Petersburg by the Mayor and his officials. The Mayor and his officials are easily fooled because of guilt caused by their corrupt practices. The play therefore highlights the corrupt practices of the Mayor and his officials which render them vulnerable to panic and consequently, easily taken in by the fake 'Inspector General'.\n(i) Both the mayor and his officials are corrupt. They handle government affairs with nonchalance. They display lackadaisical and hypocritical behaviour towards their duties to the government and the people.\n(ii) The Mayor condones the negligence of duty among his officials and this leads to the great panic which makes them mistake a common traveler (Hlestakov) for the Inspector General.\n(iii) The Mayor orders the postmaster to unseal every letter passing through the post-office and read through it for any implicating information or petition.\n(iv) The Mayor starves the convicts and orders the flogging of the sergeant's wife. He knows that the streets are dirty and the whole town is like a `pothouse' but does nothing about it.\n(v) The Mayor and his officials see the proposed visit of the Government Inspector as a punishment for their corrupt practices and that is why they bribe the Government Inspector. Other instances of corruption perpetrated in the play include the following\nThe judge takes bribes.The post-master has been opening and reading people's letters.The Charity Commissioner pays lip service to his job; he does not care whether the patients get well or not before they are discharged since the doctor does not understand a word of the Russian Language.The School Superintendent condones the teachers' unorthodox approach to teaching since he cannot control them.The Mayor gets the police superintendent to accept that the police are perfectly contented' when they are not.The Mayor engages in petty dealings with the traders and orders soldiers to harass them. He collects their goods without paying and compels them to pay tributes to him on All Saints days.The Mayor's handling of the supposed Government Inspector (Hlestakov) clearly shows how deeply corruption has eaten into the system. The Mayor lures Hlestakov to his house as an important guest and this proves his undoing as Helestakov woos his daughter (Marya) after flirting with his wife (Anna)All the officials bribe Hlestakov in the form of 'loans' in order not to have the skeletons in their cupboards exposed.",
    "explanation": "The theme of corruption in the play\nIn this play, a penniless young traveler is mistaken for a government inspector from St. Petersburg by the Mayor and his officials. The Mayor and his officials are easily fooled because of guilt caused by their corrupt practices. The play therefore highlights the corrupt practices of the Mayor and his officials which render them vulnerable to panic and consequently, easily taken in by the fake 'Inspector General'.\n(i) Both the mayor and his officials are corrupt. They handle government affairs with nonchalance. They display lackadaisical and hypocritical behaviour towards their duties to the government and the people.\n(ii) The Mayor condones the negligence of duty among his officials and this leads to the great panic which makes them mistake a common traveler (Hlestakov) for the Inspector General.\n(iii) The Mayor orders the postmaster to unseal every letter passing through the post-office and read through it for any implicating information or petition.\n(iv) The Mayor starves the convicts and orders the flogging of the sergeant's wife. He knows that the streets are dirty and the whole town is like a `pothouse' but does nothing about it.\n(v) The Mayor and his officials see the proposed visit of the Government Inspector as a punishment for their corrupt practices and that is why they bribe the Government Inspector. Other instances of corruption perpetrated in the play include the following\nThe judge takes bribes.The post-master has been opening and reading people's letters.The Charity Commissioner pays lip service to his job; he does not care whether the patients get well or not before they are discharged since the doctor does not understand a word of the Russian Language.The School Superintendent condones the teachers' unorthodox approach to teaching since he cannot control them.The Mayor gets the police superintendent to accept that the police are perfectly contented' when they are not.The Mayor engages in petty dealings with the traders and orders soldiers to harass them. He collects their goods without paying and compels them to pay tributes to him on All Saints days.The Mayor's handling of the supposed Government Inspector (Hlestakov) clearly shows how deeply corruption has eaten into the system. The Mayor lures Hlestakov to his house as an important guest and this proves his undoing as Helestakov woos his daughter (Marya) after flirting with his wife (Anna)All the officials bribe Hlestakov in the form of 'loans' in order not to have the skeletons in their cupboards exposed.",
    "year": "2006"
  },
  {
    "number": "64",
    "text": "NON-AFRICAN DRAMA;  Nikolai Gogol: The Government Inspector  \nExamine the satire in the play. Robert Bolt",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52583?exam_type=waec&type=theory&page=13",
    "correct_answer": "The Satire in the play\nThe play ridicules the corrupt nature of Russian society during the period of Nicholas I. The inadequacies of the Mayor, the highest government officials and those of his officials in the province are exposed through satire and irony.\nThe general uneasiness, guilt and fear of all the stakeholders (the Mayor, the Judge, the Charity Commissioner, the School Superintendent) when they receive the news of the inspector's visit proves that they are very corrupt.\nThe following illustrations bring out the satire in the play:\nThe established institutions, represented by the Mayor.The following are his words: • know you are like the rest us... you don't like to lose what swims into your hands\".His advice to his official is that they should hide their corrupt ways.I warn you to take precautions\".We also find the Mayor telling the supposed Government Inspector, Hlestakov not to listen to the complaints of the traders against him.\ne further invites him to his home and is ready to give him his daughter's hand in marriage, if that will make him more powerful in the Province. In all these, the Mayor's utterances and actions are a far cry from what he is expected :j do for his people. The role of the Charity Commissioner who is not after the people's welfare. ....we don't bother with expensive medicines! .... If they get better, they get better! ....\". He directs that patient's records of ailments and admission be taken just for the purpose of the inspector's visit.\nThe playwright does not spare his satire on the Mayor's instructions to the other officials like the judge who is to keep the Courthouse clean and the postmaster, to open people's letters. These expose and ridicule the laxity of these officials who handle official matter.\nThe bribes given in the form of loans to the supposed Government Inspector to keep him away from prying into the conduct of good business - proof that corruption is endemic in the society. The roles of Hlestakov and his servant Yosif, the Mayor's wife and daughter, all add to the satire of the play. Everyone believes that Hlestakov is the Government Inspector. They realize their mistake too late to recover their gifts or loans and even their honour.",
    "explanation": "The Satire in the play\nThe play ridicules the corrupt nature of Russian society during the period of Nicholas I. The inadequacies of the Mayor, the highest government officials and those of his officials in the province are exposed through satire and irony.\nThe general uneasiness, guilt and fear of all the stakeholders (the Mayor, the Judge, the Charity Commissioner, the School Superintendent) when they receive the news of the inspector's visit proves that they are very corrupt.\nThe following illustrations bring out the satire in the play:\nThe established institutions, represented by the Mayor.The following are his words: • know you are like the rest us... you don't like to lose what swims into your hands\".His advice to his official is that they should hide their corrupt ways.I warn you to take precautions\".We also find the Mayor telling the supposed Government Inspector, Hlestakov not to listen to the complaints of the traders against him.\ne further invites him to his home and is ready to give him his daughter's hand in marriage, if that will make him more powerful in the Province. In all these, the Mayor's utterances and actions are a far cry from what he is expected :j do for his people. The role of the Charity Commissioner who is not after the people's welfare. ....we don't bother with expensive medicines! .... If they get better, they get better! ....\". He directs that patient's records of ailments and admission be taken just for the purpose of the inspector's visit.\nThe playwright does not spare his satire on the Mayor's instructions to the other officials like the judge who is to keep the Courthouse clean and the postmaster, to open people's letters. These expose and ridicule the laxity of these officials who handle official matter.\nThe bribes given in the form of loans to the supposed Government Inspector to keep him away from prying into the conduct of good business - proof that corruption is endemic in the society. The roles of Hlestakov and his servant Yosif, the Mayor's wife and daughter, all add to the satire of the play. Everyone believes that Hlestakov is the Government Inspector. They realize their mistake too late to recover their gifts or loans and even their honour.",
    "year": "2006"
  },
  {
    "number": "65",
    "text": "NON-AFRICAN DRAMA; Robert Bolt: A Man For All Seasons\nWhat aspects of the Duke of Norfolk's character are revealed by his relationship with More?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52584?exam_type=waec&type=theory&page=13",
    "correct_answer": "Duke of Norfolk's character art revealed by her relationship with More. The Duke of Norfolk (Thomas Howard) has been a staunch and sympathetic friend of More's for many years. He visits More at the opening of the play where Rich is introduced to him by chance as an applicant. He eventually finds Rich employment in an effort to please More.\nTheir friendship becomes strained on the matter of the king's divorce bid and subsequent re-marriage to Anne Boleyn, Norfolk's niece. The Duke contends that More's opposition to the bid is mere theory and absurd. This proves :hat he is a man of principles. He so well understands More that he can predict his movements.\nHe never wavers in his love and sympathy for More despite their differences on the king's issue. He shows more :oncern for More when he resigns the chancellorship on the firm belief that the action of the king does not lead to a reformation but to war against the church.\nAfter Cromwell's interrogation of More at Hamption Court, the Duke speaks repeatedly in More's defence urging him to \"for think and repent of his obstinate opinions. It is only when Cromwell speaks threateningly of the king's wishes that the Duke appears to acquiesce in the matter of More's persecution. Again, this shows that he, Duke, takes their friendship seriously.\nThe Duke again after More's interrogation advises him to accede to the king's wishes.\nIn fury More insults the Duke but the Duke still manages to show considerable patience before finally losing his temper. At the Seventh Court Commission hearing the Duke and Cromwell almost quarrel openly at the manner in which. Cromwell is questioning the accused man.\nDuring More's trial for high treason, the Duke appears more considerate and restrained than Cromwell. He re-states that More's life is in his own hands as it has always been hoping and pleading that More should shift ground but to no avail.\nIt is logical from the above to conclude that the Duke's relationship with More is sustained to the end. Ironically, he has the unfortunate responsibility of presiding over More's trial for high treason and pronouncing the death sentence.",
    "explanation": "Duke of Norfolk's character art revealed by her relationship with More. The Duke of Norfolk (Thomas Howard) has been a staunch and sympathetic friend of More's for many years. He visits More at the opening of the play where Rich is introduced to him by chance as an applicant. He eventually finds Rich employment in an effort to please More.\nTheir friendship becomes strained on the matter of the king's divorce bid and subsequent re-marriage to Anne Boleyn, Norfolk's niece. The Duke contends that More's opposition to the bid is mere theory and absurd. This proves :hat he is a man of principles. He so well understands More that he can predict his movements.\nHe never wavers in his love and sympathy for More despite their differences on the king's issue. He shows more :oncern for More when he resigns the chancellorship on the firm belief that the action of the king does not lead to a reformation but to war against the church.\nAfter Cromwell's interrogation of More at Hamption Court, the Duke speaks repeatedly in More's defence urging him to \"for think and repent of his obstinate opinions. It is only when Cromwell speaks threateningly of the king's wishes that the Duke appears to acquiesce in the matter of More's persecution. Again, this shows that he, Duke, takes their friendship seriously.\nThe Duke again after More's interrogation advises him to accede to the king's wishes.\nIn fury More insults the Duke but the Duke still manages to show considerable patience before finally losing his temper. At the Seventh Court Commission hearing the Duke and Cromwell almost quarrel openly at the manner in which. Cromwell is questioning the accused man.\nDuring More's trial for high treason, the Duke appears more considerate and restrained than Cromwell. He re-states that More's life is in his own hands as it has always been hoping and pleading that More should shift ground but to no avail.\nIt is logical from the above to conclude that the Duke's relationship with More is sustained to the end. Ironically, he has the unfortunate responsibility of presiding over More's trial for high treason and pronouncing the death sentence.",
    "year": "2006"
  },
  {
    "number": "66",
    "text": "NON-AFRICAN DRAMA; Robert Bolt: A Man For All Season\n Discuss the conflict between Sir Thomas More and the authorities.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52585?exam_type=waec&type=theory&page=14",
    "correct_answer": "The conflict between Sir Thomas More and the authorities. The conflict between Sir Thomas More and the authorities in the play is very significant. It is through this conflict that Robert Bolt works out his principal themes; it is also this conflict which reveals the aspects of Thomas More's character that makes him \"a man for all seasons\". This conflict further shows the extent to which men could go in order to achieve their selfish ends.\nThe major conflict in the play, that between Sir Thomas and the authorities can be regarded as that between private judgment (represented by Sir Thomas) and constituted authority (represented by the king, Cromwell, Norfolk, Rich and others). The conflict comes to a head over Sir, Thomas' refusal to take an oath acquiescing to the Act of Succession passed by parliament. The Act conflicts with More's conscience. He has been clear all alone on his attitude to the king's intentions to divorce Catherine and marry Anne. Perhaps a little naively, More makes his stand clear during the king's visit to him, at the risk of offending Henry. Naive More may be, but we are impressed by his sincerity and honesty. An oath is important to him, and does not see how he could take the oath glibly without risking damnation.\nThe themes of sincerity, honesty and dignity are in focus here. It is clear from More's arguments that he is not refusing to give his consent out of personal spite. He loves the king and his country. He does not relish giving up his position of honour. As he sees it, there is nothing he can do about it. More puts his faith in the law even though he is perceptive enough to realize that evil men might twist the law to suit their purpose. He holds on firmly to both religious and moral principles even though he finds himself in a cynical world in which every man has his price. He is in a world in which the Thomas More are hopelessly and outrageously outnumbered by the Richard Riches, the Cromwells and the Norfolks. He succumbs when Rich testifies against him. The betrayal is too much for him to bear. He is indeed \"a man for all seasons\" because his character is untainted no matter the circumstances in which he finds himself.\nThe forces raging against More are formidable. Authority is embodied in the person of the king who by the time More goes on trial is head of the church and state. The king appears only a couple of times but he leaves one with the impression of a rugged and determined man who will ignore the niceties of conscience in order to achieve his objectives. On the king's side, are Norfolk, Cromwell and Rich. These men demonstrate moral degeneration of the most odious kind. Rich in particular appears hideously tainted because of his betrayal of More's trust. Cromwell is an opportunist and an instrument of the king. Norfolk is not man enough to follow the dictates of his conscience and allows himself to be manipulated by the king.",
    "explanation": "The conflict between Sir Thomas More and the authorities. The conflict between Sir Thomas More and the authorities in the play is very significant. It is through this conflict that Robert Bolt works out his principal themes; it is also this conflict which reveals the aspects of Thomas More's character that makes him \"a man for all seasons\". This conflict further shows the extent to which men could go in order to achieve their selfish ends.\nThe major conflict in the play, that between Sir Thomas and the authorities can be regarded as that between private judgment (represented by Sir Thomas) and constituted authority (represented by the king, Cromwell, Norfolk, Rich and others). The conflict comes to a head over Sir, Thomas' refusal to take an oath acquiescing to the Act of Succession passed by parliament. The Act conflicts with More's conscience. He has been clear all alone on his attitude to the king's intentions to divorce Catherine and marry Anne. Perhaps a little naively, More makes his stand clear during the king's visit to him, at the risk of offending Henry. Naive More may be, but we are impressed by his sincerity and honesty. An oath is important to him, and does not see how he could take the oath glibly without risking damnation.\nThe themes of sincerity, honesty and dignity are in focus here. It is clear from More's arguments that he is not refusing to give his consent out of personal spite. He loves the king and his country. He does not relish giving up his position of honour. As he sees it, there is nothing he can do about it. More puts his faith in the law even though he is perceptive enough to realize that evil men might twist the law to suit their purpose. He holds on firmly to both religious and moral principles even though he finds himself in a cynical world in which every man has his price. He is in a world in which the Thomas More are hopelessly and outrageously outnumbered by the Richard Riches, the Cromwells and the Norfolks. He succumbs when Rich testifies against him. The betrayal is too much for him to bear. He is indeed \"a man for all seasons\" because his character is untainted no matter the circumstances in which he finds himself.\nThe forces raging against More are formidable. Authority is embodied in the person of the king who by the time More goes on trial is head of the church and state. The king appears only a couple of times but he leaves one with the impression of a rugged and determined man who will ignore the niceties of conscience in order to achieve his objectives. On the king's side, are Norfolk, Cromwell and Rich. These men demonstrate moral degeneration of the most odious kind. Rich in particular appears hideously tainted because of his betrayal of More's trust. Cromwell is an opportunist and an instrument of the king. Norfolk is not man enough to follow the dictates of his conscience and allows himself to be manipulated by the king.",
    "year": "2006"
  },
  {
    "number": "67",
    "text": "AFRICAN POETRY\n How does Rubadiri present the destructive force of the thunderstorm in \"African Thunderstorm?\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52586?exam_type=waec&type=theory&page=14",
    "correct_answer": "The poem presents the destruction wreaked by a violent African thunderstorm on both people and nature itself. Rubadiri uses a lot of poetic devices to portray the storm as an agent of destruction in a most vivid way:\n1.(a) Similes: There is the use of several similes in the poem. In the second stanza alone, there are two of such similes. The poet compares the gathering rain clouds to \"a plague of locusts\" emphasizing its destructiveness.\n(b) Simile is also used to express the manner in which the storm tosses up everything on its way \"like a madman chasing nothing.\"\n(c) Then, we are told that the threatening clouds and the storm hover over everything and everybody \"like dark sinister wings.\" This presages doom and disaster.\n2. The use of personification invests the thunderstorm with a peculiarly destructive personality; everything gives way before it. \"The wind whistles by\", Trees bend to let it pass\" as \"the pregnant clouds/Ride stately by\" and cause a lot of inconvenience to all around. Both animate and inanimate objects are affected; clothes were \"like tattered flags\" and women's \"dangling breasts\" are exposed.\n3. Onomatopoeia abounds in the poem. \"Clinging\", \"dangling\", Rumble\", \"tremble\" and \"crack\" all convey a sense of force and noise echoing the various sounds made by the thunderstorm in its bids to destroy.\n4. Repetition of lines like \"The wind whistles by\", \"trees bend to let it pass\", adds to the power of the thunderstorm.\n5. There is also the apt choice of diction. Words like \"hurrying\", \"turning\" express in their continuous tenses the immediacy of the impact of the storm on things around.\n6. Contrast: The 3rd stanza sharply contrasts the behaviour of children and women to the storm. The children, on the one hand, in their blissful naivety welcome the storm while the women, on the other, rush madly moving things out of the destructive storm's way.",
    "explanation": "The poem presents the destruction wreaked by a violent African thunderstorm on both people and nature itself. Rubadiri uses a lot of poetic devices to portray the storm as an agent of destruction in a most vivid way:\n1.(a) Similes: There is the use of several similes in the poem. In the second stanza alone, there are two of such similes. The poet compares the gathering rain clouds to \"a plague of locusts\" emphasizing its destructiveness.\n(b) Simile is also used to express the manner in which the storm tosses up everything on its way \"like a madman chasing nothing.\"\n(c) Then, we are told that the threatening clouds and the storm hover over everything and everybody \"like dark sinister wings.\" This presages doom and disaster.\n2. The use of personification invests the thunderstorm with a peculiarly destructive personality; everything gives way before it. \"The wind whistles by\", Trees bend to let it pass\" as \"the pregnant clouds/Ride stately by\" and cause a lot of inconvenience to all around. Both animate and inanimate objects are affected; clothes were \"like tattered flags\" and women's \"dangling breasts\" are exposed.\n3. Onomatopoeia abounds in the poem. \"Clinging\", \"dangling\", Rumble\", \"tremble\" and \"crack\" all convey a sense of force and noise echoing the various sounds made by the thunderstorm in its bids to destroy.\n4. Repetition of lines like \"The wind whistles by\", \"trees bend to let it pass\", adds to the power of the thunderstorm.\n5. There is also the apt choice of diction. Words like \"hurrying\", \"turning\" express in their continuous tenses the immediacy of the impact of the storm on things around.\n6. Contrast: The 3rd stanza sharply contrasts the behaviour of children and women to the storm. The children, on the one hand, in their blissful naivety welcome the storm while the women, on the other, rush madly moving things out of the destructive storm's way.",
    "year": "2006"
  },
  {
    "number": "68",
    "text": "AFRICAN POETRY \nWhat does Clark find fascinating about the dancer in \"Agbor Dancer?\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52587?exam_type=waec&type=theory&page=14",
    "correct_answer": "What was found fascinating about the dance in Agbor Dancer was that it centres on a female traditional dancer from Agbor, a town in Nigeria. The poet is thrilled by the dance steps of the dancer. The dancer is described as being \"caught in the throb of a drum\". This means that the dancer's steps move in harmony with the drum beat.\nin the first stanza, the poet highlights the dancer's level of concentration and body movement to the beat of the \"hide-brimmed stem\" which is traced to the \"ancestral core.\" The dancer's limbs are likened to \"fresh foliage in the sun\", which portrays the youthful exuberance of the dancer.\nIn the second stanza, the poet describes the dancer as being \"entangled in the magic maze of music\" which conveys the trance-like state of the dancer. The dancer's perfect dance steps and body-movement baffle the poet who can hardly describe them in his speech or in writing being \"too atrophied for pen or tongue.\"\nIn the last stanza, the poet regrets not being able to participate in the communal dance like the dancer. He blames this on his Western education .... (\"lead-tethered scribe\") which prevents him from losing \"himself in her warm caress\"\nThus, inspite of the poet's fascination with the dancer and the rhythm of the dance, he remains a by-stander and can only enjoy the dance vicariously.",
    "explanation": "What was found fascinating about the dance in Agbor Dancer was that it centres on a female traditional dancer from Agbor, a town in Nigeria. The poet is thrilled by the dance steps of the dancer. The dancer is described as being \"caught in the throb of a drum\". This means that the dancer's steps move in harmony with the drum beat.\nin the first stanza, the poet highlights the dancer's level of concentration and body movement to the beat of the \"hide-brimmed stem\" which is traced to the \"ancestral core.\" The dancer's limbs are likened to \"fresh foliage in the sun\", which portrays the youthful exuberance of the dancer.\nIn the second stanza, the poet describes the dancer as being \"entangled in the magic maze of music\" which conveys the trance-like state of the dancer. The dancer's perfect dance steps and body-movement baffle the poet who can hardly describe them in his speech or in writing being \"too atrophied for pen or tongue.\"\nIn the last stanza, the poet regrets not being able to participate in the communal dance like the dancer. He blames this on his Western education .... (\"lead-tethered scribe\") which prevents him from losing \"himself in her warm caress\"\nThus, inspite of the poet's fascination with the dancer and the rhythm of the dance, he remains a by-stander and can only enjoy the dance vicariously.",
    "year": "2006"
  },
  {
    "number": "69",
    "text": "NON-AFRICAN POETRY\n Examine the use of poetic devices in \"The Solitary Reaper.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52588?exam_type=waec&type=theory&page=14",
    "correct_answer": "The use of Poetic devices in \"The Solitary Reaper.\" The narrative structure of the poem is the first device to catch the reader's eye. The first two lines are an invitation to celebrate this lady:\n\"Behold her, single in the field, Yon solitary Highland Lass!\"\nThe narrative structure combines statements with rhetorical questions from start to finish. It is thus responsible for the ranges of sorrow and excitement that constitute the mood of the poem. The call on all creation to celebrate the solitary reaper, the travelers. Nightingale, cuckoo and the earth itself illustrates Wordsworth's pantheistic view of nature.\nSimile is another device used in the poem. Through simile, \"thrilling\" voices of Highland Lass, Nightingale and cuckoo are mad to compare and contrast with the melancholy strain. The contrast is especially heightened when distant lands, the Hebrides and Arabian sands relive the sorrow in the reaper's song.\nThe rhetorical question heightens the tension:\n\"Will no one tell me what she sings\".\nThis triggers off a chain of possible answers: plaintive numbers, history, romantic ditties, battles and everyday occurrences such as love, joy, birth, maturity and death are simultaneously invoked and made to evoke complex emotions.\nDiction is yet another device used in the poem. The first word \"Behold\" is incantatory. Powerful emotions are captured in simple language \"Stop here or gently pass!. The evocative: \"0 listen! For the vale profound is deflowing with the sound\" establishes the magical influence of the lass's song on the poet who finds himself in a transport of contemplation and reflection.\nMetaphor is also another device. The reaper's \"melancholy strain\" becomes the Nightingale's welcome note\" and the thrilling voice of the cuckoo. There is a magical quality about the song; sorrowful and welcoming and thrilling all at the same time. Metaphor has blended them into a monody. There are rhymes galore to echo the sound of music:\n\"pass, lass, grain, strain, profound, sound, .... Pain, again .... Fill, hill, bore more\" In these, rhyme combines with assonance to reinforce the monody as well as enact the sorrow and pain strained from the lass' song.",
    "explanation": "The use of Poetic devices in \"The Solitary Reaper.\" The narrative structure of the poem is the first device to catch the reader's eye. The first two lines are an invitation to celebrate this lady:\n\"Behold her, single in the field, Yon solitary Highland Lass!\"\nThe narrative structure combines statements with rhetorical questions from start to finish. It is thus responsible for the ranges of sorrow and excitement that constitute the mood of the poem. The call on all creation to celebrate the solitary reaper, the travelers. Nightingale, cuckoo and the earth itself illustrates Wordsworth's pantheistic view of nature.\nSimile is another device used in the poem. Through simile, \"thrilling\" voices of Highland Lass, Nightingale and cuckoo are mad to compare and contrast with the melancholy strain. The contrast is especially heightened when distant lands, the Hebrides and Arabian sands relive the sorrow in the reaper's song.\nThe rhetorical question heightens the tension:\n\"Will no one tell me what she sings\".\nThis triggers off a chain of possible answers: plaintive numbers, history, romantic ditties, battles and everyday occurrences such as love, joy, birth, maturity and death are simultaneously invoked and made to evoke complex emotions.\nDiction is yet another device used in the poem. The first word \"Behold\" is incantatory. Powerful emotions are captured in simple language \"Stop here or gently pass!. The evocative: \"0 listen! For the vale profound is deflowing with the sound\" establishes the magical influence of the lass's song on the poet who finds himself in a transport of contemplation and reflection.\nMetaphor is also another device. The reaper's \"melancholy strain\" becomes the Nightingale's welcome note\" and the thrilling voice of the cuckoo. There is a magical quality about the song; sorrowful and welcoming and thrilling all at the same time. Metaphor has blended them into a monody. There are rhymes galore to echo the sound of music:\n\"pass, lass, grain, strain, profound, sound, .... Pain, again .... Fill, hill, bore more\" In these, rhyme combines with assonance to reinforce the monody as well as enact the sorrow and pain strained from the lass' song.",
    "year": "2006"
  },
  {
    "number": "70",
    "text": "NON-AFRICAN POETRY\nComment on the effectiveness of Houseman's use of imagery in \"To An Athlete Dying Young.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52590?exam_type=waec&type=theory&page=14",
    "correct_answer": "The effectiveness of Houseman's use of imagery in \"To an Athlete Dying Young\". Houseman uses imagery very effectively to express his major themes in the poem. The most important themes are mutability, pessimism and doomed youth. The poem is elegiac and focuses on the supposed achievement of the dead youth rather than on any loss which his death may have brought.\nMany of Houseman's images in the poem express the transience of life on earth. There is a preponderance of metaphors which focus on this. The world becomes \"fields where glory does not stay\" from which the dead youth has departed untimely. The world is a place where \"early though the laurel grows / it withers quicker than the rose\". The suggestion is that in our world, fame does not last, that in fact it fades (\"the laurel\") even more quickly than beauty (\"the rose\") does.\nHouseman throws up the athlete's image as a celebrated compatriot, champion and a man of the people. He was always celebrated as a hero any time he won sports honours and laurel. Both the old and the young always mounted informal guards of honour on roadsides to cheer him and carried him shoulder — high round the town. Upon his death, the whole town including his sportsmen never abandoned him. His corpse was equally taken round mournfully.\nSeveral metaphors also express the theme of pessimism. Death, destitution and suffering are seen as inevitable in this world. Thus, Houseman suggests that the dead youth has gained rather than lost in his fate. He has been transported from a world in which youths are doomed to suffer. He \"will not swell the rout/of lads that wore their hours out\". This metaphor suggests the inevitability of desolation, frustration and disillusionment. So also does the metaphor \"Runners whom renown outran\". Rather than settle for a life of disillusionment in this world, the youth has gone to his grave early in his life.\nHouseman paints an image of the athlete as a dear soul to his people, even in death, judging from the befitting burial given him. The athlete is portrayed as a man full of untapped resources right to his grave.\nDeath might be welcome to provide escape from the vicissitudes of life, but Houseman's images create an atmosphere of fatalism and a mood of resignation. He uses somber images to relate to death. The grave is a \"stiller town\", death is a \"shady night\", the youth is being laid to rest \"on the sill of shade\" and the dead are \"strength less\".",
    "explanation": "The effectiveness of Houseman's use of imagery in \"To an Athlete Dying Young\". Houseman uses imagery very effectively to express his major themes in the poem. The most important themes are mutability, pessimism and doomed youth. The poem is elegiac and focuses on the supposed achievement of the dead youth rather than on any loss which his death may have brought.\nMany of Houseman's images in the poem express the transience of life on earth. There is a preponderance of metaphors which focus on this. The world becomes \"fields where glory does not stay\" from which the dead youth has departed untimely. The world is a place where \"early though the laurel grows / it withers quicker than the rose\". The suggestion is that in our world, fame does not last, that in fact it fades (\"the laurel\") even more quickly than beauty (\"the rose\") does.\nHouseman throws up the athlete's image as a celebrated compatriot, champion and a man of the people. He was always celebrated as a hero any time he won sports honours and laurel. Both the old and the young always mounted informal guards of honour on roadsides to cheer him and carried him shoulder — high round the town. Upon his death, the whole town including his sportsmen never abandoned him. His corpse was equally taken round mournfully.\nSeveral metaphors also express the theme of pessimism. Death, destitution and suffering are seen as inevitable in this world. Thus, Houseman suggests that the dead youth has gained rather than lost in his fate. He has been transported from a world in which youths are doomed to suffer. He \"will not swell the rout/of lads that wore their hours out\". This metaphor suggests the inevitability of desolation, frustration and disillusionment. So also does the metaphor \"Runners whom renown outran\". Rather than settle for a life of disillusionment in this world, the youth has gone to his grave early in his life.\nHouseman paints an image of the athlete as a dear soul to his people, even in death, judging from the befitting burial given him. The athlete is portrayed as a man full of untapped resources right to his grave.\nDeath might be welcome to provide escape from the vicissitudes of life, but Houseman's images create an atmosphere of fatalism and a mood of resignation. He uses somber images to relate to death. The grave is a \"stiller town\", death is a \"shady night\", the youth is being laid to rest \"on the sill of shade\" and the dead are \"strength less\".",
    "year": "2006"
  },
  {
    "number": "71",
    "text": "AFRICAN PROSE; ISIDORE OKPEWHO: The Last Duty\nDiscuss the effects of the war on the people of Urukpe.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52591?exam_type=waec&type=theory&page=15",
    "correct_answer": "The effects of the war on the people of Urukpe The major theme of the novel is the effect which the war has on the people of Urukpe. The author highlights the devastating effects of the war on the people by stressing not only the physical loss but also the emotional trauma they experienced. On daily basis, the people experience the emotions of fear, anxiety and general apprehension of danger, especially of their lives and property.\nThe frequent restriction of movement and the devastating effects of rebel incursion and air raids make the people feel imprisoned in their own town. The characters' lives are affected and this can be seen as they individually narrate their experiences.\nToje's instigation against Oshevire causes him (Oshevire) to be detained at Iddu thus separating him from his family. Toje's exploitation of Oshevire's situation to his selfish advantage (seducing Aku) leads to the disgrace and shame which Aku suffers in the community.\nToje makes Odibo feel empty by treating him like an imbecile because the war situation makes it impossible for the youth to feel free and get jobs elsewhere.\nMajor Ali as the commander of the xv Brigade of the federal army finds himself in a very difficult situation. No matter how hard he tries, many forces are against him. He has to be very careful not to offend the prominent indigenes like Toje or step on the toes of his superior officers as well as protect the interest of the soldiers and the civilians. Thus, to strike this balance becomes difficult for him. Oshevire's situation-his detention, separated his family and subsequent death is consequence of the war.\nAku's experiences in the novel show the traumatic effects of the war on her. She has to succumb to the tempta-tion of sleeping with Odibo as a result of loneliness and the desire created in her by Toje. She is ostracized by the community and has to lie to her son about the father's situation. All these put emotional pressure and social stigma on her.\nOghenovo suffers psychological distress in the hands of his peer groups (like Onome) who tell him that his father is in prison because he is a thief. This creates a sense of loss and inferiority complex on Oghenovo who gets confused as to who his real father is.\nOshevire's appearance at the end of the novel proves to be an ironic reversal as Oghenovo and his mother (Aku) suffer in his hands.\nThe military occupation of Urukpe puts the dignity and freedom of the citizens in danger. The feud between the Sergeant and Private Sule claims the life of the girl and creates so much tension in the town. The subsequent execution of Private Sule adds to this tense atmosphere, and he is consequently transferred from his post.\nThus, the war affects all the characters to the extent that their lives are never the same again.",
    "explanation": "The effects of the war on the people of Urukpe The major theme of the novel is the effect which the war has on the people of Urukpe. The author highlights the devastating effects of the war on the people by stressing not only the physical loss but also the emotional trauma they experienced. On daily basis, the people experience the emotions of fear, anxiety and general apprehension of danger, especially of their lives and property.\nThe frequent restriction of movement and the devastating effects of rebel incursion and air raids make the people feel imprisoned in their own town. The characters' lives are affected and this can be seen as they individually narrate their experiences.\nToje's instigation against Oshevire causes him (Oshevire) to be detained at Iddu thus separating him from his family. Toje's exploitation of Oshevire's situation to his selfish advantage (seducing Aku) leads to the disgrace and shame which Aku suffers in the community.\nToje makes Odibo feel empty by treating him like an imbecile because the war situation makes it impossible for the youth to feel free and get jobs elsewhere.\nMajor Ali as the commander of the xv Brigade of the federal army finds himself in a very difficult situation. No matter how hard he tries, many forces are against him. He has to be very careful not to offend the prominent indigenes like Toje or step on the toes of his superior officers as well as protect the interest of the soldiers and the civilians. Thus, to strike this balance becomes difficult for him. Oshevire's situation-his detention, separated his family and subsequent death is consequence of the war.\nAku's experiences in the novel show the traumatic effects of the war on her. She has to succumb to the tempta-tion of sleeping with Odibo as a result of loneliness and the desire created in her by Toje. She is ostracized by the community and has to lie to her son about the father's situation. All these put emotional pressure and social stigma on her.\nOghenovo suffers psychological distress in the hands of his peer groups (like Onome) who tell him that his father is in prison because he is a thief. This creates a sense of loss and inferiority complex on Oghenovo who gets confused as to who his real father is.\nOshevire's appearance at the end of the novel proves to be an ironic reversal as Oghenovo and his mother (Aku) suffer in his hands.\nThe military occupation of Urukpe puts the dignity and freedom of the citizens in danger. The feud between the Sergeant and Private Sule claims the life of the girl and creates so much tension in the town. The subsequent execution of Private Sule adds to this tense atmosphere, and he is consequently transferred from his post.\nThus, the war affects all the characters to the extent that their lives are never the same again.",
    "year": "2006"
  },
  {
    "number": "72",
    "text": "AFRICAN PROSE ISIDORE OKPEWHO: The Last Duty\nExamine the role of Major Ali in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52592?exam_type=waec&type=theory&page=15",
    "correct_answer": "Major Ali's role in the novel Major Ali who replaces Major Akuya Bello at Urukpe is loved by the citizens. He reciprocates their love by playing the role of a comforter, protector to them. He goes to the refugee camp and consoles Dafe's mother.\nAs a Major posted to Urukpe, his primary assignment is to maintain law and order as well as protect the citizens to observe the curfew imposed on Urukpe.\nHe goes round the town to assure the citizens of Urukpe of their protection and safety during any air raid by the rebels.\nEven though Major Ali is a decent soldier who sees his duty as an impartial implementation of the Federal army code of conduct, he is full of self-concern. He fails to act decisively because he always wants to maintain a cordial relationship with the local leadership especially Toje. His failure to recognize the danger in Toje's advances towards Aku contributes to her tragedy. He fails both as a public relations man and as a soldier. He cannot prevent rebel incursions and cannot take action to forestall Aku's tragedy. Little wonder then that he is transferred from his post at the end of Oshevire's episode.\nMajor Ali's approach to the situation confronting him shows the danger inherent in the actions of military leaders whose undue concern for their careers leads to their inadvertently being insensitive to the feelings of the people they are supposed to be protecting.",
    "explanation": "Major Ali's role in the novel Major Ali who replaces Major Akuya Bello at Urukpe is loved by the citizens. He reciprocates their love by playing the role of a comforter, protector to them. He goes to the refugee camp and consoles Dafe's mother.\nAs a Major posted to Urukpe, his primary assignment is to maintain law and order as well as protect the citizens to observe the curfew imposed on Urukpe.\nHe goes round the town to assure the citizens of Urukpe of their protection and safety during any air raid by the rebels.\nEven though Major Ali is a decent soldier who sees his duty as an impartial implementation of the Federal army code of conduct, he is full of self-concern. He fails to act decisively because he always wants to maintain a cordial relationship with the local leadership especially Toje. His failure to recognize the danger in Toje's advances towards Aku contributes to her tragedy. He fails both as a public relations man and as a soldier. He cannot prevent rebel incursions and cannot take action to forestall Aku's tragedy. Little wonder then that he is transferred from his post at the end of Oshevire's episode.\nMajor Ali's approach to the situation confronting him shows the danger inherent in the actions of military leaders whose undue concern for their careers leads to their inadvertently being insensitive to the feelings of the people they are supposed to be protecting.",
    "year": "2006"
  },
  {
    "number": "73",
    "text": "BUCHI EMECHETA: The Joys of Motherhood\n \"A man is never ugly\". Using this statement as your starting point, examine the relationship between men and women in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52593?exam_type=waec&type=theory&page=15",
    "correct_answer": "The Joys of Motherhood \"A man is never ugly\". Using this statement as stalling point, examine the relationship between men and women in the novel.\nThis belief is central to an understanding of the relationship between men and women in the novel. Nnaife's friend makes this statement after Nnu Ego has lost her first son. The statement is meant to console Nnaife, Nnu Ego's second husband who in his despondency and resignation declares that Nnu Ego hates him because she thinks he is ugly. Ironically, later Nnu Ego herself makes this statement about her husband: \".... He is a man, and you know men are never ugly\".\nThe society which is presented in he novel is male-dominated. The perceived differences between men and women are taught to children from an early age. The children therefore grow up accepting those \"differences\". For example, when Oshia, Nnu Ego's first son is asked to go and help the girls fetch water he retorts: \"I am not going! I am a boy. Why should I help in the cooking? That's a woman's job.\n\" A lot of premium is put on the acquisition of male children. No one, not the man, nor the woman, would like a baby girl. This is the major cause of Amatokwu's behaviour to Nnu Ego. Because boys realize how much they are adored, they in turn treat the girls with contempt. This attitude is endorsed by the parents.\nNnu Ego's prayers to her \"chi\" to change her mind and give her a child were unanswered. Her husband, being the first son, was under pressure by his family to give them an heir. Nnu Ego is therefore casually informed by her husband move to a nearby but meant for older wives because his people have found him a new wife.\nThis development threatened her position as the senior wife coupled with the fact that the new wife took in within a month and later gave birth to a baby boy. Nnu Ego feels frustrated and hopeless especially with the way her husband a-eats her, ordering her about. . I will do my duty by you. I will come to your but when my wife starts nursing her child. But you can't produce sons, a east, you can help harvest yams.\n\" Nnu Ego's visits to her father did not help her situation. Though she has a cordial relationship with the other wife, having to breast feed her baby as if it was hers is seen as an abominable act. Caught in the act, she is beaten mercilessly by the husband. Her father is insulted and he later decides to take her home `so that she would be cool  enough inside to be fertile..\nHer departure from Amatokwu's house leads to Nnu Ego's rejuvenation regaining her weight, looking more attractive and leading to her second marriage and subsequent child bearing in her second husband's home is proof that she is not barren. It also makes way for a change of setting in the plot of the novel; from rural to urban setting.",
    "explanation": "The Joys of Motherhood \"A man is never ugly\". Using this statement as stalling point, examine the relationship between men and women in the novel.\nThis belief is central to an understanding of the relationship between men and women in the novel. Nnaife's friend makes this statement after Nnu Ego has lost her first son. The statement is meant to console Nnaife, Nnu Ego's second husband who in his despondency and resignation declares that Nnu Ego hates him because she thinks he is ugly. Ironically, later Nnu Ego herself makes this statement about her husband: \".... He is a man, and you know men are never ugly\".\nThe society which is presented in he novel is male-dominated. The perceived differences between men and women are taught to children from an early age. The children therefore grow up accepting those \"differences\". For example, when Oshia, Nnu Ego's first son is asked to go and help the girls fetch water he retorts: \"I am not going! I am a boy. Why should I help in the cooking? That's a woman's job.\n\" A lot of premium is put on the acquisition of male children. No one, not the man, nor the woman, would like a baby girl. This is the major cause of Amatokwu's behaviour to Nnu Ego. Because boys realize how much they are adored, they in turn treat the girls with contempt. This attitude is endorsed by the parents.\nNnu Ego's prayers to her \"chi\" to change her mind and give her a child were unanswered. Her husband, being the first son, was under pressure by his family to give them an heir. Nnu Ego is therefore casually informed by her husband move to a nearby but meant for older wives because his people have found him a new wife.\nThis development threatened her position as the senior wife coupled with the fact that the new wife took in within a month and later gave birth to a baby boy. Nnu Ego feels frustrated and hopeless especially with the way her husband a-eats her, ordering her about. . I will do my duty by you. I will come to your but when my wife starts nursing her child. But you can't produce sons, a east, you can help harvest yams.\n\" Nnu Ego's visits to her father did not help her situation. Though she has a cordial relationship with the other wife, having to breast feed her baby as if it was hers is seen as an abominable act. Caught in the act, she is beaten mercilessly by the husband. Her father is insulted and he later decides to take her home `so that she would be cool  enough inside to be fertile..\nHer departure from Amatokwu's house leads to Nnu Ego's rejuvenation regaining her weight, looking more attractive and leading to her second marriage and subsequent child bearing in her second husband's home is proof that she is not barren. It also makes way for a change of setting in the plot of the novel; from rural to urban setting.",
    "year": "2006"
  },
  {
    "number": "74",
    "text": "BUCHI EMECHETA: The Joys of Motherhood\n How does Nnu Ego's experiences in Amatokwu's house advance the plot of the novel?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52596?exam_type=waec&type=theory&page=15",
    "correct_answer": "Nnu Ego's experiences in Amatokwu's house advances the plot of the Novel\nNnu Ego is Ona's daughter from a relationship with Nwokocha Agbadi. Amatokwu is Nnu Ego's first husband chosen for ner by her father. Nnu Ego's father — Agbadi excelled by sending his daughter to the husband's house with so many personal possessions which later became a reference point for both the people of Ibuza and Umu-]so. In return, her husband's people come to show appreciation to her father with six \"full\" kegs of palm wine having found her a virgin.\nInitially, Nnu Ego's experiences in Amatokwu's house were pleasant ones but the couple's happiness was short-lived because as time passed, Nnu Ego could not become pregnant. Amatokwu showed understanding initially but, later ran out of patience leaving Nnu Ego alone to bear the burden as she visits one \"dibia\" or the other in secret. All the dibias\" she visits says that the slave woman (her \"chi\") had been dedicated to a river goddess before Agbadi took her away into slavery and had therefore refused to give her a child.\nWomen are treated like chattel, mere property to be disposed off as men like. Agbadi's behaviour to Ona in all matters including sex, characterizes the behaviour of men and women generally. Also, early in the novel we see Agbadi's insensitive behaviour leading to the death of his senior wife. When Nnu Ego fails to conceive, Amatokwu is unsympathetic. He tells her \"I have no time to waste my precious male seed on a woman who is infertile\". He soon gets himself a second wife and thrusts Nnu Ego aside. Nnaife's behaviour of Nnu Ego is not different. In spite of the fact that she bears him several children of both sexes, he takes on another wife to Nnu Ego's chagrin.\nEven the women themselves seem to accept, even to acquiesce to the discrimination against them. Nnu Ego cannot understand how Nnaife could descend so low as to launder the underwear of his white boss' wife in Lagos. After all the woman may be white, but she is a woman and it should have been the reverse.\nThere is one woman in the novel who even though she acknowledges the relationship which society stipulates women must have with their men, strives to assert her independence. Adaku packs out of Nnaife's house and becomes a successful businesswoman. She educates her daughter in spirit of what society feels.",
    "explanation": "Nnu Ego's experiences in Amatokwu's house advances the plot of the Novel\nNnu Ego is Ona's daughter from a relationship with Nwokocha Agbadi. Amatokwu is Nnu Ego's first husband chosen for ner by her father. Nnu Ego's father — Agbadi excelled by sending his daughter to the husband's house with so many personal possessions which later became a reference point for both the people of Ibuza and Umu-]so. In return, her husband's people come to show appreciation to her father with six \"full\" kegs of palm wine having found her a virgin.\nInitially, Nnu Ego's experiences in Amatokwu's house were pleasant ones but the couple's happiness was short-lived because as time passed, Nnu Ego could not become pregnant. Amatokwu showed understanding initially but, later ran out of patience leaving Nnu Ego alone to bear the burden as she visits one \"dibia\" or the other in secret. All the dibias\" she visits says that the slave woman (her \"chi\") had been dedicated to a river goddess before Agbadi took her away into slavery and had therefore refused to give her a child.\nWomen are treated like chattel, mere property to be disposed off as men like. Agbadi's behaviour to Ona in all matters including sex, characterizes the behaviour of men and women generally. Also, early in the novel we see Agbadi's insensitive behaviour leading to the death of his senior wife. When Nnu Ego fails to conceive, Amatokwu is unsympathetic. He tells her \"I have no time to waste my precious male seed on a woman who is infertile\". He soon gets himself a second wife and thrusts Nnu Ego aside. Nnaife's behaviour of Nnu Ego is not different. In spite of the fact that she bears him several children of both sexes, he takes on another wife to Nnu Ego's chagrin.\nEven the women themselves seem to accept, even to acquiesce to the discrimination against them. Nnu Ego cannot understand how Nnaife could descend so low as to launder the underwear of his white boss' wife in Lagos. After all the woman may be white, but she is a woman and it should have been the reverse.\nThere is one woman in the novel who even though she acknowledges the relationship which society stipulates women must have with their men, strives to assert her independence. Adaku packs out of Nnaife's house and becomes a successful businesswoman. She educates her daughter in spirit of what society feels.",
    "year": "2006"
  },
  {
    "number": "75",
    "text": "NON-AFRICAN PROSE RICHARD WRIGHT: Black boy\nWhat does Wright's childhood experiences with his family reveal about him?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52597?exam_type=waec&type=theory&page=15",
    "correct_answer": "Black Boy by Richard Wright.\nWright's childhood experiences with his family in Memphis are traumatic and reveal a lot about his character develop-ment.\nAt an early age of four, he is already giving indications of a restless, inquisitive Soul. He sets his room ablaze, deliberately, wishing to explore its outcome, in spite of his younger brother's warning. His subsequent severe punishment does little to quench his appetite for adventure.\nIt is this quest for adventure that leads to yet another experience. This time his father has asked that a kitten that is a nuisance be gotten rid of. Richard undertakes to deal with the cat by hanging it on a rope. This cruel act is meant to punish his father whom the hates, but his mother does not support it. He is made to remove the dead kitten hanging on the tree and bury it, as his mother forces him to say a prayer after her.\nThere is yet another childhood experience borne out of hunger. According to him: \"Hunger had always been more or less at my elbow .... But now I began to wake up at night to find hunger standing at my bedside, starring at me gauntly.\" It is gnawing hunger and his mother's confession of helplessness that makes him realize how important his run-away father has been: \"I had been glad that he was not there to shout his restrictions at me. But it had never occurred to me that his absence would mean that there would be no food\". This experience awakens in him the reality of deprivation.\nRichard learns a lesson from another experience, after his mother gets a job as a cook and advises her children to \"learn as soon as possible to take care of ourselves\" (themselves). He is sent to do the shopping and he is robbed by a gang of boys. He returns to his mother who sends him out again with instruction that he fight the gang or never return home. Richard's ability to stand up to the gang constitutes a psychological development. From that time on, he's ready to strike out on his own: \"that night I won the right to the streets of Memphis\".\nAs it turns out later the right extends also to the streets of New York City into a mature awareness of racism and Negro rights.",
    "explanation": "Black Boy by Richard Wright.\nWright's childhood experiences with his family in Memphis are traumatic and reveal a lot about his character develop-ment.\nAt an early age of four, he is already giving indications of a restless, inquisitive Soul. He sets his room ablaze, deliberately, wishing to explore its outcome, in spite of his younger brother's warning. His subsequent severe punishment does little to quench his appetite for adventure.\nIt is this quest for adventure that leads to yet another experience. This time his father has asked that a kitten that is a nuisance be gotten rid of. Richard undertakes to deal with the cat by hanging it on a rope. This cruel act is meant to punish his father whom the hates, but his mother does not support it. He is made to remove the dead kitten hanging on the tree and bury it, as his mother forces him to say a prayer after her.\nThere is yet another childhood experience borne out of hunger. According to him: \"Hunger had always been more or less at my elbow .... But now I began to wake up at night to find hunger standing at my bedside, starring at me gauntly.\" It is gnawing hunger and his mother's confession of helplessness that makes him realize how important his run-away father has been: \"I had been glad that he was not there to shout his restrictions at me. But it had never occurred to me that his absence would mean that there would be no food\". This experience awakens in him the reality of deprivation.\nRichard learns a lesson from another experience, after his mother gets a job as a cook and advises her children to \"learn as soon as possible to take care of ourselves\" (themselves). He is sent to do the shopping and he is robbed by a gang of boys. He returns to his mother who sends him out again with instruction that he fight the gang or never return home. Richard's ability to stand up to the gang constitutes a psychological development. From that time on, he's ready to strike out on his own: \"that night I won the right to the streets of Memphis\".\nAs it turns out later the right extends also to the streets of New York City into a mature awareness of racism and Negro rights.",
    "year": "2006"
  },
  {
    "number": "76",
    "text": "NON-AFRICAN PROSE RICHARD WRIGHT: Black boy\nExamine the causes of violence in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52599?exam_type=waec&type=theory&page=16",
    "correct_answer": "The causes of violence in the novel. Violence has been a major feature of the American society since the advent of the Blackman in America. Richard Wright's Black Boy gives a detailed and largely faithful expression to the phenomenon of violence in that society. Violence, as portrayed in Black Boy, emanated from three principal sources. These are racial discrimination, quest for dominance and domestic tension. Racial discrimination in the novel is manifested whenever instances of brutality, segregation and injustice are meted out against blacks on account of their colour. There is enough evidence in Black Boy that Whites brutalise Blacks under the idea that the latter are sub-human and so do not deserve any humane treatment. Instances of brutality leading to violence are as follows:\n(a) Avenues for employment are closed to blacks. They are therefore confined to menial jobs and reduced to poverty. They therefore resort to petty thievery and violence against each other. Indeed a white boss becomes surprised when a black employee is not for longtime discovered to have stolen something. This is a major cause of white violence against blacks.\n(b) The White man in the American society appears to be convinced that the Black man is sub-human and does not deserve to be treated as human. The blacks are therefore continually the victims of violence from whites. Richard Wright is hit with a bottle between his eyes because he failed to address a white man \"sir\". Richard does not receive any treatment from his white boss when the boss's dog bites him because \"dog bite no harm nigger\". These and other incidents lead to violence.\n(c) The Richard-Harrison fight is another evidence of racial discrimination. The white push them to maul each other to satisfy their sadistic tendencies while the poor black boys suffer.\nThe quest for dominance among blacks is also another source of violence. Here, reference may be made to the street children who attack Richard, beating him and snatching his money from him. The money was given to him for shopping. The mother sends him back mainly to fight back and secure his right to Memphis streets. After fighting and defeating the boys, he declares that he has indeed acquired his right to the streets.\nA third source of violence is the domestic tension always unfolding in Richard's home. There is, first of all the frequent beatings Richard's mother receives in the hands of the father. This breeds a sort of tension in Richard which always threatens to break out.\nThe fight between Richard and Aunt Addie over religious differences and which spilled over to the school is also the result of the domestic tension going on all the time.\nThe killing of the kitten meant to embarrass the father is also a kind of violence in the home. There is also the setting ablaze of the house which is also evidence of violence.",
    "explanation": "The causes of violence in the novel. Violence has been a major feature of the American society since the advent of the Blackman in America. Richard Wright's Black Boy gives a detailed and largely faithful expression to the phenomenon of violence in that society. Violence, as portrayed in Black Boy, emanated from three principal sources. These are racial discrimination, quest for dominance and domestic tension. Racial discrimination in the novel is manifested whenever instances of brutality, segregation and injustice are meted out against blacks on account of their colour. There is enough evidence in Black Boy that Whites brutalise Blacks under the idea that the latter are sub-human and so do not deserve any humane treatment. Instances of brutality leading to violence are as follows:\n(a) Avenues for employment are closed to blacks. They are therefore confined to menial jobs and reduced to poverty. They therefore resort to petty thievery and violence against each other. Indeed a white boss becomes surprised when a black employee is not for longtime discovered to have stolen something. This is a major cause of white violence against blacks.\n(b) The White man in the American society appears to be convinced that the Black man is sub-human and does not deserve to be treated as human. The blacks are therefore continually the victims of violence from whites. Richard Wright is hit with a bottle between his eyes because he failed to address a white man \"sir\". Richard does not receive any treatment from his white boss when the boss's dog bites him because \"dog bite no harm nigger\". These and other incidents lead to violence.\n(c) The Richard-Harrison fight is another evidence of racial discrimination. The white push them to maul each other to satisfy their sadistic tendencies while the poor black boys suffer.\nThe quest for dominance among blacks is also another source of violence. Here, reference may be made to the street children who attack Richard, beating him and snatching his money from him. The money was given to him for shopping. The mother sends him back mainly to fight back and secure his right to Memphis streets. After fighting and defeating the boys, he declares that he has indeed acquired his right to the streets.\nA third source of violence is the domestic tension always unfolding in Richard's home. There is, first of all the frequent beatings Richard's mother receives in the hands of the father. This breeds a sort of tension in Richard which always threatens to break out.\nThe fight between Richard and Aunt Addie over religious differences and which spilled over to the school is also the result of the domestic tension going on all the time.\nThe killing of the kitten meant to embarrass the father is also a kind of violence in the home. There is also the setting ablaze of the house which is also evidence of violence.",
    "year": "2006"
  },
  {
    "number": "77",
    "text": "NON-AFRICAN PROSE; GEORGE ELIOT: Silas Marner  \nComment on the friendship between Silas Marner and William Dane",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52601?exam_type=waec&type=theory&page=16",
    "correct_answer": "Silas MarnerComment on the friendship between Silas Marner and William Dane.\nSilas Marner has a gentle, loving nature and a truthful, simple soul. On the other hand, William Dane is a hypocritical, self-righteous young man. The two first meet at Lantern Yard during the betrothal of Sarah to Silas Marner. They both belong to the same church prayer meeting group and Silas Marner feels at home in the company of William Dane.\nSilas Marner is highly thought of in the community,, being a young man of exemplary life and ardent faith. At one of the prayer meetings, Silas Marner is struck by a cataleptic fit which jeopardizes his chances of marrying Sarah, even though there is not enough reason to break an engagement which the church approves of. William Dane then seizes the opportunity of Silas' fit to set him up as they take their turns in watching over the ailing senior deacon at night. As fate would have it, Silas Marner had previously used his knife to cut William's strap for him forgetting to replace it in his pocket.\nOn that fateful night senior deacon dies, Silas Marner must have had his fit again, for suddenly, he realizes that the Deacon has been long, dead and wonders why William has not come to take his turn watching over the deacon. Apparently, William placed Silas' knife near the deacon's bed and went away with the bag of money while Silas is unconscious, sneaks into Silas' chamber and tucks the empty bag behind the chest of drawers to frame Silas.\nThis act leads to the summoning of Silas to the church where the lots cast declare him guilty. His hope in God to vindicate him proves futile and when he hears that William has married Sarah, he becomes totally disillusioned and devastated. This state of mind drives him to a new \"land\"  Raveloe where he becomes a different person altogether. He lives a solitary life and, with his faith in God shattered, he keeps aloof from his neighbours altogether who in turn ostracize him.\nThus, as a result of William's betrayal, Silas' life in Raveloe is described as — \"an eager life filled with immediate purpose which fenced him in from the wide, cheerless unknown\". However, it is a barren life devoid of human relationships except with his gold. The only being that makes an inroad into his affection is the child, Eppie, who reminds him of his own little sister. From the moment he finds her, she becomes a \"light\" in his life and his \"window\" to the outside world.",
    "explanation": "Silas MarnerComment on the friendship between Silas Marner and William Dane.\nSilas Marner has a gentle, loving nature and a truthful, simple soul. On the other hand, William Dane is a hypocritical, self-righteous young man. The two first meet at Lantern Yard during the betrothal of Sarah to Silas Marner. They both belong to the same church prayer meeting group and Silas Marner feels at home in the company of William Dane.\nSilas Marner is highly thought of in the community,, being a young man of exemplary life and ardent faith. At one of the prayer meetings, Silas Marner is struck by a cataleptic fit which jeopardizes his chances of marrying Sarah, even though there is not enough reason to break an engagement which the church approves of. William Dane then seizes the opportunity of Silas' fit to set him up as they take their turns in watching over the ailing senior deacon at night. As fate would have it, Silas Marner had previously used his knife to cut William's strap for him forgetting to replace it in his pocket.\nOn that fateful night senior deacon dies, Silas Marner must have had his fit again, for suddenly, he realizes that the Deacon has been long, dead and wonders why William has not come to take his turn watching over the deacon. Apparently, William placed Silas' knife near the deacon's bed and went away with the bag of money while Silas is unconscious, sneaks into Silas' chamber and tucks the empty bag behind the chest of drawers to frame Silas.\nThis act leads to the summoning of Silas to the church where the lots cast declare him guilty. His hope in God to vindicate him proves futile and when he hears that William has married Sarah, he becomes totally disillusioned and devastated. This state of mind drives him to a new \"land\"  Raveloe where he becomes a different person altogether. He lives a solitary life and, with his faith in God shattered, he keeps aloof from his neighbours altogether who in turn ostracize him.\nThus, as a result of William's betrayal, Silas' life in Raveloe is described as — \"an eager life filled with immediate purpose which fenced him in from the wide, cheerless unknown\". However, it is a barren life devoid of human relationships except with his gold. The only being that makes an inroad into his affection is the child, Eppie, who reminds him of his own little sister. From the moment he finds her, she becomes a \"light\" in his life and his \"window\" to the outside world.",
    "year": "2006"
  },
  {
    "number": "78",
    "text": "NON-AFRICAN PROSE; GEORGE ELIOT: Silas Marner \nWhat role does fate play in the development of the plot.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52602?exam_type=waec&type=theory&page=16",
    "correct_answer": "The role Fate played in the development of the Plot. From the start of the novel in Lantern Yard to where Eppie gets married to Aaron, fate shows its mighty hand in the development of the plot.\nDuring a prayer meeting Silas is attacked by a fit and after he comes to the members who were thinking that Silas must have fallen into a trance wanted some divine revelations and prophesies from him. This is the first episode in which e shoes its hand. Silas has no revelation to give the church study group but the members of the group, especially .', Warn Dane, have noticed that something special has happened to Silas.\nSilas and Sarah are engaged to be married and the aged deacon becomes ill and needs to be attended to by young members of the congregation. This is an act of fate which contributes to the development of the plot. On the night - which the deacon dies, Silas is attacked by another fit and he comes to only to wonder why William Dane has not believed him to his watch al the Deacon's house or noticed the demise of the deacon.\nEarlier, Silas uses his knife to cut a strap for William without remembering to put his penknife back into his pocket. On the mourning after the Deacon's death, Silas' knife is found in the house and the bag containing the church's money disappears. The empty bag is later found in Silas' house. The disappearance of the money and the discovery of ate empty bag in Silas' place are all acts of fate to move the plot forward.\nBecause of his strong faith, Silas believes that the drawing of lots to find the thief will exonerate him from all suspicion. To his utter chagrin the lot falls on Silas who knows that he has not stolen the church's money.\nThe engagement between Sarah and Silas is broken even though there is no religious reason for doing so and this obviously another act of fate. later on in the story, William Dane marries Sarah and Silas decides to leave Lantern Yard because he believes that :sere is no God and that if there is any he must be a god of lies.\nSilas moves from Lantern Yard to Raveloe because he has lost all faith in God and man and wants to have no --finds and to worship God. He settles in a stone cottage outside the village of Raveloe weaving for anyone who can pay thle price without visiting anyone; his customers come to visit but all such are on purely business visits. The villagers have all kinds of stories about him but he neither hears nor cares about the speculations of human beings. He now has a new form of entertainment; playing with his gold coins, packing them back into their bag and placing it under the floor board before going to bed.\nFrom the villager's point of view, Silas has not really becomes a part of the village because all citizens of Raveloe must attend the Cass' parties, visit the Rainbow, the local pub fairly regularly and go to church at least once in a while. Silas has not attended even one of these places since his arrival in Raveloe.\nThen, Silas heals Sally Oats of a heart condition and everyone wants Silas to heal his disease but Silas ignores all their appeals because he is not a doctor and does not want to be anyone's friend. That Silas knows the herb that heals Sally Oats is another act of fate which brings people close to him, but he withdraws into his shell — Silas has human feeling and sympathizes with the pain of others.\nThen, Dunstan Cass steals the bag of Silas' gold. Once his only plaything disappears, Silas walks through the rain to the Rainbow to ask if anyone has news about his missing money. It is the hand of fate that caused Dunstan to steal Silas' gold. He is distressed and feels even more lonely than before.\nNot long afterwards, on the night of another Christmas party at the Cass' home to which Silas does not go, Silas comes home to find a golden haired toddler sleeping on his hearth. He initially thinks it is his gold come back but upon touching it discovers that it is soft. He cuddles the little girl and goes to the Cass party to announce his find and seeing that there is no claimant, decides to keep the child.\nSilas becomes a changed man and does anything that is suggested by his neighbours to be to the good of the child that he names Eppie. The arrival of the child is another example of fate and by the time his gold is discovered and handed back to him and Eppie gets baptized and Aaron comes to ask for the hand of Eppie in marriage, fate has worked full cycle on Silas. He has become acceptable to the village of Raveloe because he has fulfilled all the requirements for anyone to become a citizen of Raveloe.",
    "explanation": "The role Fate played in the development of the Plot. From the start of the novel in Lantern Yard to where Eppie gets married to Aaron, fate shows its mighty hand in the development of the plot.\nDuring a prayer meeting Silas is attacked by a fit and after he comes to the members who were thinking that Silas must have fallen into a trance wanted some divine revelations and prophesies from him. This is the first episode in which e shoes its hand. Silas has no revelation to give the church study group but the members of the group, especially .', Warn Dane, have noticed that something special has happened to Silas.\nSilas and Sarah are engaged to be married and the aged deacon becomes ill and needs to be attended to by young members of the congregation. This is an act of fate which contributes to the development of the plot. On the night - which the deacon dies, Silas is attacked by another fit and he comes to only to wonder why William Dane has not believed him to his watch al the Deacon's house or noticed the demise of the deacon.\nEarlier, Silas uses his knife to cut a strap for William without remembering to put his penknife back into his pocket. On the mourning after the Deacon's death, Silas' knife is found in the house and the bag containing the church's money disappears. The empty bag is later found in Silas' house. The disappearance of the money and the discovery of ate empty bag in Silas' place are all acts of fate to move the plot forward.\nBecause of his strong faith, Silas believes that the drawing of lots to find the thief will exonerate him from all suspicion. To his utter chagrin the lot falls on Silas who knows that he has not stolen the church's money.\nThe engagement between Sarah and Silas is broken even though there is no religious reason for doing so and this obviously another act of fate. later on in the story, William Dane marries Sarah and Silas decides to leave Lantern Yard because he believes that :sere is no God and that if there is any he must be a god of lies.\nSilas moves from Lantern Yard to Raveloe because he has lost all faith in God and man and wants to have no --finds and to worship God. He settles in a stone cottage outside the village of Raveloe weaving for anyone who can pay thle price without visiting anyone; his customers come to visit but all such are on purely business visits. The villagers have all kinds of stories about him but he neither hears nor cares about the speculations of human beings. He now has a new form of entertainment; playing with his gold coins, packing them back into their bag and placing it under the floor board before going to bed.\nFrom the villager's point of view, Silas has not really becomes a part of the village because all citizens of Raveloe must attend the Cass' parties, visit the Rainbow, the local pub fairly regularly and go to church at least once in a while. Silas has not attended even one of these places since his arrival in Raveloe.\nThen, Silas heals Sally Oats of a heart condition and everyone wants Silas to heal his disease but Silas ignores all their appeals because he is not a doctor and does not want to be anyone's friend. That Silas knows the herb that heals Sally Oats is another act of fate which brings people close to him, but he withdraws into his shell — Silas has human feeling and sympathizes with the pain of others.\nThen, Dunstan Cass steals the bag of Silas' gold. Once his only plaything disappears, Silas walks through the rain to the Rainbow to ask if anyone has news about his missing money. It is the hand of fate that caused Dunstan to steal Silas' gold. He is distressed and feels even more lonely than before.\nNot long afterwards, on the night of another Christmas party at the Cass' home to which Silas does not go, Silas comes home to find a golden haired toddler sleeping on his hearth. He initially thinks it is his gold come back but upon touching it discovers that it is soft. He cuddles the little girl and goes to the Cass party to announce his find and seeing that there is no claimant, decides to keep the child.\nSilas becomes a changed man and does anything that is suggested by his neighbours to be to the good of the child that he names Eppie. The arrival of the child is another example of fate and by the time his gold is discovered and handed back to him and Eppie gets baptized and Aaron comes to ask for the hand of Eppie in marriage, fate has worked full cycle on Silas. He has become acceptable to the village of Raveloe because he has fulfilled all the requirements for anyone to become a citizen of Raveloe.",
    "year": "2006"
  }
]