[
  {
    "number": "85",
    "text": "Study specimens A, B and C carefully and use them to answer questions (a) to (d).\n(a) State the habitats specimens A, Band C.\n (b) State (i) two observable features each of specimens A,B and C.\n(ii) how the features in 1(b)(i) adapt the specimens to their habitats.\n(c) State three Observable differences between specimens A and C.\n(d) Make a drawing 8- 10cm long of specimen C and label Tully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61314?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  },
  {
    "number": "86",
    "text": "A farmer applied different concentrations off cytokinins to his pineapple plants and observed tne development of new shoots Over a period of time.\nThe result of his observation is shown below.\n\n\n\nS/No.\nConc. of Cytokinin(mg/litre)\nNo. of new shoots\n\n\n1\n0\n 2\n\n\n2\n1\n5\n\n\n3\n2\n8\n\n\n4\n3.5\n12\n\n\n5\n4\n18\n\n\n6\n4.5\n25\n\n\n7\n5\n20\n\n\n8\n6\n10\n\n\n9\n7.5\n8\n\n\n10\n8\n6\n\n\n11\n9\n5\n\n\n12\n10\n5\n\n\n\n \n(a) Plot a graph to show the relationship between cytokinin concentration and shoot development.\n(b) Use the graph to describe the effect of cytokinin concentration on shoot development.\n(c) What advice should be given to the farmer based on the results from the graph?\n (d) List (2) two substances in plants, (ii) two substances in animals which have similar effect as cytokinins.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61315?exam_type=waec&type=practical&page=18",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  },
  {
    "number": "87",
    "text": "Study carefully specimens H, Jand K and use them to answer questions 4(a) to 4(d).\n (a) State the habitat of specimen J. \n(b) State (i) five observable features of specimen J;\n(ii) how the features in 4(b)(i) adapt specimen J to its habitat.\n(c)(i) List two differences between specimens H and J. \n(ii) State three similarities between specimen H and the skin of specimen J.\n(iii) State how the similar features named in 4(C)(i) above adapt specimen H for its functions.\n(d)(i) Classify specimen K into its phylum and class. (ii) Give three reasons for placing specimen in its class.\n(iii) List three observable features of specimen K and state how these features adapt it to its mode of life.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61316?exam_type=waec&type=practical&page=18",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  }
]