[
  {
    "number": "386",
    "text": "(a) In what ways was Israel affected by the unwise policies of Solomon?\n(b) Identify three character traits of leaders that make them unpopular.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72873?exam_type=waec&type=theory&page=78",
    "correct_answer": "a (i) Heavy taxation: to fun his numerous building projects, solomon imposed heavy taxes on people. this created a financial burden on the citizens and led to widespread dissatisfaction.\n(ii) Forced labour: Solomon conscripted labour from the isrealites for his construction projects. Many people were compelled to work on these projects, which caused resentment and hardshio among the population.\n(iii) Religious idolatory: Solomon married many foreign women who brought their own gods and religious practices to israel. solomon built altars for these foreign gods, leading to the introduction of idolatory in israel and weakening the worship of yaweh.\n(iv) Economic strain: the lavish lifestyle of solomons court and the expenses of his numerous building projects drained the nations resources. this economic strain affected the prosperity of the kingdom and the well being of its citizens.\n(v) Political division: the discontent caused by solomons policies set the stage for political instability. after solomons death, his son rehoboams decision to continue his harsh policies led to the division of the kingdom into israel (nothern kingdom) and judah (southern kingdom).\n(vi) Loss of tribal unity: solomons centralization of power and neglect of tribal distinctions led to a loss of unity among the tribes of isreal. this centralization of authority alienated the northern tribes, contributing to the eventual split of the kingdom.\nb(i) Arrogance: leaders who are arrogant tend to ignore the opinions and needs of others acting in their own self interest rather than considering the welfare of those they lead. This attitude creates a disconnect  between the leader and the people.\n(ii) Inflexibility: Inflexible leaders refuse to adapt to new situations or consider alternative view points. this rigidity can lead to poor decision making and stifle innovation causing frustration among followers.\n(iii) Lack of empathy: leaders who lack empathy do not understand or acknowlede the feelings or challenges of their followers. this insensitivity make them seem cold and uncaring leading to dissatisfacxtion and loss of support.\n(iv) Dishonesty: when leaders are dishonest they lose the trust of their followers. lies and deceit can lead to a breakdown in communications and a loss of credibility, making it difficult for the leader to gain and maintain support.\n(v) Icompetence: leaders who lack the necessary skill and knowledge to lead effectively are often viewed as incompetent. this incompetence can result in poor decision making, failure to acheive goals, and a loss of confidence among followers.\n(vi) Authoritarianism: leaders who rule with iron hand, using fear and intimidation, often become unpopular. this authoritarian approach suppresses free expression and creativity, leading to resentment and rebellion among those they lead.\n[",
    "explanation": "a (i) Heavy taxation: to fun his numerous building projects, solomon imposed heavy taxes on people. this created a financial burden on the citizens and led to widespread dissatisfaction.\n(ii) Forced labour: Solomon conscripted labour from the isrealites for his construction projects. Many people were compelled to work on these projects, which caused resentment and hardshio among the population.\n(iii) Religious idolatory: Solomon married many foreign women who brought their own gods and religious practices to israel. solomon built altars for these foreign gods, leading to the introduction of idolatory in israel and weakening the worship of yaweh.\n(iv) Economic strain: the lavish lifestyle of solomons court and the expenses of his numerous building projects drained the nations resources. this economic strain affected the prosperity of the kingdom and the well being of its citizens.\n(v) Political division: the discontent caused by solomons policies set the stage for political instability. after solomons death, his son rehoboams decision to continue his harsh policies led to the division of the kingdom into israel (nothern kingdom) and judah (southern kingdom).\n(vi) Loss of tribal unity: solomons centralization of power and neglect of tribal distinctions led to a loss of unity among the tribes of isreal. this centralization of authority alienated the northern tribes, contributing to the eventual split of the kingdom.\nb(i) Arrogance: leaders who are arrogant tend to ignore the opinions and needs of others acting in their own self interest rather than considering the welfare of those they lead. This attitude creates a disconnect  between the leader and the people.\n(ii) Inflexibility: Inflexible leaders refuse to adapt to new situations or consider alternative view points. this rigidity can lead to poor decision making and stifle innovation causing frustration among followers.\n(iii) Lack of empathy: leaders who lack empathy do not understand or acknowlede the feelings or challenges of their followers. this insensitivity make them seem cold and uncaring leading to dissatisfacxtion and loss of support.\n(iv) Dishonesty: when leaders are dishonest they lose the trust of their followers. lies and deceit can lead to a breakdown in communications and a loss of credibility, making it difficult for the leader to gain and maintain support.\n(v) Icompetence: leaders who lack the necessary skill and knowledge to lead effectively are often viewed as incompetent. this incompetence can result in poor decision making, failure to acheive goals, and a loss of confidence among followers.\n(vi) Authoritarianism: leaders who rule with iron hand, using fear and intimidation, often become unpopular. this authoritarian approach suppresses free expression and creativity, leading to resentment and rebellion among those they lead.\n[",
    "year": "2024"
  },
  {
    "number": "387",
    "text": "(a) Explain three challenges that confronted the Jewish returnees during the rebuilding of the temple.\n(b) Highlight three factors that stand in the way of development in your country.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72896?exam_type=waec&type=theory&page=78",
    "correct_answer": "a(i) opposition from surrounding people: the jewish returnees, faced strong opposition from neighboring groups like the samaritans. these groups were hostile and actively worked to discourage and hinder the rebuilding efforts, sometimes even resorting to political maneuvers to halt the construction.\n(ii) resource scarcity: the returnees struggled with a lack of resources needed for the reconstruction. limited financial and material resources made it difficult to obtain the necessary building supplies such asa timber and stone, to rebuild the temple.\n(iii) Internal disunity: among the jewish returnees there were divisions and disagreements about how to proceed with the rebuilding process. this internal disunity weakened their collective efforts and slowed down the progress of the construction work.\n(iv) economic hardship: many returnees faced severe economic difficulties upon their return. the region had been neglected for years, and there was widespread poverty. the struggle to make a living and provide for their families made it challenging to focus on rebuilding the temple.\n(v) political instability: the returnees also faced political instability both within the persian empire, which ruled over them, and from local governors who were not supportive of their efforts. changes in political leadership could result in changes in policy that affected the rebuilding process.\n(vi) Lack of skilled labour: after years of exile many skilled workers and artisans who had the expertise to construct the temple were either not available  or not in the best condition to work. the shortage of skilled laborers slowed down the construction and affected the quality of the work.\nb(i) Corruption: corruption at various levels of government and public institutions diverts resources meant for development into private pockets. This undermines public trust and reduces the effectiveness of development programs.\n(ii) Poor infrastructure; inadequate infrastructure such as roads, electricity, and water supply hampers economic growth. poor infastructure makes it difficult to attract investment and slows down the pace of development.\n(iii) Political instability: Frequent changes in government, political conflicts and lack of continuity in policies distrupt development initiatives. political instability creates an uncertain environment that is not conducive to sustainable development.\n(iv) Education system deficiencies: an underfunded and poorly managed education system fails to equip the population with the necessary skills and knowledge. This results in a workforce that is not adequately prepared to drive development.\n(v) Healthcare challenges: poor healthcare services lead to a less healthy population, which affects productivity and economic growth. high rates of disease and inadequate healthcare infrastructure pose significant barriers to development.\n(vi) Economic inequality: A wide gap between the rich and the poor can hinder development by limiting access to opportunities for a large portion of the population. Economic inequality can lead to social unrest and reduce the overall academic potential of the country.",
    "explanation": "a(i) opposition from surrounding people: the jewish returnees, faced strong opposition from neighboring groups like the samaritans. these groups were hostile and actively worked to discourage and hinder the rebuilding efforts, sometimes even resorting to political maneuvers to halt the construction.\n(ii) resource scarcity: the returnees struggled with a lack of resources needed for the reconstruction. limited financial and material resources made it difficult to obtain the necessary building supplies such asa timber and stone, to rebuild the temple.\n(iii) Internal disunity: among the jewish returnees there were divisions and disagreements about how to proceed with the rebuilding process. this internal disunity weakened their collective efforts and slowed down the progress of the construction work.\n(iv) economic hardship: many returnees faced severe economic difficulties upon their return. the region had been neglected for years, and there was widespread poverty. the struggle to make a living and provide for their families made it challenging to focus on rebuilding the temple.\n(v) political instability: the returnees also faced political instability both within the persian empire, which ruled over them, and from local governors who were not supportive of their efforts. changes in political leadership could result in changes in policy that affected the rebuilding process.\n(vi) Lack of skilled labour: after years of exile many skilled workers and artisans who had the expertise to construct the temple were either not available  or not in the best condition to work. the shortage of skilled laborers slowed down the construction and affected the quality of the work.\nb(i) Corruption: corruption at various levels of government and public institutions diverts resources meant for development into private pockets. This undermines public trust and reduces the effectiveness of development programs.\n(ii) Poor infrastructure; inadequate infrastructure such as roads, electricity, and water supply hampers economic growth. poor infastructure makes it difficult to attract investment and slows down the pace of development.\n(iii) Political instability: Frequent changes in government, political conflicts and lack of continuity in policies distrupt development initiatives. political instability creates an uncertain environment that is not conducive to sustainable development.\n(iv) Education system deficiencies: an underfunded and poorly managed education system fails to equip the population with the necessary skills and knowledge. This results in a workforce that is not adequately prepared to drive development.\n(v) Healthcare challenges: poor healthcare services lead to a less healthy population, which affects productivity and economic growth. high rates of disease and inadequate healthcare infrastructure pose significant barriers to development.\n(vi) Economic inequality: A wide gap between the rich and the poor can hinder development by limiting access to opportunities for a large portion of the population. Economic inequality can lead to social unrest and reduce the overall academic potential of the country.",
    "year": "2024"
  },
  {
    "number": "388",
    "text": "(a) 'O Nebuchadnezzar, we have no need to answer you in this matter...' Recount the events that necessitated the above statement.\n(b) Outline ways in which Christians can maintain their faith in God.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72947?exam_type=waec&type=theory&page=78",
    "correct_answer": "(a) The statement \"O Nebuchadnezzar, we have no need to answer you in this matter..\" is found in the book of daniel, specifically in Daniel 3:16. It is part of a larger narrative involving shedrach meshach and abednego, three jewish exiles in babylon who refused to worship an idol. A summary of the events leading to this statement is given below.\n1. Nebuchadnezzar's golden image: King Nebuchadnezzar made a large golden image and commanded all his officials and people to worship it. Daniel 3:1-6; \"king Nebuchadnezzar made an image of gold, six cubits high and six cubits wide, and set it up in the plain of dura in the province of babylon. he then summoned the satraps, prefects, governors, advisers, treasurers, judges, magistrates and all other provincial officials to come to the dedication of the image he had set up. so,  the satraps, prefects, governors, advisers, treasurers, judges, magistrates and all other provincial officials assembled for the dedication of the image that king Nebuchadnezzar had set up, and they stood up before it. Then the herald loudly proclaimed, nations and peoples of every language, this is what you are commanded to do: as soon as you hear the sound of the horn, flute, yre, harp, pipe and all kinds of music, you must fall down and worship the image of gold king Nebuchadnezzar has set up. whoever does not fall down and worship will immediately be thrown into a blazing furnance.\"\n2. Refusal to worship the image: Shedrach, Meshach, and Abednego, being faithful jews, refused to bow down and worship the image. Daniel 3:12; \"but there are some jews whom you have set over the affairs of the province of babylon --- Shadrach, meshach and abednego -- who pay no attention to you, your majesty. they neither serve your gods nor worship the image of gold you have set up.\n3. Accusation and confrontation: certain chaldeans reported their defiance to the king, leading to the summoning of shedrach, meshach and adednego. Daniel 3:13-15; \"Furious with rage, Nebuchadnezzar summoned Shadrach, Meshach and Abednego. So these men were brought before the king, 14 and Nebuchadnezzar said to them, “Is it true, Shadrach, Meshach and Abednego, that you do not serve my gods or worship the image of gold I have set up? 15 Now when you hear the sound of the horn, flute, zither, lyre, harp, pipe and all kinds of music, if you are ready to fall down and worship the image I made, very good. But if you do not worship it, you will be thrown immediately into a blazing furnace. Then what god will be able to rescue you from my hand?\"\n4. The defiant reponse: Shadrach, Meshach and Abednego responded with faith and courage, declaring their trust in God and their unwilligness to worship the image. Daniel 3:16-18; Shadrach, Meshach and Abednego replied to him, “King Nebuchadnezzar, we do not need to defend ourselves before you in this matter. If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty’s hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.\"\n5. The fiery furnance: in his rage Nebuchadnezzar ordered the furnance to be heated seven times hotter than usual and had the three men thrown into it. Daniel 3:19 - 23; \" Then Nebuchadnezzar was furious with Shadrach, Meshach and Abednego, and his attitude toward them changed. He ordered the furnace heated seven times hotter than usual and commanded some of the strongest soldiers in his army to tie up Shadrach, Meshach and Abednego and throw them into the blazing furnace. So these men, wearing their robes, trousers, turbans and other clothes, were bound and thrown into the blazing furnace. The king’s command was so urgent and the furnace so hot that the flames of the fire killed the soldiers who took up Shadrach, Meshach and Abednego, and these three men, firmly tied, fell into the blazing furnace.\"\n6. Divine deliverance: God miraculously saved Shadrach, Meshach and Abednego. They were unharmes and seen walking in the furnance with a fourth figure, who looked like a divine being. Daniel 3: 24 - 27;  \"Then King Nebuchadnezzar leaped to his feet in amazement and asked his advisers, “Weren’t there three men that we tied up and threw into the fire?” They replied, “Certainly, Your Majesty.” He said, “Look! I see four men walking around in the fire, unbound and unharmed, and the fourth looks like a son of the gods.” Nebuchadnezzar then approached the opening of the blazing furnace and shouted, “Shadrach, Meshach and Abednego, servants of the Most High God, come out! Come here! So Shadrach, Meshach and Abednego came out of the fire, and the satraps, prefects, governors and royal advisers crowded around them. They saw that the fire had not harmed their bodies, nor was a hair of their heads singed; their robes were not scorched, and there was no smell of fire on them.\"\n7. Nebuchadnezzar's praise: Nebuchadnezzar acknowledeged the power of their God and promoted Shadrach, Meshach and Abednego in babylon. Daniel 3: 28 - 30; \"\nThen Nebuchadnezzar said, “Praise be to the God of Shadrach, Meshach and Abednego, who has sent his angel and rescued his servants! They trusted in him and defied the king’s command and were willing to give up their lives rather than serve or worship any god except their own God. Therefore I decree that the people of any nation or language who say anything against the God of Shadrach, Meshach and Abednego be cut into pieces and their houses be turned into piles of rubble, for no other god can save in this way.” Then the king promoted Shadrach, Meshach and Abednego in the province of Babylon\". These events illustrate the faith and courage of  Shadrach, Meshach and Abednego, and the power and deliverance of God.\n(b) 1. regular prayer\n2. studying the bible\n3. worship and fellowship\n4. obedience to God's commands\n5. serving others\n6. personal reflection and meditation\n7. seeking mentorship and accountability\n8. trusting God in difficult times",
    "explanation": "(a) The statement \"O Nebuchadnezzar, we have no need to answer you in this matter..\" is found in the book of daniel, specifically in Daniel 3:16. It is part of a larger narrative involving shedrach meshach and abednego, three jewish exiles in babylon who refused to worship an idol. A summary of the events leading to this statement is given below.\n1. Nebuchadnezzar's golden image: King Nebuchadnezzar made a large golden image and commanded all his officials and people to worship it. Daniel 3:1-6; \"king Nebuchadnezzar made an image of gold, six cubits high and six cubits wide, and set it up in the plain of dura in the province of babylon. he then summoned the satraps, prefects, governors, advisers, treasurers, judges, magistrates and all other provincial officials to come to the dedication of the image he had set up. so,  the satraps, prefects, governors, advisers, treasurers, judges, magistrates and all other provincial officials assembled for the dedication of the image that king Nebuchadnezzar had set up, and they stood up before it. Then the herald loudly proclaimed, nations and peoples of every language, this is what you are commanded to do: as soon as you hear the sound of the horn, flute, yre, harp, pipe and all kinds of music, you must fall down and worship the image of gold king Nebuchadnezzar has set up. whoever does not fall down and worship will immediately be thrown into a blazing furnance.\"\n2. Refusal to worship the image: Shedrach, Meshach, and Abednego, being faithful jews, refused to bow down and worship the image. Daniel 3:12; \"but there are some jews whom you have set over the affairs of the province of babylon --- Shadrach, meshach and abednego -- who pay no attention to you, your majesty. they neither serve your gods nor worship the image of gold you have set up.\n3. Accusation and confrontation: certain chaldeans reported their defiance to the king, leading to the summoning of shedrach, meshach and adednego. Daniel 3:13-15; \"Furious with rage, Nebuchadnezzar summoned Shadrach, Meshach and Abednego. So these men were brought before the king, 14 and Nebuchadnezzar said to them, “Is it true, Shadrach, Meshach and Abednego, that you do not serve my gods or worship the image of gold I have set up? 15 Now when you hear the sound of the horn, flute, zither, lyre, harp, pipe and all kinds of music, if you are ready to fall down and worship the image I made, very good. But if you do not worship it, you will be thrown immediately into a blazing furnace. Then what god will be able to rescue you from my hand?\"\n4. The defiant reponse: Shadrach, Meshach and Abednego responded with faith and courage, declaring their trust in God and their unwilligness to worship the image. Daniel 3:16-18; Shadrach, Meshach and Abednego replied to him, “King Nebuchadnezzar, we do not need to defend ourselves before you in this matter. If we are thrown into the blazing furnace, the God we serve is able to deliver us from it, and he will deliver us from Your Majesty’s hand. But even if he does not, we want you to know, Your Majesty, that we will not serve your gods or worship the image of gold you have set up.\"\n5. The fiery furnance: in his rage Nebuchadnezzar ordered the furnance to be heated seven times hotter than usual and had the three men thrown into it. Daniel 3:19 - 23; \" Then Nebuchadnezzar was furious with Shadrach, Meshach and Abednego, and his attitude toward them changed. He ordered the furnace heated seven times hotter than usual and commanded some of the strongest soldiers in his army to tie up Shadrach, Meshach and Abednego and throw them into the blazing furnace. So these men, wearing their robes, trousers, turbans and other clothes, were bound and thrown into the blazing furnace. The king’s command was so urgent and the furnace so hot that the flames of the fire killed the soldiers who took up Shadrach, Meshach and Abednego, and these three men, firmly tied, fell into the blazing furnace.\"\n6. Divine deliverance: God miraculously saved Shadrach, Meshach and Abednego. They were unharmes and seen walking in the furnance with a fourth figure, who looked like a divine being. Daniel 3: 24 - 27;  \"Then King Nebuchadnezzar leaped to his feet in amazement and asked his advisers, “Weren’t there three men that we tied up and threw into the fire?” They replied, “Certainly, Your Majesty.” He said, “Look! I see four men walking around in the fire, unbound and unharmed, and the fourth looks like a son of the gods.” Nebuchadnezzar then approached the opening of the blazing furnace and shouted, “Shadrach, Meshach and Abednego, servants of the Most High God, come out! Come here! So Shadrach, Meshach and Abednego came out of the fire, and the satraps, prefects, governors and royal advisers crowded around them. They saw that the fire had not harmed their bodies, nor was a hair of their heads singed; their robes were not scorched, and there was no smell of fire on them.\"\n7. Nebuchadnezzar's praise: Nebuchadnezzar acknowledeged the power of their God and promoted Shadrach, Meshach and Abednego in babylon. Daniel 3: 28 - 30; \"\nThen Nebuchadnezzar said, “Praise be to the God of Shadrach, Meshach and Abednego, who has sent his angel and rescued his servants! They trusted in him and defied the king’s command and were willing to give up their lives rather than serve or worship any god except their own God. Therefore I decree that the people of any nation or language who say anything against the God of Shadrach, Meshach and Abednego be cut into pieces and their houses be turned into piles of rubble, for no other god can save in this way.” Then the king promoted Shadrach, Meshach and Abednego in the province of Babylon\". These events illustrate the faith and courage of  Shadrach, Meshach and Abednego, and the power and deliverance of God.\n(b) 1. regular prayer\n2. studying the bible\n3. worship and fellowship\n4. obedience to God's commands\n5. serving others\n6. personal reflection and meditation\n7. seeking mentorship and accountability\n8. trusting God in difficult times",
    "year": "2024"
  },
  {
    "number": "389",
    "text": "(a) Give an account of the incident that made the Jews describe King Cyrus of Persia as the Lord's anointed.\n(b) Identify three ways by which immigrants can contribute to the welfare of their host nation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72948?exam_type=waec&type=theory&page=78",
    "correct_answer": "(a) The jews described King Cyrus of persia as the Lord's anointed because of his decisive role in ending the babylonian captivity and facilitating their return to jerusalem to rebuild the temple. This significant event was prophesied by Isaiah and Jeremiah and fulfilled through Cyrus's actions.\nPROPHECY OF ISAIAH\nLong before the events unfolded, the prophet Isaiah prophesied about Cyrus, naming him specifically as God's chosen instrument to restore Israel. isaiah 45: 1 - 4. This is what the Lord says to his anointed, to Cyrus, whose right hand I take hold of to subdue nations before him and to strip kings of their armor,to open doors before him so that gates will not be shut, I will go before you and will level the mountains, I will break down gates of bronze and cut through bars of iron, I will give you hidden treasures, riches stored in secret places, so that you may know that I am the Lord, the God of Israel, who summons you by name. For the sake of Jacob my servant, of Israel my chosen, I summon you by name and bestow on you a title of honor, though you do not acknowledge me.\"\nCYRUS DECREE\nIn 539 B.C, Cyrus the great conqured babylon. in his first year as ruler over the babylonian empire, he issued a decree that allowed the jewish exiles to return to jerusalem and rebuild the temple. this decree was seen as the fulfilment of isaiah's prophecy and marked cyrus as the Lord's anointed. Ezra 1: 1 - 4; \"In the first year of Cyrus king of Persia, in order to fulfill the word of the Lord spoken by Jeremiah, the Lord moved the heart of Cyrus king of Persia to make a proclamation throughout his realm and also to put it in writing: “This is what Cyrus king of Persia says: “‘The Lord, the God of heaven, has given me all the kingdoms of the earth and he has appointed me to build a temple for him at Jerusalem in Judah.  Any of his people among you may go up to Jerusalem in Judah and build the temple of the Lord, the God of Israel, the God who is in Jerusalem, and may their God be with them. And in any locality where survivors may now be living, the people are to provide them with silver and gold, with goods and livestock, and with freewill offerings for the temple of God in Jerusalem.\nTHE ROLE OF JEREMIAH'S PROPHECY\nThe prophecy of Isaiah was complemented by Jeremiah's prophecy, which predicted the end of the babylonian exile after 70 years. Cyrus decree aligned with the timeline given by Jeremiah further solidifying the belief that cyrus was divinely appointed. Jeremiah 25:11-12; \"This whole country will become a desolate wasteland, and these nations will serve the king of Babylon seventy years. But when the seventy years are fulfilled, I will punish the king of Babylon and his nation, the land of the Babylonians, for their guilt, declares the Lord, and will make it desolate forever. Jeremiah 29:10; \"This is what the Lord says: “When seventy years are completed for Babylon, I will come to you and fulfill my good promise to bring you back to this place.\"\nTHE ROLE OF KING CYRUS OF PERSIA IN THE BUILDING OF JERUSALEM\nKing cyrus of persia occupies a significant space in the biblical narrative sourrunding the rebuilding of the jerusalem temple also known as the second temple. the decree of cyrus did the following:\ni. allowed exiled jews to return to jerusalem\nii. specifically permitted the building of the temple \"which is in Judah\".\niii. authorized the return of scared vessels Nebudchadnezzar II had taken from the first temple.\niv. offerered financial aid for acquiring building materials.\nv. presented cyrus as divinely chosen by God (\"the Lord God of heaven has given me all the kingdoms of the earth\")\n(b) Migrants can contribute to the welfare of their host nation in several ways:\n1. Economic contribution: Migrants often fill labor shortages, contribute to the economy through entreprenuership and pay taxes.\n2. Cultural enrichment: they bring diverse cultures, languages, and traditiond enhancing the cultural fabric of the host nation.\n3. Innovationtion and skills: migrants often bring new skills, ideas, and perspectives, fostering innovation and enhancing the host nation's workforce.\n4. Demographic balance: they can help counter attack aging populations and decling birth rates in many developed countries\n5. public services: migrants frequently work in essential public services, such as healthcare, education, and public transport.\n6. Intrernational relations: their presence can strenghen diplomatic and economic ties between the host nation and their countries  of origin.\n7. Community development: Migrants often contribute to local communities through volunteer work and community engagement.\n8. Trade and investment: Migrants can act as bridges  for trade and investment between their home countries and host nations boosting economic growth",
    "explanation": "(a) The jews described King Cyrus of persia as the Lord's anointed because of his decisive role in ending the babylonian captivity and facilitating their return to jerusalem to rebuild the temple. This significant event was prophesied by Isaiah and Jeremiah and fulfilled through Cyrus's actions.\nPROPHECY OF ISAIAH\nLong before the events unfolded, the prophet Isaiah prophesied about Cyrus, naming him specifically as God's chosen instrument to restore Israel. isaiah 45: 1 - 4. This is what the Lord says to his anointed, to Cyrus, whose right hand I take hold of to subdue nations before him and to strip kings of their armor,to open doors before him so that gates will not be shut, I will go before you and will level the mountains, I will break down gates of bronze and cut through bars of iron, I will give you hidden treasures, riches stored in secret places, so that you may know that I am the Lord, the God of Israel, who summons you by name. For the sake of Jacob my servant, of Israel my chosen, I summon you by name and bestow on you a title of honor, though you do not acknowledge me.\"\nCYRUS DECREE\nIn 539 B.C, Cyrus the great conqured babylon. in his first year as ruler over the babylonian empire, he issued a decree that allowed the jewish exiles to return to jerusalem and rebuild the temple. this decree was seen as the fulfilment of isaiah's prophecy and marked cyrus as the Lord's anointed. Ezra 1: 1 - 4; \"In the first year of Cyrus king of Persia, in order to fulfill the word of the Lord spoken by Jeremiah, the Lord moved the heart of Cyrus king of Persia to make a proclamation throughout his realm and also to put it in writing: “This is what Cyrus king of Persia says: “‘The Lord, the God of heaven, has given me all the kingdoms of the earth and he has appointed me to build a temple for him at Jerusalem in Judah.  Any of his people among you may go up to Jerusalem in Judah and build the temple of the Lord, the God of Israel, the God who is in Jerusalem, and may their God be with them. And in any locality where survivors may now be living, the people are to provide them with silver and gold, with goods and livestock, and with freewill offerings for the temple of God in Jerusalem.\nTHE ROLE OF JEREMIAH'S PROPHECY\nThe prophecy of Isaiah was complemented by Jeremiah's prophecy, which predicted the end of the babylonian exile after 70 years. Cyrus decree aligned with the timeline given by Jeremiah further solidifying the belief that cyrus was divinely appointed. Jeremiah 25:11-12; \"This whole country will become a desolate wasteland, and these nations will serve the king of Babylon seventy years. But when the seventy years are fulfilled, I will punish the king of Babylon and his nation, the land of the Babylonians, for their guilt, declares the Lord, and will make it desolate forever. Jeremiah 29:10; \"This is what the Lord says: “When seventy years are completed for Babylon, I will come to you and fulfill my good promise to bring you back to this place.\"\nTHE ROLE OF KING CYRUS OF PERSIA IN THE BUILDING OF JERUSALEM\nKing cyrus of persia occupies a significant space in the biblical narrative sourrunding the rebuilding of the jerusalem temple also known as the second temple. the decree of cyrus did the following:\ni. allowed exiled jews to return to jerusalem\nii. specifically permitted the building of the temple \"which is in Judah\".\niii. authorized the return of scared vessels Nebudchadnezzar II had taken from the first temple.\niv. offerered financial aid for acquiring building materials.\nv. presented cyrus as divinely chosen by God (\"the Lord God of heaven has given me all the kingdoms of the earth\")\n(b) Migrants can contribute to the welfare of their host nation in several ways:\n1. Economic contribution: Migrants often fill labor shortages, contribute to the economy through entreprenuership and pay taxes.\n2. Cultural enrichment: they bring diverse cultures, languages, and traditiond enhancing the cultural fabric of the host nation.\n3. Innovationtion and skills: migrants often bring new skills, ideas, and perspectives, fostering innovation and enhancing the host nation's workforce.\n4. Demographic balance: they can help counter attack aging populations and decling birth rates in many developed countries\n5. public services: migrants frequently work in essential public services, such as healthcare, education, and public transport.\n6. Intrernational relations: their presence can strenghen diplomatic and economic ties between the host nation and their countries  of origin.\n7. Community development: Migrants often contribute to local communities through volunteer work and community engagement.\n8. Trade and investment: Migrants can act as bridges  for trade and investment between their home countries and host nations boosting economic growth",
    "year": "2024"
  },
  {
    "number": "390",
    "text": "(a) Highlight Lukes account of the demands of Discipleship.\n(b) Outline three characters expected of a disciple.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72949?exam_type=waec&type=theory&page=78",
    "correct_answer": "(a) Luke's gospel emphasises the rigorous demands of discipleship through various teachings and encounters. Key pages include:\n1. Luke 9:23-24; Jesus states, \"If anyone desires to come after Me, let him deny himself, and take up his cross daily, and follow Me. For whoever desires to save his life will lose it, but whoever loses his life for My sake will save it.\" This passage emphasizes self - denial and a willingness to endure suffering.\n2. Luke 9:57-62; Jesus addresses three pontential disciples:\n- To the first he says, “Foxes have holes and birds of the airhavenests, but the Son of Man has nowhere to layHishead.” indicating the need for readiness to face hardship.\n- Then He said to another, “Follow Me.” But he said, “Lord, let me first go and bury my father.” Jesus said to him, “Let the dead bury their own dead, but you go and preach the kingdom of God.” emphasizing the urgency and priority of the mission.\n- The third also said, “Lord, I will follow You, but let me first goandbid them farewell who are at my house.” But Jesus said to him, “No one, having put his hand to the plow, and looking back, is fit for the kingdom of God.” Highlighting the necessity of undivided focus and commitment.\n3. Luke 14:26-27;  “If anyone comes to Me and does not hate his father and mother, wife and children, brothers and sisters, yes, and his own life also, he cannot be My disciple.  And whoever does not bear his cross and come after Me cannot be My disciple.\" This underscores the absolute prioritization of following Jesus over all other relationships and personal interests.\n4. Luke 14:33; \" So likewise, whoever of you does not forsake all that he has cannot be My disciple.\" This passage stresses the need to renounce pssesions and personal ties for the sake of discipleship.\n5. Luke 18: 22;  So when Jesus heard these things, He said to him, “You still lack one thing. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow Me.” This indicates that true discipleship involves a radical reodering of ones life and priorities. In summary, Lukes gospel presents discipleship as demanding total commitment, self denil, prioritization of Jesus above all else and readiness to endure hardship and sacrifice.\n(b) In the gospel of luke a potential disciple id expected to exhibit several key characteristics, here are eight important ones;\n1. Commitment: A disciple must be willing to forsake all personal ambitions and possesiond (luke 14:33)\n2. Humility: They should be humble, recognizing their need for God's mercy (luke 18:14)\n3. Love: Love for God and others is crucial, including loving one's enemies (luke 6:27-28)\n4. Faith: A strong unwavering faith in Jesus and his teachings is essential (luke 17:5-6)\n5. Obedience: Following Jesus' commands and teachings with diligence (like 11:28)\n6. Self-denial: Willingness to deny oneself and take up one's cross daily (luke 9:23)\n7. Prayerfulness: A robust prayer life, seeking guidance and strength from God. (luke 18:1)\n8. Forgiveness: Readiness to forgive others, reflecting God's forgiveness (luke 17:3-4)",
    "explanation": "(a) Luke's gospel emphasises the rigorous demands of discipleship through various teachings and encounters. Key pages include:\n1. Luke 9:23-24; Jesus states, \"If anyone desires to come after Me, let him deny himself, and take up his cross daily, and follow Me. For whoever desires to save his life will lose it, but whoever loses his life for My sake will save it.\" This passage emphasizes self - denial and a willingness to endure suffering.\n2. Luke 9:57-62; Jesus addresses three pontential disciples:\n- To the first he says, “Foxes have holes and birds of the airhavenests, but the Son of Man has nowhere to layHishead.” indicating the need for readiness to face hardship.\n- Then He said to another, “Follow Me.” But he said, “Lord, let me first go and bury my father.” Jesus said to him, “Let the dead bury their own dead, but you go and preach the kingdom of God.” emphasizing the urgency and priority of the mission.\n- The third also said, “Lord, I will follow You, but let me first goandbid them farewell who are at my house.” But Jesus said to him, “No one, having put his hand to the plow, and looking back, is fit for the kingdom of God.” Highlighting the necessity of undivided focus and commitment.\n3. Luke 14:26-27;  “If anyone comes to Me and does not hate his father and mother, wife and children, brothers and sisters, yes, and his own life also, he cannot be My disciple.  And whoever does not bear his cross and come after Me cannot be My disciple.\" This underscores the absolute prioritization of following Jesus over all other relationships and personal interests.\n4. Luke 14:33; \" So likewise, whoever of you does not forsake all that he has cannot be My disciple.\" This passage stresses the need to renounce pssesions and personal ties for the sake of discipleship.\n5. Luke 18: 22;  So when Jesus heard these things, He said to him, “You still lack one thing. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow Me.” This indicates that true discipleship involves a radical reodering of ones life and priorities. In summary, Lukes gospel presents discipleship as demanding total commitment, self denil, prioritization of Jesus above all else and readiness to endure hardship and sacrifice.\n(b) In the gospel of luke a potential disciple id expected to exhibit several key characteristics, here are eight important ones;\n1. Commitment: A disciple must be willing to forsake all personal ambitions and possesiond (luke 14:33)\n2. Humility: They should be humble, recognizing their need for God's mercy (luke 18:14)\n3. Love: Love for God and others is crucial, including loving one's enemies (luke 6:27-28)\n4. Faith: A strong unwavering faith in Jesus and his teachings is essential (luke 17:5-6)\n5. Obedience: Following Jesus' commands and teachings with diligence (like 11:28)\n6. Self-denial: Willingness to deny oneself and take up one's cross daily (luke 9:23)\n7. Prayerfulness: A robust prayer life, seeking guidance and strength from God. (luke 18:1)\n8. Forgiveness: Readiness to forgive others, reflecting God's forgiveness (luke 17:3-4)",
    "year": "2024"
  },
  {
    "number": "391",
    "text": "(a) Describe how Jesus was pronounced guilty before Caiaphas the high priest.\n(b) State two lessons that can be drawn from Jesus' trial.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72950?exam_type=waec&type=theory&page=79",
    "correct_answer": "(a) Jesus was pronounced guilty before Caiaphas, the high preist, in a series of events that took place after his arrest in the garden of gethsamane. the key points of this trial, as depicted in the gospells, are as follows;\n1. Arrest and initial hearing: after this arrest, Jesus was first taken to annas, the father in law of caiaphas, who had been the high preist before caiphas (john18:13). Annas questioned Jesus but sent him bound to caiaphas.\n2. Accusations: At caiaphas' house the cheif preists and the sanhedrin gathered to find evidence against Jesus. They brought  foward false witnesses but their testimonies did not agree (mark 14;15-59)\n3. Questioning by Caiaphas: Caiaphas directly questioned Jesus, asking if he was the messiah, the son of God. Jesus affirmed this by saying, \"you have said so\" and added that they would see the son of man sitting at the right hand of power and coming on the clouds of heaven (Matt 26:63-64)\n4. Charge of blasphemy: Jesus' affirmation was considered blasphemy by the sanhedrin. Caiaphas tore his clothes and declared that they did not need any more witnesses. the council agreed that Jesus deserved death (matt 26:65-66).\n5. Mockery and beating: After being pronounced guilty Jesus was spat on, blindfolded, struck and mocked by those present (mark 14:65). the trial before caiaphas was a critical moment that led to Jesus' condemnation and subsequent handover to the roman authorities, where he would face further trials and ultimately, crucifiction.\n(b) i. Injustice and corruption can lead to false accusations and wrongful convictions.\nii. Standing up for one's beliefs and values can lead to persecution and suffering.\niii. Despite the false testimonies against Him, Jesus remained truthful, demonstrating the power and importance of truth in the face of lies.\niv. God's plan and purpose can be fulfilled even even through unjust and painful circumstances.\nv. The actions of caiaphas and the sanhedrin highlights how human judgement can be flawed and influenced by fear, jealousy, and the desire to maintain power.",
    "explanation": "(a) Jesus was pronounced guilty before Caiaphas, the high preist, in a series of events that took place after his arrest in the garden of gethsamane. the key points of this trial, as depicted in the gospells, are as follows;\n1. Arrest and initial hearing: after this arrest, Jesus was first taken to annas, the father in law of caiaphas, who had been the high preist before caiphas (john18:13). Annas questioned Jesus but sent him bound to caiaphas.\n2. Accusations: At caiaphas' house the cheif preists and the sanhedrin gathered to find evidence against Jesus. They brought  foward false witnesses but their testimonies did not agree (mark 14;15-59)\n3. Questioning by Caiaphas: Caiaphas directly questioned Jesus, asking if he was the messiah, the son of God. Jesus affirmed this by saying, \"you have said so\" and added that they would see the son of man sitting at the right hand of power and coming on the clouds of heaven (Matt 26:63-64)\n4. Charge of blasphemy: Jesus' affirmation was considered blasphemy by the sanhedrin. Caiaphas tore his clothes and declared that they did not need any more witnesses. the council agreed that Jesus deserved death (matt 26:65-66).\n5. Mockery and beating: After being pronounced guilty Jesus was spat on, blindfolded, struck and mocked by those present (mark 14:65). the trial before caiaphas was a critical moment that led to Jesus' condemnation and subsequent handover to the roman authorities, where he would face further trials and ultimately, crucifiction.\n(b) i. Injustice and corruption can lead to false accusations and wrongful convictions.\nii. Standing up for one's beliefs and values can lead to persecution and suffering.\niii. Despite the false testimonies against Him, Jesus remained truthful, demonstrating the power and importance of truth in the face of lies.\niv. God's plan and purpose can be fulfilled even even through unjust and painful circumstances.\nv. The actions of caiaphas and the sanhedrin highlights how human judgement can be flawed and influenced by fear, jealousy, and the desire to maintain power.",
    "year": "2024"
  },
  {
    "number": "392",
    "text": "(a) Give an account of the events that led to the appointment of the seven deacons.\n(b) Give three ways in which conflict can be resolved in the society.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72951?exam_type=waec&type=theory&page=79",
    "correct_answer": "The appointment of the seven deacons in the early Christian church, as described in Acts 6:1-7, arose from a practical need to address a specific issue within the growing community of believers. here is an account of the events that led to their appointment:\n1. Rapid growth of th church; the early church in jerusalem was expending quickly with a diverse group og believers, inclluding both hebrew speaking jews and greek speaking jews (hellinists).\n2. Complaint of neglect; A complaint arose from the hellenistic jews that their widows were being neglected in the daily distribution of food and other necessities, whereas the hebrew speaking widows were receiving adequate support. (acts 6:1).\n3. Response by the apostles; the twelve apostles recognized that this issue needed to be addressed, but they also understood that their primary mission was to focus on prayer and the ministry of the word. they acknowledged that they could not effectively manage both the spiritual and practical needs of the community without assistance (acts 6:2)\n4. Proposal for delegation; the apostles proposed that the community select seven responsible men, full of the spirit and wisdom, to take on the responsibility of overseeing the daily distribution. this woul allow the apostles to concentrate on their primary tasks (acts 6:3-4).\n5. Selection of the seven; the community accepted the proposal and chose seven men: Stephen, Philip, Prochorus, Nicanor, Timon, Parmenas, and nicolas, a proselyte from antioch. these men were presented to the apostles who prayed and laid their hands on them, officially appointing them to their new roles (acts 6:5-6).\n6. Impact on the church: the appointment of the seven deacons resolved the issue of the neglected widows and allowed the apostles to focus on their spiritual mission. As a result, the word of God spread even more, and the number of disciples in jerusalem continued to increase significantly, including the coversion of many preists. (acts 6:7). this event demonstrated the early church ability to adapt and address internal challenges by delegating responsibilities, ensuring that both the spiritual and practical needs of the community were met effectively.\n(b) Resolving conflicts in the society can be approached through various methods. Some of these methodas are given below:\n1. Dialogue and communication: open and honest dialogue between conflicting parties can help clarify misunderstandings and find common ground. encouraging active listening and empathy can facilitate mutual understanding.\n2. Mediation: a neutral third party or mediator can assist in facilitating discussions and negotiations between conflicting parties. the mediator helps them reach a mutually acceptable solution without imposing a decision.\n3. Negotiation: involves direct discussion between parties to reach a compromise or agreement. effective negotiation involves clear communication, willingness to compromise, and a focus on common interests rather than positions.\n4. Arbitration: a process where a neutral third part, the arbitrator, listens to both sides and makes a binding decision. this method is often used when parties cannot reach an agreement through negotiation or mediation\n5. Conflict resolution training: educating individuals and groups on conflict resolution techniques can empower them to handle disputes constructively. training can include skills like active listening, negotiation, and problem solving.\n6. Restorative justice: a process that involves bringing together the victim, offender, and community to address the harm caused by a conflict or crime. the focus is on healing, accountability, and making amends.\n7. Community involvement: engaging community leaders and members in the conflict resolution process can help ensure that solutions are culturally appropriate and have community support. this approach leverages local  knowledge and resources.\n8. Legal and institutional frameworks: establishing and enforcing laws and regulations that promote fairness and justice can help prevent and resolve conflicts. This includes having accessible legal systems and institutions that uphold human rights and resolve disputes impartially.",
    "explanation": "The appointment of the seven deacons in the early Christian church, as described in Acts 6:1-7, arose from a practical need to address a specific issue within the growing community of believers. here is an account of the events that led to their appointment:\n1. Rapid growth of th church; the early church in jerusalem was expending quickly with a diverse group og believers, inclluding both hebrew speaking jews and greek speaking jews (hellinists).\n2. Complaint of neglect; A complaint arose from the hellenistic jews that their widows were being neglected in the daily distribution of food and other necessities, whereas the hebrew speaking widows were receiving adequate support. (acts 6:1).\n3. Response by the apostles; the twelve apostles recognized that this issue needed to be addressed, but they also understood that their primary mission was to focus on prayer and the ministry of the word. they acknowledged that they could not effectively manage both the spiritual and practical needs of the community without assistance (acts 6:2)\n4. Proposal for delegation; the apostles proposed that the community select seven responsible men, full of the spirit and wisdom, to take on the responsibility of overseeing the daily distribution. this woul allow the apostles to concentrate on their primary tasks (acts 6:3-4).\n5. Selection of the seven; the community accepted the proposal and chose seven men: Stephen, Philip, Prochorus, Nicanor, Timon, Parmenas, and nicolas, a proselyte from antioch. these men were presented to the apostles who prayed and laid their hands on them, officially appointing them to their new roles (acts 6:5-6).\n6. Impact on the church: the appointment of the seven deacons resolved the issue of the neglected widows and allowed the apostles to focus on their spiritual mission. As a result, the word of God spread even more, and the number of disciples in jerusalem continued to increase significantly, including the coversion of many preists. (acts 6:7). this event demonstrated the early church ability to adapt and address internal challenges by delegating responsibilities, ensuring that both the spiritual and practical needs of the community were met effectively.\n(b) Resolving conflicts in the society can be approached through various methods. Some of these methodas are given below:\n1. Dialogue and communication: open and honest dialogue between conflicting parties can help clarify misunderstandings and find common ground. encouraging active listening and empathy can facilitate mutual understanding.\n2. Mediation: a neutral third party or mediator can assist in facilitating discussions and negotiations between conflicting parties. the mediator helps them reach a mutually acceptable solution without imposing a decision.\n3. Negotiation: involves direct discussion between parties to reach a compromise or agreement. effective negotiation involves clear communication, willingness to compromise, and a focus on common interests rather than positions.\n4. Arbitration: a process where a neutral third part, the arbitrator, listens to both sides and makes a binding decision. this method is often used when parties cannot reach an agreement through negotiation or mediation\n5. Conflict resolution training: educating individuals and groups on conflict resolution techniques can empower them to handle disputes constructively. training can include skills like active listening, negotiation, and problem solving.\n6. Restorative justice: a process that involves bringing together the victim, offender, and community to address the harm caused by a conflict or crime. the focus is on healing, accountability, and making amends.\n7. Community involvement: engaging community leaders and members in the conflict resolution process can help ensure that solutions are culturally appropriate and have community support. this approach leverages local  knowledge and resources.\n8. Legal and institutional frameworks: establishing and enforcing laws and regulations that promote fairness and justice can help prevent and resolve conflicts. This includes having accessible legal systems and institutions that uphold human rights and resolve disputes impartially.",
    "year": "2024"
  },
  {
    "number": "393",
    "text": "(a) '.. have a seat here please, while you say to the poor man, stand there or sit at my feet'. Recount how the above situation was addressed by James in the church.\n(b) In what three ways does the situation above affect the progress of the society?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72952?exam_type=waec&type=theory&page=79",
    "correct_answer": "In the church James addressed the situation described by saying; \"my brethren, do not hold the faith of our Lord Jesus Christ, the Lord of glory with partiality. for if there should come into your assembly a man with gold rings and fine apparel, and there should also come in a poor man in filthy garments, and you pay attention to the one wearing the fine clothes and say to him 'you sit here in a good place' and say to the poor man, 'you stand there', or 'sit here at my feet', have you not shown partiality among yourselves, and become judges with evil thoughts?' (james 2:1-4). James condemened the practice of showing favouritism to the wealthy and discriminating against the poor. He taught that all believers, regardless of their socioeconomic status, should be treated with respect and dignity. in his epistle, James addresses the issue of how to traet the rich and the poor within the community. His primary concern is the partiality shown to the rich and the neglect of the poor. Here is a summary of james' teaching on this matter, particularly from james 2:1-13.\n1. Codemnation of favouritism: james begins by directly condemning favoritism and partiality. He urges believers to show no favouritism as they hold the faith in Jesus christ (james 2:1)\n2. Example of partiality; James provides a practical example: if a rich person wearing fine clothes and a poor person in shabby clothes come into a meeting, and special attention is given to the rich person while the poor person is told to stand or sit at the floor, this behaviour is unjust and discriminatory (james 2:2-4).\n3. Gods view of the poor; James reminds believers that God has chosen the poor to be rich in faith and to inherit the kingdom promised to those who love him. By dishonoring the poor, they are acting contrary to Gods values. (james 2: 5-6)\n4. Critique of the rich: He points out that it is often the rich who oppress the believers and drag them into court. futhermore, they are the ones who blaspheme the noble name of Jesus, to whom the  believers belong (james 2:6-7).\n5. The royal law: James emphasizes the importance of fulfilling \"the rotal law\" found in scripture; \"love your neighbor as yourself\". showing favouritism violates this commandment, as it discriminates against those in need (james 2:8-9).\n6. Sin of partiality: He makes it clear that showing partiality is a sin and those who do so are convicted by the law as transgressors. james teaches that breaking one part of the law makes one guilty of  breaking the whole law (james 2:9-11).\n7. Call to mercy: james concludes by calling believers to speak and act as those who will be judged by the law that gives freedom. he stresses that judgement without mercy will  be shown to anyone who has not been merciful. mercy triumphs over judgement (james 2:12-13).\nThrough these teachings, james emphasies that all  believers, regardless of their social or economic status, should be treated with equal respsct and dignity.\n(b) The situation of discrimination and prejudice based on wealth can affect the progress of society in these three ways;\n1. Social division: It creates a divide between the wealthy and the poor, leading to resentment, conflict, and instability.\n2. Economic inequality; discrimination against the poor perpetuates economic inequality and makes it difficult for them to improve their lives. this hinders economic growth and prevents society from reaching its full potential.\n3. Moral degradation; the practice of favoring the wealthy over the poor erodes moral values and corrupts society's ethical foundation. it undermines the principles of justice, equality, and compassion that are essential for a healthy and prosperous society.",
    "explanation": "In the church James addressed the situation described by saying; \"my brethren, do not hold the faith of our Lord Jesus Christ, the Lord of glory with partiality. for if there should come into your assembly a man with gold rings and fine apparel, and there should also come in a poor man in filthy garments, and you pay attention to the one wearing the fine clothes and say to him 'you sit here in a good place' and say to the poor man, 'you stand there', or 'sit here at my feet', have you not shown partiality among yourselves, and become judges with evil thoughts?' (james 2:1-4). James condemened the practice of showing favouritism to the wealthy and discriminating against the poor. He taught that all believers, regardless of their socioeconomic status, should be treated with respect and dignity. in his epistle, James addresses the issue of how to traet the rich and the poor within the community. His primary concern is the partiality shown to the rich and the neglect of the poor. Here is a summary of james' teaching on this matter, particularly from james 2:1-13.\n1. Codemnation of favouritism: james begins by directly condemning favoritism and partiality. He urges believers to show no favouritism as they hold the faith in Jesus christ (james 2:1)\n2. Example of partiality; James provides a practical example: if a rich person wearing fine clothes and a poor person in shabby clothes come into a meeting, and special attention is given to the rich person while the poor person is told to stand or sit at the floor, this behaviour is unjust and discriminatory (james 2:2-4).\n3. Gods view of the poor; James reminds believers that God has chosen the poor to be rich in faith and to inherit the kingdom promised to those who love him. By dishonoring the poor, they are acting contrary to Gods values. (james 2: 5-6)\n4. Critique of the rich: He points out that it is often the rich who oppress the believers and drag them into court. futhermore, they are the ones who blaspheme the noble name of Jesus, to whom the  believers belong (james 2:6-7).\n5. The royal law: James emphasizes the importance of fulfilling \"the rotal law\" found in scripture; \"love your neighbor as yourself\". showing favouritism violates this commandment, as it discriminates against those in need (james 2:8-9).\n6. Sin of partiality: He makes it clear that showing partiality is a sin and those who do so are convicted by the law as transgressors. james teaches that breaking one part of the law makes one guilty of  breaking the whole law (james 2:9-11).\n7. Call to mercy: james concludes by calling believers to speak and act as those who will be judged by the law that gives freedom. he stresses that judgement without mercy will  be shown to anyone who has not been merciful. mercy triumphs over judgement (james 2:12-13).\nThrough these teachings, james emphasies that all  believers, regardless of their social or economic status, should be treated with equal respsct and dignity.\n(b) The situation of discrimination and prejudice based on wealth can affect the progress of society in these three ways;\n1. Social division: It creates a divide between the wealthy and the poor, leading to resentment, conflict, and instability.\n2. Economic inequality; discrimination against the poor perpetuates economic inequality and makes it difficult for them to improve their lives. this hinders economic growth and prevents society from reaching its full potential.\n3. Moral degradation; the practice of favoring the wealthy over the poor erodes moral values and corrupts society's ethical foundation. it undermines the principles of justice, equality, and compassion that are essential for a healthy and prosperous society.",
    "year": "2024"
  },
  {
    "number": "394",
    "text": "(a) '...but you are a chosen race, a royal priesthood, a holy nation..' Outline Peter's expectation of the people described above.\n(b) Explain three factors that stand in the way of peaceful co-existence among people.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72953?exam_type=waec&type=theory&page=79",
    "correct_answer": "The passage comes from 1 peter 2:9 - 10, where peter describes believers in christ with the following identities: \"but you are chosen race, a roytal priesthood, a holy nation, a people for hia own possesion, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light. Based on this description peter outlined several expectations for the people of God:\n1. Proclaiming God's excellencies: The primary purpose of being chosen, a royal preisthood, and a holy nation is to proclaim the excellencies of God. this involves sharing the gospel and living in such a way that God's goodness and grace are made known to others.\n2. Living a holy life; as a holy nation, believers are expected to live holy lives that reflect their identity as God's people. This includes being set apart from the world and pursuing righteousness and purity.\n3. Being a people of God's possesion: believers are called to recognize that they belong to God. This involves acknowledging God's ownership over their lives and living in obedience to Him.\n4. Rejecting drakness: Peter constrasts being called out of darkness into God's marvelous light. Believers are expected to reject the ways of darkness, including sin and ungodliness, and to live in the light of God's truth and righteousness.\n5. Unity and community: As a chosen race and holy nation, believers are part of a community that transcends racial, cultural, and social boundaries. They are to live in unity and love with one another, reflecting the love of God.\n6. Sacrificial service: As a royal preisthood, believers are called to offer spiritual sacrifices acceptable to God through Jesus Christ (1 peter 2:5). This includes worship, prayer, and serving others in the name ogf Christ.\n7. Enduring persecution: Peter goes on to speak about the reality of suffering for the sake of righteousness (1 peter 3:14). Believers are expected to endure persecution and hardship with faith and patience, trusting in God's sovereignty and care. In conclusion, Peter's expectations for those described as a chosen race, a royal preisthood and a holy nation are centred on living life that reflects their identity in Christ proclaiming the gospel, living in holiness, unity, sacrificial service, and enduring suffering with faith and persevserance.\n(b) Peaceful coexistence among peoplw can be hindered by various factors as listed below:\n1. Misunderstandings and lack of communication: Poor communication and misunderstandings can lead to mistrust and conflict. When people dont understand each others perspective, beliefs, or cultural backgrounds, it can create barriers to peaceful coexistence.\n2. Prejudice and discrimination: Prejudice based on race, ethnicity, religion, or other factors can lead to discrimination and inequality. This can result in systemic barrierts that prevent certain groups from fully participating in society and can lead to resentment and conflict.\n3. Lack of respect for diversity: When individuals or groups do not respect the diversity of beliefs, traditions, and practices within a community, it can lead to intolerance and conflict. Embracing and celebrating diversity is essential for fostering peaceful coexistence.\n4. Inequality and Social Injustice: Economic disparities, unequal access to resources, and social injustices can create divisions and tensions within a society. Addressing these inequalities and promoting social justice are crucial for building a more harmonious community.\n5. Political and idealogical differences: Differences in political beliefs, idealogies, and values can create divisions and polarize communites. When individuals or groups are unwilling to engage in constructive dialogue and compromise, it can lead to conflict and hinder peaceful coexistence.\n6. Historical greivances and trauma: Pat conflicts, historical injustices, and unresolved grievances can create deep seated resentment and distrust among different groups. addressing historiacal trauma and promoting reconciliation are essential for healing and building peaceful relationships.",
    "explanation": "The passage comes from 1 peter 2:9 - 10, where peter describes believers in christ with the following identities: \"but you are chosen race, a roytal priesthood, a holy nation, a people for hia own possesion, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light. Based on this description peter outlined several expectations for the people of God:\n1. Proclaiming God's excellencies: The primary purpose of being chosen, a royal preisthood, and a holy nation is to proclaim the excellencies of God. this involves sharing the gospel and living in such a way that God's goodness and grace are made known to others.\n2. Living a holy life; as a holy nation, believers are expected to live holy lives that reflect their identity as God's people. This includes being set apart from the world and pursuing righteousness and purity.\n3. Being a people of God's possesion: believers are called to recognize that they belong to God. This involves acknowledging God's ownership over their lives and living in obedience to Him.\n4. Rejecting drakness: Peter constrasts being called out of darkness into God's marvelous light. Believers are expected to reject the ways of darkness, including sin and ungodliness, and to live in the light of God's truth and righteousness.\n5. Unity and community: As a chosen race and holy nation, believers are part of a community that transcends racial, cultural, and social boundaries. They are to live in unity and love with one another, reflecting the love of God.\n6. Sacrificial service: As a royal preisthood, believers are called to offer spiritual sacrifices acceptable to God through Jesus Christ (1 peter 2:5). This includes worship, prayer, and serving others in the name ogf Christ.\n7. Enduring persecution: Peter goes on to speak about the reality of suffering for the sake of righteousness (1 peter 3:14). Believers are expected to endure persecution and hardship with faith and patience, trusting in God's sovereignty and care. In conclusion, Peter's expectations for those described as a chosen race, a royal preisthood and a holy nation are centred on living life that reflects their identity in Christ proclaiming the gospel, living in holiness, unity, sacrificial service, and enduring suffering with faith and persevserance.\n(b) Peaceful coexistence among peoplw can be hindered by various factors as listed below:\n1. Misunderstandings and lack of communication: Poor communication and misunderstandings can lead to mistrust and conflict. When people dont understand each others perspective, beliefs, or cultural backgrounds, it can create barriers to peaceful coexistence.\n2. Prejudice and discrimination: Prejudice based on race, ethnicity, religion, or other factors can lead to discrimination and inequality. This can result in systemic barrierts that prevent certain groups from fully participating in society and can lead to resentment and conflict.\n3. Lack of respect for diversity: When individuals or groups do not respect the diversity of beliefs, traditions, and practices within a community, it can lead to intolerance and conflict. Embracing and celebrating diversity is essential for fostering peaceful coexistence.\n4. Inequality and Social Injustice: Economic disparities, unequal access to resources, and social injustices can create divisions and tensions within a society. Addressing these inequalities and promoting social justice are crucial for building a more harmonious community.\n5. Political and idealogical differences: Differences in political beliefs, idealogies, and values can create divisions and polarize communites. When individuals or groups are unwilling to engage in constructive dialogue and compromise, it can lead to conflict and hinder peaceful coexistence.\n6. Historical greivances and trauma: Pat conflicts, historical injustices, and unresolved grievances can create deep seated resentment and distrust among different groups. addressing historiacal trauma and promoting reconciliation are essential for healing and building peaceful relationships.",
    "year": "2024"
  }
]