[
  {
    "number": "25",
    "text": "(a)(i) Give the botanical names of Specimens A and B (ii) State four benefits of growing of specimens À and B together in a pasture.\n(b) State four management practices that could be carried out in pasture established with specimens A and B.\n(c) List two other common forages that could be used in place of specimen A in a pasture.\n(d) List with an example, the forms in which specimen B could be presented to livestock.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69687?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "26",
    "text": "(a)(i) State one use of specimen C in animal production. (ii) Name one nutrient which could be supplied by specimen C in livestock feed.\n(b) Mention two products each which could be obtained from each of specimens D, E and F.\n(c)(i) List three ways of preventing the growth of specimen E animal production. (ii) List four benefits of preventing the growth of specimen E in cattle.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69699?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "27",
    "text": "(a) Mention the major nutrient in each of specimens G, H, and J.\n(b)(i) Give two benefits that could be derived from feeding livestock with specimen G. (ii) State two effects of excessive consumption of specimen by poultry.\n(c) State five other feedstuffs that could be used in place of specimen H.\n(d) Name three effects of improper storage of specimen J in animal production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69700?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "28",
    "text": "(a)(i) List four sources of specimen Kin animal production. (ii) State four ways in which specimen K could be used in poultry production.\n(b) Stale four ways in which animals could be restrained using specimen L.\n(c) Name three activities whichl could be carried out using specimen L",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69701?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  }
]