[
  {
    "number": "1420",
    "text": "Government refers to all the following except",
    "options": {
      "A": "an academic field of study",
      "B": "an organized group of people that formulate policies",
      "C": "a process of making and enforcing laws",
      "D": "an institution made up of people with common interest"
    },
    "answer_url": "https://myschool.ng/classroom/government/45218?exam_type=waec&type=obj&page=284",
    "correct_answer": "D",
    "explanation": "Governmenttypically refers to:\nAn academic field of study: The study of government and political systems is a recognized academic discipline.An organised group of people that formulate policies: This describes how government functions, with organised groups (such as branches or departments) responsible for policy-making.A process of making and enforcing laws: Government involves the creation and enforcement of laws to maintain order and regulate society.\nAn institution made up of people with common interests, however, refers to organisations or groups that might not be governmental but are focused on shared goals or interests, such as clubs, societies, or special interest groups. These are not necessarily involved in the formal processes of governance.",
    "year": "2016"
  },
  {
    "number": "1421",
    "text": "All the following are experienced by a community without government except",
    "options": {
      "A": "insecurity",
      "B": "planned development",
      "C": "lawlessness",
      "D": "political anarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/45219?exam_type=waec&type=obj&page=285",
    "correct_answer": "B",
    "explanation": "In a community without government, issues such asinsecurity,lawlessnessandpolitical anarchyare commonly experienced due to the absence of organised structures to maintain order, enforce laws and provide security. However,planned developmentis not experienced in such a community.\nPlanned developmentrequires structured governance to create and implement development plans and policies. Without a government, there is usually no organised mechanism for planning and executing development projects.",
    "year": "2016"
  },
  {
    "number": "1422",
    "text": "As an academic field the study of government does not include",
    "options": {
      "A": "Political economy",
      "B": "Comparative politics",
      "C": "Public administration",
      "D": "Ecological interaction"
    },
    "answer_url": "https://myschool.ng/classroom/government/45220?exam_type=waec&type=obj&page=285",
    "correct_answer": "D",
    "explanation": "Government as an academic field of study:- is the study of political institutions and theories, which deals with the acquisition and use of political power. It is a social science subject taught in higher institution.",
    "year": "2016"
  },
  {
    "number": "1423",
    "text": "Which of the following systems of government is authoritarian in nature?",
    "options": {
      "A": "Capitalist system",
      "B": "Fascism",
      "C": "Republicanism",
      "D": "Constitutional monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/45222?exam_type=waec&type=obj&page=285",
    "correct_answer": "B",
    "explanation": "Fascism is a form of far right-wing, authoritarian ultranationalism characterized by dictatorial power, forcible suppression of opposition, and strong regimentation of society and of the economy\nFascismis a form of government which is a type of one-party dictatorship.Fascistsare against democracy. ...Fascismputs nation and often race above the individual. It stands for a centralized government headed by a dictator.",
    "year": "2016"
  },
  {
    "number": "1424",
    "text": "The system that allows the opposition to participate in governance is",
    "options": {
      "A": "dictatorial",
      "B": "collectivism",
      "C": "aristocratic",
      "D": "democratic"
    },
    "answer_url": "https://myschool.ng/classroom/government/45224?exam_type=waec&type=obj&page=285",
    "correct_answer": "D",
    "explanation": "In ademocraticcountry, all eligible citizens have the right to participate, either directly or indirectly, in making the decisions that affect them. It also allows the participation of the opposition in governance",
    "year": "2016"
  },
  {
    "number": "1425",
    "text": "Which of the following hinders the establishment of a representative government in a state?",
    "options": {
      "A": "Mass illiteracy",
      "B": "Existence of pressure groups",
      "C": "Vibrant political culture",
      "D": "Independent electoral commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/45226?exam_type=waec&type=obj&page=285",
    "correct_answer": "A",
    "explanation": "Illiteracyis a state whereby one is unable to read and write. In its simplest form, it can be defined as lack of any or sufficient education. Sometimes people who have had very basic education also experience challenges in reading and writing. When majority of the electorates are illiterates, electoral malpractice prevalent, making  representative government difficult",
    "year": "2016"
  },
  {
    "number": "1426",
    "text": "Which of the following is not an attribute of a state?",
    "options": {
      "A": "Definite territory",
      "B": "Population",
      "C": "Government",
      "D": "Common language"
    },
    "answer_url": "https://myschool.ng/classroom/government/45227?exam_type=waec&type=obj&page=286",
    "correct_answer": "D",
    "explanation": "The state has four essential attributes, Population, Territory, Government and Sovereignty. Population and territory constitute the physical basis of the State while government and sovereignty constitute its legal basis or political basis.",
    "year": "2016"
  },
  {
    "number": "1427",
    "text": "In a democracy political sovereignty is vested in the",
    "options": {
      "A": "judges",
      "B": "people",
      "C": "legislature",
      "D": "executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/45229?exam_type=waec&type=obj&page=286",
    "correct_answer": "B",
    "explanation": "Popular sovereigntyis the principle that the authority of a state and its government are created and sustained by the consent of its people, through their elected representatives (Rule by the People), who is the source of all political power.",
    "year": "2016"
  },
  {
    "number": "1428",
    "text": "According to Charles Montesquieu, the theory of separation of powers is to prevent",
    "options": {
      "A": "influence",
      "B": "authority",
      "C": "power",
      "D": "arbitrariness"
    },
    "answer_url": "https://myschool.ng/classroom/government/45230?exam_type=waec&type=obj&page=286",
    "correct_answer": "D",
    "explanation": "Baron deMontesquieuin in his book titled '' The Spirit of the Laws, argued for a constitutional government with three separate branches, each of which would have defined abilities to check the powers of the others. This is to prevent cases like arbitrariness.\nArbitrariness isthe quality of being based on random choice or personal whim, rather than any reason or system.",
    "year": "2016"
  },
  {
    "number": "1429",
    "text": "Decentralisation is a common feature of",
    "options": {
      "A": "totalitarian system of government",
      "B": "federal system of government",
      "C": "unitary system of government",
      "D": "fascist system"
    },
    "answer_url": "https://myschool.ng/classroom/government/45232?exam_type=waec&type=obj&page=286",
    "correct_answer": "B",
    "explanation": "Decentralization—the transfer of authority and responsibility for public functions from the central government to subordinate or quasi-independent government organizations. The governmental powers in a federal system of government is decentralized in a way that, authority and reponsibilities are shared among the federal, state and local government .",
    "year": "2016"
  },
  {
    "number": "1430",
    "text": "Bye-laws are made through",
    "options": {
      "A": "delegated legislation",
      "B": "executive instrument",
      "C": "presidential order",
      "D": "emergency power"
    },
    "answer_url": "https://myschool.ng/classroom/government/45234?exam_type=waec&type=obj&page=286",
    "correct_answer": "A",
    "explanation": "Delegated legislation means the exercise of legislative power by an agency that is subordinate to the legislature.\nNot alllawsaremadeby the government. Some Acts of Parliament give other organisations the power tomakelaws– usually local councils.",
    "year": "2016"
  },
  {
    "number": "1431",
    "text": "Power is transformed into legal authority through",
    "options": {
      "A": "force",
      "B": "prayers",
      "C": "influence",
      "D": "legitimacy"
    },
    "answer_url": "https://myschool.ng/classroom/government/45235?exam_type=waec&type=obj&page=287",
    "correct_answer": "D",
    "explanation": "Legitimacy is a political concept which referstothe acceptance and recognition by the citizens of a country the right of their rulerstogovern. Power is  transformed into legal authority by legitimizing it.",
    "year": "2016"
  },
  {
    "number": "1432",
    "text": "Conventions are mostly used by states that have",
    "options": {
      "A": "a large number of illiterates",
      "B": "a lot of people not interested in political activities",
      "C": "unwritten constitution",
      "D": "rigid constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/45237?exam_type=waec&type=obj&page=287",
    "correct_answer": "C",
    "explanation": "Conventions are mostly used by states that have anunwritten constitution. In such states, conventions are established practices or norms that are not formally codified in written law but are followed as part of the political system. These conventions help guide the functioning of government and fill gaps where the Constitution is silent.",
    "year": "2016"
  },
  {
    "number": "1433",
    "text": "One advantage of a flexible constitution is that it",
    "options": {
      "A": "can lead to dictatorship",
      "B": "can easily be manipulated",
      "C": "is best suited for a federation",
      "D": "can be amended by a simple majority"
    },
    "answer_url": "https://myschool.ng/classroom/government/45260?exam_type=waec&type=obj&page=287",
    "correct_answer": "D",
    "explanation": "1. A flexible constitution can be amended with the same ease and facility with which ordinary laws are altered. (with a simple majority voting in favor of its amendment)\n2.  A flexible constitution can easily adopt the needs of people with the change of time because of its elasticity.\n3. A flexible constitution is very useful for developing a country, because it is a great expression of its development. It does not hinder progress due to it's adaptability.\n4. Flexible constitution is moulded by the conventions of national life.",
    "year": "2016"
  },
  {
    "number": "1434",
    "text": "A constitution that requires complicated procedure for its amendment is",
    "options": {
      "A": "rigid",
      "B": "flexible",
      "C": "written",
      "D": "unwritten"
    },
    "answer_url": "https://myschool.ng/classroom/government/45262?exam_type=waec&type=obj&page=287",
    "correct_answer": "A",
    "explanation": "Rigid constitutionis  a constitution that is difficult or slow to change usually because of a prescribed process of amendment that is detailed and lengthy",
    "year": "2016"
  },
  {
    "number": "1435",
    "text": "The official who enforces discipline among members of his party in parliament is the",
    "options": {
      "A": "majority leader",
      "B": "minority leader",
      "C": "clerk of the House",
      "D": "chief whip"
    },
    "answer_url": "https://myschool.ng/classroom/government/45263?exam_type=waec&type=obj&page=287",
    "correct_answer": "D",
    "explanation": "The Chief Whip is a political office in some legislatures whose task is to administer the whipping system that tries to ensure that members of the party attend and vote as the party leadership desires.",
    "year": "2016"
  },
  {
    "number": "1436",
    "text": "When an action of the executive is declared ultra-vires, it is a control exercised by the",
    "options": {
      "A": "public",
      "B": "minister",
      "C": "judiciary",
      "D": "parliament"
    },
    "answer_url": "https://myschool.ng/classroom/government/45265?exam_type=waec&type=obj&page=288",
    "correct_answer": "C",
    "explanation": "Ultra-vires means acting or done beyond one's legal power or authority.",
    "year": "2016"
  },
  {
    "number": "1437",
    "text": "In a presidential system of government, the president can constitutionally be removed from the office through",
    "options": {
      "A": "persuasion",
      "B": "impeachment",
      "C": "coup d' etat",
      "D": "vote -of-no- confidence"
    },
    "answer_url": "https://myschool.ng/classroom/government/45269?exam_type=waec&type=obj&page=288",
    "correct_answer": "B",
    "explanation": "Impeachment is the process by which a legislative body levels charges against a government official. it is one of the ways a president can be removed  from office",
    "year": "2016"
  },
  {
    "number": "1438",
    "text": "One of the features of an absolute monarch is that the ruler",
    "options": {
      "A": "is elected by the electorate",
      "B": "has a definite tenure of office",
      "C": "is elected by the representatives of the people",
      "D": "wields the supreme power in a state"
    },
    "answer_url": "https://myschool.ng/classroom/government/45270?exam_type=waec&type=obj&page=288",
    "correct_answer": "D",
    "explanation": "Absolute monarchy, or absolutism, meant that the ultimate authority to run a state was in the hands of a king who ruled by divine right.",
    "year": "2016"
  },
  {
    "number": "1439",
    "text": "A notable feature of cabinet system of government is",
    "options": {
      "A": "collective responsibility",
      "B": "the separation of powers",
      "C": "violation of human rights",
      "D": "impeachment of the executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/45272?exam_type=waec&type=obj&page=288",
    "correct_answer": "A",
    "explanation": "The most distinctive characteristic of a Cabinet system of government is the complete and continuous responsibility of the executive to the legislature. Collectively, the Cabinet shapes the programme of legislation which is submitted to Parliament and from it emanates the broad and general policies.",
    "year": "2016"
  },
  {
    "number": "1440",
    "text": "All the following are the conditions for the adoption of federalism except",
    "options": {
      "A": "size",
      "B": "defence",
      "C": "population",
      "D": "homogeneity"
    },
    "answer_url": "https://myschool.ng/classroom/government/45273?exam_type=waec&type=obj&page=288",
    "correct_answer": "D",
    "explanation": "Different groups within a country mayadopt federalismas a means of preventing the over-concentration of power at the centre. This is one way in which they can prevent the country from drifting into dictatorship. States with a common historical background can come together to form a federation.\nHomogeneity is the quality or state of being all the same or all of the same kind.",
    "year": "2016"
  },
  {
    "number": "1441",
    "text": "The privileged citizens enjoyed in a country irrespective of sex, tribe or creed is",
    "options": {
      "A": "right",
      "B": "constitution",
      "C": "manifesto",
      "D": "franchise"
    },
    "answer_url": "https://myschool.ng/classroom/government/45275?exam_type=waec&type=obj&page=289",
    "correct_answer": "A",
    "explanation": "Therightsbelonging to an individual by virtue of citizenship, including civil liberties, due process, equal protection of the laws, and freedom from discrimination.",
    "year": "2016"
  },
  {
    "number": "1442",
    "text": "The judicial order requiring a detained person to be brought before a judge is the writ of",
    "options": {
      "A": "Habeas corpus",
      "B": "Mandamus",
      "C": "Prohibition",
      "D": "Certiorari"
    },
    "answer_url": "https://myschool.ng/classroom/government/45276?exam_type=waec&type=obj&page=289",
    "correct_answer": "A",
    "explanation": "Habeas corpus; is a writ requiring a person under arrest to be brought before a judge or into court, especially to secure the person's release unless lawful grounds are shown for their detention.",
    "year": "2016"
  },
  {
    "number": "1443",
    "text": "A political party can contest and win a widely accepted election if it has",
    "options": {
      "A": "the ability to rig election",
      "B": "intolerant attitude to oppositions",
      "C": "a broad-based membership",
      "D": "the support of very wealthy politicians"
    },
    "answer_url": "https://myschool.ng/classroom/government/45279?exam_type=waec&type=obj&page=289",
    "correct_answer": "C",
    "explanation": "A political party can win a widely accepted election when it has a broad / wide base of  members and supporters who will vote for the party during elections.",
    "year": "2016"
  },
  {
    "number": "1444",
    "text": "Political parties aim at all the following except",
    "options": {
      "A": "contesting elections",
      "B": "forming a government",
      "C": "organizing general elections",
      "D": "educating the electorate politically"
    },
    "answer_url": "https://myschool.ng/classroom/government/45283?exam_type=waec&type=obj&page=289",
    "correct_answer": "C",
    "explanation": "Partymembers in each branch suggest ideas forpartypolicies. They help choose, or pre-select,partycandidates for local, state and federal elections. They also assist with election campaigns, distribute 'how to vote' cards on Election Day, and help scrutinise the counting of votes.",
    "year": "2016"
  },
  {
    "number": "1445",
    "text": "Which of the following is not a means through which political parties reach the populace?",
    "options": {
      "A": "Posters",
      "B": "newspapers",
      "C": "schools",
      "D": "the internet"
    },
    "answer_url": "https://myschool.ng/classroom/government/45286?exam_type=waec&type=obj&page=289",
    "correct_answer": "C",
    "explanation": "Political parties typically use various means to reach the populace, including:\nPosters: Used for visual communication and advertising in public spaces.Newspapers: Provide news coverage and articles that can be used to convey political messages and party platforms.The internet: Offers a wide range of digital platforms (websites, social media) for engaging with voters and sharing information.\nSchools, however, are not used by political parties as a direct means of reaching the populace. While educational institutions may indirectly influence public opinion through education, they are not a primary medium for political campaigning or outreach.",
    "year": "2016"
  },
  {
    "number": "1446",
    "text": "An association whose ultimate aim is to influence government policies is known as",
    "options": {
      "A": "civil service",
      "B": "pressure group",
      "C": "political party",
      "D": "public corporation"
    },
    "answer_url": "https://myschool.ng/classroom/government/45288?exam_type=waec&type=obj&page=290",
    "correct_answer": "B",
    "explanation": "Pressure groupisa group that tries to influence government / public policy in the interest of a particular cause.",
    "year": "2016"
  },
  {
    "number": "1447",
    "text": "Membership of pressure groups is usually limited because they",
    "options": {
      "A": "pursue specific and narrow objectives",
      "B": "promote other people's interests",
      "C": "do not have dynamic leadership",
      "D": "promote the interest of the government"
    },
    "answer_url": "https://myschool.ng/classroom/government/45291?exam_type=waec&type=obj&page=290",
    "correct_answer": "A",
    "explanation": "Pressure groups often have limited membership because they focus onspecific and narrow objectives. These groups are formed around particular issues or causes, and their appeal may be limited to individuals who are particularly interested in or affected by those issues. This focus helps them to concentrate their efforts and resources effectively, but it also means that their membership base tends to be smaller and more specialised compared to broader organizations.",
    "year": "2016"
  },
  {
    "number": "1448",
    "text": "Elections are conducted to",
    "options": {
      "A": "provide permanent employment for the people",
      "B": "make the people choose their leaders",
      "C": "known the number of people in a country",
      "D": "know the social amenities in the community"
    },
    "answer_url": "https://myschool.ng/classroom/government/45296?exam_type=waec&type=obj&page=290",
    "correct_answer": "B",
    "explanation": "The nature of democracy is that elected officials are accountable to the people, and theymustreturn to the voters at prescribed intervals to seek their mandate to continue in office. Election ensures the citizens choose their preferred candidates to represent them at various elective position",
    "year": "2016"
  },
  {
    "number": "1449",
    "text": "Suffrage is also known as",
    "options": {
      "A": "franchise",
      "B": "plebiscite",
      "C": "public opinion",
      "D": "electoral college"
    },
    "answer_url": "https://myschool.ng/classroom/government/45299?exam_type=waec&type=obj&page=290",
    "correct_answer": "A",
    "explanation": "Suffrage is the right to vote in political elections. It is also known as franchise",
    "year": "2016"
  },
  {
    "number": "1450",
    "text": "For an election to be fair and free Electoral Commission must be",
    "options": {
      "A": "ready to manipulate results",
      "B": "ready to reject criticisms",
      "C": "headed by a minister in the executive",
      "D": "independent of other institutions of government"
    },
    "answer_url": "https://myschool.ng/classroom/government/45301?exam_type=waec&type=obj&page=290",
    "correct_answer": "D",
    "explanation": "An independent electoral commission ensures the conduct of free, fair and credible elections",
    "year": "2016"
  },
  {
    "number": "1451",
    "text": "Which of the following categories of people can vote in periodic elections?",
    "options": {
      "A": "Minors",
      "B": "Aliens",
      "C": "Lunatics",
      "D": "Citizens"
    },
    "answer_url": "https://myschool.ng/classroom/government/45303?exam_type=waec&type=obj&page=291",
    "correct_answer": "D",
    "explanation": "The following are some of the requirements for voting in an election;\nMust be a citizen of that country.At least 18 years of age on or before the date of the next election.A current resident of that country/stateNot in prison or on parole for a felony conviction.",
    "year": "2016"
  },
  {
    "number": "1452",
    "text": "The anonymity of a civil servant means that he",
    "options": {
      "A": "is above the law of the land",
      "B": "should take part in partisan politics",
      "C": "receives neither praise nor blame publicly",
      "D": "should be prosecuted for professional misconduct"
    },
    "answer_url": "https://myschool.ng/classroom/government/45304?exam_type=waec&type=obj&page=291",
    "correct_answer": "C",
    "explanation": "The anonymity of the civil service is linked to two concepts: permanence and neutrality. Civil servants, many of whom remain in their jobs whilst serving numerous governments, are thus likely to have to give advice to governments of different political parties, who may have different attitudes to policy. The advice they give needs to be given to ministers both freely and also without fear of adverse public or political reactions and without fear of future career damage.",
    "year": "2016"
  },
  {
    "number": "1453",
    "text": "Which of the following functions is performed by the civil service?",
    "options": {
      "A": "Enactment of laws",
      "B": "Settlement of disputes",
      "C": "Appointment of ministers",
      "D": "Implementation of policies"
    },
    "answer_url": "https://myschool.ng/classroom/government/45306?exam_type=waec&type=obj&page=291",
    "correct_answer": "D",
    "explanation": "The Civil service is the entity that is charged with the responsibility of carrying out government policies, providing services to the public and keeping the machinery of government running. One of the functions of the Civil Service is to implement the policies of the government of the day.",
    "year": "2016"
  },
  {
    "number": "1454",
    "text": "Public corporations are established to",
    "options": {
      "A": "make maximum profits",
      "B": "help businessmen",
      "C": "provide employment for defeated politicians",
      "D": "provide utility services to the public at minimal cost"
    },
    "answer_url": "https://myschool.ng/classroom/government/45310?exam_type=waec&type=obj&page=291",
    "correct_answer": "D",
    "explanation": "One of the major  reason for establishment of Public Corporation is to lower the prices of the goods and services they provide.",
    "year": "2016"
  },
  {
    "number": "1455",
    "text": "A minister controls public corporation by",
    "options": {
      "A": "provide the corporation's finances",
      "B": "auditing the accounts of the corporation personally",
      "C": "criticizing the corporation through the mass media",
      "D": "ensuring the effective administration of the corporation"
    },
    "answer_url": "https://myschool.ng/classroom/government/45311?exam_type=waec&type=obj&page=291",
    "correct_answer": "D",
    "explanation": "A minister's role with a public corporation is to oversee and ensure the effective administration of the corporation.",
    "year": "2016"
  },
  {
    "number": "1456",
    "text": "An institution of government that makes bye-laws is the",
    "options": {
      "A": "judiciary",
      "B": "executive",
      "C": "legislature",
      "D": "local authorities"
    },
    "answer_url": "https://myschool.ng/classroom/government/45312?exam_type=waec&type=obj&page=292",
    "correct_answer": "D",
    "explanation": "A byelaw is a law which is made by a body, such as a local authority, under an enabling power established by an Act of Parliament and which has been confirmed by the Secretary of State.",
    "year": "2016"
  },
  {
    "number": "1457",
    "text": "Local governments are created to",
    "options": {
      "A": "give more powers to the traditional rulers",
      "B": "bring the government closer to the people",
      "C": "make the people obey more of the local laws",
      "D": "take over the functions of the central government"
    },
    "answer_url": "https://myschool.ng/classroom/government/45313?exam_type=waec&type=obj&page=292",
    "correct_answer": "B",
    "explanation": "Local government brings about grass root inclusion and development. A grassroots movement is one which uses the people in a given district, region, or community as the basis for a political or economic movement.",
    "year": "2016"
  },
  {
    "number": "1458",
    "text": "Some pre-colonial West African governments were democratic because of the existence of",
    "options": {
      "A": "powerful traditional rulers",
      "B": "age grades",
      "C": "religious institutions",
      "D": "checks and balances"
    },
    "answer_url": "https://myschool.ng/classroom/government/45314?exam_type=waec&type=obj&page=292",
    "correct_answer": "D",
    "explanation": "In pre-colonial West Africa, some governance systems exhibited democratic features due to their internal mechanisms of checks and balances. These mechanisms ensured that power was not concentrated in the hands of a single individual or group. Instead, various institutions or councils had specific roles and powers that balanced each other.",
    "year": "2016"
  },
  {
    "number": "1459",
    "text": "One of the measures introduced by indirect rule was",
    "options": {
      "A": "collection and keeping of taxes by the chiefs only",
      "B": "not recognizing traditional institutions",
      "C": "fixing and collection of taxes by British officials themselves",
      "D": "exclusion of the educated elite from the colonial administration"
    },
    "answer_url": "https://myschool.ng/classroom/government/45315?exam_type=waec&type=obj&page=292",
    "correct_answer": "D",
    "explanation": "Educated elites were excluded in the administration of the colonial indirect rule system",
    "year": "2016"
  },
  {
    "number": "1460",
    "text": "Which of the following policies was replaced by the French Policy of Association?",
    "options": {
      "A": "Apartheid",
      "B": "Assimilation",
      "C": "Indirect rule",
      "D": "Frenchification"
    },
    "answer_url": "https://myschool.ng/classroom/government/45316?exam_type=waec&type=obj&page=292",
    "correct_answer": "B",
    "explanation": "The assimilation policy was a policy of absorbing Aboriginal people into white society through the process of removing children from their families. The ultimate intent of this policy was the destruction of Aboriginal society.",
    "year": "2016"
  },
  {
    "number": "1461",
    "text": "The appointment and deposition of chiefs by their people was a demand of the",
    "options": {
      "A": "Pan African Movements",
      "B": "National Congress of British West Africa",
      "C": "West African Students' Union",
      "D": "West African Youth League"
    },
    "answer_url": "https://myschool.ng/classroom/government/45317?exam_type=waec&type=obj&page=293",
    "correct_answer": "A",
    "explanation": "TheNational Congress of British West Africa (NCBWA)was a significant Pan-African and nationalist organization founded in 1944. It sought to address various issues affecting West Africa under colonial rule, including the political and social rights of the people. One of its key demands was for greater local control and autonomy, which included the appointment and deposition of chiefs by their own communities rather than by colonial authorities.",
    "year": "2016"
  },
  {
    "number": "1462",
    "text": "The desire for constitutional development in British West African Colonies was as a result of the",
    "options": {
      "A": "rigidity of the constitution",
      "B": "desire of the British to review the constitution",
      "C": "power of traditional rulers in British West Africa",
      "D": "growing agitation of the people for political independence"
    },
    "answer_url": "https://myschool.ng/classroom/government/45318?exam_type=waec&type=obj&page=293",
    "correct_answer": "D",
    "explanation": "The desire for constitutional development in British West African colonies stemmed primarily from the growing agitation of the people for political independence. As the people became more aware of their rights and the need for self-governance, they increasingly demanded reforms and constitutional changes that would lead to greater autonomy and eventual independence from British colonial rule. This movement was driven by educated elites, nationalists, and other groups pushing for political and social reforms.",
    "year": "2016"
  },
  {
    "number": "1463",
    "text": "The following are features of military regimes except",
    "options": {
      "A": "respect for human rights",
      "B": "suspension of the constitution",
      "C": "rules by decrees and  edicts",
      "D": "curtailment of human rights"
    },
    "answer_url": "https://myschool.ng/classroom/government/45319?exam_type=waec&type=obj&page=293",
    "correct_answer": "A",
    "explanation": "Military regimes are often characterised bysuspension of the constitution,rule by decrees and edictsandcurtailment of human rights. However, they are not typically associated withrespect for human rights. Instead, military governments tend to prioritise control and order at the expense of individual freedoms and rights.",
    "year": "2016"
  },
  {
    "number": "1464",
    "text": "Military regimes in West Africa have often made use of civilians because",
    "options": {
      "A": "only civilians can make decrees",
      "B": "the soldiers are democratic",
      "C": "civilians are part of the armed forces",
      "D": "they need the experience of civilians in government"
    },
    "answer_url": "https://myschool.ng/classroom/government/45320?exam_type=waec&type=obj&page=293",
    "correct_answer": "D",
    "explanation": "Military regimes in West Africa have often included civilians in their governments because civilians possess the necessary experience, expertise and knowledge of governance that military officers typically lack. While military officers may have control over the armed forces and security, civilians are often more familiar with the complexities of administration, law, economics and other aspects of government.",
    "year": "2016"
  },
  {
    "number": "1465",
    "text": "One criticism levelled against the pre-independence political parties in West Africa was that some of them",
    "options": {
      "A": "did not possess credible programmes",
      "B": "did not contribute to political development",
      "C": "were not national in outlook",
      "D": "were instruments of the colonial administration"
    },
    "answer_url": "https://myschool.ng/classroom/government/45321?exam_type=waec&type=obj&page=293",
    "correct_answer": "C",
    "explanation": "One major criticism of the pre-independence political parties in West Africa was that they often lacked anational outlook. This means that many of these parties were regionally or ethnically based, focusing on the interests of specific groups rather than representing the entire nation. This lack of a national perspective hindered their ability to unify the country and build a broad-based political movement that could effectively challenge colonial rule and promote national independence.",
    "year": "2016"
  },
  {
    "number": "1466",
    "text": "Foreign policy is the",
    "options": {
      "A": "general principles that guide foreigners in a country",
      "B": "policy made by a country during war",
      "C": "policy made by a country in peace time",
      "D": "general principles of a country in the conduct of international relations"
    },
    "answer_url": "https://myschool.ng/classroom/government/45322?exam_type=waec&type=obj&page=294",
    "correct_answer": "D",
    "explanation": "Foreign policy is simply a government's strategy in dealing with other nations.",
    "year": "2016"
  },
  {
    "number": "1467",
    "text": "The Commonwealth of Nations was originally made up of",
    "options": {
      "A": "former Portuguese colonies in Africa",
      "B": "former Spanish colonies in Africa",
      "C": "independent nations formerly under British Empire",
      "D": "France and her former colonies in West Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/45323?exam_type=waec&type=obj&page=294",
    "correct_answer": "C",
    "explanation": "The Commonwealth was first officially formed in 1926 when the Balfour Declaration of the Imperial Conference recognized the full sovereignty of dominions. Known as the \"British Commonwealth\", the original members were the United Kingdom, Canada, Australia, New Zealand, South Africa, Irish Free State, and Newfoundland.",
    "year": "2016"
  },
  {
    "number": "1468",
    "text": "Which of the following countries was not instrumental to the formation of the United Nations Organization (UNO)?",
    "options": {
      "A": "United States of America",
      "B": "Britain",
      "C": "Germany",
      "D": "USSR"
    },
    "answer_url": "https://myschool.ng/classroom/government/45324?exam_type=waec&type=obj&page=294",
    "correct_answer": "C",
    "explanation": "TheUnited Nations Organization (UNO)was established in 1945 after World War II to promote peace, security and cooperation among nations. The founding members included theUnited States of America,Britain, theUSSR, and many other countries.Germanywas not instrumental in the formation of the UNO because it was one of the defeated Axis powers in World War II and was not involved in the initial establishment of the organisation.",
    "year": "2016"
  }
]