[
  {
    "number": "49",
    "text": "Study the map extract provided on a scale of I 100,000 and answer the questions that follow. (Attach the topographical map extract to this answer booklet).\n(a) On the topographical map extract, mark and name the following features using the letters in the bracket: (i) the 1460 Primary Trigonometrical Station (PTS); (ii) col (CL); (iii) gentle (GS); (iv) an area that rises above 1900 feet in the north (ARS); (v) a confluence in the northwest (CF).\n(b) Calculate the gradient along line A to B, (Use the metric method of measurement) (c) Using evidence from the map, outline three reasons for which FUTUK is likely to be a more important settlement than Lungo.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64839?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "50",
    "text": "The Table F below shows the number of students who gained admission into three Nursing Training Schools from the years 2001 to 2003.\n                                                Table F\n\n\n\n        Nursing Training School\n     Year 2001\n    Year 2002\n   Year 2003\n\n\n                         A\n         40\n          60\n        50\n\n\n                         B\n         50\n          40\n        40\n\n\n                         C\n         60\n          30\n        40\n\n\n\n(a) Represent the data in Table F with a compound bar graph, using the years as the base of the graph (x-axis) and a scale of 2 cm to 20 students on the vertical axis (y-axis).\n(b) Calculate: (i) the number of students who gained admission into Nursing Training School A for the entire period; (ii) the number of students who gained admission into the three Nursing Training Schools in the year 2003; (iii) the difference in enrolment between students who gained admission into Nursing Training Schools  A and C for the entire period.\n(c) Outline one major difference between a Simple bar chart and a compound bar chart.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64855?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "51",
    "text": "(a) List two examples of volcanic mountains in the world.\n(b) With the aid of annotated diagram, describe how composite cones are formed.\n(c) Outline three causes of landslides.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64859?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "52",
    "text": "(a) Name three processes of wind transportation in an arid region.\n(b) With the aid of a diagram, describe the characteristics and mode of formation of a deflation hollow.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64866?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "53",
    "text": "(a) Explain four reasons for which temperature decreases with height within the troposphere.\n(b) With the aid of a diagram, describe the mode of formation of orographic rainfall.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64870?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "54",
    "text": "(a) What is volcanic intrusion ?\n(b) Describe the characteristics and mode of formation of a block mountain.\n(c) List three landforms that are associated with intrusive volcanic activities.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64874?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "55",
    "text": "(a) List: (i) three factors that influence weathering; (ii) two effects of landslides.\n(b) Describe the following processes of weathering: (i) exfoliation; (ii) frost action.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64892?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  },
  {
    "number": "56",
    "text": "(a) Define the term ecosystem.\n(b) Describe the main components of the ecosystem citing two examples of each.\n(c) Explain two ways in which the components of the ecosystem are interdependent.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/geography/64896?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2022"
  }
]