[
  {
    "number": "37",
    "text": "(a) In the laboratory preparation of crystals of CuSO\\(_4\\), a green powder Q was added to dilute H\\(_2\\)SO\\(_4\\), and stirred. Effervescence occurred and a gas R was given off which turned lime water milky. Excess Q was removed from the mixture. The solution of Cu\\(_2\\)SO\\(_4\\) was concentrated to half its original volume and allowed to stand.\n(i) What is substance Q?\n(ii) Name gas R\n(ii) Why was excess Q used?\n(iv) How would you know that the reaction is complete?\n(v) What method was used to remove excess Q? (vi) Why was the solution of CusO\\(_4\\) not heated to dryness?\n(b) Name the reagent(s) used for testing each of the following substances in the laboratory: (i) Water; (i) Primary alkanol.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60031?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  },
  {
    "number": "38",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely recorded, and for accurate inferences. All tests, observations, and inferences must be clearly centered in your answer book, at the time they are made.\nC is a mixture of two salts. Carry outline following exercises on C. Record your observations and identify any gas(es) evolved. State the conclusion you draw from the result of each test.\n(a) Put C into a beaker and add about 10 cm\\(^3\\) of distilled water, stir the mixture, and filter. Test the filtrate with litmus paper. Keep the residue and the filtrate.\n(b)(i) To about 2 cm\\(^3\\) of the filtrate, add few drops of aqueous HNO\\(_3\\) followed by AgNO\\(_{3(aq)}\\) \n(ii) Add excess NH\\(_3\\) solution to the resulting mixture.\n(c) To about half of the residue from (a) above, add about 5cm\\(^3\\) of dilute HNO\\(_3\\) in drops. Divide the resulting solution into two equal portions.\n(d)(i) To the first portion add ammonia solution in drops and then in excess.\n(ii) To the second portion add dilute hydrochloric acid.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60032?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  },
  {
    "number": "39",
    "text": "Burette readings(initial and final) must be given to two decimal places. Volume of pipette user must also be recorded but on account of experimental procedure is required. All calculations must be done in your answer book. A is O.050 mol dm\\(^{-3}\\) of acid HX. Bis a solution of NaOH containing 0.025 moles per 250 solutions.\n(a) Put A into the burette and titrate it against 20.00 cm\\(^3\\) or 25.00 cm\\(^3\\) portions B using phenolphthalein as indicator. Tabulate your readings and calculate the average volume or A used.\n \n(b) your results and the information provided above, calculate the;\n(i) amount of acid in the average\n(ii) amount of base in 20.00 cm\\(^3\\) or 25.00 cm\\(^3\\);\n(iii) mole ratio of acid to base\n \n(c) Write a balanced chemical equation for the reaction between the acid H\\(_y\\)X and the base NaOH\n(d) State the basicity of the acid H\\(_y\\)X.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60033?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  }
]