[
  {
    "number": "13",
    "text": "You are provided with a uniform metre rule, a knife-edge, some masses and other necessary materials.\ni. Determine and record the centre of gravity of the metre rule.\nii. Fix the 100g mass marked N at a point Y, the 80cm mark of the rule using a sellotape.\niii. Suspend another 50g mass marked M at X, a distance A = 1Ocm from the 0cm mark of the rule.\niv. Balance the arrangement horizontally on the knife edge as illustrated in the diagram above.\nv. Measure and record the distance B of a knife-edge from the 0cm mark of the rule.\nvi. Repeat the procedure for four other values of A =15cm, 20cm, 25cm and 30cm.\nvii. Tabulate your readings.\nviii. Plot a graph with B on the vertical axis and A on the horizontal axis.\nix. Determine the slope, s, of the graph.\nx. Also determine the intercept, c, on the vertical axis.\nxi. Evaluate:\n\\(\\propto\\)) = k\\(_{1}\\) = (\\(\\frac{1 - 2s}{s}\\))100\n(\\(\\beta\\)) =  k\\(_{2}\\) = \\(\\frac{2c}{s}\\) = 160\nxii. State two precautions taken to obtain accurate results.\n(b)i. Define the moment of a force about a point.\nii. State two conditions under which a rigid body at rest remains in equilibrium when acted upon by non-parallel coplanar forces.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59939?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "14",
    "text": "You are provided with a beaker, a thermometer, a stirrer, a measuring cylinder, a bunsen burner, a wire gauze, a 50g mass, a pair of tongs, water, tripod stand, and other necessary materials.\ni. Using the measuring cylinder, measure 150cm\\(^{3}\\) of water into the beaker.\nii. Record the volume v of the water in the beaker\niii. Calculate the mass m of the water, given that m = pv and; p = 1gcm\\(_{-3}\\). \niv. Measure and record the initial temperature \\(\\theta_{0}\\) of the water in the beaker.\nv. Hold the 50g mass with the pair of tongs in the flame of the bunsen burner for 2 minutes.\nvi. Quickly transfer the 50g mass to water in the beaker.\nvii. Stir gently and record the highest temperature \\(\\theta_{1}\\), attained\nviii. Evaluate \\(\\theta\\) = (\\(\\theta_{1}\\) - \\(\\theta_{0}\\)).\nix. Empty the content of the beaker and repeat the procedures above for the values of v = 200cm\\(^{3}\\), 250cm\\(^{3}\\), 300cm\\(^{3}\\), and 350 cm\\(^{3}\\).\nx. Tabulate your readings.\nxi. Plot a graph with m on the vertical axis and \\(\\theta\\) on the horizontal axis.\nxii. Determine the slope, s, of the graph.\nxiii. Evaluate k = \\(\\frac{50}{s}\\).\nxiv. State two precautions taken to obtain accurate results.\n(b)i. Define heat capacity.\nii. An electric kettle rated 1.2kw is used to heat 800g of water initially at a temperature of 20 C. Neglecting heat losses, calculate the time taken for the kettle to heat the water to its boiling point. [Take the boiling point of water= 101 C specific heat capacity of water = 4200 Jkg' K'1 (odv)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59945?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "15",
    "text": "You are provided with a variable d.c. power supply E, a 2\\(\\propto\\) standard resistor, a key, an ammeter, a voltmeter and other necessary materials.\ni. Set up a circuit as shown in the diagram above with E= 1.5V\nii. Close the key k.\niii. Take and record the voltmeter reading V.\niv. Take and record the corresponding ammeter reading l.\nv. Evaluate V\\(^{-1}\\) and l\\(^{-1}\\)  \nvi. Repeat the procedure for four other values of E= 3.0V, 4.5V, 6.0V, and 7.4V.\nvii. Tabulate your readings.\nviii. Plot a graph with V\\(^{-1}\\)  on the vertical axis and l\\(^{-1}\\) on the horizontal axis starting both axes from the origin (0, 0).\nix. Determine the slope, s, of the graph.\nx. Also determine the intercept, e, on the vertical axis.\nxi. State two precautions taken to obtain accurate results.\n(b)i. State two methods by which an electric current can be produced.\nii\n\nCalculate the value of R in the circuit diagram shown above, given that the effective resistance of the circuit is 4.0\\(\\Omega\\) and the internal resistance of the cell is negligible.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59950?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  }
]