[
  {
    "number": "75",
    "text": "You have learnt that your younger brother intends to involve i=himself in examination malpractice during his WASSCE. Write a letter to him warning him of the dangers of such an action and urging him to concentrate on his studies.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51065?exam_type=waec&type=theory&page=15",
    "correct_answer": "43, Bloomfield Street,lkoyi,Lagos.14th May, 2008.Dear Tolu,I was unhappy when !learnt that you intend to involve yourself in examination malpractice during the forthcoming WASSCE. It will be quite unfortunate if you involve yourself in such despicable act. I would like to highlight some of the dangers inherent in examination malpractices so that you can realize that nothing pays as hardwork.Tolulope, I hope you know that the punishment for anybody who engages in examination malpractice is twenty-five year imprisonment. This is quite scary and intimidating as it is not a joke for someone to be behind bars for twenty-five years. It is better imagined than being real because such years would be regarded as wasted.Secondly, the disgrace and social stigma that always accompany the ultimate loss of integrity, if you are caught, is also better imagined. Those who were caught engaging in examination malpractice in the past don't regain their integrity throughout their lives. They live in disgrace and humiliation for the rest of their lives and I known that you wouldn't want to bring such disgrace upon yourself. Apart from this, I am sure that you know that our parents would not be happy with you when they hear that you engage in examination malpractice.Moreover, examination malpractice destroys the intelligence and the confidence of whoever engages in it. Defi-nitely, when you depend on 'expo', as it is commonly referred to by students, you will loss your reading ability and, trust me, you won't be able to stop depending on it. This could be disastrous as you are likely to depend on examination malpractice for every other examinations you have to write.Lastly, I'm sure that you've heard the word 'nemesis'. It surely catches up with whoever engages in any evil practice. My brother, students might be involving themselves in examination malpractice and get away with it now but they always reap what they have sown later in life. This is the reason many university undergraduates find it difficult to cope with their studies after gaining admission into the university.I hope that you now understand that examination malpractice is not the way forward at all and I believe that you will desist from it. It is always better to work hard because it pays. Besides this, when there is no pain, there is no gain, so it will be more rewarding for you to concentrate on your studies than engaging in examination malpractice.Did you receive the success card that I sent to you? I know that you are brilliant and you can make it. Anyway I wish you the best. May the good Lord crown your effort with huge success.Yours sincerelyOlumide",
    "explanation": "43, Bloomfield Street,lkoyi,Lagos.14th May, 2008.Dear Tolu,I was unhappy when !learnt that you intend to involve yourself in examination malpractice during the forthcoming WASSCE. It will be quite unfortunate if you involve yourself in such despicable act. I would like to highlight some of the dangers inherent in examination malpractices so that you can realize that nothing pays as hardwork.Tolulope, I hope you know that the punishment for anybody who engages in examination malpractice is twenty-five year imprisonment. This is quite scary and intimidating as it is not a joke for someone to be behind bars for twenty-five years. It is better imagined than being real because such years would be regarded as wasted.Secondly, the disgrace and social stigma that always accompany the ultimate loss of integrity, if you are caught, is also better imagined. Those who were caught engaging in examination malpractice in the past don't regain their integrity throughout their lives. They live in disgrace and humiliation for the rest of their lives and I known that you wouldn't want to bring such disgrace upon yourself. Apart from this, I am sure that you know that our parents would not be happy with you when they hear that you engage in examination malpractice.Moreover, examination malpractice destroys the intelligence and the confidence of whoever engages in it. Defi-nitely, when you depend on 'expo', as it is commonly referred to by students, you will loss your reading ability and, trust me, you won't be able to stop depending on it. This could be disastrous as you are likely to depend on examination malpractice for every other examinations you have to write.Lastly, I'm sure that you've heard the word 'nemesis'. It surely catches up with whoever engages in any evil practice. My brother, students might be involving themselves in examination malpractice and get away with it now but they always reap what they have sown later in life. This is the reason many university undergraduates find it difficult to cope with their studies after gaining admission into the university.I hope that you now understand that examination malpractice is not the way forward at all and I believe that you will desist from it. It is always better to work hard because it pays. Besides this, when there is no pain, there is no gain, so it will be more rewarding for you to concentrate on your studies than engaging in examination malpractice.Did you receive the success card that I sent to you? I know that you are brilliant and you can make it. Anyway I wish you the best. May the good Lord crown your effort with huge success.Yours sincerelyOlumide",
    "year": "2008"
  },
  {
    "number": "76",
    "text": "Write an article suitable for publication in one of your national dialies discussing the vandalistion of publuic facilites on your country and its effects.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51073?exam_type=waec&type=theory&page=16",
    "correct_answer": "VANDALISATION OF PUBLIC FACILITIES IN MY COUNTRY\nIt is a common sight in Nigeria to see public facilities vandalized. Street light, telecommunication cables, express roads or highway dividends and even pipe-lines are often vandalized by unscrupulous Nigerians. in almost all our cities and towns, public facilities which are provided by government are damaged soon after they have been in-stalled. Vandalisation of public facilities is a thing that should give any Nigerian a serious. concern.\nThis is so because the rate at which these facilities are being vandalized is alarming and disturbing. The public street. lights which is meant to provide illumination at night to motorists and pedestrians alike are vandalized, thus throwing most of our major streets into darkness. The most outrageous vandalisation is that of the petroleum pipe-lines which mostly result in conflagration that destroys people and properties.\nVandalisation of public facilities is a direct result of our bad perception that government properties or facilities are nobody's properties. As a result of this, we are non-chalant about taking proper care of them. This makes some unscrupulous Nigerians to take delight in destroying public facilities without impunity. We often forget that government spends a lot of money in replacing these vandalized facilities and where government fails to replace them, many people suffer for the action of these few vandals.\nObviously, vandalisation of public facilities in my country is a negative trend that must be discouraged because of its effects. Firstly, foreigners living in the country see how Nigerians willfully vandalise public facilities which probably looks strange to them. As a result of this, the image of the country suffers as the country will be regarded as the country of vandals by these foreigners. Other countries will regard us as people who could not keep and maintain the facilities provided for them. Unfortunately enough, an average Nigerian will be regarded as a vandal who willfully destroys things.\nBesides this, vandalisation of public facilities can only lead us to wastage of tax payers' money. These facilities are provided with the money obtained through tax and their vandalisation is mere wastage of the money with which these facilities are provided. Government is not encouraged to provide more of these facilities as they have to replace them soon after they are put in place.\nVandalisation has resulted in loss of lives in the country. Most Nigerians have been killed through armed robbery at night while some other ones have lost their lives through ghastly motor accidents simply because they are traveling at night on the roads which are in darkness as a result of vandalisation of the light provided by government; More lives are lost through vandalisation of petroleum pipe-line which often explode as people scoop fuel from vandalized pipes.\nIn conclusion, vandalisation of public facilities should be condemned and discouraged. Stiffer penalties should be meted out to those who are caught vandalizing public amenities and there should be no sacred cows. Lastly, we need to re-orientate Nigerians towards making them regard public facilities as their own which must be jealously guarded and maintained by every Nigerian.\nBisola Adenrele",
    "explanation": "VANDALISATION OF PUBLIC FACILITIES IN MY COUNTRY\nIt is a common sight in Nigeria to see public facilities vandalized. Street light, telecommunication cables, express roads or highway dividends and even pipe-lines are often vandalized by unscrupulous Nigerians. in almost all our cities and towns, public facilities which are provided by government are damaged soon after they have been in-stalled. Vandalisation of public facilities is a thing that should give any Nigerian a serious. concern.\nThis is so because the rate at which these facilities are being vandalized is alarming and disturbing. The public street. lights which is meant to provide illumination at night to motorists and pedestrians alike are vandalized, thus throwing most of our major streets into darkness. The most outrageous vandalisation is that of the petroleum pipe-lines which mostly result in conflagration that destroys people and properties.\nVandalisation of public facilities is a direct result of our bad perception that government properties or facilities are nobody's properties. As a result of this, we are non-chalant about taking proper care of them. This makes some unscrupulous Nigerians to take delight in destroying public facilities without impunity. We often forget that government spends a lot of money in replacing these vandalized facilities and where government fails to replace them, many people suffer for the action of these few vandals.\nObviously, vandalisation of public facilities in my country is a negative trend that must be discouraged because of its effects. Firstly, foreigners living in the country see how Nigerians willfully vandalise public facilities which probably looks strange to them. As a result of this, the image of the country suffers as the country will be regarded as the country of vandals by these foreigners. Other countries will regard us as people who could not keep and maintain the facilities provided for them. Unfortunately enough, an average Nigerian will be regarded as a vandal who willfully destroys things.\nBesides this, vandalisation of public facilities can only lead us to wastage of tax payers' money. These facilities are provided with the money obtained through tax and their vandalisation is mere wastage of the money with which these facilities are provided. Government is not encouraged to provide more of these facilities as they have to replace them soon after they are put in place.\nVandalisation has resulted in loss of lives in the country. Most Nigerians have been killed through armed robbery at night while some other ones have lost their lives through ghastly motor accidents simply because they are traveling at night on the roads which are in darkness as a result of vandalisation of the light provided by government; More lives are lost through vandalisation of petroleum pipe-line which often explode as people scoop fuel from vandalized pipes.\nIn conclusion, vandalisation of public facilities should be condemned and discouraged. Stiffer penalties should be meted out to those who are caught vandalizing public amenities and there should be no sacred cows. Lastly, we need to re-orientate Nigerians towards making them regard public facilities as their own which must be jealously guarded and maintained by every Nigerian.\nBisola Adenrele",
    "year": "2008"
  },
  {
    "number": "77",
    "text": "Write a letter to the Minister of Works in your country complaining about the deplorable condition of roads in your area and the effects this has on the lives of your people.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51075?exam_type=waec&type=theory&page=16",
    "correct_answer": "Bloomfied Comprehensive High School,\n7-8 Olofin Street,\nYaba,\nLagos\n13th May, 2008.\nThe Minister,\nMinistry of Works,\nP.M.B. 207,\nGarki, Abuja.\nDear Madam,\nCOMPLAINT ABOUT THE DEPLORABLE CONDITION OF ROADS IN MY AREA\nI wish to complain about the deplorable condition of the roads in my area. The roads in my area are in such a deplorable condition that the people in my area have started doubting whether they are Nigerians. The condition of these roads has debilitating effects on the lives of my people.\nThe potholes on these roads have damaging effects on the vehicles plying the roads. Both the private owners of vehicles and commercial bus drivers are wailing daily, complaining about the damaging effects of these roads on their vehicles. Many private car owners have parked their cars because they spend a lot of money repairing their cars which are damaged daily as a result of the poor state of the roads while many transporters have withdrawn their vehicles from the roads. This ultimately affects movement of people and goods from one place to the other in the area. As a result of this, transport fare is exorbitant.\nSecondly, the roads have become danger zone for travelers who are traveling from one community to the other. Apart from the incessant road accidents and loss of lives which would have been prevented if these roads were to be in good shape, armed robbers constantly dispossess commuters of their belongings and valuables on these roads. The worst incidence of such robbery happened a month ago when some of our people were robbed on their way to the market which was caused by the deplorable condition of the roads. Madam, the most painful scene of this incident was that the young girls who were traveling in the bus were raped by these criminals.\nMoreover, these bad roads deny us of things we are supposed to benefit from. For instance, it was discovered that our area is enclosed with some natural resources which foreign explorers promised to come and explore but could not come to begin their mining operations because of the bad roads. If not for the deplorable condition of our roads, our community would have contributed immensely to the revenue of the country.\nMadam, I have heard of the good work that you have done in many parts of the country and I know that you are a kind woman who would not like people to suffer. Therefore, I would appreciate it, if you could use your good offices to repair the roads in my area.\nYours faithfully,\n(Signature)\nOlusegun Famakin",
    "explanation": "Bloomfied Comprehensive High School,\n7-8 Olofin Street,\nYaba,\nLagos\n13th May, 2008.\nThe Minister,\nMinistry of Works,\nP.M.B. 207,\nGarki, Abuja.\nDear Madam,\nCOMPLAINT ABOUT THE DEPLORABLE CONDITION OF ROADS IN MY AREA\nI wish to complain about the deplorable condition of the roads in my area. The roads in my area are in such a deplorable condition that the people in my area have started doubting whether they are Nigerians. The condition of these roads has debilitating effects on the lives of my people.\nThe potholes on these roads have damaging effects on the vehicles plying the roads. Both the private owners of vehicles and commercial bus drivers are wailing daily, complaining about the damaging effects of these roads on their vehicles. Many private car owners have parked their cars because they spend a lot of money repairing their cars which are damaged daily as a result of the poor state of the roads while many transporters have withdrawn their vehicles from the roads. This ultimately affects movement of people and goods from one place to the other in the area. As a result of this, transport fare is exorbitant.\nSecondly, the roads have become danger zone for travelers who are traveling from one community to the other. Apart from the incessant road accidents and loss of lives which would have been prevented if these roads were to be in good shape, armed robbers constantly dispossess commuters of their belongings and valuables on these roads. The worst incidence of such robbery happened a month ago when some of our people were robbed on their way to the market which was caused by the deplorable condition of the roads. Madam, the most painful scene of this incident was that the young girls who were traveling in the bus were raped by these criminals.\nMoreover, these bad roads deny us of things we are supposed to benefit from. For instance, it was discovered that our area is enclosed with some natural resources which foreign explorers promised to come and explore but could not come to begin their mining operations because of the bad roads. If not for the deplorable condition of our roads, our community would have contributed immensely to the revenue of the country.\nMadam, I have heard of the good work that you have done in many parts of the country and I know that you are a kind woman who would not like people to suffer. Therefore, I would appreciate it, if you could use your good offices to repair the roads in my area.\nYours faithfully,\n(Signature)\nOlusegun Famakin",
    "year": "2008"
  },
  {
    "number": "78",
    "text": "You are a chief speaker in a debate on the topic: The Television has done more harm than good. Write your speech for or against the topic.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51081?exam_type=waec&type=theory&page=16",
    "correct_answer": "THE TELEVISION HAS DONE MORE GOOD THAN HARMChairman, Panel of Judges, Co-debaters, Ladies and Gentlemen, I am here to oppose the motion which claims that the television has done more harm than good. If we look critically at the issue of the debate, we woulds ee that the television has contributed immensely to the development of our society. Television is an electronic device used in disseminating information to people.First and foremost, television is a means of passing information to several people. It is one of the important means of the mass media through which people are exposed to all sorts of things. Television is like a connecting which connects the countries of the world, as people get to know what is going on in other parts of the world far away from theirs. Is it not true that many of us get to see what is happening in far away places through television? Events taking place in America and Europe are viewed in Africa as they are unfolding through television.Apart from this, television serves as a means of entertainment. A home without television becomes very dull. Musical videos and dramas on television keep many people active and happy and we even have some comedy programmes that make people laugh to keep them away from sorrow. Most of these educative programmes like 'Who wants to be a millionaire' and 'Mind your language' keep many students educated and entertained. Besides, several wild-life documentaries and other ones beamed on television entertain people as well as keeping us informed.Furthermore, television which shows us how festivals like Christmas, Easter, Id-el-Fitri and other celebrations are done in various parts of the world helps us to appreciate other people's arts and culture. An example is my family where each member of the family has a country he or she wishes to live in in future. It is easy for each of us to make a choice because we have learnt to appreciate the culture of the various people of the world through television.My opponent might argue that television distracts the attention of people from what they are doing and that it keeps students away from their studies but I sincerely want to tell you that a planned routine in the home which makes children know when to watch television will make them achievers in life.Chairman, Panel of Judges and my distinguished audience, you will all agree with me that the advantages of television are too numerous to be challenged by few disadvantages. Has the television done more harm than good? The answer is No. With all my points, I hope all and sundry is convinced that the television has done more good than harm. Thank you.",
    "explanation": "THE TELEVISION HAS DONE MORE GOOD THAN HARMChairman, Panel of Judges, Co-debaters, Ladies and Gentlemen, I am here to oppose the motion which claims that the television has done more harm than good. If we look critically at the issue of the debate, we woulds ee that the television has contributed immensely to the development of our society. Television is an electronic device used in disseminating information to people.First and foremost, television is a means of passing information to several people. It is one of the important means of the mass media through which people are exposed to all sorts of things. Television is like a connecting which connects the countries of the world, as people get to know what is going on in other parts of the world far away from theirs. Is it not true that many of us get to see what is happening in far away places through television? Events taking place in America and Europe are viewed in Africa as they are unfolding through television.Apart from this, television serves as a means of entertainment. A home without television becomes very dull. Musical videos and dramas on television keep many people active and happy and we even have some comedy programmes that make people laugh to keep them away from sorrow. Most of these educative programmes like 'Who wants to be a millionaire' and 'Mind your language' keep many students educated and entertained. Besides, several wild-life documentaries and other ones beamed on television entertain people as well as keeping us informed.Furthermore, television which shows us how festivals like Christmas, Easter, Id-el-Fitri and other celebrations are done in various parts of the world helps us to appreciate other people's arts and culture. An example is my family where each member of the family has a country he or she wishes to live in in future. It is easy for each of us to make a choice because we have learnt to appreciate the culture of the various people of the world through television.My opponent might argue that television distracts the attention of people from what they are doing and that it keeps students away from their studies but I sincerely want to tell you that a planned routine in the home which makes children know when to watch television will make them achievers in life.Chairman, Panel of Judges and my distinguished audience, you will all agree with me that the advantages of television are too numerous to be challenged by few disadvantages. Has the television done more harm than good? The answer is No. With all my points, I hope all and sundry is convinced that the television has done more good than harm. Thank you.",
    "year": "2008"
  },
  {
    "number": "79",
    "text": "Write a story to illustrate the saying:  The ealry birds catches the worm.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51082?exam_type=waec&type=theory&page=16",
    "correct_answer": "THE EARLY BIRD CATCHES THE WORM\nThere lived in Gwabi two friends whose names were Francis and Chukwuma. They were intimate friends and their friendship started from childhood. These two friends were brought up in the same village where their friendship began. Their friendship continued after leaving the village and decided to settle down in Gwabi. In Gwabi. these two friends went into the same type of business of fabricating spare parts for industrial machines.\nFrancis and Chukwuma were in this business for a long period of time, struggling very hard to make a living. Though Gwabi was a big city that was full of opportunities, these two friends toiled daily to eke out a living. It got to a time in their lives of struggle when they thought that they were dogged by misfortunes. Hard as they struggled daily to eke out a living. difficult was it for them to make an headway. \"I don't know why we are unlucky. Those who started after us are doing well\". said Francis. As despondent as Francis was, he continued to struggle hard with his friend, Chukwuma, serving as a source of encouragement for him. \"Don't be discouraged because I know that our own time will come\". Chukwuma always said to his friend and business partner.\nThe story that changed the misfortune of one of these two friends started with Chukwuma's business trip to Gwandu, a neighbouring city to Gwabi where he and his friend, Francis, were living. Chukwuma had traveled there to buy some metal scraps with which they would fabricate some tools in their workshop for a company that had asked them to make the tools for its factory. After buying the metal scraps, he ran into lfeanyi, another friend of theirs. Ifeanyi had become a successful businessman and he had just arrived from an overseas trip. Chukwuma narrated the hardship and difficulty he and his friend, Francis, were passing through in Gwabi. lfeanyi then promised to introduce them to a man who helped to give him the opportunity to break even in his business of selling vehicles.\nWhen Chukwuma got back to Gwabi, he told his friend how he met Ifeanyi and the promise that he made. Two weeks after Chukwuma and Francis set out for Gwandu to see Ifeanyi. They went to meet Ifeanyi in his office through the address he gave them. After entertaining them, he took them to Chief lberemadu who after listening to them promised to help at least one of them to travel abroad where he would have the opportunity to stay, depending on the readiness of any of the two friends to make a good use of the opportunity. Chief lberemadu asked them to come back in one week's time.\nOn the day that they were to come and see Chief Iberemadu, Francis woke up early in the morning to wait for his friend, Chukwuma at their workshop where they had agreed to meet by 5.30 am. He waited for Chukwuma to come for thirty minutes before setting out for Gwandu to see Chief lberemadu. Francis got to the Chiefs house at 6.45am and the Chief gave him the document with which he would travel abroad and a cash donation of five million dollars.\nChukwuma arrived Chief Eberemadu's house at 8.00arn with lfeanyi. The chief welcomed them and said that he had given all what he intended to give to Francis because he made use of the opportunity he offered maximally. There was nothing Ifeanyi could do to make the chief change his mind to help Chukwuma. He then turned to him and said that, \"the early bird catches the worm.\"",
    "explanation": "THE EARLY BIRD CATCHES THE WORM\nThere lived in Gwabi two friends whose names were Francis and Chukwuma. They were intimate friends and their friendship started from childhood. These two friends were brought up in the same village where their friendship began. Their friendship continued after leaving the village and decided to settle down in Gwabi. In Gwabi. these two friends went into the same type of business of fabricating spare parts for industrial machines.\nFrancis and Chukwuma were in this business for a long period of time, struggling very hard to make a living. Though Gwabi was a big city that was full of opportunities, these two friends toiled daily to eke out a living. It got to a time in their lives of struggle when they thought that they were dogged by misfortunes. Hard as they struggled daily to eke out a living. difficult was it for them to make an headway. \"I don't know why we are unlucky. Those who started after us are doing well\". said Francis. As despondent as Francis was, he continued to struggle hard with his friend, Chukwuma, serving as a source of encouragement for him. \"Don't be discouraged because I know that our own time will come\". Chukwuma always said to his friend and business partner.\nThe story that changed the misfortune of one of these two friends started with Chukwuma's business trip to Gwandu, a neighbouring city to Gwabi where he and his friend, Francis, were living. Chukwuma had traveled there to buy some metal scraps with which they would fabricate some tools in their workshop for a company that had asked them to make the tools for its factory. After buying the metal scraps, he ran into lfeanyi, another friend of theirs. Ifeanyi had become a successful businessman and he had just arrived from an overseas trip. Chukwuma narrated the hardship and difficulty he and his friend, Francis, were passing through in Gwabi. lfeanyi then promised to introduce them to a man who helped to give him the opportunity to break even in his business of selling vehicles.\nWhen Chukwuma got back to Gwabi, he told his friend how he met Ifeanyi and the promise that he made. Two weeks after Chukwuma and Francis set out for Gwandu to see Ifeanyi. They went to meet Ifeanyi in his office through the address he gave them. After entertaining them, he took them to Chief lberemadu who after listening to them promised to help at least one of them to travel abroad where he would have the opportunity to stay, depending on the readiness of any of the two friends to make a good use of the opportunity. Chief lberemadu asked them to come back in one week's time.\nOn the day that they were to come and see Chief Iberemadu, Francis woke up early in the morning to wait for his friend, Chukwuma at their workshop where they had agreed to meet by 5.30 am. He waited for Chukwuma to come for thirty minutes before setting out for Gwandu to see Chief lberemadu. Francis got to the Chiefs house at 6.45am and the Chief gave him the document with which he would travel abroad and a cash donation of five million dollars.\nChukwuma arrived Chief Eberemadu's house at 8.00arn with lfeanyi. The chief welcomed them and said that he had given all what he intended to give to Francis because he made use of the opportunity he offered maximally. There was nothing Ifeanyi could do to make the chief change his mind to help Chukwuma. He then turned to him and said that, \"the early bird catches the worm.\"",
    "year": "2008"
  },
  {
    "number": "80",
    "text": "Read the following passage carefully and answer the questions on it.\n      I have great sympathy for the common fear that is suffered by young people when examinations are looming ahead. Sometimes it is the actual examination they fear but equally likely to excite fear are the expectations of the parents who are keen on their offspring results in failures which could be avoided. achieving good results. Pressure in these circumstances only leads to more fear and often results in failure which could be avoided.\n      My very last examination was an oral and I knew that everything depended on the kind of impression I made on the government representative who I expected, had difficult questions for me. This, though, was not the only reason for my apprehension. As a youth, I was often teased because I was small in stature. I was obsessed with it. I was very self-conscious, therefore, about meeting this important man. Fortunately, the previous day 1 had learned another lesson from nature, one which was to help me in my face-to-face encounter with the examiner.\n      I had been staying with my aunt and uncle in order to do some last-minute preparations. I went through my books that afternoon, sitting outside in the sunshine until about three o'clock, when the weather took a turn for the worse. The sky looked menacing and, as the clouds gathered in the distance, I heard the rumble of thunder. The lovely sunny afternoon was changing to a dark and dismal evening. Several times I broke my concentration to look at a very beautiful water lily in the pond. As I quickly gathered up my books, I remembered the lily and went over to see it for the last time that day. I was just in time to see the flower close its petals as the rumble of the distant thunder grew louder. I didn't mind getting wet as I realized that the rain could do nothing to damage the delicate, inner beauty of the lily.\n      This simple act of nature restored my confidence and I realized that I too could muster courage to face the examiner. I could, in fact, protect the inner me from the outside world. My new-found philosophy worked! Of the eight people who sat for the examination that day, only two succeeded and the government representative congratulated me on being the youngest candidate ever to have passed.\n      I was lucky for I had learnt to control my obsession with my stature.\n(a) According to the writer, what two things excite fear in young people going for examinations?\n(b) Give two reasons for the writer's apprehension before the examination.\n(c) Why was the writer almost obsessed with his small stature?\n(d) How did the observation of the lily affect the writer?\n(e) What proof is there in the passage that the writer actually passed the exam?\n(f) The sky looked menacing ..... What figure of speech is contained in this expression?\n(g) .... because I was small in stature.\n(i) What grammatical name is given to this expression as it is used in the passage?\n(ii) what is its function?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) excite; (ii) offspring; (iii) apprehension; (iv) dismal; (v) delicate; (vi) muster.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51100?exam_type=waec&type=theory&page=16",
    "correct_answer": "(a) The two things are: (i) the examinations themselves / the actual examination (ii) parents' expectations (of good results) / pressure from parents\n(b) The two reasons are: (i) the writer expected to be asked difficult questions (ii) the writer was obsessed with his (small) stature\n(c) Because he was often teased / mocked about it\n(d) It gave him confidence / courage\n(e) The government representative congratulated him (on passing the examination)\n(f) Metaphor\n(g) Adverbial clause (of reason) (ii) it modifies (the verb phrase / the verb) was (often) teased\n(h) (i) excite - evoke, arouse, create, engender, bring about, cause (ii) offspring - children (iii) apprehension — anxiety, Worry, fear (iv) dismal — gloomy, somber, dull, dreary (v) delicate — fragile, tender, frail (vi) muster — garner, gather, the summon, pluck up.",
    "explanation": "(a) The two things are: (i) the examinations themselves / the actual examination (ii) parents' expectations (of good results) / pressure from parents\n(b) The two reasons are: (i) the writer expected to be asked difficult questions (ii) the writer was obsessed with his (small) stature\n(c) Because he was often teased / mocked about it\n(d) It gave him confidence / courage\n(e) The government representative congratulated him (on passing the examination)\n(f) Metaphor\n(g) Adverbial clause (of reason) (ii) it modifies (the verb phrase / the verb) was (often) teased\n(h) (i) excite - evoke, arouse, create, engender, bring about, cause (ii) offspring - children (iii) apprehension — anxiety, Worry, fear (iv) dismal — gloomy, somber, dull, dreary (v) delicate — fragile, tender, frail (vi) muster — garner, gather, the summon, pluck up.",
    "year": "2008"
  },
  {
    "number": "81",
    "text": "Read the following passage carefully and answer the questions on it.\n      Work can be an essential part of children's education and a means of transmitting  vital skills from parent to off-spring. In some countries, children are often involved in workshops and small-scale services, and gradually become full-fledged workers later in life. In other countries, teenagers work a few hours a week to earn pocket money. Such work is beneficial as it enhances a child's physical, mental, spiritual, moral and social development without interfering with his schooling, recreation and rest.\n      Child labour, on the other hand, is about children who work long hours for low wages. often under conditions harmful to their health. This type of work is destructive and exploitative. Child labour takes different forms. By and large, most child workers are in domestic service. Domestic service need not be hazardous, but it often is. Children in domestic service are poorly paid or not paid at all. Their masters set the terms and conditions of their work entirely to their whim. They are deprived of affection, schooling, play and social activity. They are also vulnerable to physical abuse.\n      Poverty is the most powerful force driving children into hazardous labour. For poor families, the small contribution of a child's income at home can make the difference between hunger and survival. The parents of child workers are often unemployed or underemployed. They are desperate for a secure income. In developing countries, for example, class-rooms do not have seats, half of the students have no textbooks, and half of the classrooms have no blackboards. It is not surprising that many children who attend such schools abandon schooling for work.\n      Child labour is aggravated by a modern society that is preoccupied with the demand for low-priced products. Few people seem to care that these may have been produced by millions of anonymous,  exploited children. The effects of child labour on the psychological, emotional and intellectual growth of the victims are grave. Such children are deprived of affection. Beatings, insults and punishment by being deprived of food are very common. Ultimately, most child labourers are condemned to lifelong poverty, misery, sickness and illiteracy.\n(a) Identify two types of work that are beneficial to children.\n(b) According to the passage, what is child labour? \n(c) Give two causes of child labour. \n(d) In one word, describe the effect of child labour on the child \n(e) According to the passage, why do children drop out of school? \n(f) .... who work long hours for low wages? (I) What is the grammatical named given to this expression as it is used in the passage? (ii) What is its functions? \n(g) .... most child labourers are condemned to lifelong poverty What is the meaning of this expression? \n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) transmitting, (ii) enhances; (iii) vulnerable; (iv) preoccupied; (v) anonymous; (vi) grave.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51112?exam_type=waec&type=theory&page=17",
    "correct_answer": "a)(i) Work that is a means of transmitting (vital) skills (from parent to offspring) (ii) Work for earning pocket money\n(b) Child labour is when children work for long hours and for low wages under harmful conditions.(c) The two causes are: (1) Poverty (ii) the demand for low priced goods(d) Harmful /destructive / detrimental /devastating(e) The schools ill-equipped ll-equipped / lack (basic) facilities(f)(i) Adjectival / Relative clause (ii) It qualifies (the noun) children.(g) It means that most child labourers live in poverty / want throughout their lives.(h)(i) transmitting - passing on, transferring (ii) enhances improves, boosts, advances, reinforces, promotes (iii) vulnerable — prone, exposed, susceptible, open (iv) preoccupied — engrossed, obsessed, concerned, engaged. (v) anonymous — nameless, unnamed, unidentified, unknown (vi) grave serous, profound, tremendous.",
    "explanation": "a)(i) Work that is a means of transmitting (vital) skills (from parent to offspring) (ii) Work for earning pocket money\n(b) Child labour is when children work for long hours and for low wages under harmful conditions.(c) The two causes are: (1) Poverty (ii) the demand for low priced goods(d) Harmful /destructive / detrimental /devastating(e) The schools ill-equipped ll-equipped / lack (basic) facilities(f)(i) Adjectival / Relative clause (ii) It qualifies (the noun) children.(g) It means that most child labourers live in poverty / want throughout their lives.(h)(i) transmitting - passing on, transferring (ii) enhances improves, boosts, advances, reinforces, promotes (iii) vulnerable — prone, exposed, susceptible, open (iv) preoccupied — engrossed, obsessed, concerned, engaged. (v) anonymous — nameless, unnamed, unidentified, unknown (vi) grave serous, profound, tremendous.",
    "year": "2008"
  },
  {
    "number": "82",
    "text": "Read the following passage carefully and answer the questions on it.\n      Many cities in the world have now become overcrowded because everyday people migrate to them from the country-side in search of work and better living conditions. This problem is far worse in Third World countries, where the harsh living conditions and the lack of gainful employment opportunities in rural areas usually compel a ceaseless and massive rural-urban drift.\n      This desperate state of affairs is not without its direct consequences for the cities. Facilities like accommodation, schools, hospitals, water supply and public transport cannot cope with the demands on them from increased numbers of people, and so they are under severe strain. House rents soar astronomically, and so too many tenants crowd into inadequate spaces. Markets, streets and motorways are congested with people and vehicles. And as the garbage disposal is inefficient, the garbage piles up everywhere, contributing to environmental pollution.\n      Many of the migrants come to the big cities in the hope of finding employment. However, because a majority of them are unskilled workers or fresh school-leavers not equipped in any way for gainful self-employment, they simply end up swelling the ranks of the desperate unemployed in the city.\n      The devil, they say, makes work for idle hands. With no means of livelihood in the relatively more expensive cities, many of these disillusioned young people resort to prostitution, fraud and crime in order to survive. No wonder the crime rate in the cities is for ever rising, and there are daily reports of victims who lose their money, possessions or even their lives to dare-devil robbers.\n      How can this deplorable state of affairs in the cities be reversed? Since the search for jobs accounts for much of the rural-urban drift, one way is to encourage the creation of jobs outside the cities. For example, certain businesses such as banks and manufacturing industries could be encouraged to set up branches in rural areas. If rural dweller have ready access to the same jobs they go to look for in the city, the need for migrating will be reduced.\n      It should be admitted that in this modern age, life without the basic amenities of pipe-borne water, electricity, good roads, schools and hospitals is just not good enough. Many rural dwellers are lured to the cities because of the lack of amenities, so providing them in these rural communities will not only contribute to stemming the tide of migration but also create a favourable environment for investment.\n      It has also been argued that rural farming is gradually being abandoned to the aged. The primitive, labour-intensive methods and the relatively low yields have made it unattractive to the youth, who would rather seek their fortune in the cities. If farming is made attractive, for example, through mechanization, it will become another source of employment for rural dwellers and thus reduce the necessity to migrate to the city.\n      Rural-urban migration causes a serious population imbalance, and has all sorts of attendant problems that can get worse if not tackled effectively. So, the sooner a solution is sought the better.\n(a) In three sentences, one for each, summarize the three negative consequences of rural-urban migration discussed in the passage.\n(b) In three sentences, one for each, summarize the writer's suggestions for tackling the problem.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51114?exam_type=waec&type=theory&page=17",
    "correct_answer": "(a) (i) It/Rural — urban migration leads to congestion / over — crowding in cities (ii) It puts a strain / pressure on the facilities / amenities in cities (iii) It worsens unemployment in cities. (iv) It increases crime (the crime rate) in cities\n(b)(i) Jobs should be created in rural areas / communities (ii) Basic amenities / facilities should be provided in rural areas / communities (iii) Farming should be made (more) attractive in rural areas) communities.",
    "explanation": "(a) (i) It/Rural — urban migration leads to congestion / over — crowding in cities (ii) It puts a strain / pressure on the facilities / amenities in cities (iii) It worsens unemployment in cities. (iv) It increases crime (the crime rate) in cities\n(b)(i) Jobs should be created in rural areas / communities (ii) Basic amenities / facilities should be provided in rural areas / communities (iii) Farming should be made (more) attractive in rural areas) communities.",
    "year": "2008"
  }
]