[
  {
    "number": "181",
    "text": "(a) State three characteristics of agricultural non-governmental organizations. (b) State five objectives of each of the following: (i) West African Rice Development Agency (ii) International Institute of Tropical Agriculture (c) Mention three other non-governmental organizations involved in agricultural development.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52779?exam_type=waec&type=theory&page=37",
    "correct_answer": "(a) Characteristics of Agricultural Non-Governmental Organisation: (i) They are established by private agendas O or corporate bodies concerned with the development of agriculture all over the world. (ii) They are not owned controlled by the government. (iii) They are privately funded. (iv) Their activities cut across many countries with r specific aims of developing improved species of crops and livestock breeds. (v) They are non-profit making. (vi) They do not pay corporate taxes.\n(b)(i) Objectives of West Africa Rice Development Agency: (i) To promote the cultivation of rice within the West Africa sub-region. (ii) To develop rice species with high yield. (iii) To develop rice species with high quality. (iv) To produce rice species which can adapt to the climatic condition of West Africa sub-region. (v) To develop disease resistant varieties of rice. (vi) To develop pest resistant varieties of rice. (vii) To develop rice which can meet the nutritional needs of the West Africa sub-region.\n(b)(ii) Objectives of International Institute of Tropical Agriculture: (i) To promote the cultivation of food crops such as maize, cowpea, cassava, yam and plantain within the tropics. (ii) To develop high yielding food crops. (iii) To develop food crops with high quality. (iii) To develop food crops that are resistant to diseases. (iv) To develop food crops that can adapt to the climate of tropical countries. (v) To encourage the local farmers to grow the crops approved by the institute. (vi) To improve the methods of processing food crops. (vii) To improve the utilization methods of food crops. (viii) To develop appropriate farming systems for the West Africa sub-region.\n(c) Other Non-governmental Organisation involved in Agricultural Development: (i) International Livestock Research Institute/International Livestock Centre for Africa. (ii) International Crop Research Institute for Semi-Arid Tropics (ICRISAT). (iii) International Fund for Agricultural Development (IFAD). (iv) International Centre for Research in Agro-forestry. (v) Action Aid (vi) ECWA Rural Development (vii) World Vision International (viii) Catholic Relief Service (ix) Hunger Project (Ghana) (x) Adventist Relief Agency (xi) Food and Agricultural Organisation",
    "explanation": "(a) Characteristics of Agricultural Non-Governmental Organisation: (i) They are established by private agendas O or corporate bodies concerned with the development of agriculture all over the world. (ii) They are not owned controlled by the government. (iii) They are privately funded. (iv) Their activities cut across many countries with r specific aims of developing improved species of crops and livestock breeds. (v) They are non-profit making. (vi) They do not pay corporate taxes.\n(b)(i) Objectives of West Africa Rice Development Agency: (i) To promote the cultivation of rice within the West Africa sub-region. (ii) To develop rice species with high yield. (iii) To develop rice species with high quality. (iv) To produce rice species which can adapt to the climatic condition of West Africa sub-region. (v) To develop disease resistant varieties of rice. (vi) To develop pest resistant varieties of rice. (vii) To develop rice which can meet the nutritional needs of the West Africa sub-region.\n(b)(ii) Objectives of International Institute of Tropical Agriculture: (i) To promote the cultivation of food crops such as maize, cowpea, cassava, yam and plantain within the tropics. (ii) To develop high yielding food crops. (iii) To develop food crops with high quality. (iii) To develop food crops that are resistant to diseases. (iv) To develop food crops that can adapt to the climate of tropical countries. (v) To encourage the local farmers to grow the crops approved by the institute. (vi) To improve the methods of processing food crops. (vii) To improve the utilization methods of food crops. (viii) To develop appropriate farming systems for the West Africa sub-region.\n(c) Other Non-governmental Organisation involved in Agricultural Development: (i) International Livestock Research Institute/International Livestock Centre for Africa. (ii) International Crop Research Institute for Semi-Arid Tropics (ICRISAT). (iii) International Fund for Agricultural Development (IFAD). (iv) International Centre for Research in Agro-forestry. (v) Action Aid (vi) ECWA Rural Development (vii) World Vision International (viii) Catholic Relief Service (ix) Hunger Project (Ghana) (x) Adventist Relief Agency (xi) Food and Agricultural Organisation",
    "year": "2006"
  },
  {
    "number": "182",
    "text": "(a) Define the term farmstead. (b) List four factors to be considered in planning a farmstead. (c) Explain the importance of the factors listed in (b) above. (d) Give two reasons for planning a farmstead.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52780?exam_type=waec&type=theory&page=37",
    "correct_answer": "(a) Farmstead: This can be defined as farm house and all production and processing structures.\n(b) Factors to Consider in Planning a Farmstead: (i) Topography (ii) Soil type (iii) Accessibility (iv) Health/Hygiene (v) Water supply (vi) Nearness to market (vii) Drainage.\n(c) Importance of: Topography: (i) Living quarters should be located on the highest elevation - to provide good view of the farm. (ii)Animal quarters to be located far from the living quarters. (iii) Locate crops such as vegetables on low lying areas where moisture content is high. (iv) Fish ponds are located on slopy grounds. (v) Irrigation farms are best sited on flat grounds. Soil Type: (i) Crop farms are sited on soils that are fertile. (ii) Pastures on less fertile soils. (iii) Farm building and structures are best located on poor soils. (iv) Farrn roads are best constructed on well drained poor soil.\nAccessibility: (i) Locate facilities within walking distance. (ii) To facilitate the transportation of farm inputs. (iii) For evacuation of farm produce. (iv) Good accessibility makes marketing of farm produce possible.\nWater Supply: (i) Adequate water supply is needed for human and animal use. (ii) Livestock structures are located close to source of water supply for easy cleaning. (iii) Water is required for irrigation purposes.\nHealth/Hygiene: (i) Erect livestock units against wind direction. (ii) Locate animal units far away from the dwelling houses to avoid health hazards.\nNearess to Market: (i) Reduces distribution/transport cost. (ii) Exposes products to many buyers. (iii) Reduces the need for farm storage facilities.\nDrainage (i) Adequate drainage is important to avoid water logging. (ii) Gentle slope facilitates proper drainage. (iii) Good drainage makes movement easier within the farm.\n(d) Reasons for Planning Farmstead: (i) Allows for proper utilisation of resources without wastage. (ii) Makes the farmer to be more responsive to market demand. (iii) Encourages efficiency of farm activities. (iv) It makes coordination and control of farm operations easier.",
    "explanation": "(a) Farmstead: This can be defined as farm house and all production and processing structures.\n(b) Factors to Consider in Planning a Farmstead: (i) Topography (ii) Soil type (iii) Accessibility (iv) Health/Hygiene (v) Water supply (vi) Nearness to market (vii) Drainage.\n(c) Importance of: Topography: (i) Living quarters should be located on the highest elevation - to provide good view of the farm. (ii)Animal quarters to be located far from the living quarters. (iii) Locate crops such as vegetables on low lying areas where moisture content is high. (iv) Fish ponds are located on slopy grounds. (v) Irrigation farms are best sited on flat grounds. Soil Type: (i) Crop farms are sited on soils that are fertile. (ii) Pastures on less fertile soils. (iii) Farm building and structures are best located on poor soils. (iv) Farrn roads are best constructed on well drained poor soil.\nAccessibility: (i) Locate facilities within walking distance. (ii) To facilitate the transportation of farm inputs. (iii) For evacuation of farm produce. (iv) Good accessibility makes marketing of farm produce possible.\nWater Supply: (i) Adequate water supply is needed for human and animal use. (ii) Livestock structures are located close to source of water supply for easy cleaning. (iii) Water is required for irrigation purposes.\nHealth/Hygiene: (i) Erect livestock units against wind direction. (ii) Locate animal units far away from the dwelling houses to avoid health hazards.\nNearess to Market: (i) Reduces distribution/transport cost. (ii) Exposes products to many buyers. (iii) Reduces the need for farm storage facilities.\nDrainage (i) Adequate drainage is important to avoid water logging. (ii) Gentle slope facilitates proper drainage. (iii) Good drainage makes movement easier within the farm.\n(d) Reasons for Planning Farmstead: (i) Allows for proper utilisation of resources without wastage. (ii) Makes the farmer to be more responsive to market demand. (iii) Encourages efficiency of farm activities. (iv) It makes coordination and control of farm operations easier.",
    "year": "2006"
  },
  {
    "number": "183",
    "text": "(a) List four asexual methods of crop propagation. (b) Define the following terms: (i) mixed farming (ii) inter-cropping (iii) ley farming (c) State four advantages of each of mixed farming and inter-cropping.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52781?exam_type=waec&type=theory&page=37",
    "correct_answer": "(a) Asexual Methods of Propagaion: (i) Budding (ii) Layering (iii) Cutting (iv) Grafting\n(b)(i) Mixed Farming: This is a system of farming in which both crops and animals are raised on the same farm or piece of land. (ii) Inter Cropping: A practice of growing a minor crop with a major crop on the same piece of land and the minor crop s, harvested before the major crop. (iii) Ley Farming: This is the practice whereby a piece of farmland is alternatively cultivated with pasture crops and food crops.\n(c) (i) Advantages of Mixed Farming:  (i) The farmer is assured of regular income/employment throughout the year. (ii) The farmer feeds his animals with his crops or waste produce. (iii) the farmer is assured of protein needs of his family e.g. milk, eggs, meat. (iv) The faeces and urine of e animals can be used as organic manure. (v) It helps to reduce the failure of any single farm enterprise. (vi) Supply farm power by the animals. (vii) Optimal/maximal use of land. (ii) Advantages of Inter-cropping: (i) Enables some of the crops to serve as ground cover. (ii) Protects the soil from erosion and harmful effects of sunlight. (iii) Helps to check the growth of weeds which compete with plants for food. (iv) Helps the farmer to spread his harvest over the season and so ensure a regular supply of food. (v) Reduces the risk of crop failure. (vi) May reduce the, spread of pests. (vii) Optimal/maximal use of land. (yiii) May reduce the spread of diseases. (ix) Source of regular income. (x) Planting of legume adds nitrogen to soil.",
    "explanation": "(a) Asexual Methods of Propagaion: (i) Budding (ii) Layering (iii) Cutting (iv) Grafting\n(b)(i) Mixed Farming: This is a system of farming in which both crops and animals are raised on the same farm or piece of land. (ii) Inter Cropping: A practice of growing a minor crop with a major crop on the same piece of land and the minor crop s, harvested before the major crop. (iii) Ley Farming: This is the practice whereby a piece of farmland is alternatively cultivated with pasture crops and food crops.\n(c) (i) Advantages of Mixed Farming:  (i) The farmer is assured of regular income/employment throughout the year. (ii) The farmer feeds his animals with his crops or waste produce. (iii) the farmer is assured of protein needs of his family e.g. milk, eggs, meat. (iv) The faeces and urine of e animals can be used as organic manure. (v) It helps to reduce the failure of any single farm enterprise. (vi) Supply farm power by the animals. (vii) Optimal/maximal use of land. (ii) Advantages of Inter-cropping: (i) Enables some of the crops to serve as ground cover. (ii) Protects the soil from erosion and harmful effects of sunlight. (iii) Helps to check the growth of weeds which compete with plants for food. (iv) Helps the farmer to spread his harvest over the season and so ensure a regular supply of food. (v) Reduces the risk of crop failure. (vi) May reduce the, spread of pests. (vii) Optimal/maximal use of land. (yiii) May reduce the spread of diseases. (ix) Source of regular income. (x) Planting of legume adds nitrogen to soil.",
    "year": "2006"
  },
  {
    "number": "184",
    "text": "(a) Draw an annotated diagram of a water cycle. (b) State six importance of water to crops. (c) State four ways of conserving water in the soil.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52782?exam_type=waec&type=theory&page=37",
    "correct_answer": "(a) Water Cycle\n(b) Importance of Water to Crops: (i) used in hydroysing food. (ii) water dissolves plant nutrients for root absorption. (iii) used in photosynthesis. (iv) medium of enzymatic activities. (v) large constituent of protoplasm. (vi) Medium for food nutrients translocation (vii) transpiration helps to cool plants. (viii) very vital or sustaining life (ix) responsible for turgidity of leaves (x) needed for seed germination.\n(c) Ways of Conserving Water in the Soil: (i) Stoppage or reduction of surface water run-off. (ii) Addition of humus/organic manure. (iii) Removal of weeds to reduce transpiration and water loss. (iv) mulching (v) Cover cropping (vi) Contour Ridging (vii) Appropriate tillage (viii) Strip cropping",
    "explanation": "(a) Water Cycle\n(b) Importance of Water to Crops: (i) used in hydroysing food. (ii) water dissolves plant nutrients for root absorption. (iii) used in photosynthesis. (iv) medium of enzymatic activities. (v) large constituent of protoplasm. (vi) Medium for food nutrients translocation (vii) transpiration helps to cool plants. (viii) very vital or sustaining life (ix) responsible for turgidity of leaves (x) needed for seed germination.\n(c) Ways of Conserving Water in the Soil: (i) Stoppage or reduction of surface water run-off. (ii) Addition of humus/organic manure. (iii) Removal of weeds to reduce transpiration and water loss. (iv) mulching (v) Cover cropping (vi) Contour Ridging (vii) Appropriate tillage (viii) Strip cropping",
    "year": "2006"
  },
  {
    "number": "185",
    "text": "(a) List four ways by which diseases are spread on a crop farm. (b) State three symptoms and three control measures of each of the following diseases: (i) onion twister (ii) root-knot of tomato",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52783?exam_type=waec&type=theory&page=37",
    "correct_answer": "(a) Ways ways By Which Diseases Spread On A Crop Farm: (i) rain splash (ii) use of contaminated tools and equipment. (iii) use of infected planting materials. (iv) wind blowing pathogens to other crops. (v) animals, especially predators during feeding. (vi) insect vectors (vii) visitors (viii) weeds harbour pathogens (ix) through irrigation water.\n(b)(i) Symptoms of Onion Twister: (i) Twisting and curling of the leaves and the pseudostem. (ii) The twisted leaves later change from the normal darkgreen colour to yellowish green. (iii) The neck of the affected onion plant becomes abnormally long. (iv) the bulbs are narrow and elongated. (v) The bulbs rot quickly when stored. Control Measures of Onion Twister: (i) Early Planting (ii) Removal and destruction of infected plants. (ill) By spraying fungicides. (iv) Practising good farm sanitation.\n(b)(ii) Symptons of Root-Knot Disease of Tomato: (i) Formation of galls or knots on the roots of infected plants. (ii) Stunted plants. (iii) The leaves turn yellow. (iv) Production of many secondary roots. (v) Death of plants. Control Measures of Root-Knot Disease of Tomato: (I) Planting resistant varieties of tomatoes. (ii) Soil treatment with nematicides. (iii) Soil sterilisation/ burning of crop residue and weeds. (iv) Practising crop rotation. (v) Removal of crop residues from the field. (vi) Weed control.",
    "explanation": "(a) Ways ways By Which Diseases Spread On A Crop Farm: (i) rain splash (ii) use of contaminated tools and equipment. (iii) use of infected planting materials. (iv) wind blowing pathogens to other crops. (v) animals, especially predators during feeding. (vi) insect vectors (vii) visitors (viii) weeds harbour pathogens (ix) through irrigation water.\n(b)(i) Symptoms of Onion Twister: (i) Twisting and curling of the leaves and the pseudostem. (ii) The twisted leaves later change from the normal darkgreen colour to yellowish green. (iii) The neck of the affected onion plant becomes abnormally long. (iv) the bulbs are narrow and elongated. (v) The bulbs rot quickly when stored. Control Measures of Onion Twister: (i) Early Planting (ii) Removal and destruction of infected plants. (ill) By spraying fungicides. (iv) Practising good farm sanitation.\n(b)(ii) Symptons of Root-Knot Disease of Tomato: (i) Formation of galls or knots on the roots of infected plants. (ii) Stunted plants. (iii) The leaves turn yellow. (iv) Production of many secondary roots. (v) Death of plants. Control Measures of Root-Knot Disease of Tomato: (I) Planting resistant varieties of tomatoes. (ii) Soil treatment with nematicides. (iii) Soil sterilisation/ burning of crop residue and weeds. (iv) Practising crop rotation. (v) Removal of crop residues from the field. (vi) Weed control.",
    "year": "2006"
  },
  {
    "number": "186",
    "text": "(a) Define an insecticide (b) List four groups of insecticides. (c) For each of the following pests, name the class of pesticide used for their control: (i) grasshoppers (ii) rats (iii) weaver birds (iv) eelworms (d) Enumerate two effects of each of the following pest control measures on the environment: (i) chemical (ii) cultural (iii) biological",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52784?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) Insecticide: An insecticide is defined as a chemical preparation used to control insect pests.\n(b) Group of insecticides: (i) Powder (ii) Liquid (iii) Granules (iv) Tablets (v) Aerosol\n(c) Class of Pesticide that Kills Specific Insect Pests:\nPest killedPesticidePest killedPesticide(i) GrasshoppersInsecticide(iii) Weaver birds RodenticidesAvicides(ii) RatsRodenticides(iv) Eelworms AvicidesNematicides\n(d)(i) Effects of Chemical Control on the Environment: (i) Beneficial organism insects like earthworms, bees may be destroyed. (ii) Some chemicals may be toxic to man, domestic animals and plants. (iii) It may lead to pollution of the environment. (iv) It destroys aquatic life.\n(ii) Effects of Cultural Control on the Environment: (i) Fire that kills harmful insects may also kill beneficial insects. (ii) Bush burning spreads within a twinkle of an eye to other places and causing excessive damage to structures, crops and animals. (iii) Fire destroys organic matter in the soil. (iv) Tillage operation destroys soil structure and causes erosion.\n(d)(iii) Effects of Biological Control on the Environment: (i) Natural enemy (organism) introduced to control pest may abandon the pest and start to attack other crops in the environment originally free from attack. (ii) Predators may feed on other beneficial insects other than the ones intended to control. (iii) Newly introduced organism may cause imbalance in the ecosystem. (iv) Breeding for increased yield may alter genetic resistance of crops to pest and diseases thereby leading to increased pest/disease population in the environment.",
    "explanation": "(a) Insecticide: An insecticide is defined as a chemical preparation used to control insect pests.\n(b) Group of insecticides: (i) Powder (ii) Liquid (iii) Granules (iv) Tablets (v) Aerosol\n(c) Class of Pesticide that Kills Specific Insect Pests:\nPest killedPesticidePest killedPesticide(i) GrasshoppersInsecticide(iii) Weaver birds RodenticidesAvicides(ii) RatsRodenticides(iv) Eelworms AvicidesNematicides\n(d)(i) Effects of Chemical Control on the Environment: (i) Beneficial organism insects like earthworms, bees may be destroyed. (ii) Some chemicals may be toxic to man, domestic animals and plants. (iii) It may lead to pollution of the environment. (iv) It destroys aquatic life.\n(ii) Effects of Cultural Control on the Environment: (i) Fire that kills harmful insects may also kill beneficial insects. (ii) Bush burning spreads within a twinkle of an eye to other places and causing excessive damage to structures, crops and animals. (iii) Fire destroys organic matter in the soil. (iv) Tillage operation destroys soil structure and causes erosion.\n(d)(iii) Effects of Biological Control on the Environment: (i) Natural enemy (organism) introduced to control pest may abandon the pest and start to attack other crops in the environment originally free from attack. (ii) Predators may feed on other beneficial insects other than the ones intended to control. (iii) Newly introduced organism may cause imbalance in the ecosystem. (iv) Breeding for increased yield may alter genetic resistance of crops to pest and diseases thereby leading to increased pest/disease population in the environment.",
    "year": "2006"
  },
  {
    "number": "187",
    "text": "(a) Explain the term candling in chicks production. (b) Write notes on the intensive method of managing poultry under the following headings: (i) sanitation (ii) feeding (c) List six breeds of pigs.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52785?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) Candling: (i) Candling is the use of a strong shaded light. (ii) Done to detect unfertilised egg or dead embryo in the egg. (iii) It is usually carried out during incubation. (iv) It is carried out first within 6 - 7 days and later 18th -19th days of incubation before hatching of eggs.\n(b) Intensive Poultry Management: (i) Sanitation: Feed only clean diet and water. Cull off all sick birds promptly. Restrict visitors to farm. Avoid keeping different age group of birds together. Provide foot bath at the entrance. Purchase foundation stock from accredited breeders. Vaccinate animals regularly against notificable diseases as and when due. Remove and bury of all dead birds promptly. Screen windows against wild birds and insects. Ensure adequate ventilation of the house. Maintain a dry litter if deep litter system is practised. Deworm at regular intervals. Spray or dust birds at regular intervals against ectoparassites. Clean all equipment thoroughly before use. Avoid bringing in recycled bags of feed from outside. Clear the surrounding bush/weeds around the poultry house.\n(c) Breeds of Pigs: West African Dwarf (WAD). Large white  Landrace Hampshire Duroc Large black Wessex Saddle back. Tansworth. Poland china. Chester white. Belgium Pietrain",
    "explanation": "(a) Candling: (i) Candling is the use of a strong shaded light. (ii) Done to detect unfertilised egg or dead embryo in the egg. (iii) It is usually carried out during incubation. (iv) It is carried out first within 6 - 7 days and later 18th -19th days of incubation before hatching of eggs.\n(b) Intensive Poultry Management: (i) Sanitation: Feed only clean diet and water. Cull off all sick birds promptly. Restrict visitors to farm. Avoid keeping different age group of birds together. Provide foot bath at the entrance. Purchase foundation stock from accredited breeders. Vaccinate animals regularly against notificable diseases as and when due. Remove and bury of all dead birds promptly. Screen windows against wild birds and insects. Ensure adequate ventilation of the house. Maintain a dry litter if deep litter system is practised. Deworm at regular intervals. Spray or dust birds at regular intervals against ectoparassites. Clean all equipment thoroughly before use. Avoid bringing in recycled bags of feed from outside. Clear the surrounding bush/weeds around the poultry house.\n(c) Breeds of Pigs: West African Dwarf (WAD). Large white  Landrace Hampshire Duroc Large black Wessex Saddle back. Tansworth. Poland china. Chester white. Belgium Pietrain",
    "year": "2006"
  },
  {
    "number": "188",
    "text": "(a) With the aid of an annotated diagram, describe the life cycle of the liver-fluke (Fasciola hepatica). Explain how you will prevent the liver-fluke from completing its life cycle in the field. (c) List three effects of lice on animal production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52786?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) Life Cycle of the Liver Fluke (Fasciola hepatica)\nLiver fluke: The adult fluke is found in the bile duct of animals where it feeds and reproduces. The adult fluke reproduces eggs in the bile duct of the animal which are pass out with faeces from the primary host (Cattle, sheep etc) If the eggs and faeces are passed out by the ruminant into water, they develop to a larva called miracidium which will later hatch ten days later. This larva swims in the water, looks for a snail which is its secondary host (usually Limnea truncatula). It penetrates the snails skin or the pulmonary hole.  It develops to a sporocyst within the snail. Through asexual reproduction the sporocyst reproduces a larva called radial. The radial ruptures from the sporocyst and migrate to the digestive gland of the snail. Here it grows to a final larva called cercaria. After six weeks this cercaria leaves the snail through the pulmonary hole and swims to look for the final host in the water. The cercaria is ingested by the ruminant through infested pasture or water. Then in animal stomach, it makes its way to the animal liver to the bile duct through the liver tissues. It grow to an adult fluke in the animal's bile duct\n(b) The life cycle of the fluke can be disrupted by: Eliminating all the snails which are its secondary host in the waters where the ruminant animals drink or feed by spraying copper sulphate solution. Provide clear uninfested waters and feed for the animals. Control weeds along river sides. Periodic burning of pasture to kill eggs in faeces\n(c) The Effects of Lice on Animal Production: They cause discomfort and irritation on f animals. They  blood from animals leading to anaemia. They reduce production or yield of animals. They create the wounds for secondary infection. They transmit diseases. They reduce feed and water intake. They reduce the growth of animal/cause emaciation. Weaken the animals",
    "explanation": "(a) Life Cycle of the Liver Fluke (Fasciola hepatica)\nLiver fluke: The adult fluke is found in the bile duct of animals where it feeds and reproduces. The adult fluke reproduces eggs in the bile duct of the animal which are pass out with faeces from the primary host (Cattle, sheep etc) If the eggs and faeces are passed out by the ruminant into water, they develop to a larva called miracidium which will later hatch ten days later. This larva swims in the water, looks for a snail which is its secondary host (usually Limnea truncatula). It penetrates the snails skin or the pulmonary hole.  It develops to a sporocyst within the snail. Through asexual reproduction the sporocyst reproduces a larva called radial. The radial ruptures from the sporocyst and migrate to the digestive gland of the snail. Here it grows to a final larva called cercaria. After six weeks this cercaria leaves the snail through the pulmonary hole and swims to look for the final host in the water. The cercaria is ingested by the ruminant through infested pasture or water. Then in animal stomach, it makes its way to the animal liver to the bile duct through the liver tissues. It grow to an adult fluke in the animal's bile duct\n(b) The life cycle of the fluke can be disrupted by: Eliminating all the snails which are its secondary host in the waters where the ruminant animals drink or feed by spraying copper sulphate solution. Provide clear uninfested waters and feed for the animals. Control weeds along river sides. Periodic burning of pasture to kill eggs in faeces\n(c) The Effects of Lice on Animal Production: They cause discomfort and irritation on f animals. They  blood from animals leading to anaemia. They reduce production or yield of animals. They create the wounds for secondary infection. They transmit diseases. They reduce feed and water intake. They reduce the growth of animal/cause emaciation. Weaken the animals",
    "year": "2006"
  },
  {
    "number": "189",
    "text": "(a) State five reasons why farm accounts are kept. (b) Using the following information, prepare a profit and loss account for UNITY FARM, for the year ending December, 2005.\n (i) Cost of maize seeds  - -D1,400.00\n (ii) Cost of fertilizers - D1,200.00\n(iii) Cost of insecticides - D1,900.00\n(iv) Tractor hiring - D2,000.00\n(v) Cost of herbicides - D1,100.00\n(vi) Cost of cassava stems - D1,200.00\n(vii) Sales of maize - D29,000.00\n(viii) Sales of yam - D7,000.00\n(ix) Sales of cassava tubers - D5,500.00\n(x) Cost of processing cassava tubers - D1,500.00\n(xi) Wages of workers - D6,000.00\n(xii) Miscellaneous expenses - D4,400.00\n(xiii) Maize consumed - D300.00\n(xiv) Potato gift to visitors - D1,000.00 )",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52787?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) Reasons why farm accounts are kept by farmers: It enables the farmer to know whether he is running the farm at a profit or loss. It enables the farmer to make sound management decisions. It shows the financial weakness/strength of the farm. It enables the farmer to obtain loans from the bank. It makes accurate determination of his annual tax possible. It enables the farmer to determine the actual worth of his farm for any given purpose. For transferring a business from one person to another. Facilitates farm auditing. Provides data for planning and budgeting. It enables the farmer to detect fraudulent practices e.g. theft. For comparing management efficiency over a period of time. Assists farmers to monitor changes in prices of commodities.\nAlternative 1: Double Entry Method\n(b) Profit and Loss Account for Unity Farm For the Year ending December, 2005\nExpenditure (Debit)DIncome (Credit)DCost of maize seeds1,400.00Sales of Maize29,000.00Cost of fertilizers1,200.00Sales of yam7,000.00Cost of insecticides1,900.00Sales of Cassava tubers5,500.00Tractor hiring2,000.00Maize Consumed300.00Cost of herbicides1,100.00Potato gift1,000.00Cost of processing cassava tubers1,500.00Total income42,800.00Wages of workers6,000.00Miscellaneous expenses4,400.00Total ExpenditureD20,700.00Net ProfitD22,100.00Grand TotalD12,800.00TotalD42,800.00\nAlternative 2: Single method\nProfit and Loss Account for Unity Farm for the Year ending December, 2005\nSales/IncomeDSales of Maize29,000.00Sales of yam7,000.00Sales of Cassava tubers5,500..00Maize Consumed300.00Potato gift1000.00Total incomeD42,800.00Less ExpensesCost of Maize1,400.00Cost of fertlizers1,200.00Cost of insecticides1,900.00Tractor hiring2,000.00Cost of herbicides1,100.00Cost of processing cassava tubersCost of processing Cassava tubers1,200.001,500.00Wages of workers6,000.00Miscellaneous expenses4,400.00Total Expenditure20,700.00Net Profit22,100.00Grand TotalD42,800.00",
    "explanation": "(a) Reasons why farm accounts are kept by farmers: It enables the farmer to know whether he is running the farm at a profit or loss. It enables the farmer to make sound management decisions. It shows the financial weakness/strength of the farm. It enables the farmer to obtain loans from the bank. It makes accurate determination of his annual tax possible. It enables the farmer to determine the actual worth of his farm for any given purpose. For transferring a business from one person to another. Facilitates farm auditing. Provides data for planning and budgeting. It enables the farmer to detect fraudulent practices e.g. theft. For comparing management efficiency over a period of time. Assists farmers to monitor changes in prices of commodities.\nAlternative 1: Double Entry Method\n(b) Profit and Loss Account for Unity Farm For the Year ending December, 2005\nExpenditure (Debit)DIncome (Credit)DCost of maize seeds1,400.00Sales of Maize29,000.00Cost of fertilizers1,200.00Sales of yam7,000.00Cost of insecticides1,900.00Sales of Cassava tubers5,500.00Tractor hiring2,000.00Maize Consumed300.00Cost of herbicides1,100.00Potato gift1,000.00Cost of processing cassava tubers1,500.00Total income42,800.00Wages of workers6,000.00Miscellaneous expenses4,400.00Total ExpenditureD20,700.00Net ProfitD22,100.00Grand TotalD12,800.00TotalD42,800.00\nAlternative 2: Single method\nProfit and Loss Account for Unity Farm for the Year ending December, 2005\nSales/IncomeDSales of Maize29,000.00Sales of yam7,000.00Sales of Cassava tubers5,500..00Maize Consumed300.00Potato gift1000.00Total incomeD42,800.00Less ExpensesCost of Maize1,400.00Cost of fertlizers1,200.00Cost of insecticides1,900.00Tractor hiring2,000.00Cost of herbicides1,100.00Cost of processing cassava tubersCost of processing Cassava tubers1,200.001,500.00Wages of workers6,000.00Miscellaneous expenses4,400.00Total Expenditure20,700.00Net Profit22,100.00Grand TotalD42,800.00",
    "year": "2006"
  },
  {
    "number": "190",
    "text": "(a) Mention four target groups of the extension agent. (b) Discuss five important qualities of a good extension worker (c) State four functions of an extension worker.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52788?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) Target Groups of The Extension Agent: Commercial farmers. Subsistence farmers. Farmers' cooperative societies. Nomads. Youth Organisations e.g. Young Farmers Club. Non-governmental organisations. Fishermen/ fish farmers. Community Development Association. Bee keepers.\n(b) Qualities of a Good Extension Worker:\n(i) Originality: For an extension officer or worker to succeed as an agent of change, he must be original. He must have the native intelligence to be original in his thoughts, words and action.\n(ii) Leadership: He must be a leader among leaders. He must be able to know the way i.e. his goal and lead the rural farmers to grasp and embrace that goal. He must be patient and able to inspire the rural farmers to achieve the goal.\n(iii) Initiative: A good extension worker must have initiative to tackle problems himself before referring them to supervisors. He must be able to take steps without being directed.\n(iv) Organisational Ability: The success of any extension activity will depend on how it is planned, organised and executed. He should be able to organise training of leaders.\n(v) Problem Solving. Ability: A good extension worker must be able to recognise problems, define them in simple terms and solve then if they fall within his training and experience.\n(vi) Clear Judgement: He must possess great foresight, he must be able to appreciate the problems of the farmers on the ground and know what to do to solve them.\n(vii) Reliability Honesty: An extension worker must be reliable, a man of his words. If the agency sends him down to the rural area, he should go down to deliver the piece of information and bring back feedback. If the rural farmers discover that he is reliable, they can then assimilate the new innovation and research findings.\n(viii) Communication Skill: An excellent extension worker must possess good communication skills e.g. good command of local language, boldness and oratory abilities.\n(ix) Freedom from Local Politics: A good extension worker must not be involved in the local politics as as to win the confidence of all members of the target group.\n(x) Respect for Culture and Traditions: He must be a good mixer for him to succeed. He must be able to come down to their level. He should dress like them, eat whatever they present, possibly drink their water, while not losing his goal for doing all these. By the wise behaviours he will win the hearts of the rural farmers. He should not feel superior to the farmers so as to achieve his goal. He must be approachable.\n(xi) Technical Knowledge: With sound training, an extension worker must be able to impact knowledge. He should be able to motivate these adult learners to acquire knowledge\n(xii) Punctuality and Availability: He should be able to attend all pre-arranged meetings,  seminars, workshops, etc, promptly and always make himself available.\n(c) unctions of an Extension Worker: To change peoples' outlook towards their living conditions. To teach rural people to recognise and take interest in their problems so as to overcome them To teach farmers improved practices using various methods, demonstrations, lectures, film shows, symposia, radio, etc, To act as a link between farmers and research institutes/Government. To teach farmers efficient management on the farms. To assist in obtaining loans and credits. To assist in locating markets for their farm produce, To monitor the use of Agric loans. To assist farmers tolocate sources of farm input. To evaluate the success or otherwise of the extension programme. To educate rural women on home management. To plan and execute farming educational programmes.",
    "explanation": "(a) Target Groups of The Extension Agent: Commercial farmers. Subsistence farmers. Farmers' cooperative societies. Nomads. Youth Organisations e.g. Young Farmers Club. Non-governmental organisations. Fishermen/ fish farmers. Community Development Association. Bee keepers.\n(b) Qualities of a Good Extension Worker:\n(i) Originality: For an extension officer or worker to succeed as an agent of change, he must be original. He must have the native intelligence to be original in his thoughts, words and action.\n(ii) Leadership: He must be a leader among leaders. He must be able to know the way i.e. his goal and lead the rural farmers to grasp and embrace that goal. He must be patient and able to inspire the rural farmers to achieve the goal.\n(iii) Initiative: A good extension worker must have initiative to tackle problems himself before referring them to supervisors. He must be able to take steps without being directed.\n(iv) Organisational Ability: The success of any extension activity will depend on how it is planned, organised and executed. He should be able to organise training of leaders.\n(v) Problem Solving. Ability: A good extension worker must be able to recognise problems, define them in simple terms and solve then if they fall within his training and experience.\n(vi) Clear Judgement: He must possess great foresight, he must be able to appreciate the problems of the farmers on the ground and know what to do to solve them.\n(vii) Reliability Honesty: An extension worker must be reliable, a man of his words. If the agency sends him down to the rural area, he should go down to deliver the piece of information and bring back feedback. If the rural farmers discover that he is reliable, they can then assimilate the new innovation and research findings.\n(viii) Communication Skill: An excellent extension worker must possess good communication skills e.g. good command of local language, boldness and oratory abilities.\n(ix) Freedom from Local Politics: A good extension worker must not be involved in the local politics as as to win the confidence of all members of the target group.\n(x) Respect for Culture and Traditions: He must be a good mixer for him to succeed. He must be able to come down to their level. He should dress like them, eat whatever they present, possibly drink their water, while not losing his goal for doing all these. By the wise behaviours he will win the hearts of the rural farmers. He should not feel superior to the farmers so as to achieve his goal. He must be approachable.\n(xi) Technical Knowledge: With sound training, an extension worker must be able to impact knowledge. He should be able to motivate these adult learners to acquire knowledge\n(xii) Punctuality and Availability: He should be able to attend all pre-arranged meetings,  seminars, workshops, etc, promptly and always make himself available.\n(c) unctions of an Extension Worker: To change peoples' outlook towards their living conditions. To teach rural people to recognise and take interest in their problems so as to overcome them To teach farmers improved practices using various methods, demonstrations, lectures, film shows, symposia, radio, etc, To act as a link between farmers and research institutes/Government. To teach farmers efficient management on the farms. To assist in obtaining loans and credits. To assist in locating markets for their farm produce, To monitor the use of Agric loans. To assist farmers tolocate sources of farm input. To evaluate the success or otherwise of the extension programme. To educate rural women on home management. To plan and execute farming educational programmes.",
    "year": "2006"
  }
]