[
  {
    "number": "1719",
    "text": "An undesirable attribute of capitalism is mostly seen in",
    "options": {
      "A": "freedom of choice",
      "B": "exploitation of labour",
      "C": "efficient production of goods and services",
      "D": "effective utilization of labour"
    },
    "answer_url": "https://myschool.ng/classroom/government/60781?exam_type=waec&type=obj&page=344",
    "correct_answer": "B",
    "explanation": "Exploitation of labour refers to the tendency in capitalist systems for workers to receive less value than the worth of what they produce. This often leads to economic inequality and poor working conditions.",
    "year": "2021"
  },
  {
    "number": "1720",
    "text": "A constitution that requires an absolute majority of members of parliament to amend is a",
    "options": {
      "A": "confederal constitution",
      "B": "federal constitution",
      "C": "flexible constitution",
      "D": "rigid constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/60782?exam_type=waec&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "A rigid constitution requires a more complex process to amend, often involving a significant majority in the legislature, and sometimes a referendum or approval from multiple institutions.",
    "year": "2021"
  },
  {
    "number": "1721",
    "text": "What is the term given to the action of discontinuing a session of a parliament or other legislative assembly without dissolving",
    "options": {
      "A": "Adjournment",
      "B": "Postponement",
      "C": "Prorogation",
      "D": "Recess"
    },
    "answer_url": "https://myschool.ng/classroom/government/60783?exam_type=waec&type=obj&page=345",
    "correct_answer": "C",
    "explanation": "Prorogation is the formal ending of a parliamentary session by the head of state or other authority, without dissolving the parliament. It marks the end of a session but not the end of the legislative body's existence.\nAdjournment refers to the suspension of a sitting of a legislative body to a later date or time. Recess refers to a break or temporary halt in the proceedings of a legislative body, not the discontinuation of a session.",
    "year": "2021"
  },
  {
    "number": "1722",
    "text": "In a monocephalous executive system of government, all executive powers are vested in the",
    "options": {
      "A": "Chief Justice",
      "B": "President",
      "C": "Prime Minister",
      "D": "Speaker"
    },
    "answer_url": "https://myschool.ng/classroom/government/60786?exam_type=waec&type=obj&page=345",
    "correct_answer": "B",
    "explanation": "In a monocephalous executive system, such as in a presidential system, all executive powers are concentrated in a single individual, the President.",
    "year": "2021"
  },
  {
    "number": "1723",
    "text": "The action programme of a political party intended to be carried out when political power is won is known as",
    "options": {
      "A": "code of conduct",
      "B": "party constitution",
      "C": "party survey",
      "D": "manifesto"
    },
    "answer_url": "https://myschool.ng/classroom/government/60789?exam_type=waec&type=obj&page=345",
    "correct_answer": "D",
    "explanation": "A manifesto is a public declaration by a political party outlining its proposed policies, plans and goals that it aims to implement if it wins the election.",
    "year": "2021"
  },
  {
    "number": "1724",
    "text": "What does the mass media rely on to gauge public opinion?",
    "options": {
      "A": "Influential citizens",
      "B": "propaganda and interviews",
      "C": "polls and survey",
      "D": "Rumors and gossip"
    },
    "answer_url": "https://myschool.ng/classroom/government/60791?exam_type=waec&type=obj&page=345",
    "correct_answer": "C",
    "explanation": "Polls and surveys are structured methods used by the mass media to collect data on public opinion. This allows for a quantifiable assessment of how the public feels about various issues. Influential citizens, propaganda, interviews, rumours and gossip are not objective or reliable means of gauging the opinion of the public.",
    "year": "2021"
  },
  {
    "number": "1725",
    "text": "Which of the following options is the role of a newspaper in a state?",
    "options": {
      "A": "Determines government appointment",
      "B": "Disseminates information",
      "C": "Ensures fairness in newspaper circulation",
      "D": "Ensures fair distribution of relief items"
    },
    "answer_url": "https://myschool.ng/classroom/government/60793?exam_type=waec&type=obj&page=345",
    "correct_answer": "B",
    "explanation": "Newspapers play a critical role in disseminating information to the public, including news, analysis and opinion, thereby informing citizens about various aspects of governance and society.",
    "year": "2021"
  },
  {
    "number": "1726",
    "text": "The Civil Services helps the government to",
    "options": {
      "A": "recruit personnel for the army",
      "B": "develop and implement policies effectively",
      "C": "maintain instability in the state",
      "D": "stay in power for a long time."
    },
    "answer_url": "https://myschool.ng/classroom/government/60797?exam_type=waec&type=obj&page=346",
    "correct_answer": "B",
    "explanation": "Civil Services, which include various government agencies and departments staffed by civil servants, are responsible for formulating, developing, and implementing government policies. Civil servants are often experts in their respective fields, and they provide the necessary knowledge, expertise, and administrative support to policymakers.\nThe role of Civil Services in policy development and implementation contributes to the overall governance and functioning of the state. Their expertise helps governments address complex issues, manage resources, and respond to the needs of the society they serve. While the elected officials set the direction and priorities, civil servants play a vital role in translating these into actionable policies and programs.",
    "year": "2021"
  },
  {
    "number": "1727",
    "text": "A citizen is barred from active politics when employed as a",
    "options": {
      "A": "university lecturer",
      "B": "priest",
      "C": "civil servant",
      "D": "journalist"
    },
    "answer_url": "https://myschool.ng/classroom/government/60801?exam_type=waec&type=obj&page=346",
    "correct_answer": "C",
    "explanation": "Civil servants are usually barred from engaging in active politics to ensure that they remain impartial and non-partisan in their roles",
    "year": "2021"
  },
  {
    "number": "1728",
    "text": "Citizens' political participation is best practised under a",
    "options": {
      "A": "militant pressure group",
      "B": "neighborhood vigilante group",
      "C": "cooperative society",
      "D": "political party"
    },
    "answer_url": "https://myschool.ng/classroom/government/60804?exam_type=waec&type=obj&page=346",
    "correct_answer": "D",
    "explanation": "Political parties are the primary organisations through which citizens engage in the political process. They offer a platform for political participation, including voting, running for office and influencing policy and governance.",
    "year": "2021"
  },
  {
    "number": "1729",
    "text": "The most important function of government is to ensure the",
    "options": {
      "A": "building of offices and houses",
      "B": "judiciary is well resourced",
      "C": "second arm of government is respected",
      "D": "security of the citizens"
    },
    "answer_url": "https://myschool.ng/classroom/government/60806?exam_type=waec&type=obj&page=346",
    "correct_answer": "D",
    "explanation": "The primary and most crucial function of government is to ensure the safety and security of its citizens, maintaining law and order and protecting them from internal and external threats.",
    "year": "2021"
  },
  {
    "number": "1730",
    "text": "The right to an adequate standard of living falls under",
    "options": {
      "A": "civil rights",
      "B": "economic right",
      "C": "free market economy",
      "D": "right to life"
    },
    "answer_url": "https://myschool.ng/classroom/government/60810?exam_type=waec&type=obj&page=346",
    "correct_answer": "B",
    "explanation": "Economic rights include the right to an adequate standard of living, which encompasses access to essential resources like food, shelter and healthcare.",
    "year": "2021"
  },
  {
    "number": "1731",
    "text": "People's political values are continuously shaped by the following agents except",
    "options": {
      "A": "education",
      "B": "family",
      "C": "media",
      "D": "ombudsman"
    },
    "answer_url": "https://myschool.ng/classroom/government/60814?exam_type=waec&type=obj&page=347",
    "correct_answer": "D",
    "explanation": "An ombudsman is an official appointed to investigate complaints against government agencies or officials. While important for addressing grievances and ensuring accountability, an ombudsman does not typically shape people's political values.",
    "year": "2021"
  },
  {
    "number": "1732",
    "text": "In which political system were there two levels of government with considerable devolution?",
    "options": {
      "A": "Capitalism",
      "B": "Federalism",
      "C": "Fascism",
      "D": "Unitarism"
    },
    "answer_url": "https://myschool.ng/classroom/government/60817?exam_type=waec&type=obj&page=347",
    "correct_answer": "B",
    "explanation": "Federalism is a system of government in which power is divided between a central (national) government and regional (state or provincial) governments. This division of powers allows for considerable devolution of authority to the regional governments, enabling them to have a degree of autonomy in certain matters. In a federal system, each level of government has its own set of responsibilities and powers.",
    "year": "2021"
  },
  {
    "number": "1733",
    "text": "A system of government in which people elect their lawmakers and make them accountable for their actions and inactions in government is",
    "options": {
      "A": "a representative government",
      "B": "first-past-the-post government",
      "C": "an oligarchy government",
      "D": "checks and balances system of government"
    },
    "answer_url": "https://myschool.ng/classroom/government/60821?exam_type=waec&type=obj&page=347",
    "correct_answer": "A",
    "explanation": "In a representative government, citizens elect officials to make decisions and govern on their behalf. These elected representatives are accountable to the electorate, who can vote them out of office if they fail to perform effectively.",
    "year": "2021"
  },
  {
    "number": "1734",
    "text": "Which territories in British West Africa did the colonial government exercise limited jurisdiction?",
    "options": {
      "A": "Conquered states",
      "B": "Mandated territories",
      "C": "protectorates",
      "D": "Trust territories"
    },
    "answer_url": "https://myschool.ng/classroom/government/60824?exam_type=waec&type=obj&page=347",
    "correct_answer": "C",
    "explanation": "In protectorates, the British colonial government exercised limited jurisdiction, allowing local rulers to retain some authority while British officials managed foreign policy and major administrative functions. This system provided a degree of autonomy to local governments under British oversight.",
    "year": "2021"
  },
  {
    "number": "1735",
    "text": "One of the following French West African colonies was the first to gain independence",
    "options": {
      "A": "Benin",
      "B": "Burkina Faso",
      "C": "Guinea",
      "D": "Togo"
    },
    "answer_url": "https://myschool.ng/classroom/government/60829?exam_type=waec&type=obj&page=347",
    "correct_answer": "C",
    "explanation": "Guinea was the first French West African colony to gain independence, achieving this on October 2, 1958. It chose to leave the French Union in a referendum, making it the earliest of the French colonies to become independent. Benin, Burkina Faso and Togo gained independence in 1960.",
    "year": "2021"
  },
  {
    "number": "1736",
    "text": "The struggle by the chiefs and people of West Africa against political, social and economic dominance by European powers was referred to as",
    "options": {
      "A": "imperialism",
      "B": "nationalism",
      "C": "neo-colonialism",
      "D": "liberation"
    },
    "answer_url": "https://myschool.ng/classroom/government/60834?exam_type=waec&type=obj&page=348",
    "correct_answer": "B",
    "explanation": "Nationalism is the term used to describe the movement for political independence and self-determination, where people of West Africa sought to resist and overthrow colonial rule and assert their own national identity and sovereignty.",
    "year": "2021"
  },
  {
    "number": "1737",
    "text": "The European imperialist penetration into West Africa was primarily motivated by the following considerations except",
    "options": {
      "A": "compassion",
      "B": "economic",
      "C": "social",
      "D": "military"
    },
    "answer_url": "https://myschool.ng/classroom/government/60839?exam_type=waec&type=obj&page=348",
    "correct_answer": "A",
    "explanation": "Compassion was not a primary motivator for European imperialism in West Africa. The motives for imperialism were more centred around economic gain, social and political influence, and military strategy.",
    "year": "2021"
  },
  {
    "number": "1738",
    "text": "Which policy made the colonised French West African partners with France in her colonial project?",
    "options": {
      "A": "Assimilation policy",
      "B": "Association policy",
      "C": "Indirect rule policy",
      "D": "Loi Cadre"
    },
    "answer_url": "https://myschool.ng/classroom/government/60848?exam_type=waec&type=obj&page=348",
    "correct_answer": "B",
    "explanation": "While theassimilation Policy(19th century – early 20th century) aimed to turn colonized Africans intoFrench citizensif they adopted French culture, theassociation Policy(introduced in the mid-20th century) acknowledged that the people of French West Africa haddistinct culturesand should not be forced to become \"French.\" Instead, it promotedpolitical participationand grantedmore autonomyto local leaders. This shift was crucial in redefining Africans aspartners rather than subjectsin the French colonial empire.",
    "year": "2021"
  },
  {
    "number": "1739",
    "text": "The British colonial governor in West Africa wielded sweeping powers by virtues of",
    "options": {
      "A": "the land tenure system",
      "B": "drafting laws",
      "C": "tax collection",
      "D": "veto power"
    },
    "answer_url": "https://myschool.ng/classroom/government/60849?exam_type=waec&type=obj&page=348",
    "correct_answer": "D",
    "explanation": "The veto power allowed the British colonial governor to override or reject legislation passed by the local legislative bodies or councils, giving them substantial control over colonial policies and governance.",
    "year": "2021"
  },
  {
    "number": "1740",
    "text": "The action plan by African countries under the New Partnership for Africa's Development (NEPAD) aimed at tackling the following issues except",
    "options": {
      "A": "economic",
      "B": "political",
      "C": "religious",
      "D": "social"
    },
    "answer_url": "https://myschool.ng/classroom/government/60851?exam_type=waec&type=obj&page=348",
    "correct_answer": "C",
    "explanation": "NEPAD does not specifically address religious issues. Its primary focus is on economic, political and social development rather than religious matters.",
    "year": "2021"
  },
  {
    "number": "1741",
    "text": "What motivated the adoption of the Indirect Rule system by the British in her West African colonies?",
    "options": {
      "A": "Effective and efficient tax system was in place",
      "B": "Chiefs did not have the power to make laws",
      "C": "Educated elites were in bed with the British government",
      "D": "The land was fertile for cash crop farming"
    },
    "answer_url": "https://myschool.ng/classroom/government/60852?exam_type=waec&type=obj&page=349",
    "correct_answer": "A",
    "explanation": "Indirect Rule allowed the British to leverage existing local administrative structures and leaders to collect taxes and implement colonial policies more efficiently. By using local chiefs and traditional rulers, the British could manage and extract resources without having to establish an entirely new administrative system.",
    "year": "2021"
  },
  {
    "number": "1742",
    "text": "The Economic Community for West African States (ECOWAS) was established primarily to",
    "options": {
      "A": "create a common currency for member countries",
      "B": "prevent neo-colonialism",
      "C": "sideline French West African countries in economic activities",
      "D": "Promote economic growth and development among member states."
    },
    "answer_url": "https://myschool.ng/classroom/government/60974?exam_type=waec&type=obj&page=349",
    "correct_answer": "D",
    "explanation": "The primary purpose of ECOWAS is to promote economic growth and development through regional integration, trade and cooperation among West African countries.",
    "year": "2021"
  },
  {
    "number": "1743",
    "text": "The media can best contribute to the democratic process of a country by",
    "options": {
      "A": "lobbying ministers to be in their good books",
      "B": "setting the agenda for good government",
      "C": "inciting strikes and demonstrations",
      "D": "recounting the achievements of the government in power"
    },
    "answer_url": "https://myschool.ng/classroom/government/60977?exam_type=waec&type=obj&page=349",
    "correct_answer": "B",
    "explanation": "By setting the agenda, the media can influence public debate, highlight important issues and hold government accountable. This role helps ensure that democratic processes are informed and responsive to public needs and concerns.",
    "year": "2021"
  },
  {
    "number": "1744",
    "text": "Public Corporations can deliver on their mandate if",
    "options": {
      "A": "incidence of corporation and mismanagement were dealt with",
      "B": "loans were secured to pay staff well",
      "C": "politicians were members of the board",
      "D": "religious institutions pray for their success"
    },
    "answer_url": "https://myschool.ng/classroom/government/60978?exam_type=waec&type=obj&page=349",
    "correct_answer": "A",
    "explanation": "Addressing corruption and mismanagement is crucial for public corporations to operate effectively and deliver on their mandates. Ensuring transparency, accountability and proper management practices helps these organizations achieve their objectives and serve the public efficiently.",
    "year": "2021"
  },
  {
    "number": "1745",
    "text": "Citizenship of a state is based on the following requirements except",
    "options": {
      "A": "birth",
      "B": "marriage",
      "C": "education",
      "D": "naturalization"
    },
    "answer_url": "https://myschool.ng/classroom/government/60980?exam_type=waec&type=obj&page=349",
    "correct_answer": "C",
    "explanation": "Education is not a requirement for acquiring citizenship. While education can be a factor in the integration process, it is not a criterion for citizenship. Citizenship can be by birth, marriage (or registration), naturalisation or honorary.",
    "year": "2021"
  },
  {
    "number": "1746",
    "text": "One-party system encourages and often ends up in",
    "options": {
      "A": "democracy",
      "B": "dictatorship",
      "C": "fair electoral contest",
      "D": "freedom of expression"
    },
    "answer_url": "https://myschool.ng/classroom/government/60981?exam_type=waec&type=obj&page=350",
    "correct_answer": "B",
    "explanation": "In a one-party system, the ruling party controls all political power and there is usually no room for opposition or dissent. This often leads to authoritarian or dictatorial rule where power is concentrated in the hands of a single party or leader.",
    "year": "2021"
  },
  {
    "number": "1747",
    "text": "Which of the following tools is not used by pressure groups to achieve with their aim?",
    "options": {
      "A": "Boycotts",
      "B": "Demonstrations",
      "C": "Elections",
      "D": "Strikes"
    },
    "answer_url": "https://myschool.ng/classroom/government/60982?exam_type=waec&type=obj&page=350",
    "correct_answer": "C",
    "explanation": "While pressure groups may influence elections through campaigning or endorsements, they do not typically run candidates or participate in elections themselves. Their primary activities are focused on advocacy and lobbying rather than directly participating in the electoral process.",
    "year": "2021"
  },
  {
    "number": "1748",
    "text": "Frequent military coup d'etats which topple elected governments negatively affect and stall",
    "options": {
      "A": "education",
      "B": "culture and religion",
      "C": "health",
      "D": "democratic gains"
    },
    "answer_url": "https://myschool.ng/classroom/government/60984?exam_type=waec&type=obj&page=350",
    "correct_answer": "D",
    "explanation": "Frequent military coups undermine democratic institutions, disrupt the rule of law and erode the legitimacy of elected governments. This leads to a loss of democratic progress and stability and makes it difficult to build or sustain democratic governance.",
    "year": "2021"
  },
  {
    "number": "1749",
    "text": "How beneficial is delegated legislation to the democratic process? It",
    "options": {
      "A": "aids lawmakers to become experts in legislation",
      "B": "cannot be applied during period of crises",
      "C": "helps to discipline personnel in the civil service",
      "D": "permits handling of certain aspect of legislation by non-technocrats"
    },
    "answer_url": "https://myschool.ng/classroom/government/60987?exam_type=waec&type=obj&page=350",
    "correct_answer": "D",
    "explanation": "Delegated legislation allows technical or specialised matters to be addressed by experts or officials who may not be elected legislators but are qualified to handle specific issues. This helps ensure that complex or detailed aspects of the law can be effectively managed without overburdening the legislative process.",
    "year": "2021"
  },
  {
    "number": "1750",
    "text": "Local government performs a number of functions on behalf of the central government in the form of",
    "options": {
      "A": "employing police officers",
      "B": "ensuring people attend religious institutions of prayers",
      "C": "mobilizing of resources of development",
      "D": "punishing opposition or dissent"
    },
    "answer_url": "https://myschool.ng/classroom/government/60989?exam_type=waec&type=obj&page=350",
    "correct_answer": "C",
    "explanation": "Local governments are often tasked with mobilising and managing resources to support local development projects and initiatives. This includes planning and implementing development programs that align with broader national policies.",
    "year": "2021"
  },
  {
    "number": "1751",
    "text": "In an environment of press freedom, the media plays the role of",
    "options": {
      "A": "articulating views of individuals",
      "B": "inciting people to be lawless",
      "C": "projecting individuals above the state",
      "D": "highlighting only the activities of government"
    },
    "answer_url": "https://myschool.ng/classroom/government/60993?exam_type=waec&type=obj&page=351",
    "correct_answer": "A",
    "explanation": "The media serves as a platform for individuals to express their opinions and views It facilitates public discourse and ensures diverse perspectives are represented.",
    "year": "2021"
  },
  {
    "number": "1752",
    "text": "Chiefs under the Indirect Rule system were used to carry out unpopular tasks, one of which was",
    "options": {
      "A": "enforcement of Western education",
      "B": "establishment of churches",
      "C": "military conscription",
      "D": "presiding over native courts"
    },
    "answer_url": "https://myschool.ng/classroom/government/60995?exam_type=waec&type=obj&page=351",
    "correct_answer": "D",
    "explanation": "Chiefs were often given the responsibility of presiding over native or traditional courts under the Indirect Rule system. This allowed colonial authorities to govern through existing local structures and leaders and leverage their authority to administer justice and enforce colonial policies at the local level.",
    "year": "2021"
  },
  {
    "number": "1753",
    "text": "In restoring peace and security to Liberia and Sierra Leone the Economic Community of West African States (ECOWAS) deployed a military force known as",
    "options": {
      "A": "Regional Armed Forces (RAF)",
      "B": "Peace Keeping Force of West Africa  (PKFWA)",
      "C": "ECOWAS Ceasefire Monitoring Group (ECOMOG)",
      "D": "ECOWAS heads of State and Government"
    },
    "answer_url": "https://myschool.ng/classroom/government/61002?exam_type=waec&type=obj&page=351",
    "correct_answer": "C",
    "explanation": "ECOMOG (ECOWAS Ceasefire Monitoring Group) was the force deployed by ECOWAS to monitor ceasefires and restore peace in Liberia and Sierra Leone during their respective civil wars.",
    "year": "2021"
  },
  {
    "number": "1754",
    "text": "The desire for foreign investments and overseas markets had become the driving force behind many West African countries",
    "options": {
      "A": "educational policy",
      "B": "foreign policy",
      "C": "campaign tool",
      "D": "dream ideology"
    },
    "answer_url": "https://myschool.ng/classroom/government/61004?exam_type=waec&type=obj&page=351",
    "correct_answer": "B",
    "explanation": "Foreign policy is significantly influenced by the desire to attract foreign investments and access overseas markets. West African countries often shape their foreign policy to improve trade relations, attract investment and participate in global markets.",
    "year": "2021"
  },
  {
    "number": "1755",
    "text": "Citizenship does not only go with rights but also the performance of",
    "options": {
      "A": "compulsory military service",
      "B": "compulsory teaching",
      "C": "certain obligations and duties",
      "D": "certain religious rites"
    },
    "answer_url": "https://myschool.ng/classroom/government/61178?exam_type=waec&type=obj&page=351",
    "correct_answer": "C",
    "explanation": "Citizenship typically comes with various responsibilities, such as obeying the law, paying taxes and participating in civic duties. These obligations ensure that citizens contribute to the functioning and welfare of their country.",
    "year": "2021"
  },
  {
    "number": "1756",
    "text": "Taking over power, military governments disregard democratic protocols and rule mainly by",
    "options": {
      "A": "decrees",
      "B": "popular acclamation",
      "C": "jury",
      "D": "court martial"
    },
    "answer_url": "https://myschool.ng/classroom/government/61179?exam_type=waec&type=obj&page=352",
    "correct_answer": "A",
    "explanation": "Military governments typically issue decrees to establish their authority and govern the country. These decrees are legislative orders or commands issued by military leaders and often bypass established democratic processes and legal frameworks.",
    "year": "2021"
  },
  {
    "number": "1757",
    "text": "Which electoral system best suits a heterogeneous political environment?",
    "options": {
      "A": "Non-transferable votes",
      "B": "Preferential ballot",
      "C": "Proportional representation",
      "D": "Run-off election"
    },
    "answer_url": "https://myschool.ng/classroom/government/61180?exam_type=waec&type=obj&page=352",
    "correct_answer": "C",
    "explanation": "A proportional representation system allocates seats in proportion to the number of votes each party or candidate receives, which helps ensure that diverse and minority groups are represented fairly. It is particularly effective in reflecting the heterogeneity of a population and accommodating various political and ethnic groups.",
    "year": "2021"
  },
  {
    "number": "1758",
    "text": "Judicial review in a democratic environment is an aspect of",
    "options": {
      "A": "checks and balances",
      "B": "a check on the legislature",
      "C": "a check on the executive and the media",
      "D": "ensuring the police assist the judiciary in its work"
    },
    "answer_url": "https://myschool.ng/classroom/government/61181?exam_type=waec&type=obj&page=352",
    "correct_answer": "A",
    "explanation": "Judicial review is a key component of the system of checks and balances. It allows the judiciary to review and potentially invalidate laws and actions by the executive and legislative branches if they are found to be unconstitutional. This ensures that no branch of government exceeds its authority and helps maintain the balance of power.",
    "year": "2021"
  },
  {
    "number": "1759",
    "text": "One advantage of a multi-party system is that, the",
    "options": {
      "A": "electorate have wide range of choice",
      "B": "educated elite represents their people in parliament",
      "C": "executive is not restrained by law",
      "D": "party in power creates employment for all sympathizers"
    },
    "answer_url": "https://myschool.ng/classroom/government/61183?exam_type=waec&type=obj&page=352",
    "correct_answer": "A",
    "explanation": "In a multi-party system, voters can choose from a variety of parties with different platforms and policies. This enhances representation and reflects a broader spectrum of political opinions and interests.",
    "year": "2021"
  },
  {
    "number": "1760",
    "text": "The following factors motivated the formation and growth of political parties in British West African territories except",
    "options": {
      "A": "external socio-political factors",
      "B": "improvement in communication network",
      "C": "membership of legislative council",
      "D": "the role of newspapers"
    },
    "answer_url": "https://myschool.ng/classroom/government/61184?exam_type=waec&type=obj&page=352",
    "correct_answer": "B",
    "explanation": "While improvements in communication networks may have facilitated the dissemination of ideas and information, they were not a primary motivating factor for the formation of political parties. The growth of political parties was more directly driven by the desire for political representation, resistance to colonial rule and socio-political dynamics.",
    "year": "2021"
  },
  {
    "number": "1761",
    "text": "Undue political interference in the work of electoral management bodies in West Africa has the potential to",
    "options": {
      "A": "ensure fairness and transparency in their operations",
      "B": "employ qualified returning officers",
      "C": "erode the independence of the institution",
      "D": "make all parties accept election result."
    },
    "answer_url": "https://myschool.ng/classroom/government/61185?exam_type=waec&type=obj&page=353",
    "correct_answer": "C",
    "explanation": "Political interference can undermine the autonomy and impartiality of electoral management bodies and lead to a loss of confidence in their ability to conduct free and fair elections.",
    "year": "2021"
  },
  {
    "number": "1762",
    "text": "A person who is denied the right to vote is described as",
    "options": {
      "A": "uncivilized",
      "B": "disenfranchised",
      "C": "civil servant",
      "D": "non-partisan"
    },
    "answer_url": "https://myschool.ng/classroom/government/61186?exam_type=waec&type=obj&page=353",
    "correct_answer": "B",
    "explanation": "The disenfranchised refers to individuals who have been deprived of their voting rights, either through legal restrictions, discriminatory practices or other means.",
    "year": "2021"
  },
  {
    "number": "1763",
    "text": "Public corporation is a semi-independent statutory body established by",
    "options": {
      "A": "an act of parliament",
      "B": "a civil service commission",
      "C": "a private sector initiative",
      "D": "free zones board"
    },
    "answer_url": "https://myschool.ng/classroom/government/61189?exam_type=waec&type=obj&page=353",
    "correct_answer": "A",
    "explanation": "A public corporation is a semi-independent statutory body established by an act of parliament to carry out specific public functions or services. It operates with a degree of independence from the government but is still accountable to it and operates under statutory regulations.",
    "year": "2021"
  },
  {
    "number": "1764",
    "text": "One of the objectives of the United Nations Organization (UNO) is to",
    "options": {
      "A": "establish a standing army",
      "B": "give loans to poor countries in the world",
      "C": "promote and encourage respect for human rights and freedoms",
      "D": "ensure African leaders are respected"
    },
    "answer_url": "https://myschool.ng/classroom/government/61190?exam_type=waec&type=obj&page=353",
    "correct_answer": "C",
    "explanation": "One of the central goals of the United Nations is to promote and protect human rights and fundamental freedoms through various treaties, conventions, and agencies like the Human Rights Council.",
    "year": "2021"
  },
  {
    "number": "1765",
    "text": "The West African Youth League (WAYL) was a nationalist movement founded by",
    "options": {
      "A": "Bankole-Bright",
      "B": "ITA Wallace-Johnson",
      "C": "J.E. Casely Hayford",
      "D": "Samuel Akisanya"
    },
    "answer_url": "https://myschool.ng/classroom/government/61191?exam_type=waec&type=obj&page=353",
    "correct_answer": "B",
    "explanation": "The West African Youth League (WAYL) was a nationalist movement founded by I.T.A. Wallace-Johnson.  I.T.A. Wallace-Johnson was a key figure in founding the West African Youth League. The WAYL was established in 1934 to promote political and economic development in West Africa and advocate for greater self-governance.",
    "year": "2021"
  },
  {
    "number": "1766",
    "text": "Commonwealth member states derive the following benefits from the association except",
    "options": {
      "A": "assistance to war-torn countries",
      "B": "promotion of education",
      "C": "political instability",
      "D": "promotion of sports"
    },
    "answer_url": "https://myschool.ng/classroom/government/61193?exam_type=waec&type=obj&page=354",
    "correct_answer": "C",
    "explanation": "Political instability is not a benefit of Commonwealth membership. In fact, the Commonwealth aims to support democratic governance and stability in member states. Political instability is a challenge that the Commonwealth seeks to address, rather than a benefit.",
    "year": "2021"
  },
  {
    "number": "1767",
    "text": "The Economic Community of West African States (ECOWAS) is saddled with many problems, one of which is",
    "options": {
      "A": "colonial heritage",
      "B": "facilitation of movement of people",
      "C": "inter-state trading",
      "D": "sports and cultural exchange"
    },
    "answer_url": "https://myschool.ng/classroom/government/61194?exam_type=waec&type=obj&page=354",
    "correct_answer": "A",
    "explanation": "Colonial heritage is a significant problem for ECOWAS. The legacy of colonialism has left a mark on the region’s political boundaries, economic structures and administrative systems, which can create challenges for regional integration and cooperation.",
    "year": "2021"
  },
  {
    "number": "1768",
    "text": "In which system of government are all the component units sovereign?",
    "options": {
      "A": "Confederal",
      "B": "Federal",
      "C": "monarchical",
      "D": "Republican"
    },
    "answer_url": "https://myschool.ng/classroom/government/61195?exam_type=waec&type=obj&page=354",
    "correct_answer": "A",
    "explanation": "In a Confederal system of government, all the component units (such as states or provinces) are sovereign. This means that the component units retain the majority of the power and authority, while the central government has limited powers that are delegated to it by the component units.\nIn a federal system, sovereignty is shared between the central government and the component units. Both levels of government have constitutionally guaranteed powers, and neither is fully sovereign over the other. In a monarchical system, sovereignty is typically vested in the monarch or the central government, not in the component units. In a republican system, sovereignty resides with the people and is exercised through elected representatives. The distribution of power can vary, but it does not imply that all component units are sovereign.",
    "year": "2021"
  }
]