[
  {
    "number": "28",
    "text": "(a) A colourless gas P was given off when dilute tetraoxosulphate (VI) acid was added to zinc salt Q. On bubbling the gas through lime water, a white precipitate R was formed. Identify P, Q and R.\n(b) Name a suitable apparatus that could be used to perform each of the following activities in the laboratory\n(i) storage of dilute silver trioxonitrate (V):\n(ii) heating copper metal;\n(iii) separation of a mixture of water and Kerosene. Give one reason for each of your answers in (b)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60019?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "29",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely record and for accurate inferences. All tests, observations and inferences must be clearly entered in your answer book in ink, at the time they are made.\nC is a mixture of two salts. Carry out the following exercises on C. Record your observations and identify any gas(es) evolved. State the conclusion drawn from the result of each fest\n(a) Put all of C into a boiling tube and add about 5cm\\(^3\\) of distilled water. Stir thoroughly and filter. Keep both the residue and the filtrate.\n(b) To about 2 cm\\(^3\\) of the filtrate, add few drops of Pb(NO\\(_3\\))\\(_{(aq)}\\). Boil the mixture and then allow to cool.\n(c)(i) Put the residue in a test tube and add dilute HNO\\(_{3}\\). Shake the mixture and divide the solution into two portions\n(ii) to the first portion from (c)(i), add NaOH\\(_{(aq)}\\) in drops acid then in excess.\n(iii) To the second portion from (c)(ii), add aqueous ammonia in drops and then in excess",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60020?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "30",
    "text": "Burette readings (initial and final) must be given to two decimal places. Volume of pipefte used must also be recored but no account of expeririental procedure is required. All calculations must be done in your answer book.\nA is 0.100 mol dm\\(^{-3}\\) solution of an acid. B is a solution of KOH containing 2.8 g per 500 cm'\\(^3\\)\n(a) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\)  portions of B using methyl orange as an indicator. Repeat the titration to obtain consistent titres. Tabulate your readings and calculate the average volume of A used.\n(b) From your results and the information provided above, calculate the:\n(i) number of moles of acid in the average titre;\n(i) number of moles of KOH in the volume of B pipetted;\n(ii) mole ratio of acid to base in the reaction. [H = 1.00, O = 16.0, K = 39.0]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60021?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  }
]