[
  {
    "number": "1",
    "text": "(a)\n\nYou are provided with a metre rule, a knife-edge, set of masses, inextensible string, retort support and other necessary apparatus.\ni. Place the metre rule on the knife edge. Read and record the point G where the metre rule balances horizontally, as shown in Fig (a).\nii. Suspend the metre rule at G with the aid of the string provided and attach the string to the retort support as shown in Fig 1(b). Keep the string attached to this point throughout the experiment.\niii. Attach the mass M\\(_{0}\\) at the 80cm mark of the metre rule. Determine the distance of y from G. Keep M\\(_{0}\\) at this\nposition throughout the experiment.\niv. Suspend a mass M= 40g on the side AG and adjust its position until the metre rule balances horizontally.\nv. Measure and record the distance of x of M from G. Evaluate x\\(^{-1}\\)\nvi. Repeat the procedure for four other values of M= 60g, 80g, 100g and 120g. Measure and record x and evaluate x\\(^{-1}\\) in each case.\nvii. Tabulate the readings.\nviii. Plot a graph of M on the vertical axis and x on the horizontal axis, starting both axes from the origin (0,0).\nix. Determine the slope s of the graph:\nx. Given that s = yM\\(_{0}\\), determine M\\(_{0}\\).\nxi. State two precautions taken to obtain accurate results.\n(b) i. Define the moment of a force about a point.\nii. A uniform metre rule is suspended by an inextensible string at its centre of gravity. If a mass of 60g is placed at the 25cm mark, what mass should be placed at the 80cm mark of the metre rule to balance it horizontally?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59725?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "2",
    "text": "You are provided with a glass block, plane mirror, and optical pins. \n(i) Place the glass block on a drawing sheet and trace its outline ABCD as shown in the diagram above.\n(ii) Remove the block, measure and record the width W of the block.\n(iii) Draw a normal ON to DC at a point about one-quarter the length of DC.\n(iv) Draw a line making an angle i = 10° with the normal.\n(v) Replace the block on its outline and mount the plane mirror vertically behind the block such that it makes good contact with the face AB.\n(vi) Stick two pins P\\(_{1}\\) and P\\(_{2}\\) on the line MO.\n(vii) Looking through the face CD, stick two other pins P\\(_{3}\\) and P\\(_{4}\\) such that they appear to be in a straight line with the images of pins P\\(_{1}\\) and P\\(_{2}\\) seen through the block.\n(viii) Join P\\(_{3}\\) and P\\(_{4}\\) with a straight line and extend it to touch the face CD at O\\(^{1}\\).\n(ix)Draw a perpendicular line from the midpoint of OO\\(^{1}\\) to meet AB at Q.\n(x) Draw lines OQ, O\\(^{1}\\)Q and normal O\\(^{1}\\)N\\(^{1}\\) produced.\n(xi) Measure and record \\cos\\theta, e, and d.\n(xii) Evaluate m = sin e, and n cos\\(\\frac{\\theta}{2}\\)\n(xii)Repeat the procedure for i = 20°, 30°, 40° and 50.\n(xiv) Tabulate your readings.\n(xv) Plot a graph with m on the vertical axis and n on the horizontal axis.\n(xvi) Determine the slope, s, of the graph and evaluate \\cos\\theta = 2Ws.\n(xvii) State two precautions are taken to ensure accurate results.\n(xviii) Sketch a diagram to show the path of the ray through the glass block when the angle of incidence i = 90° in the experiment above.\n(xix) A coin lies at the bottom of a tank containing water to a depth of 130cm. If the refractive index of water is 1.3, calculate the apparent displacement of the coin when viewed vertically from above.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59735?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "3",
    "text": "You are provided with a resistance box R, voltmeter, key, cell of e.m.f. E, constantan wire, standard resistor, RX, an ammeter, and other necessary apparatus.\n(i) Measure and record the e.m.f. E of the cell provided.\n(ii) Set up the circuit as shown in the diagram above.\n(iii) Set R to 1\\(\\Omega\\). Close the key, read and record the current I and the corresponding voltage V.\n(iv) Repeat the procedure for four other values of R= 2\\(\\Omega\\), 4\\(\\Omega, 6\\(\\Omega\\), and 8\\(\\Omega\\).\n(v) In each case, read and record I and V.\n(vi) Tabulate the reading.\n(vii) Plot a graph of V on the vertical axis and I on the horizontal axis.\n(viii) Determine the slope s, of the graph.\n(ix) State two precautions are taken to ensure accurate results\n(b) )State two advantages of connecting identical cells in parallel.\n(ii) State two factors to consider in choosing the material for the design of a resistor",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59755?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  }
]