[
  {
    "number": "76",
    "text": "Study specimens A, B C and D carefully and use them to answer questions 1(a) to 1(d).\n(a)(i) Name tne phylum to which each of specimens A and D belong. \n(ii) Name the habitat or each Specimens A and D.\n (b)(i) Name the type of reproduction common to specimens A, B, C and D.\n(ii) List the method of reproduction of each of specimens A, B,C and D giving one reason each for the method of reproduction listed.\n(c) In a tabular form, state three observable differences between specimens B and C.\n (d) Make a drawing 8-10 cm long of specimens A to show the essential parts and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60305?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "77",
    "text": "Study specimens E, F, G1 and G2 carefully and use them to answer questions 2(a) to 2(d).\n(a)(i) Name the life process in mammals that is associated with specimens E. \n(ii) State two structural similarities between the surface of specimen E and the skin of specimen F.\n(b)(i) Name the habitat in which specimen F will function efficiently. \n(ii) Explain how two observable features of specimens F adapt the organism to its habitats.\n (C)(i) Using the blade provided cut a thin transverse section of the stem of specimens G add two drops of freshly prepared iodine solution to the cut section.\n          Record your observation and inferences :\n(ii) In which part of the stem is food stored.\n(iii) Name two tissues used for transportation of materials in specimens G,\n (iv) List two supporting tissues present in specimen G,\n(d) Make a drawing 10-12 cm long of a cut transverse section of the stem of specimen G, and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60306?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "78",
    "text": "Study specimens L, M, N, P, Q, R and S carefully and use them to answer questions 4(a) to 4(d).\n(a) Name two specimens which can be used for the following: (i) transaction; (ii) protection; (iii) statement.\n(b) Stating observable features in specimens L, M, N, P,Q and R, Suggest one reason each for the answers given in 4(a)i), (ii) and (iii) above.\n(c) State. (i) two observable similarities; (ii) two differences between specimens P and R.\n(d)(i) Sate how observable features of specimen M adapt the specimen to its functions. \n(ii) Arrange specimens L, , N and S in the increasing order of  complexity of the organism to which they belong.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60307?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  }
]