[
  {
    "number": "81",
    "text": "(a) Identify specimens A, B and C\nSpecimen A;            Specimen B;      Specimen C;\n            \n(b) Give one function of each of Specimen A, B and C\n(c) State two ways of maintaining each of specimen A and B\n(d) Name three other farm implements that perform the same function as specimen B\n(e) Mention two precautions to be observed when using specimen B",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59973?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "82",
    "text": "(a) To what type of rock do each of specimens D, E, and F belong?\n(b) State the types of weathering caused by each of specimens G, H, and l\n(c) Give two ways by which weathering causes each of specimens G, H, and I.\n(o) State three ways in which specimen D is important to agriculture",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59974?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "83",
    "text": "(a) State each of the disease condition observed on specimens J (MAIZE PLANT) and K (CASSAVA LEAF) and their causative agents.\n(b) Explain the mode of transmission of the diseases on each of specimens J and K.\n(c) State two effects each of the diseases on Specimens J and K and two control measures of each\n(d) Name two other diseases of specimen K.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59975?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "84",
    "text": "(a) ldentify specimens L, M and N.\nSpecimen L;          Specimen M;                      Specimen N;\n          \n(b) ldentify specimens O and P, using specimen N\n(c) In which of specimens O and P will specimen M survive better?\n(d) What is the relevance of specimen L in the production of specimen M?\n(e) State two pond management practices to improve specimen O for the production of specimen M.\n(f) List three ways by which the loss of specimen M can be controlled in a farm.\n(g) State one method each of (i) partial harvesting. (ii) complete harvesting of specimen M.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59976?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  }
]