[
  {
    "number": "312",
    "text": "A sole proprietor has been advised to advertise her business in order to increase sales.\n(a) i. List four advertising media she could use.\nii. State four factors she would consider in the choice of a medium.\n(b) State four advantages of advertising to her business",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58579?exam_type=waec&type=theory&page=63",
    "correct_answer": "(a) The advertising media she could use include:\nThe press, (newspapers, magazines/journals and books) -TelevisionRadioCinemaHoarding (billboards)Window display CataloguesExhibitions and trade fairsHandbills/ fliers Car stickers.\nii. The factors she would consider in the choice of a medium are:-\n- Coverage or extent of circulation: This refers to the number of people that can be reached by the medium, i.e. the percentage of a given market covered.-\n- Frequency: This means the number of times the same viewer or reader may be exposed to the same advert.\n- Communication effectiveness: This refers to the ability of a medium to deliver the impact as desired by the advertiser to the target market.\n- The target audience: She must consider the type and social group to which an advertisement is directed and their purchasing power.\n- Cost: The cost of using a particular medium will determine the one to be chosen by the advertiser.\n- Flexibility of a medium: This refers to the number of different things she can do using the same medium. For example, direct mail allows the enclosure of money, coupons and pencils.\n- Nature of the goods: The nature of the products will determine the choice of media to be used for advertising.\n- Geographical selectivity: This is the ability of the medium to reach out to homes in specific geographical areas such as Villages and hamlets.\n-The media used by competitors: The media used by manufacturers of competing products must be carefully considered before making a choice of medium.\n(b) The advantages of advertising to her business are:\n- Provision of information about features: it helps her to explain the use, features, and benefits of her business to the consumers.\n-Increase in cost per unit of goods will be reduced thereby attracting consumers to her business.\n- Increase in profit: it increases the profitability of an organization\n- Higher revenue: The advertising firms also gain in terms of revenue.\n- Provision of information about the existence of goods: It provides information about the existence of her business.\n- Improvement in quality of goods: It helps in improving the quality of goods as a result of healthy competition.\n- Increase in production: It can lead to an increase in production as more goods/services will be demanded\n- Creation of awareness: It helps her in creating awareness for her business.",
    "explanation": "(a) The advertising media she could use include:\nThe press, (newspapers, magazines/journals and books) -TelevisionRadioCinemaHoarding (billboards)Window display CataloguesExhibitions and trade fairsHandbills/ fliers Car stickers.\nii. The factors she would consider in the choice of a medium are:-\n- Coverage or extent of circulation: This refers to the number of people that can be reached by the medium, i.e. the percentage of a given market covered.-\n- Frequency: This means the number of times the same viewer or reader may be exposed to the same advert.\n- Communication effectiveness: This refers to the ability of a medium to deliver the impact as desired by the advertiser to the target market.\n- The target audience: She must consider the type and social group to which an advertisement is directed and their purchasing power.\n- Cost: The cost of using a particular medium will determine the one to be chosen by the advertiser.\n- Flexibility of a medium: This refers to the number of different things she can do using the same medium. For example, direct mail allows the enclosure of money, coupons and pencils.\n- Nature of the goods: The nature of the products will determine the choice of media to be used for advertising.\n- Geographical selectivity: This is the ability of the medium to reach out to homes in specific geographical areas such as Villages and hamlets.\n-The media used by competitors: The media used by manufacturers of competing products must be carefully considered before making a choice of medium.\n(b) The advantages of advertising to her business are:\n- Provision of information about features: it helps her to explain the use, features, and benefits of her business to the consumers.\n-Increase in cost per unit of goods will be reduced thereby attracting consumers to her business.\n- Increase in profit: it increases the profitability of an organization\n- Higher revenue: The advertising firms also gain in terms of revenue.\n- Provision of information about the existence of goods: It provides information about the existence of her business.\n- Improvement in quality of goods: It helps in improving the quality of goods as a result of healthy competition.\n- Increase in production: It can lead to an increase in production as more goods/services will be demanded\n- Creation of awareness: It helps her in creating awareness for her business.",
    "year": "2020"
  },
  {
    "number": "313",
    "text": "(a) State four functions of a cartel\n(b) Explain three advantages and three disadvantages of public enterprises",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58583?exam_type=waec&type=theory&page=63",
    "correct_answer": "(a) Functions of a cartel:\nRegulation of production and price: A cartel regulates the production and raises the price of their products/services.\nRegulation of production: The organization, to a large extent, has succeeded in allocating production quotas to member states.\nRestriction of output Members of a cartel can also agree to prevent, restrict or limit the goods or services they are buying or selling or the goods or services that would likely be bought and sold.\nBid rigging: A cartel does this through an agreement among its members about who should win a bid among them.-\nMarket sharing: This occurs when businesses collude to carve up markets as regards the sale of a specific product, a geographical area, or a specific type of customer or consumer. among them.\n(b)Advantages of public enterprises:\ni. Provision of infrastructural facilities: Public enterprises provide infrastructural facilities such as roads, schools, railways, electricity, etc. to the populace.\nii. Availability of large capital: Since public enterprises are owned by the government, there is always availability of sufficient capital to ensure the expansion of the enterprises.\niii. There is continuity: Public enterprises can last for a long period of time. In other words, there is perpetual existence.\niv. Development of capital projects: The establishment of public enterprises can ensure the development of capital projects, e.g. rural electrification.\nv. Avoidance of exploitation of consumers: Public enterprises are consumer-conscious as they ensure that the exploitation of consumers is greatly reduced.\nvi. Creation of higher standards: The government enters into business in order to ensure higher standards, e.g provision of educational facilities.\nvii. Accountability to the public: Public enterprises are accountable to the public because they have to submit their annual reports to the parliament.\nviii. They cater for the interest of workers: in public enterprIses, the interest of the workers is catered for and the employees have a great sense of security\nix. Provision of employment opportunities: Public enterprises provide employment opportunities for the teeming number of the unemployed.\nx. Generation of revenue: Revenue is generated by the government from public enterprises, e.g. water rate or electricity bill, to finance other projects\nDisadvantages of public enterprises:\ni. Large capital requirement: The cost of establishing a public Corporation is very high, i.e. large capital is involved.\nii. Government interference: Government can interfere in the activities of public enterprises through the appointment of unqualified and incompetent people as board members.\niii. Inefficiency in operation: Lack of competition can bring about inefficiency in business operations.\niv. Danger of monopoly: Public enterprises are monopolistic in nature, e.g. NEPA (now PHCN); hence, it can abuse the privileged.\nv. Bureaucratic tendencies and red-tapism: Decision making may be slow because it has to pass through many people or channels before approval\nvi. Corruption and mismanagement: Many public enterprises In Nigeria have become the major areas for embezzlement and mismanagement of the nation's resources\nvii. Wastage: In public enterprises, wastages are usually recorded, and the taxpayers bear the brunt.",
    "explanation": "(a) Functions of a cartel:\nRegulation of production and price: A cartel regulates the production and raises the price of their products/services.\nRegulation of production: The organization, to a large extent, has succeeded in allocating production quotas to member states.\nRestriction of output Members of a cartel can also agree to prevent, restrict or limit the goods or services they are buying or selling or the goods or services that would likely be bought and sold.\nBid rigging: A cartel does this through an agreement among its members about who should win a bid among them.-\nMarket sharing: This occurs when businesses collude to carve up markets as regards the sale of a specific product, a geographical area, or a specific type of customer or consumer. among them.\n(b)Advantages of public enterprises:\ni. Provision of infrastructural facilities: Public enterprises provide infrastructural facilities such as roads, schools, railways, electricity, etc. to the populace.\nii. Availability of large capital: Since public enterprises are owned by the government, there is always availability of sufficient capital to ensure the expansion of the enterprises.\niii. There is continuity: Public enterprises can last for a long period of time. In other words, there is perpetual existence.\niv. Development of capital projects: The establishment of public enterprises can ensure the development of capital projects, e.g. rural electrification.\nv. Avoidance of exploitation of consumers: Public enterprises are consumer-conscious as they ensure that the exploitation of consumers is greatly reduced.\nvi. Creation of higher standards: The government enters into business in order to ensure higher standards, e.g provision of educational facilities.\nvii. Accountability to the public: Public enterprises are accountable to the public because they have to submit their annual reports to the parliament.\nviii. They cater for the interest of workers: in public enterprIses, the interest of the workers is catered for and the employees have a great sense of security\nix. Provision of employment opportunities: Public enterprises provide employment opportunities for the teeming number of the unemployed.\nx. Generation of revenue: Revenue is generated by the government from public enterprises, e.g. water rate or electricity bill, to finance other projects\nDisadvantages of public enterprises:\ni. Large capital requirement: The cost of establishing a public Corporation is very high, i.e. large capital is involved.\nii. Government interference: Government can interfere in the activities of public enterprises through the appointment of unqualified and incompetent people as board members.\niii. Inefficiency in operation: Lack of competition can bring about inefficiency in business operations.\niv. Danger of monopoly: Public enterprises are monopolistic in nature, e.g. NEPA (now PHCN); hence, it can abuse the privileged.\nv. Bureaucratic tendencies and red-tapism: Decision making may be slow because it has to pass through many people or channels before approval\nvi. Corruption and mismanagement: Many public enterprises In Nigeria have become the major areas for embezzlement and mismanagement of the nation's resources\nvii. Wastage: In public enterprises, wastages are usually recorded, and the taxpayers bear the brunt.",
    "year": "2020"
  },
  {
    "number": "314",
    "text": "(a) List six credit instruments used in business transactions\n(b) Mr. Sylva is considering hire purchase as a source of finance for his business operations. State four advantages and three disadvantages of this source of finance.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58584?exam_type=waec&type=theory&page=63",
    "correct_answer": "(a) Credit instruments used in business transactions:\nPromissory noteBill of exchangeChequeLetter of creditBondBank draftTrade billAccommodation Dill.\n(b)The advantages of hire purchase as a source of finance for Mr. Sylva's business operations are:\ni. Promotion of durable goods: It facilitates the promotion of durable goods.\nii. Increase in profit: The profit will increase as a result of the availability of hire purchase.\niii. Increase in turnover: It increases the rate of turnover.\niv. Large-scale production: It leads to large-scale production as a result of an increase in demand.\nv. Opportunity to acquire expensive goods: It presents the opportunity to acquire expensive goods which he or she could not have been able to buy by cash\nvi. Access to credit: He has access to credit which he could otherwise not have obtained from banks.\nThe disadvantages of hire purchase as a source of finance for Mr. Sylva's business operations are:\ni. Additional costs: It usually brings additional costs as a result of court action for recovery of den\nii. Court action: It can lead to court action.\niii. Paying more than necessary: He will pay more than he Would pay under cash transactions.\niv. Payment of a high interest rate: He will be paying a high rate of interest\nv. Inability to negotiate for better deals: He may not be able to negotiate for a better deal",
    "explanation": "(a) Credit instruments used in business transactions:\nPromissory noteBill of exchangeChequeLetter of creditBondBank draftTrade billAccommodation Dill.\n(b)The advantages of hire purchase as a source of finance for Mr. Sylva's business operations are:\ni. Promotion of durable goods: It facilitates the promotion of durable goods.\nii. Increase in profit: The profit will increase as a result of the availability of hire purchase.\niii. Increase in turnover: It increases the rate of turnover.\niv. Large-scale production: It leads to large-scale production as a result of an increase in demand.\nv. Opportunity to acquire expensive goods: It presents the opportunity to acquire expensive goods which he or she could not have been able to buy by cash\nvi. Access to credit: He has access to credit which he could otherwise not have obtained from banks.\nThe disadvantages of hire purchase as a source of finance for Mr. Sylva's business operations are:\ni. Additional costs: It usually brings additional costs as a result of court action for recovery of den\nii. Court action: It can lead to court action.\niii. Paying more than necessary: He will pay more than he Would pay under cash transactions.\niv. Payment of a high interest rate: He will be paying a high rate of interest\nv. Inability to negotiate for better deals: He may not be able to negotiate for a better deal",
    "year": "2020"
  },
  {
    "number": "315",
    "text": "(a) Explain four factors to be considered in setting up a retail business.\n(b) State how the government uses the following to regulate business:\ni. registration of business name\nii. patent;\niii. trade mark;\niv. copyright.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58585?exam_type=waec&type=theory&page=63",
    "correct_answer": "(a) Factors to be considered in setting up a retail business:\ni. Availability of capital: There should be the availability of capital to stock the goods and for the payment of rent.\nii. Best location: It is important for the person setting up a retail business to secure the right location for his business. For instance, someone who wants to be selling stationery materials must be close to an area full of schools\niii. Target market: The target market must be close to the right location where you have your retail business.\niv. Financial capital: This is needed to function well in the business. It can be raised by investors and lenders to operate comfortably.\nv. Adequate transport network: There should be an adequate transport network to move goods to the store for retail.\nvi. Nearness to Customers: The location of the business must be close where there is demand for the goods sold.\nvii. Closeness to the source of supply of products: The shop should be very close to where goods can be easily obtained.\nviii. Nature of goods: The nature of goods is equally important to be considered.\nix. Level of competition: The number of other traders in the same line of business in the location should be considered.\nx. Accessibility: He or she should consider the availability of accessible roads to his business premises.\nxi. Government policy: Government policy, if any, as it relates to the location of such business must be considered.\n(b) How the government uses the following to regulate business:\ni. Registration of business name: The government made the registration of business names compulsory under the Company Act. All businesses must be registered either as a Sole trading, a partnership, a public company, or a co-operative. In Nigeria, it is the Corporate Affairs Commission (CAC) that is saddled with the responsibility of registering business enterprises before commencing operation. The Corporate Affairs Commission will then issue a certificate of incorporation to any business incorporated. The Government also does this to raise revenue through tax imposition for certain purposes. For example, in Nigeria, companies pay education tax as value-added tax (VAT).\nii. Patent right: The government grants this exclusive right to a person to make use or sell an invention for a certain period of years. This gives the owner some degree of monopoly of the invention Nobody can make use of such invention without permission from the right owner. The government does this to encourage innovation and allow the investor to recoup his or her research cost.\niii. Trademark: This is a distinctive symbol, special mark, or design that is given to a producer to distinguish or identify its products from other products. Trademark is a legal term covering words and symbols which can be registered and protected. If the trademark is infringed upon, government empowers the owner of the copyright to sue the culprit. Trademark. registration in Nigeria is regulated by the Trademarks Act 1967\niv. Copyright: This is an exclusive or sole right granted to writers of literary works (authors), musicians, and artists to produce their works for a specified period of time. Another person cannot reproduce such work without written permission from the copyright owner, Literary copyright will last for 50 years after the death of the author while musical rights will only last for 50 years after its release. In Nigeria, the agency in charge of copyright issues is the Nigerian Copyright Commission.",
    "explanation": "(a) Factors to be considered in setting up a retail business:\ni. Availability of capital: There should be the availability of capital to stock the goods and for the payment of rent.\nii. Best location: It is important for the person setting up a retail business to secure the right location for his business. For instance, someone who wants to be selling stationery materials must be close to an area full of schools\niii. Target market: The target market must be close to the right location where you have your retail business.\niv. Financial capital: This is needed to function well in the business. It can be raised by investors and lenders to operate comfortably.\nv. Adequate transport network: There should be an adequate transport network to move goods to the store for retail.\nvi. Nearness to Customers: The location of the business must be close where there is demand for the goods sold.\nvii. Closeness to the source of supply of products: The shop should be very close to where goods can be easily obtained.\nviii. Nature of goods: The nature of goods is equally important to be considered.\nix. Level of competition: The number of other traders in the same line of business in the location should be considered.\nx. Accessibility: He or she should consider the availability of accessible roads to his business premises.\nxi. Government policy: Government policy, if any, as it relates to the location of such business must be considered.\n(b) How the government uses the following to regulate business:\ni. Registration of business name: The government made the registration of business names compulsory under the Company Act. All businesses must be registered either as a Sole trading, a partnership, a public company, or a co-operative. In Nigeria, it is the Corporate Affairs Commission (CAC) that is saddled with the responsibility of registering business enterprises before commencing operation. The Corporate Affairs Commission will then issue a certificate of incorporation to any business incorporated. The Government also does this to raise revenue through tax imposition for certain purposes. For example, in Nigeria, companies pay education tax as value-added tax (VAT).\nii. Patent right: The government grants this exclusive right to a person to make use or sell an invention for a certain period of years. This gives the owner some degree of monopoly of the invention Nobody can make use of such invention without permission from the right owner. The government does this to encourage innovation and allow the investor to recoup his or her research cost.\niii. Trademark: This is a distinctive symbol, special mark, or design that is given to a producer to distinguish or identify its products from other products. Trademark is a legal term covering words and symbols which can be registered and protected. If the trademark is infringed upon, government empowers the owner of the copyright to sue the culprit. Trademark. registration in Nigeria is regulated by the Trademarks Act 1967\niv. Copyright: This is an exclusive or sole right granted to writers of literary works (authors), musicians, and artists to produce their works for a specified period of time. Another person cannot reproduce such work without written permission from the copyright owner, Literary copyright will last for 50 years after the death of the author while musical rights will only last for 50 years after its release. In Nigeria, the agency in charge of copyright issues is the Nigerian Copyright Commission.",
    "year": "2020"
  },
  {
    "number": "316",
    "text": "(a) State four functions of a Stock Exchange.\n(b) Explain the following types of securities traded on the Stock Exchange:\ni. debentures\nii. bonds\niii. shares \niv. stock.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58586?exam_type=waec&type=theory&page=64",
    "correct_answer": "(a) Functions of a Stock Exchange:\ni. Provision of rules and regulations: It provides rules and regulations that will guide smooth operation on the floor of the stock exchange.\nii. Provision of professional advice: It provides professional advice/information to investors on sales and management of securities.\niii. Allowing forces of demand and supply: It allows forces of demand and supply to fix the prices of securities of quoted companies/evaluation of existing shares.\niv. Facilitation of the transfer of shares: It facilitates the transfer of shares from owners to investors. Investors who want to withdraw from one company to another can do so without hindrance. Investors can buy and sell old securities.\nv. Providing an avenue for the government to raise funds: It provides an avenue for the government to raise funds to execute projects in their various states through the issue of bonds.\nvi. Instilling discipline: It instills discipline in the operations of quoted companies.\nv. Ensuring good reputation of quoted companies: It ensures that companies quoted have a good reputation. This will gear up companies to perform well or maintain a high standard.\nvi. Allowing quoted companies to raise funds and capital: Quoted companies raise funds and capital by selling shares, bonds, stocks, and debentures in the stock exchange market.\n(b) Types of securities traded on the Stock Exchange:\ni. Debentures: This is an official document that is given by a company, showing it has borrowed money from a person and stating the interest payments that it will make to them. Or This is a document that acknowledges a loan generally under the company's seal, bearing a fixed rate of interest. Or It is a document that usually gives security for repayment of loans as well as the interest and can be described as a document setting out the terms Of a loan t0 a company, 1.e. certificate of indebtedness.\nii. Bonds: These are agreements by a government or a company to pay you interest on the money you have lent. Or These are securities issued by a government or its agency or private institutions as a means of raising funds. Bonds are usually due to being redeemed at some future dates, and they carry a fixed rate of interest.\niii. Shares: A share can be defined as an individual portion of the company's capital owned by shareholders. It is the interest that a shareholder has in a company. Or a share is a unit of capital measured by a sum of money. A share also represents the mechanism by which the shareholders of a company can have limited liability. Or lt is any of the units of equal value into which a company and sold to raise money.\niv. Stock: This can be defined as the bundle of shares or mass of capital that can be transferred in fractional amounts. It is always fully paid. Or This is the capital raised by a company or corporation through the issue and subscription of shares.",
    "explanation": "(a) Functions of a Stock Exchange:\ni. Provision of rules and regulations: It provides rules and regulations that will guide smooth operation on the floor of the stock exchange.\nii. Provision of professional advice: It provides professional advice/information to investors on sales and management of securities.\niii. Allowing forces of demand and supply: It allows forces of demand and supply to fix the prices of securities of quoted companies/evaluation of existing shares.\niv. Facilitation of the transfer of shares: It facilitates the transfer of shares from owners to investors. Investors who want to withdraw from one company to another can do so without hindrance. Investors can buy and sell old securities.\nv. Providing an avenue for the government to raise funds: It provides an avenue for the government to raise funds to execute projects in their various states through the issue of bonds.\nvi. Instilling discipline: It instills discipline in the operations of quoted companies.\nv. Ensuring good reputation of quoted companies: It ensures that companies quoted have a good reputation. This will gear up companies to perform well or maintain a high standard.\nvi. Allowing quoted companies to raise funds and capital: Quoted companies raise funds and capital by selling shares, bonds, stocks, and debentures in the stock exchange market.\n(b) Types of securities traded on the Stock Exchange:\ni. Debentures: This is an official document that is given by a company, showing it has borrowed money from a person and stating the interest payments that it will make to them. Or This is a document that acknowledges a loan generally under the company's seal, bearing a fixed rate of interest. Or It is a document that usually gives security for repayment of loans as well as the interest and can be described as a document setting out the terms Of a loan t0 a company, 1.e. certificate of indebtedness.\nii. Bonds: These are agreements by a government or a company to pay you interest on the money you have lent. Or These are securities issued by a government or its agency or private institutions as a means of raising funds. Bonds are usually due to being redeemed at some future dates, and they carry a fixed rate of interest.\niii. Shares: A share can be defined as an individual portion of the company's capital owned by shareholders. It is the interest that a shareholder has in a company. Or a share is a unit of capital measured by a sum of money. A share also represents the mechanism by which the shareholders of a company can have limited liability. Or lt is any of the units of equal value into which a company and sold to raise money.\niv. Stock: This can be defined as the bundle of shares or mass of capital that can be transferred in fractional amounts. It is always fully paid. Or This is the capital raised by a company or corporation through the issue and subscription of shares.",
    "year": "2020"
  },
  {
    "number": "317",
    "text": "(a) State five functions of an Export Promotion Council.\n(b) Outline five roles performed by the Customs and Excise Authority towards the growth of commerce",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58587?exam_type=waec&type=theory&page=64",
    "correct_answer": "(a) Functions of an Export Promotion Council:\ni.Trade enhancement activities: It reviews and liberalizes export procedures and documentation to enhance clearance at the ports.\nii. Export financing and incentives: It assists in financing export by deigning steps that will result in export financing facilities, investment, etc.\niii. Organization of training activities: It organizes training programs, seminars, and Workshops in export management and international marketing.\niv. Preparation of export documents: It cooperates with other government agencies to assist in the preparation of export documents.\nv. Trade information services: It establishes and operates international trade information centres to provide prompt information services.\nvi. Creation of awareness: It produces publicity materials to publicize the export potentials of the country and by so doing create awareness for them and the Council's activities.\nv. Setting out procedures for export trade: It approves export, provides export licence and sets out procedures for exporting goods abroad.\nvi. Export development activities: It adopts measures necessary to increase the volume of production from agriculture and industry for export.\nvii. Giving advice: lt gives advice on quality control, packaging and product design to e ensure an acceptable standard of exportable goods.\n(b) Roles performed by the Customs and Excise Authority towards the growth of commerce:\ni. Assisting in generating income for the government through import and export taxes and excise duties on goods and services.\nii. Enforcing government regulations on imports and exports by making sure that the quantities of goods imported and exported are within the limit indicated on the licences issued for that purpose.\niii. Helping to check and prevent smuggling.\niv. Assisting in supervising the bonded warehouse where goods on which appropriate duties have not been paid are kept.\nv. performing health functions by not allowing infected plants and animals Into the country/ provision of quarantine services.\nvi. Assisting in collecting data for the compilation of a country's international trade statistics which helps to give the true picture of the country's balance of trade and balance of payments.\nvii. Working in collaboration with other law enforcement agencies of the country to create good commercial activities.",
    "explanation": "(a) Functions of an Export Promotion Council:\ni.Trade enhancement activities: It reviews and liberalizes export procedures and documentation to enhance clearance at the ports.\nii. Export financing and incentives: It assists in financing export by deigning steps that will result in export financing facilities, investment, etc.\niii. Organization of training activities: It organizes training programs, seminars, and Workshops in export management and international marketing.\niv. Preparation of export documents: It cooperates with other government agencies to assist in the preparation of export documents.\nv. Trade information services: It establishes and operates international trade information centres to provide prompt information services.\nvi. Creation of awareness: It produces publicity materials to publicize the export potentials of the country and by so doing create awareness for them and the Council's activities.\nv. Setting out procedures for export trade: It approves export, provides export licence and sets out procedures for exporting goods abroad.\nvi. Export development activities: It adopts measures necessary to increase the volume of production from agriculture and industry for export.\nvii. Giving advice: lt gives advice on quality control, packaging and product design to e ensure an acceptable standard of exportable goods.\n(b) Roles performed by the Customs and Excise Authority towards the growth of commerce:\ni. Assisting in generating income for the government through import and export taxes and excise duties on goods and services.\nii. Enforcing government regulations on imports and exports by making sure that the quantities of goods imported and exported are within the limit indicated on the licences issued for that purpose.\niii. Helping to check and prevent smuggling.\niv. Assisting in supervising the bonded warehouse where goods on which appropriate duties have not been paid are kept.\nv. performing health functions by not allowing infected plants and animals Into the country/ provision of quarantine services.\nvi. Assisting in collecting data for the compilation of a country's international trade statistics which helps to give the true picture of the country's balance of trade and balance of payments.\nvii. Working in collaboration with other law enforcement agencies of the country to create good commercial activities.",
    "year": "2020"
  },
  {
    "number": "318",
    "text": "Emeka has been a sales representative for three years but has never met his target.\n(a) State five reasons that could have accounted for his inability to meet his target.\n(b) Explain five promotional tools he could use to stimulate sales of his company's products",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58614?exam_type=waec&type=theory&page=64",
    "correct_answer": "(a) Reasons that could account for the inability of Emeka to meet his target:\ni. Disconnection between sales and marketing teams: Disconnection between the sales and marketing teams is responsible for his failure to meet the target.\nii. Poor networking: Networking is a socioeconomic activity embarked upon by business people to form business relationships and share important information related to their line of business. If it is poorly done, it will lead to his inability to meet his target.\niii. Weak advertising moves: Meeting the target will be a tough task when his advertising moves are weak. Maybe due to his poor use of online and physical advertising.\niv. Poor quality of products: If the quality of the products is poor, there is no way he can meet the target.\nv. Poor follow-up: Poor follow-up can also contribute to his inability to meet his target.\nvi. Long sales cycle: If the circle of sales is long. it will be difficult for him to meet his target. This means that if it takes too long to reach your customers, they will look for an alternative.\nvii. Poor use of promotional tools: He has never been able to meet his target due to his poor use of promotional tools such as public relations, advertising, sales promotion, etc.\n(b) The promotional tools that Emeka could use to stimulate sales of his company's products:\ni. Advertising: This is the process of creating awareness in the minds of the public about the existence of a product through print and electronic media.\nii. Personal selling: This is a way of meeting the Customers or consumers on a one-on-one basis and explaining the features, benefits, and uses of the products to them.\niii. Sales promotion: This involves giving Out free girts like I-shirts, openers, bags, caps, and stickers that will announce the products so as to attract buyers\niv. Public address system or ringing of bells: He can do this to herald their presence before bringing the products to the knowledge of the people gathered around.\nv. Internet/Telephone: He can send unsolicited text messages to prospective Customers to create awareness.\nvi. Salęs promotion: This involves giving.out free gifts like T-shirts Openers, bags., caps, and stickers showing the products to attract buyers.\nvii. Public relation: He could use this measure to maintain a good relationship with its customers.\nviii. Search engine optimization (SEO): This means setting up his e-commerce website and content in a way that the products of the organization he works for can show up in online search results. This will announce the company's products or services to those who conduct online searches for products on devices such as personal computers, smartphones, tablets, etc.",
    "explanation": "(a) Reasons that could account for the inability of Emeka to meet his target:\ni. Disconnection between sales and marketing teams: Disconnection between the sales and marketing teams is responsible for his failure to meet the target.\nii. Poor networking: Networking is a socioeconomic activity embarked upon by business people to form business relationships and share important information related to their line of business. If it is poorly done, it will lead to his inability to meet his target.\niii. Weak advertising moves: Meeting the target will be a tough task when his advertising moves are weak. Maybe due to his poor use of online and physical advertising.\niv. Poor quality of products: If the quality of the products is poor, there is no way he can meet the target.\nv. Poor follow-up: Poor follow-up can also contribute to his inability to meet his target.\nvi. Long sales cycle: If the circle of sales is long. it will be difficult for him to meet his target. This means that if it takes too long to reach your customers, they will look for an alternative.\nvii. Poor use of promotional tools: He has never been able to meet his target due to his poor use of promotional tools such as public relations, advertising, sales promotion, etc.\n(b) The promotional tools that Emeka could use to stimulate sales of his company's products:\ni. Advertising: This is the process of creating awareness in the minds of the public about the existence of a product through print and electronic media.\nii. Personal selling: This is a way of meeting the Customers or consumers on a one-on-one basis and explaining the features, benefits, and uses of the products to them.\niii. Sales promotion: This involves giving Out free girts like I-shirts, openers, bags, caps, and stickers that will announce the products so as to attract buyers\niv. Public address system or ringing of bells: He can do this to herald their presence before bringing the products to the knowledge of the people gathered around.\nv. Internet/Telephone: He can send unsolicited text messages to prospective Customers to create awareness.\nvi. Salęs promotion: This involves giving.out free gifts like T-shirts Openers, bags., caps, and stickers showing the products to attract buyers.\nvii. Public relation: He could use this measure to maintain a good relationship with its customers.\nviii. Search engine optimization (SEO): This means setting up his e-commerce website and content in a way that the products of the organization he works for can show up in online search results. This will announce the company's products or services to those who conduct online searches for products on devices such as personal computers, smartphones, tablets, etc.",
    "year": "2020"
  },
  {
    "number": "319",
    "text": "The following information relates to Raisa's grocery store as of 31st December 2018.\n\n\n\nStock -1st January 2018\n20,000\n\n\nPurchases\n150,000\n\n\nSales\n230,000\n\n\nCarriage inwards\n4,000\n\n\nRent received\n80,000\n\n\nSalaries\n29,000\n\n\nStock -31st December 2018\n \n\n\n\nYou are required to calculate:\n(a) cost of goods sold\n(b) gross profit\n(c) net profit\n(d) percentage of gross profit",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/58621?exam_type=waec&type=theory&page=64",
    "correct_answer": "Trading, profit, and loss accountopening account -------------  20,000sales ------------------230,000Add purchases --------------  150,000170,000Add carriage inwards-------  4,000cost of goods available-----174,000Less closing stock-----------  35,000cost of goods sold(wk1)----139,000Gross profit(wk2)-------------  91,000230,000230,000EXPENDITUREGross profit b/d---------   91,000Salaries-----------------------   29,000Net profit c/d(wk3)---------    62,00091,00091,000Net profit b/d -----------    62,000\nWorkings:\ni. Cost of goods sold = 139,000\nii. Gross profit = 91,000\niii. Net profit 62,000\niv. percentage of gross profit = \\(\\frac{\\text{gross profit}}{sales}\\) x 100%\n= \\(\\frac{91,000}{230,000} \\times \\frac{100}{1}\\)\n= 39.57%",
    "explanation": "Trading, profit, and loss accountopening account -------------  20,000sales ------------------230,000Add purchases --------------  150,000170,000Add carriage inwards-------  4,000cost of goods available-----174,000Less closing stock-----------  35,000cost of goods sold(wk1)----139,000Gross profit(wk2)-------------  91,000230,000230,000EXPENDITUREGross profit b/d---------   91,000Salaries-----------------------   29,000Net profit c/d(wk3)---------    62,00091,00091,000Net profit b/d -----------    62,000\nWorkings:\ni. Cost of goods sold = 139,000\nii. Gross profit = 91,000\niii. Net profit 62,000\niv. percentage of gross profit = \\(\\frac{\\text{gross profit}}{sales}\\) x 100%\n= \\(\\frac{91,000}{230,000} \\times \\frac{100}{1}\\)\n= 39.57%",
    "year": "2020"
  }
]