[
  {
    "number": "69",
    "text": "(a) You are provided with a set of masses, a metre rule, a thread, two retort stands and clamps, a stop watch, a knife edge and split corks.\nCarry out the following instructions using the diagram above as a guide.\n(i) Determine the centre of gravity, C, of the metre rule using the knife edge.\n(ii) Read and record the mass, M, of the metre rule written on the reverse side of it.\n(iii) Suspend the metre rule by means of two parallel threads of equal length, h =70 cm, with one at the 10 cm mark and the other at 90 cm mark of the metre rule.\n(iv) Attach a mass m = 30g firmly to the metre rule at C. Ensure that the graduated face of the metre rule is facing upwards and that d= 80 cm throughout the experiment. (v) Set the metre rule into small angular oscillations about the vertical axis through its centre of gravity by displacing its ends in opposite directions.\n(VI) Determine the time,i, for 20 oscillations and evaluate the period T, T\\(^2\\) and T\\(^{-2}\\).\n(vii) Repeat the procedure for four other values of m =40 g, 50 g, 60 g and 70 g n each case, determine I and evaluate T\\(^2\\) and T\\(^{-2}\\).\n(viii) Plot a graph of T on the vertical axis and m on the horizontal axis.\n(ix) Determine the slope, s, of the graph.\n(x) Evaluate Q= 0.68 / s.\n(xi) State two precautions taken to ensure accurate results.\n(b) (i) Give two examples of simple harmonic motion other than the motion of a simple pendulum.\n(ii) Explain the term centre of gravity of a body.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/62349?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  },
  {
    "number": "70",
    "text": "You have been provided with a ray box, a converging lens, a lens holder, a screen, a metre rule, and half- metre rule. Use the diagram above as a guide to perform the experiment.\n(i) Determine the approximate focal length f, of the lens by focusing a distant object on the screen.\n(ii) Place the ray box and the screen such that the distance between the illuminated cross-Wire and the screen, D= 150 cm.\n(iii) Place the lens at a position L where a sharp mage of the cross-Wire Is obtained on the screen Note L.\n(iv) Move the lens at a position L, to 0btain another sharp image of the cross-wire on the screen. Note L\n(V) Measure the distance, d. between L\\(_1\\) and L\\(_2\\).\n(Vi) Evaluate D\\(^2\\): d\\(^2\\) and D\\(^2\\) - d\\(^2\\).\n(vii) Repeat the procedure for four other values of D = 130cm, 100 cm, 90 cm and 80 cm. in each case.evaluate D\\(^2\\); d\\(^2\\) and D\\(^2\\) - d\\(^2\\).\n(viii) Tabulate the result\n(ix) Plot a graph with D\\(^2\\) - d\\(^2\\) on the vertical axis and  D on the horizontal axis.\n(x) Determine the r values of D axis and  Determine the slopes, S, of the graph.\n(xi) Evaluate k = \\(\\frac{s}{4}\\)\n(xii) State two precautions taken to ensure accurate results.\n(bi) Distinguish between a virtual image and. plain image?\n(ii) With the aid of a ray diagram, explain how a converging lens produces a Virtual image",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/62350?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  },
  {
    "number": "71",
    "text": "(a) You are provided with a battery, an ammeter, a voltmeter, a resistance box, a key and connection wires.\n(i) Set up circuit as shown in the diagram above.\n(ii) With the key opened, measure and record the e.m.f. E\\(_o\\) of the battery\n(iii) With the key closed, select the resistance R=1 on the resistance box. Read and record the current, 1Ω.\n(iv) Evaluate I\\(^{-1}\\).\n(v) Repeat the procedure for five other values of R=2Ω,3Ω, 4Ω, 5Ω, and 6Ω.\nIn each case, record I and evaluate I\\(^{-1}\\) results.\n(vii) Plot a graph with R on the vertical axis and I\\(^{-1}\\) on the horizontal axis.\n(Viii) Determine the slope, s, of the graph.\n(ix) Determine the intercept C, On the vertical axis.\n(x) State two precautions taken to ensure accurate results.\n(b)(i) Define potential difference in an electric field.\n(ii) A piece of resistance wire of diameter 0.2 mm and length 25 cm has a resistance of 7Ω. Calculate the resistivity of the wire of the battery. [ π = 22\\7]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/62351?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  }
]