[
  {
    "number": "61",
    "text": "(a) Name one laboratory equipment used for\n(i) keeping salts dry:\n(ii) converting vapour to liquid during distillation\n(ii) bubbling a gas into a liquid\n \n(b) (i) What technique would you use to purify a sample of sodium chloride contaminated with ammonium chloride?\n(ii) Given sodium hydroxide solution, outline the procedure you would use to determine whether or not all the ammonium chloride in (b)(i) above had been removed.\n \n(c) State what is observed on carrying out each of the following exercises.\n(i) Adding few drops of methyl orange indicator to lime juice:\n(ii) Adding few drops of concentrated HNO\\(_3\\) to acidified FeSO\\(_4\\) solution\n(iii) Exposing a fresh precipitate of silver chloride to sunlight for 30 minutes\n(iv) Adding zinc dust to dilute CuCl\\(_2\\) solution;\n(v) Adding dilute H\\(_2\\)SO\\(_4\\), to Pb(NO\\(_3\\))\\(_2\\) solution",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60118?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "62",
    "text": "Credit will be given for strict adherence to instructions, for observations precisely recorded and for accurate inferences. All tests observations and inferences must be clearly entered in your answer book. in ink, at the time they are made.\nC is a mixture of two simple salts. Carry out the following exercises on C. Record your observations and identify any gases evolved. Sate the conclusion you draw from the result of each test.\n(a) Put all of C into a beaker of boiling tube and add about 10cm\\(^3\\) of distilled water. Stir well and filter. Keep the residue and keep the residue and the filtrate. Test the filtrate with litmus\n \n(b) Add about 1 cm\\(^3\\) of dilute hydrochloric acid to the residue in a test tube  and warm gently Divide the reaction mixture into two portions.\n(c)(i) To the first portion from (b) add saturated sodium trioxocarbonate (V) solution in excess.\n(d) To about 2cm\\(^3\\) of the filtrate from (a) add a few drops of barium chloride solution followed by excess dilute hydrochloric acid.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60119?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "63",
    "text": "All your burette readings (initial and final), as well as the size of your pipette, must be recorded but on no account of experimental procedure is required. All calculations must be done in your answer book.\nA is solution of trioxonitrate (V) acid, B is a solution containing 6.90 g of potassium trioxocarbonate (IV) per dm\\(^3\\)\n(a) Put A into the buret and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portions of B using methy orange or screened methyl orange as indicater. Record the volume of your pipette. Tabulate your burette readings and calculate the average volume A used. The equation for the reaction is K\\(_2\\)CO\\(_{3(aq)}\\) +  2HNO\\(_{3(aq)}\\) \\(\\to\\) 2KNO\\(_{3(aq)}\\) + CO\\(_{2(g)}\\) +  H\\(_2\\)O\\(_{(l)}\\)\n \n(b) From your results and the information provided calculate;\n(i) concentration of solution B in mol dm\\(^{-3}\\)\n(ii) number of potassium ions in 1.00 dm\\(^3\\) of B [C = 12.0, O = 16.0, K = 39.0, Avogadro constant = 6.02 x 10\\(^{23}\\) mol \\(^{-1}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60121?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  }
]