[
  {
    "number": "301",
    "text": "Your school participated in an inter-school sports festival recently. As the Sports Prefect, write a report on the event for your school.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69235?exam_type=waec&type=theory&page=61",
    "correct_answer": "I am pleased to present a comprehensive report on the recent Inter-School Sports Festival in which our school enthusiastically participated. The event, which held on the 4th of May at the main bowl, brought together schools from the all around Asaba to compete in various sports and foster camaraderie among students.Our school fielded a strong contingent of [Number] athletes who showcased their talent and sportsmanship throughout the festival. The participants were selected after rigorous trials and training sessions led by our dedicated coaches. The athletes' commitment and hard work were evident in their performance, making us proud both on and off the field.The Inter-School Sports Festival featured a diverse range of sports, including football and basketball. Our school excelled in several disciplines, securing three gold medals, five silver medals, and two bronze medals. The dedication and perseverance of our athletes shone through as they displayed exceptional teamwork and skill in each event.Beyond the medals, our school demonstrated remarkable sportsmanship and teamwork throughout the festival. Our athletes cheered for each other, encouraged competitors from other schools, and upheld the values of fair play and respect. Such conduct reflects positively on our school's commitment to holistic development.I extend my heartfelt gratitude to the school team coach and all the support staff who worked tirelessly behind the scenes to ensure the smooth execution of the event. Their dedication and guidance have been instrumental in our success.The Inter-School Sports Festival was an incredible platform that not only showcased the sporting prowess of our school but also fostered a sense of unity and sportsmanship among students from various institutions. Our athletes' achievements and conduct are a testament to our school's commitment to excellence in all domains.Moving forward, I believe that this experience will serve as a stepping stone for our athletes to continue honing their skills and striving for greater accomplishments in the world of sports. With continued dedication, rigorous training, and a strong sense of camaraderie, our school will undoubtedly leave a lasting mark on future sporting events.Thank you for your unwavering support.",
    "explanation": "I am pleased to present a comprehensive report on the recent Inter-School Sports Festival in which our school enthusiastically participated. The event, which held on the 4th of May at the main bowl, brought together schools from the all around Asaba to compete in various sports and foster camaraderie among students.Our school fielded a strong contingent of [Number] athletes who showcased their talent and sportsmanship throughout the festival. The participants were selected after rigorous trials and training sessions led by our dedicated coaches. The athletes' commitment and hard work were evident in their performance, making us proud both on and off the field.The Inter-School Sports Festival featured a diverse range of sports, including football and basketball. Our school excelled in several disciplines, securing three gold medals, five silver medals, and two bronze medals. The dedication and perseverance of our athletes shone through as they displayed exceptional teamwork and skill in each event.Beyond the medals, our school demonstrated remarkable sportsmanship and teamwork throughout the festival. Our athletes cheered for each other, encouraged competitors from other schools, and upheld the values of fair play and respect. Such conduct reflects positively on our school's commitment to holistic development.I extend my heartfelt gratitude to the school team coach and all the support staff who worked tirelessly behind the scenes to ensure the smooth execution of the event. Their dedication and guidance have been instrumental in our success.The Inter-School Sports Festival was an incredible platform that not only showcased the sporting prowess of our school but also fostered a sense of unity and sportsmanship among students from various institutions. Our athletes' achievements and conduct are a testament to our school's commitment to excellence in all domains.Moving forward, I believe that this experience will serve as a stepping stone for our athletes to continue honing their skills and striving for greater accomplishments in the world of sports. With continued dedication, rigorous training, and a strong sense of camaraderie, our school will undoubtedly leave a lasting mark on future sporting events.Thank you for your unwavering support.",
    "year": "2023"
  },
  {
    "number": "302",
    "text": "There have been several articles in the national newspapers on the lack of maintenance of public facilities. Write a letter to the editor of one of the newspapers expressing your opinion on the matter.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69236?exam_type=waec&type=theory&page=61",
    "correct_answer": "10,Kobbie street,Ilesha,Osun state.The Editor,Daily Royal Newspaper.Dear sir/ma,Urgent Need for Improved Maintenance of Public FacilitiesI hope this letter finds you well. I am writing to express my deep concern regarding the ongoing issue of the inadequate maintenance of public facilities, as highlighted in several recent articles in your esteemed newspaper. This matter is of great importance and warrants immediate attention from authorities, policymakers, and the general public alike.Public facilities, such as parks, roads, public transportation, and community centres, play a vital role in enhancing the quality of life for residents in our city. However, it is disheartening to witness the neglect and decay that many of these facilities are currently experiencing. This not only reflects poorly on our community's image but also has a tangible impact on the well-being and safety of citizens.The lack of proper maintenance not only leads to an unsightly environment but also poses various risks and inconveniences. Uneven sidewalks and poorly maintained roads are not only an eyesore but also jeopardize the safety of pedestrians and motorists. Parks and recreational areas, when left uncared for, discourage outdoor activities and contribute to a decline in community bonding and overall health.Furthermore, poorly maintained public facilities can hinder economic growth and development. Visitors and investors are likely to be deterred by the evident disregard for the upkeep of our city, affecting our local businesses and job opportunities.It is imperative for both government bodies and community members to take collective responsibility for addressing this issue. Adequate funding and efficient allocation of resources are essential to ensure that our public facilities receive the attention they require. Moreover, community engagement initiatives and volunteer efforts can significantly contribute to the upkeep and improvement of these spaces.\nI urge the relevant authorities to prioritize the maintenance of public facilities as an integral part of urban planning and development. This will not only enhance the quality of life for citizens but also instill a sense of pride and ownership in our community.I applaud your newspaper for bringing this issue to the forefront and sparking a much-needed discussion. I hope that the collective voice of concerned citizens can drive positive change and inspire policymakers to take immediate action.Thank you for your continued dedication to raising awareness about matters of public interest.Yours faithfully,Mumainat Kola.",
    "explanation": "10,Kobbie street,Ilesha,Osun state.The Editor,Daily Royal Newspaper.Dear sir/ma,Urgent Need for Improved Maintenance of Public FacilitiesI hope this letter finds you well. I am writing to express my deep concern regarding the ongoing issue of the inadequate maintenance of public facilities, as highlighted in several recent articles in your esteemed newspaper. This matter is of great importance and warrants immediate attention from authorities, policymakers, and the general public alike.Public facilities, such as parks, roads, public transportation, and community centres, play a vital role in enhancing the quality of life for residents in our city. However, it is disheartening to witness the neglect and decay that many of these facilities are currently experiencing. This not only reflects poorly on our community's image but also has a tangible impact on the well-being and safety of citizens.The lack of proper maintenance not only leads to an unsightly environment but also poses various risks and inconveniences. Uneven sidewalks and poorly maintained roads are not only an eyesore but also jeopardize the safety of pedestrians and motorists. Parks and recreational areas, when left uncared for, discourage outdoor activities and contribute to a decline in community bonding and overall health.Furthermore, poorly maintained public facilities can hinder economic growth and development. Visitors and investors are likely to be deterred by the evident disregard for the upkeep of our city, affecting our local businesses and job opportunities.It is imperative for both government bodies and community members to take collective responsibility for addressing this issue. Adequate funding and efficient allocation of resources are essential to ensure that our public facilities receive the attention they require. Moreover, community engagement initiatives and volunteer efforts can significantly contribute to the upkeep and improvement of these spaces.\nI urge the relevant authorities to prioritize the maintenance of public facilities as an integral part of urban planning and development. This will not only enhance the quality of life for citizens but also instill a sense of pride and ownership in our community.I applaud your newspaper for bringing this issue to the forefront and sparking a much-needed discussion. I hope that the collective voice of concerned citizens can drive positive change and inspire policymakers to take immediate action.Thank you for your continued dedication to raising awareness about matters of public interest.Yours faithfully,Mumainat Kola.",
    "year": "2023"
  },
  {
    "number": "303",
    "text": "Your friend who resides in another country wants to study in your school and has written for information and advice. Write a letter to him, telling him all that he needs to know about the school.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69238?exam_type=waec&type=theory&page=61",
    "correct_answer": "5, University way,Enugu city,Enugu.Dearest,I hope this letter finds you in good health and high spirits. I was thrilled to receive your letter expressing your interest in studying at my school. I am more than happy to provide you with all the information you need to make an informed decision about joining our institution.Firstly, let me assure you that choosing to study at HIY College would be a fantastic decision. Our school is renowned for its excellent academic programs, dedicated faculty, and vibrant student community. HIY College offers a diverse range of academic programs tailored to suit different interests and career goals. Whether you're inclined towards arts, sciences, commerce, or any other field, you'll find a program that matches your aspirations. Our school takes pride in its highly qualified and experienced faculty members who are not only experts in their respective fields but also genuinely committed to nurturing students' intellectual growth. They are approachable and willing to provide guidance whenever needed.Also, The campus is equipped with state-of-the-art facilities, including modern classrooms, well-stocked libraries, advanced laboratories, and recreational areas. These facilities contribute to a conducive learning environment. Beyond academics, our school offers a wide range of extracurricular activities to help you explore your passions, develop new skills, and make lifelong friends. From sports to arts and cultural clubs, there's something for everyone. Our school is welcoming to international students, and we have a dedicated support system in place to assist you with any challenges you might face while adjusting to a new country and educational system.To apply, you'll need to complete the application form, provide the necessary documents (transcripts, letters of recommendation, etc.), and meet the admission criteria. It's important to start the application process well in advance to ensure you have ample time to prepare. Our school offers various options for accommodation, including on-campus dormitories and off-campus housing. It's advisable to explore your options and book your accommodation early.\nStudying in a new country also means experiencing a different culture. Embrace this opportunity to learn about local customs, traditions, and cuisine. It's a chance for personal growth and to expand your horizons.\nIn conclusion, HIY college is a place where academic excellence, personal growth, and memorable experiences converge. I believe that your decision to study here will be a stepping stone towards a bright future. If you have any more questions or need further assistance, please don't hesitate to reach out to me. I'm here to help in any way I can.Wishing you all the best in your decision-making process. I look forward to the possibility of having you as a fellow student. Take care and stay in touch!Warm regards,Somtochukwu.",
    "explanation": "5, University way,Enugu city,Enugu.Dearest,I hope this letter finds you in good health and high spirits. I was thrilled to receive your letter expressing your interest in studying at my school. I am more than happy to provide you with all the information you need to make an informed decision about joining our institution.Firstly, let me assure you that choosing to study at HIY College would be a fantastic decision. Our school is renowned for its excellent academic programs, dedicated faculty, and vibrant student community. HIY College offers a diverse range of academic programs tailored to suit different interests and career goals. Whether you're inclined towards arts, sciences, commerce, or any other field, you'll find a program that matches your aspirations. Our school takes pride in its highly qualified and experienced faculty members who are not only experts in their respective fields but also genuinely committed to nurturing students' intellectual growth. They are approachable and willing to provide guidance whenever needed.Also, The campus is equipped with state-of-the-art facilities, including modern classrooms, well-stocked libraries, advanced laboratories, and recreational areas. These facilities contribute to a conducive learning environment. Beyond academics, our school offers a wide range of extracurricular activities to help you explore your passions, develop new skills, and make lifelong friends. From sports to arts and cultural clubs, there's something for everyone. Our school is welcoming to international students, and we have a dedicated support system in place to assist you with any challenges you might face while adjusting to a new country and educational system.To apply, you'll need to complete the application form, provide the necessary documents (transcripts, letters of recommendation, etc.), and meet the admission criteria. It's important to start the application process well in advance to ensure you have ample time to prepare. Our school offers various options for accommodation, including on-campus dormitories and off-campus housing. It's advisable to explore your options and book your accommodation early.\nStudying in a new country also means experiencing a different culture. Embrace this opportunity to learn about local customs, traditions, and cuisine. It's a chance for personal growth and to expand your horizons.\nIn conclusion, HIY college is a place where academic excellence, personal growth, and memorable experiences converge. I believe that your decision to study here will be a stepping stone towards a bright future. If you have any more questions or need further assistance, please don't hesitate to reach out to me. I'm here to help in any way I can.Wishing you all the best in your decision-making process. I look forward to the possibility of having you as a fellow student. Take care and stay in touch!Warm regards,Somtochukwu.",
    "year": "2023"
  },
  {
    "number": "304",
    "text": "Write an article suitable for publication in your school magazine on the need to revive the activities clubs and societies in schools.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69239?exam_type=waec&type=theory&page=61",
    "correct_answer": "In the bustling world of education, where academic pressures often take centre stage, it's easy to overlook the profound impact that extracurricular activities can have on a student's overall development. Activities clubs and societies, which were once vibrant hubs of creativity, camaraderie, and skill-building, have gradually faded into the background. However, it's time to reignite the spirit of these clubs and societies within our school walls, for they offer a myriad of benefits that extend beyond textbooks and classrooms.A Holistic Approach to EducationEducation extends beyond textbooks, and the resurgence of activities clubs and societies can inject a much-needed dose of holistic learning into our academic journey. These platforms provide students with an avenue to explore their passions, interests, and hidden talents, fostering a sense of individuality and self-awareness. Whether it's painting, drama, debate, robotics, or sports, these clubs offer an opportunity to diversify skills and gain experiences that can't be found within the confines of a classroom.Building Confidence and Leadership SkillsActive participation in clubs and societies bolsters confidence and nurtures leadership skills in students. Through organizing events, taking on responsibilities, and collaborating with peers, students learn to communicate effectively, manage their time efficiently, and lead with integrity. These skills are transferable to every facet of life and lay the foundation for future success, both personally and professionally.Fostering a Sense of CommunityClubs and societies serve as a bridge to forge connections and form lasting friendships. They create a sense of belonging, where students with shared interests come together to exchange ideas, support one another, and collaborate on projects. By creating an inclusive environment that values diversity, these clubs contribute to a thriving school community where mutual respect and understanding flourish.Balancing Academics and extracurriculars\nWhile academics remain of paramount importance, extracurricular activities offer a refreshing counterbalance. Engaging in activities that ignite passion revitalizes the mind and provides much-needed breaks from the rigour of academics. These moments of respite enhance overall mental well-being, alleviate stress, and invigorate students to approach their studies with renewed energy and enthusiasm.In conclusion, the revival of activities clubs and societies is not just a matter of rekindling the past; it's a vision for a richer, more holistic educational experience. By embracing these platforms, we embrace a journey of self-discovery, camaraderie, and all-around excellence that transcends the classroom walls. Let's revive the spirit of these clubs and societies to empower our students for a well-rounded and successful future.",
    "explanation": "In the bustling world of education, where academic pressures often take centre stage, it's easy to overlook the profound impact that extracurricular activities can have on a student's overall development. Activities clubs and societies, which were once vibrant hubs of creativity, camaraderie, and skill-building, have gradually faded into the background. However, it's time to reignite the spirit of these clubs and societies within our school walls, for they offer a myriad of benefits that extend beyond textbooks and classrooms.A Holistic Approach to EducationEducation extends beyond textbooks, and the resurgence of activities clubs and societies can inject a much-needed dose of holistic learning into our academic journey. These platforms provide students with an avenue to explore their passions, interests, and hidden talents, fostering a sense of individuality and self-awareness. Whether it's painting, drama, debate, robotics, or sports, these clubs offer an opportunity to diversify skills and gain experiences that can't be found within the confines of a classroom.Building Confidence and Leadership SkillsActive participation in clubs and societies bolsters confidence and nurtures leadership skills in students. Through organizing events, taking on responsibilities, and collaborating with peers, students learn to communicate effectively, manage their time efficiently, and lead with integrity. These skills are transferable to every facet of life and lay the foundation for future success, both personally and professionally.Fostering a Sense of CommunityClubs and societies serve as a bridge to forge connections and form lasting friendships. They create a sense of belonging, where students with shared interests come together to exchange ideas, support one another, and collaborate on projects. By creating an inclusive environment that values diversity, these clubs contribute to a thriving school community where mutual respect and understanding flourish.Balancing Academics and extracurriculars\nWhile academics remain of paramount importance, extracurricular activities offer a refreshing counterbalance. Engaging in activities that ignite passion revitalizes the mind and provides much-needed breaks from the rigour of academics. These moments of respite enhance overall mental well-being, alleviate stress, and invigorate students to approach their studies with renewed energy and enthusiasm.In conclusion, the revival of activities clubs and societies is not just a matter of rekindling the past; it's a vision for a richer, more holistic educational experience. By embracing these platforms, we embrace a journey of self-discovery, camaraderie, and all-around excellence that transcends the classroom walls. Let's revive the spirit of these clubs and societies to empower our students for a well-rounded and successful future.",
    "year": "2023"
  },
  {
    "number": "305",
    "text": "Write a story to illustrate the saying: Half a loaf is better than none.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69241?exam_type=waec&type=theory&page=61",
    "correct_answer": "In the heart of a quaint village nestled between rolling hills, lived a young girl named Lila. She was known far and wide for her unwavering optimism and her ability to find joy in even the smallest of things. However, her family's humble lifestyle often tested her optimism.One year, a severe drought struck the village, causing crops to wither and water sources to dry up. The villagers grew anxious as their food supplies dwindled, and starvation loomed on the horizon. Lila's family, like the others, faced a dire situation. They had just a small loaf of bread left, barely enough to sustain them for a few days.Lila's father, a hardworking farmer, set off to the village square where a meeting was convened to discuss their predicament. As the villagers gathered, worry and despair etched on their faces, a wise old man named Ravi stood up and addressed the assembly.\"My friends,\" Ravi began, \"I understand the gravity of our situation. But we must not lose hope. In times of scarcity, we must remember the saying, 'Half a loaf is better than none.' Let us share what little we have and make the most of it.\"With Ravi's words, a glimmer of hope started to light up the faces of the villagers. They agreed to pool their resources and share their remaining food, ensuring that everyone would have at least a portion to sustain them.As days turned into weeks, the villagers worked together to find alternative sources of sustenance. They foraged for wild berries, caught small fish in the dwindling streams, and shared their meagre harvests. Despite the challenges, the village came together, strengthening the bonds of community.Meanwhile, Lila's family, though their small loaf of bread had been shared among them, managed to survive on the collective effort. Lila herself was instrumental in lifting the villagers' spirits. She organized games, told stories, and sang songs to distract them from their hunger and worries.One day, as the villagers were exploring a distant part of the hills, they stumbled upon a hidden oasis—a glistening lake surrounded by fertile land. With their newfound discovery, they were able to rejuvenate their crops and secure a sustainable source of food and water.Lila's village emerged from the drought stronger and more united than ever. The lesson of sharing, cooperation, and embracing even the smallest blessings had transformed their perspective. Ravi's words had become a guiding principle, reminding them that \"Half a loaf is better than none.\"In the years that followed, Lila's village thrived, its people thriving on the fruits of their unity and resilience. They never forgot the lessons learned during the drought, and the saying that once inspired them remained a testament to their triumph over adversity.And so, the story of Lila and her village became a beacon of hope, teaching generations to come that even in the face of scarcity, the willingness to share and make the most of what they had could lead to a bountiful future.",
    "explanation": "In the heart of a quaint village nestled between rolling hills, lived a young girl named Lila. She was known far and wide for her unwavering optimism and her ability to find joy in even the smallest of things. However, her family's humble lifestyle often tested her optimism.One year, a severe drought struck the village, causing crops to wither and water sources to dry up. The villagers grew anxious as their food supplies dwindled, and starvation loomed on the horizon. Lila's family, like the others, faced a dire situation. They had just a small loaf of bread left, barely enough to sustain them for a few days.Lila's father, a hardworking farmer, set off to the village square where a meeting was convened to discuss their predicament. As the villagers gathered, worry and despair etched on their faces, a wise old man named Ravi stood up and addressed the assembly.\"My friends,\" Ravi began, \"I understand the gravity of our situation. But we must not lose hope. In times of scarcity, we must remember the saying, 'Half a loaf is better than none.' Let us share what little we have and make the most of it.\"With Ravi's words, a glimmer of hope started to light up the faces of the villagers. They agreed to pool their resources and share their remaining food, ensuring that everyone would have at least a portion to sustain them.As days turned into weeks, the villagers worked together to find alternative sources of sustenance. They foraged for wild berries, caught small fish in the dwindling streams, and shared their meagre harvests. Despite the challenges, the village came together, strengthening the bonds of community.Meanwhile, Lila's family, though their small loaf of bread had been shared among them, managed to survive on the collective effort. Lila herself was instrumental in lifting the villagers' spirits. She organized games, told stories, and sang songs to distract them from their hunger and worries.One day, as the villagers were exploring a distant part of the hills, they stumbled upon a hidden oasis—a glistening lake surrounded by fertile land. With their newfound discovery, they were able to rejuvenate their crops and secure a sustainable source of food and water.Lila's village emerged from the drought stronger and more united than ever. The lesson of sharing, cooperation, and embracing even the smallest blessings had transformed their perspective. Ravi's words had become a guiding principle, reminding them that \"Half a loaf is better than none.\"In the years that followed, Lila's village thrived, its people thriving on the fruits of their unity and resilience. They never forgot the lessons learned during the drought, and the saying that once inspired them remained a testament to their triumph over adversity.And so, the story of Lila and her village became a beacon of hope, teaching generations to come that even in the face of scarcity, the willingness to share and make the most of what they had could lead to a bountiful future.",
    "year": "2023"
  },
  {
    "number": "306",
    "text": "Why did Mma Koku leave home on a cold, windy Monday morning?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69245?exam_type=waec&type=theory&page=62",
    "correct_answer": "Mma Koku left home on a cold, windy Monday morning to meet The Pathfinder, a middle-aged university teacher who was the first person to earn the highest postgraduate degree from their village. She was on her way to give him a parcel for her son who was studying in the university in the city, about a thousand miles away. Despite her frail health and the harsh weather conditions, she was determined to make the journey for the sake of her son's future.",
    "explanation": "Mma Koku left home on a cold, windy Monday morning to meet The Pathfinder, a middle-aged university teacher who was the first person to earn the highest postgraduate degree from their village. She was on her way to give him a parcel for her son who was studying in the university in the city, about a thousand miles away. Despite her frail health and the harsh weather conditions, she was determined to make the journey for the sake of her son's future.",
    "year": "2023"
  },
  {
    "number": "307",
    "text": "What two difficulties did Mma Koku face on her way to meet The Pathfinder?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69246?exam_type=waec&type=theory&page=62",
    "correct_answer": "Mma Koku faced two main difficulties on her way to meet The Pathfinder. The first difficulty was the harsh weather conditions. It was a cold, windy Monday morning and she had to brave the draught of air that was threatening to topple her. The second difficulty was the physical challenges of the journey. She had to walk on a dirty road, step into muddy potholes, and contend with the sand ground that was still largely undisturbed owing to the dew. Despite these difficulties, she remained determined to reach her destination.",
    "explanation": "Mma Koku faced two main difficulties on her way to meet The Pathfinder. The first difficulty was the harsh weather conditions. It was a cold, windy Monday morning and she had to brave the draught of air that was threatening to topple her. The second difficulty was the physical challenges of the journey. She had to walk on a dirty road, step into muddy potholes, and contend with the sand ground that was still largely undisturbed owing to the dew. Despite these difficulties, she remained determined to reach her destination.",
    "year": "2023"
  },
  {
    "number": "308",
    "text": "What may have prompt the villagers to call the man The Pathfinder?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69248?exam_type=waec&type=theory&page=62",
    "correct_answer": "The villagers may have called the man The Pathfinder because he was the first person from their village to earn the highest postgraduate degree. This achievement set him apart and made him a role model or 'pathfinder' for others in the village. His educational attainment and his role as a university teacher in the city could have inspired others in the village to pursue higher education and aspire for greater achievements.",
    "explanation": "The villagers may have called the man The Pathfinder because he was the first person from their village to earn the highest postgraduate degree. This achievement set him apart and made him a role model or 'pathfinder' for others in the village. His educational attainment and his role as a university teacher in the city could have inspired others in the village to pursue higher education and aspire for greater achievements.",
    "year": "2023"
  },
  {
    "number": "309",
    "text": "What two indications are there in the passage that Mma Koku was poor?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69250?exam_type=waec&type=theory&page=62",
    "correct_answer": "There are two indications in the passage that suggest Mma Koku was poor. The first indication is her clothing. She was described as wearing a threadbare sweater over an equally aged wrapper, suggesting that she could not afford better or newer clothes. The second indication is her financial situation. It was mentioned that she took all her savings for the last three months, put it in a small envelope and tied it up in the edge of her wrapper. This suggests that she had limited financial resources.",
    "explanation": "There are two indications in the passage that suggest Mma Koku was poor. The first indication is her clothing. She was described as wearing a threadbare sweater over an equally aged wrapper, suggesting that she could not afford better or newer clothes. The second indication is her financial situation. It was mentioned that she took all her savings for the last three months, put it in a small envelope and tied it up in the edge of her wrapper. This suggests that she had limited financial resources.",
    "year": "2023"
  },
  {
    "number": "310",
    "text": "What was The Pathfinder's attitude to Mma Koku?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69252?exam_type=waec&type=theory&page=62",
    "correct_answer": "The Pathfinder's attitude towards Mma Koku was one of respect and empathy. When he saw her coming towards him in the rain, he switched off the ignition and rushed out to meet her, guiding her into a nearby shed. He also accepted the small envelope containing her savings, which she had brought for her son. After receiving the envelope, he asked her to wait in the shed until the rain stopped. Furthermore, he made a promise to himself to ensure that her son gets a teaching job once he is done with his studies. These actions show that he respected her efforts and was empathetic towards her situation.",
    "explanation": "The Pathfinder's attitude towards Mma Koku was one of respect and empathy. When he saw her coming towards him in the rain, he switched off the ignition and rushed out to meet her, guiding her into a nearby shed. He also accepted the small envelope containing her savings, which she had brought for her son. After receiving the envelope, he asked her to wait in the shed until the rain stopped. Furthermore, he made a promise to himself to ensure that her son gets a teaching job once he is done with his studies. These actions show that he respected her efforts and was empathetic towards her situation.",
    "year": "2023"
  },
  {
    "number": "311",
    "text": "What was the expectation of Mma Koku concerning her son?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69254?exam_type=waec&type=theory&page=63",
    "correct_answer": "Mma Koku's expectation for her son is that he would amount to something in life. This is evident in her statement, 'What would I not do for Koku to amount to something in this life that has given me nothing but woes?' She is willing to risk her health and make sacrifices to ensure her son's success. She also prays, 'Please let my son turn out well.' This shows her hope and expectation for her son to have a better life,",
    "explanation": "Mma Koku's expectation for her son is that he would amount to something in life. This is evident in her statement, 'What would I not do for Koku to amount to something in this life that has given me nothing but woes?' She is willing to risk her health and make sacrifices to ensure her son's success. She also prays, 'Please let my son turn out well.' This shows her hope and expectation for her son to have a better life,",
    "year": "2023"
  },
  {
    "number": "312",
    "text": "In what age range would you place Mma Koku?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69256?exam_type=waec&type=theory&page=63",
    "correct_answer": "Mma Koku is described as an 'early septuagarian' in the passage. A septuagarian is someone who is in their seventies. Therefore, Mma Koku is in her early seventies.",
    "explanation": "Mma Koku is described as an 'early septuagarian' in the passage. A septuagarian is someone who is in their seventies. Therefore, Mma Koku is in her early seventies.",
    "year": "2023"
  },
  {
    "number": "313",
    "text": "...sky stops weeping...\nWhat figure of speech is contained in the expression above?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69257?exam_type=waec&type=theory&page=63",
    "correct_answer": "The expression 'sky stops weeping' is a figure of speech known as personification. Personification is a figure of speech in which a thing, an idea or an animal is given human attributes. The non-human entities are portrayed in such a way that we feel they have the ability to act like human beings. In this case, the sky is given the human attribute of weeping, which means raining.",
    "explanation": "The expression 'sky stops weeping' is a figure of speech known as personification. Personification is a figure of speech in which a thing, an idea or an animal is given human attributes. The non-human entities are portrayed in such a way that we feel they have the ability to act like human beings. In this case, the sky is given the human attribute of weeping, which means raining.",
    "year": "2023"
  },
  {
    "number": "314",
    "text": "...before he leaves for the city...\nWhat is the grammatical name given to this expression as it is used in the passage?\nWhat is its function?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69258?exam_type=waec&type=theory&page=63",
    "correct_answer": "\"Adverbial clause of time\"\nIt modifies the verb \"shall see\"",
    "explanation": "\"Adverbial clause of time\"\nIt modifies the verb \"shall see\"",
    "year": "2023"
  },
  {
    "number": "315",
    "text": "...before he leaves for the city...\nWhat is its function?",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69260?exam_type=waec&type=theory&page=63",
    "correct_answer": "The function of the expression 'before he leaves for the city' in the passage is to indicate time. It shows when Mma Koku plans to see the Pathfinder. The action in the main clause, 'today I shall see the pathfinder', is expected to take place 'before he leaves for the city'.",
    "explanation": "The function of the expression 'before he leaves for the city' in the passage is to indicate time. It shows when Mma Koku plans to see the Pathfinder. The action in the main clause, 'today I shall see the pathfinder', is expected to take place 'before he leaves for the city'.",
    "year": "2023"
  },
  {
    "number": "316",
    "text": "For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n\ndelicate",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69262?exam_type=waec&type=theory&page=64",
    "correct_answer": "The word 'delicate' in the context of the passage refers to the frail and fragile health of the old woman. It can be replaced with synonyms such as 'fragile', 'frail', 'weak', or 'sensitive'. These words all convey the same meaning as 'delicate' in the context of the passage, which is the susceptibility of the old woman's health to harm or damage.",
    "explanation": "The word 'delicate' in the context of the passage refers to the frail and fragile health of the old woman. It can be replaced with synonyms such as 'fragile', 'frail', 'weak', or 'sensitive'. These words all convey the same meaning as 'delicate' in the context of the passage, which is the susceptibility of the old woman's health to harm or damage.",
    "year": "2023"
  },
  {
    "number": "317",
    "text": "For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n\nominous",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69263?exam_type=waec&type=theory&page=64",
    "correct_answer": "The word 'ominous' in the context of the passage refers to the threatening and foreboding signs from the sky. It can be replaced with synonyms such as 'threatening', 'foreboding', 'menacing', or 'sinister'. These words all convey the same meaning as 'ominous' in the context of the passage, which is the sense of impending danger or harm.",
    "explanation": "The word 'ominous' in the context of the passage refers to the threatening and foreboding signs from the sky. It can be replaced with synonyms such as 'threatening', 'foreboding', 'menacing', or 'sinister'. These words all convey the same meaning as 'ominous' in the context of the passage, which is the sense of impending danger or harm.",
    "year": "2023"
  },
  {
    "number": "318",
    "text": "For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n\nan obligation",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69265?exam_type=waec&type=theory&page=64",
    "correct_answer": "The phrase 'an obligation' in the context of the passage refers to a duty or responsibility that The Pathfinder owes to the old woman. It can be replaced with synonyms such as 'a duty', 'a responsibility', 'a commitment', or 'a requirement'. These words all convey the same meaning as 'an obligation' in the context of the passage, which is a moral or legal responsibility.",
    "explanation": "The phrase 'an obligation' in the context of the passage refers to a duty or responsibility that The Pathfinder owes to the old woman. It can be replaced with synonyms such as 'a duty', 'a responsibility', 'a commitment', or 'a requirement'. These words all convey the same meaning as 'an obligation' in the context of the passage, which is a moral or legal responsibility.",
    "year": "2023"
  },
  {
    "number": "319",
    "text": "For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n\novercast",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69267?exam_type=waec&type=theory&page=64",
    "correct_answer": "The word 'overcast' in the context of the passage refers to the sky being covered with clouds; it is cloudy. It can be replaced with synonyms such as 'cloudy', 'clouded over', 'cloud-covered', or 'cloud-filled'. These words all convey the same meaning as 'overcast' in the context of the passage, which is the state of the sky when it is covered with clouds.",
    "explanation": "The word 'overcast' in the context of the passage refers to the sky being covered with clouds; it is cloudy. It can be replaced with synonyms such as 'cloudy', 'clouded over', 'cloud-covered', or 'cloud-filled'. These words all convey the same meaning as 'overcast' in the context of the passage, which is the state of the sky when it is covered with clouds.",
    "year": "2023"
  },
  {
    "number": "320",
    "text": "For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n\npensively",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69268?exam_type=waec&type=theory&page=64",
    "correct_answer": "The word 'pensively' in the context of the passage refers to the thoughtful or reflective state of Dr Felix Adoka. It can be replaced with synonyms such as 'thoughtfully', 'reflectively', 'contemplatively', or 'meditatively'. These words all convey the same meaning as 'pensively' in the context of the passage, which is the state of being engaged in, involving, or reflecting deep or serious thought.",
    "explanation": "The word 'pensively' in the context of the passage refers to the thoughtful or reflective state of Dr Felix Adoka. It can be replaced with synonyms such as 'thoughtfully', 'reflectively', 'contemplatively', or 'meditatively'. These words all convey the same meaning as 'pensively' in the context of the passage, which is the state of being engaged in, involving, or reflecting deep or serious thought.",
    "year": "2023"
  },
  {
    "number": "321",
    "text": "In six sentences, one for each, summarise the qualities that the writer advises parents to instil in their children.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/69272?exam_type=waec&type=theory&page=65",
    "correct_answer": "The following are qualities that the writer advises parents to instil in their children:\n1. Parents should inculcate the quality of self-control in their children.\n2. Parents should encourage their children in resilience through encouragement.\n3. Parents must insil in their children the virtue of humility.\n4. Parents must teach their children integrity so that they can be responsible children.\n5. Parents must teach their children the value of hard work while trying to make a fortune.\n6. Parents should ensure that their children take an active part in chores and duties at home.\n7. The principle of humility should be the watchword for every child.\n8. Parents should train their children to abide by the fundamental laws of the land.\n9. Parents should train their children on the need to have integrity, dignity and manners.",
    "explanation": "The following are qualities that the writer advises parents to instil in their children:\n1. Parents should inculcate the quality of self-control in their children.\n2. Parents should encourage their children in resilience through encouragement.\n3. Parents must insil in their children the virtue of humility.\n4. Parents must teach their children integrity so that they can be responsible children.\n5. Parents must teach their children the value of hard work while trying to make a fortune.\n6. Parents should ensure that their children take an active part in chores and duties at home.\n7. The principle of humility should be the watchword for every child.\n8. Parents should train their children to abide by the fundamental laws of the land.\n9. Parents should train their children on the need to have integrity, dignity and manners.",
    "year": "2023"
  }
]