[
  {
    "number": "190",
    "text": "(a) What is a Covenant?\n \n(b) Illustrate how God proved to Abraham that He would honour the covenant.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51872?exam_type=waec&type=theory&page=38",
    "correct_answer": "(a) A covenant is a mutual agreement between two parties, each pleading allegiance to its own responsibility or duty according to the terms of covenant. The two parties in the covenant could be equals or one could be superior to the other. The breach of the terms by any of the parties determines/terminates the covenant unless the other party forgoes its legal right and allows the covenant to subsist.\n(b) One of the conditions stipulated in the covenant was God's promise that Sarah would bear Abraham a son in his old age (to be called Isaac). Although Abraham expressed a doubt (owing to his old age and the age of his \"barren\" wife), God assured him of his faithfulness. Then Abraham suggested that Ishmael might be the vehicle for God's fulfillment of the covenant. `No', said God. Sarah would bear a son with whom the covenant would be established with his descendants for ever. As for Ishmael, God would bless him with children, but Sarah's son, Isaac, would surely be born at that season the following year. Soon after this, she conceived and bore a son. Abraham called his name 'Isaac' and circumcised him on the eighth day. Abraham was 100 years old then. Sarah said that God had made laughter of her. Abraham celebrated the occasion with feast for his faithfulness to the covenant.",
    "explanation": "(a) A covenant is a mutual agreement between two parties, each pleading allegiance to its own responsibility or duty according to the terms of covenant. The two parties in the covenant could be equals or one could be superior to the other. The breach of the terms by any of the parties determines/terminates the covenant unless the other party forgoes its legal right and allows the covenant to subsist.\n(b) One of the conditions stipulated in the covenant was God's promise that Sarah would bear Abraham a son in his old age (to be called Isaac). Although Abraham expressed a doubt (owing to his old age and the age of his \"barren\" wife), God assured him of his faithfulness. Then Abraham suggested that Ishmael might be the vehicle for God's fulfillment of the covenant. `No', said God. Sarah would bear a son with whom the covenant would be established with his descendants for ever. As for Ishmael, God would bless him with children, but Sarah's son, Isaac, would surely be born at that season the following year. Soon after this, she conceived and bore a son. Abraham called his name 'Isaac' and circumcised him on the eighth day. Abraham was 100 years old then. Sarah said that God had made laughter of her. Abraham celebrated the occasion with feast for his faithfulness to the covenant.",
    "year": "2001"
  },
  {
    "number": "191",
    "text": "(a) Narrate the events which led to the reconciliation between David and Abner\n \n(b) What two lessons could be derived from",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51873?exam_type=waec&type=theory&page=39",
    "correct_answer": "(a) After Saul's death, there was war between his house and the house of David. Abner made himself stronger as he retained the leadership of Saul's army. lshboshet later accused Abner of having gone in to his father's concubine (Rizpah). This irked Abner and he asked whether he had become a dog's head as to be insulted on a matter concerning a woman. He openly defied lshboshet by telling him that he would renounce his allegiance to Saul's house and transfer same to David. Ishboshet was too weak to react to Abner's threat for he feared Abner. Abner however, sent messengers to David.\nHe asked him to enter into a covenant with him and he would hand over all Israel to him. David said he would consider his offer (see his face) if only he should restore his first wife, Michal. Saul's daughter, to him, after he had suffered so much to get her betrothed to him. David even sent the same order td Ishboshet to restore Michal to him and he had no choice but to comply. Abner conferred with the elders of Israel and called upon them to demonstrate their desire to make David king of all Israel (as God had destined it). With a delegation (of twenty men), he went to David in Hebron and David received thew warmly. Abner assured David that he would gather all Israel to enter into a covenant with him to reign over them. With the agreement sealed, David sent Abner away in peace.\n(b) Lessons learnt from the reconciliation between David and Abner are:\n(i) David's forgiveness of Abner who had beer waging a protracted war of attrition against him is worthy of emulation.\n(ii) In order to make his claim legitimate as king of Israel, David had to reconcile with Michal, Saul's daughter.\n(iii) David exercised wisdom by seizing time by the fore-lock; his reconciliation with Abner worked in his favour more than the many apparent victories his army might have registered against Saul's army.\n(iv) David's nature was in contrast with Abner's peremptory and unforgiving stance.\n(v) Leaders should strive for peace always.",
    "explanation": "(a) After Saul's death, there was war between his house and the house of David. Abner made himself stronger as he retained the leadership of Saul's army. lshboshet later accused Abner of having gone in to his father's concubine (Rizpah). This irked Abner and he asked whether he had become a dog's head as to be insulted on a matter concerning a woman. He openly defied lshboshet by telling him that he would renounce his allegiance to Saul's house and transfer same to David. Ishboshet was too weak to react to Abner's threat for he feared Abner. Abner however, sent messengers to David.\nHe asked him to enter into a covenant with him and he would hand over all Israel to him. David said he would consider his offer (see his face) if only he should restore his first wife, Michal. Saul's daughter, to him, after he had suffered so much to get her betrothed to him. David even sent the same order td Ishboshet to restore Michal to him and he had no choice but to comply. Abner conferred with the elders of Israel and called upon them to demonstrate their desire to make David king of all Israel (as God had destined it). With a delegation (of twenty men), he went to David in Hebron and David received thew warmly. Abner assured David that he would gather all Israel to enter into a covenant with him to reign over them. With the agreement sealed, David sent Abner away in peace.\n(b) Lessons learnt from the reconciliation between David and Abner are:\n(i) David's forgiveness of Abner who had beer waging a protracted war of attrition against him is worthy of emulation.\n(ii) In order to make his claim legitimate as king of Israel, David had to reconcile with Michal, Saul's daughter.\n(iii) David exercised wisdom by seizing time by the fore-lock; his reconciliation with Abner worked in his favour more than the many apparent victories his army might have registered against Saul's army.\n(iv) David's nature was in contrast with Abner's peremptory and unforgiving stance.\n(v) Leaders should strive for peace always.",
    "year": "2001"
  },
  {
    "number": "192",
    "text": "(a) Describe Solomons's dream at Gibeon\n \n(b) For what two reasons would you approve of Solomon's request on this ision?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51875?exam_type=waec&type=theory&page=39",
    "correct_answer": "(a) Solomon loved the Lord and walked according to his father, David's statutes, laws and ways. When he began to reign he went to sacrifice to the Lord in Gibeon. The Lord appeared to him in dream by night and said to him, 'ask what I shat give you'. Solomon began by commending God for his great love for his father, David and for giving him a son to reign in his stead because he had walked before him in faithfulness and he remained faithful to God. He said, though, he, Solomon. was but a little child, he was in the midst of God's chosen people, a great people that cannot be numbered. He therefore asked for an understanding mind and wisdom, to govern the people and discern between good and evil ir governance. God was pleased with his request and he told him that since he had not asked for long life, riches, or the life of his enemies, he would grant him his request (such that none before or after him could be like him). Furthermore, he would give him what he had not asked for - riches and honour. God concluded that should he remember in faith and obey all God's commandments like his father, David, He would lengthen his days. Solomon woke up and realized that it was a dream. He returned to Jerusalem, stood before the Ark (of the covenant) and offered burnt offerings to the Lord and feasted his servants.\n(b) The reasons for God's approval of Solomon's request are:\n(i) Solomon's request of wisdom from God was very apt, for with it, no difficulty in his government of Israel would be insurmountable.\n(ii) Solomon knew that he was not David's eldest son. Therefore, with wisdom, he would be able to handle any successor squabble that might arise.\n(iii) As a child (he was then only 12 or 14), his inexperience needed God's sustaining gift of wisdom.\n(iv) The king's most important function in his day was administration of justice since, as absolute kings, the reigned and ruled (they were not constitutional monarchs); therefore he required wisdom.",
    "explanation": "(a) Solomon loved the Lord and walked according to his father, David's statutes, laws and ways. When he began to reign he went to sacrifice to the Lord in Gibeon. The Lord appeared to him in dream by night and said to him, 'ask what I shat give you'. Solomon began by commending God for his great love for his father, David and for giving him a son to reign in his stead because he had walked before him in faithfulness and he remained faithful to God. He said, though, he, Solomon. was but a little child, he was in the midst of God's chosen people, a great people that cannot be numbered. He therefore asked for an understanding mind and wisdom, to govern the people and discern between good and evil ir governance. God was pleased with his request and he told him that since he had not asked for long life, riches, or the life of his enemies, he would grant him his request (such that none before or after him could be like him). Furthermore, he would give him what he had not asked for - riches and honour. God concluded that should he remember in faith and obey all God's commandments like his father, David, He would lengthen his days. Solomon woke up and realized that it was a dream. He returned to Jerusalem, stood before the Ark (of the covenant) and offered burnt offerings to the Lord and feasted his servants.\n(b) The reasons for God's approval of Solomon's request are:\n(i) Solomon's request of wisdom from God was very apt, for with it, no difficulty in his government of Israel would be insurmountable.\n(ii) Solomon knew that he was not David's eldest son. Therefore, with wisdom, he would be able to handle any successor squabble that might arise.\n(iii) As a child (he was then only 12 or 14), his inexperience needed God's sustaining gift of wisdom.\n(iv) The king's most important function in his day was administration of justice since, as absolute kings, the reigned and ruled (they were not constitutional monarchs); therefore he required wisdom.",
    "year": "2001"
  },
  {
    "number": "193",
    "text": "(a) What was God's message to the people of Israel through Isaiah when they offended Him?\n \n(b) In which two ways are these issues still prevalent in your society?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51876?exam_type=waec&type=theory&page=39",
    "correct_answer": "(a) Isaiah called upon the rulers and the people of Jerusalem, whom he referred to as Sodom and Gomorrah to listened to the words of God/teaching of God. He wondered why they should continue to make (their multitude of) sacrifices when God had become tired of their burnt offerings and fats of well-fed beasts and their pretentious appearances in God's courts have become an abomination to God who had no need of their offerings and who hated their new moons sabbaths, and other religious feasts because they were tainted with all sorts of immorality. When they spread their hands in prayer, God would turn away his eyes and He would not listen because they were full of blood.\nIf, however, they.must appease the anger of God, they must wash themselves clean by removing the evil in their actions. They should learn to do good, seek justice, stop oppression, defend the fatherless and plead for the widows. Thereafter, they should respond positively to God's invitation to dialogue with him so that even if their sins were scarlet, they would be as snow; though red like crimson, they would be like wool. If they were willing and obedient, they would eat the good of the land but if they should rebel, they would be devoured by the sword.\n(b) The ways these issues are still prevalent in our society today are:\n(i) Empty sacrifices: People still offer empty sacrifices to God, their offerings are not pure.\n(ii) Corrupt courts/judiciary: There is no justice, the judges use their position to enrich their pockets and victimize the common people\n(iii) Observance of rituals: People still cling to the belief that they can appease their false gods through rituals rather than serving the real God according to the scripture.\n(iv) Moral uncleanliness/ immorality: There is moral decadence especially among our youth. Their mode of dressing, expression, taste and actions show negligence and lack of dedication to the right path.\n(v) Oppression of the weak/poor: The disparity between the rich and the poor is so obvious that the rich become richer while the poor remain their tools. The rich become oppressors and fail to assist the poor.\n(vi) Ritual murder: Cases of ritual murder occur daily in our society. Killing of innocent people, using of private parts of people for rituals are common in our society today.\n(vii) External show of religion rather than inner spirituality: Hypocrisy has taken over. The rich donate where they will be praised while they find it difficult to propagate the message of God.",
    "explanation": "(a) Isaiah called upon the rulers and the people of Jerusalem, whom he referred to as Sodom and Gomorrah to listened to the words of God/teaching of God. He wondered why they should continue to make (their multitude of) sacrifices when God had become tired of their burnt offerings and fats of well-fed beasts and their pretentious appearances in God's courts have become an abomination to God who had no need of their offerings and who hated their new moons sabbaths, and other religious feasts because they were tainted with all sorts of immorality. When they spread their hands in prayer, God would turn away his eyes and He would not listen because they were full of blood.\nIf, however, they.must appease the anger of God, they must wash themselves clean by removing the evil in their actions. They should learn to do good, seek justice, stop oppression, defend the fatherless and plead for the widows. Thereafter, they should respond positively to God's invitation to dialogue with him so that even if their sins were scarlet, they would be as snow; though red like crimson, they would be like wool. If they were willing and obedient, they would eat the good of the land but if they should rebel, they would be devoured by the sword.\n(b) The ways these issues are still prevalent in our society today are:\n(i) Empty sacrifices: People still offer empty sacrifices to God, their offerings are not pure.\n(ii) Corrupt courts/judiciary: There is no justice, the judges use their position to enrich their pockets and victimize the common people\n(iii) Observance of rituals: People still cling to the belief that they can appease their false gods through rituals rather than serving the real God according to the scripture.\n(iv) Moral uncleanliness/ immorality: There is moral decadence especially among our youth. Their mode of dressing, expression, taste and actions show negligence and lack of dedication to the right path.\n(v) Oppression of the weak/poor: The disparity between the rich and the poor is so obvious that the rich become richer while the poor remain their tools. The rich become oppressors and fail to assist the poor.\n(vi) Ritual murder: Cases of ritual murder occur daily in our society. Killing of innocent people, using of private parts of people for rituals are common in our society today.\n(vii) External show of religion rather than inner spirituality: Hypocrisy has taken over. The rich donate where they will be praised while they find it difficult to propagate the message of God.",
    "year": "2001"
  },
  {
    "number": "194",
    "text": "(a) From the Sermon on the Mount, state how Jesus handled the issues of adultery, divorce and swearing.\n \n(b) Indicate the two lessons to be drawn from Jesus' attitude to these practices.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51877?exam_type=waec&type=theory&page=39",
    "correct_answer": "(a) From the sermon on the Mount, Jesus handled the issues of adultery, divorce and swearing in the following ways: Adultery: Jesus reminded the audience that the (Mosaic) law forbade adultery; but added; 'I say to you that every one who looks at a woman lustfully has already committed adultery with her in his heart; He warned the people that if their right eye would cause them to sin, it should be plucked out. It is better to lose one member than to lose the whole body in hell and \"if their right hand would cause them to sin, they should cut it off. Divorce: The law said that whoever divorces his wife, let him give her a certificate of divorce.\nHowever, Jesus said, But I say to you that anybody who divorces his wife, except for unchastity, immorality or adultery makes her an adulteress; and whoever marries a divorced woman commits adultery.\" Swearing: The law forbade swearing falsely as one must perform whatever one had sworn to do. Christ taught them not to swear at all, either by heaven, for it is the throne of God; nor by the earth, for it is God's footstool or by Jerusalem, the city of the great king/God. He also said, \"do not swear by your head, for you cannot make one hair black or white. Let what you say be simply 'Yes' or 'No'. Anything more than this is of the devil/evil\".\n(b) Significant lessons to be learnt from the issues are:\n(i) The Mosaic law stresses the physical aspect and the don'ts; Jesus stresses the internal motivation of the people's actions which lead them to sin.\n(ii) Jesus claims full divine authority to fulfil the laws of God, unlike the scribes who had no such authority but only recited Mosaic laws.\n(iii) To the Jews, swearing was not a serious offence, but Jesus condemns it in its entirety (as coming from the evil one/satan, the devil).\n(iv) For the Jews, a man rarely commits adultery. Such a discriminatory attitude against women is unacceptable to Jesus who states that a man who marries a divorced woman is guilty of the sin of adultery.",
    "explanation": "(a) From the sermon on the Mount, Jesus handled the issues of adultery, divorce and swearing in the following ways: Adultery: Jesus reminded the audience that the (Mosaic) law forbade adultery; but added; 'I say to you that every one who looks at a woman lustfully has already committed adultery with her in his heart; He warned the people that if their right eye would cause them to sin, it should be plucked out. It is better to lose one member than to lose the whole body in hell and \"if their right hand would cause them to sin, they should cut it off. Divorce: The law said that whoever divorces his wife, let him give her a certificate of divorce.\nHowever, Jesus said, But I say to you that anybody who divorces his wife, except for unchastity, immorality or adultery makes her an adulteress; and whoever marries a divorced woman commits adultery.\" Swearing: The law forbade swearing falsely as one must perform whatever one had sworn to do. Christ taught them not to swear at all, either by heaven, for it is the throne of God; nor by the earth, for it is God's footstool or by Jerusalem, the city of the great king/God. He also said, \"do not swear by your head, for you cannot make one hair black or white. Let what you say be simply 'Yes' or 'No'. Anything more than this is of the devil/evil\".\n(b) Significant lessons to be learnt from the issues are:\n(i) The Mosaic law stresses the physical aspect and the don'ts; Jesus stresses the internal motivation of the people's actions which lead them to sin.\n(ii) Jesus claims full divine authority to fulfil the laws of God, unlike the scribes who had no such authority but only recited Mosaic laws.\n(iii) To the Jews, swearing was not a serious offence, but Jesus condemns it in its entirety (as coming from the evil one/satan, the devil).\n(iv) For the Jews, a man rarely commits adultery. Such a discriminatory attitude against women is unacceptable to Jesus who states that a man who marries a divorced woman is guilty of the sin of adultery.",
    "year": "2001"
  },
  {
    "number": "195",
    "text": "(a) Teacher, what shall I do to inherit eternal life?' How did Jesus deal with this question?\n \n(b) In what two ways could a Christian show concern for others?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51878?exam_type=waec&type=theory&page=39",
    "correct_answer": "(a) A lawyer put the quoted question to Jesus in order to test him. Jesus however, asked him what was written in the law and how he was reading the law. He summarised the law by saying 'You should love the Lord your God and your neighbour as yourself.' Jesus commanded him to go and do that and he would live and be qualified for eternal life, but the lawyer, still wishing to justify himself, asked Jesus who his neighbour was.\nJesus told him, in a parable, how a man who was travelling from Jerusalem to Jericho fell in to the hands of robbers who beat him thoroughly, stripped him and left him half dead. By chance, a priest and later, a Levite saw him and each of them passed him by on the other side. Later, a Samaritan came by and saw the injured man and gave him first aid. He carried him on his beast to an inn and paid an advance for further treatment and care. He also promised to return and offset whatever extra would be spent on him. Then, Jesus asked the lawyer which of the three (who saw the injured man) proved to be neighbour to him. It was the one who showed him mercy, he answered. Then Jesus asked him to go and do likewise.\n(b) Christians can show concern for others in the following ways:\n(i) Christians should share with others what they have received by God's grace, especially with those in spiritual and physical need This includes the word of God and the physical assets at their disposal.\n(ii)They should take care of the sick, the aged and the invalid in the society.\n(iii) They should forgive and reconcile with those who offend them, if they sincerely repent.\n(iv)True religion is not just by attending services regularly and paying all tithes and thanksgivings, but more by living a practical Christian life and thereby influencing others through exemplary character. Christians should avoid hypocrisy and do good unto others.",
    "explanation": "(a) A lawyer put the quoted question to Jesus in order to test him. Jesus however, asked him what was written in the law and how he was reading the law. He summarised the law by saying 'You should love the Lord your God and your neighbour as yourself.' Jesus commanded him to go and do that and he would live and be qualified for eternal life, but the lawyer, still wishing to justify himself, asked Jesus who his neighbour was.\nJesus told him, in a parable, how a man who was travelling from Jerusalem to Jericho fell in to the hands of robbers who beat him thoroughly, stripped him and left him half dead. By chance, a priest and later, a Levite saw him and each of them passed him by on the other side. Later, a Samaritan came by and saw the injured man and gave him first aid. He carried him on his beast to an inn and paid an advance for further treatment and care. He also promised to return and offset whatever extra would be spent on him. Then, Jesus asked the lawyer which of the three (who saw the injured man) proved to be neighbour to him. It was the one who showed him mercy, he answered. Then Jesus asked him to go and do likewise.\n(b) Christians can show concern for others in the following ways:\n(i) Christians should share with others what they have received by God's grace, especially with those in spiritual and physical need This includes the word of God and the physical assets at their disposal.\n(ii)They should take care of the sick, the aged and the invalid in the society.\n(iii) They should forgive and reconcile with those who offend them, if they sincerely repent.\n(iv)True religion is not just by attending services regularly and paying all tithes and thanksgivings, but more by living a practical Christian life and thereby influencing others through exemplary character. Christians should avoid hypocrisy and do good unto others.",
    "year": "2001"
  },
  {
    "number": "196",
    "text": "(a) Trace Matthew's account of the crucifixion and burial of Jesus.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51879?exam_type=waec&type=theory&page=40",
    "correct_answer": "As the soldiers led Jesus along the road to Calvary, they seized Simon of Cyrene to carry the cross of Jesus. At Golgotha, they offered wine mingled with gall to Jesus who tasted and rejected it. After crucifying him, they divided his garments by lot and they sat down to keep watch. Over his head was the inscription, \"This is Jesus, the King of the Jews.\" Two robbers were crucified with him (one on either side). Passers-by mocked Jesus: 'you who would destroy the temple and build it in three days, save yourself if you are the son of God/come from the cross'. Chief priests, scribes, and the elders mocked him saying, 'if you are the king of Israel, come down from the cross and we shall believe'. Even the two robbers crucified with him mocked him. From the sixth hour, there was darkness all over to the ninth hour and he cried, 'Eli, Eli, lamasabachthanr meaning 'My God, my God, why has thou forsaken me'. Bystanders said he was calling Elijah, let us see if Elijah would come to save him. They gave him vinegar to drink. Jesus cried with a loud voice and gave up his spirit.\nThe centurion and the guards who were filled with awe said, \"Truly this man was the Son of God.\" The ministering women who were looking from afar (including Mary Magdalene, Mary, mother of James, etc) were all there and witnessed the event. In the evening, Joseph of Arimathea sought and obtained permission from Pilate to bury the body of Jesus. He took the body, wrapped it in clean linen and buried it in his (rock hewn) tomb.",
    "explanation": "As the soldiers led Jesus along the road to Calvary, they seized Simon of Cyrene to carry the cross of Jesus. At Golgotha, they offered wine mingled with gall to Jesus who tasted and rejected it. After crucifying him, they divided his garments by lot and they sat down to keep watch. Over his head was the inscription, \"This is Jesus, the King of the Jews.\" Two robbers were crucified with him (one on either side). Passers-by mocked Jesus: 'you who would destroy the temple and build it in three days, save yourself if you are the son of God/come from the cross'. Chief priests, scribes, and the elders mocked him saying, 'if you are the king of Israel, come down from the cross and we shall believe'. Even the two robbers crucified with him mocked him. From the sixth hour, there was darkness all over to the ninth hour and he cried, 'Eli, Eli, lamasabachthanr meaning 'My God, my God, why has thou forsaken me'. Bystanders said he was calling Elijah, let us see if Elijah would come to save him. They gave him vinegar to drink. Jesus cried with a loud voice and gave up his spirit.\nThe centurion and the guards who were filled with awe said, \"Truly this man was the Son of God.\" The ministering women who were looking from afar (including Mary Magdalene, Mary, mother of James, etc) were all there and witnessed the event. In the evening, Joseph of Arimathea sought and obtained permission from Pilate to bury the body of Jesus. He took the body, wrapped it in clean linen and buried it in his (rock hewn) tomb.",
    "year": "2001"
  },
  {
    "number": "197",
    "text": "(a) Give an account of the work of Philip in Samaria\n \n(b) In what two ways were the activities of the Holy Spirit manifested in Samaria?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51880?exam_type=waec&type=theory&page=40",
    "correct_answer": "(a) Mass persecution started in Jerusalem after Stephen's death. The Church became panicky and fled from Jerusalem to other places (Judea, Samaria, etc). Wherever they went, they preached and converted many to the faith. Philip, one of the seven deacons fled to Samaria and proclaimed the Gospel message in Samaria. When the people of Samaria heard and saw the miracles he performed, many were converted. He cast out demons from those possessed and healed those who were paralysed. Philip encountered a magician called Simon who had deceived many people who thought he had the power of God. Simon too was converted and was baptized. The good work of Philip in Samaria reached the apostles in Jerusalem. Peter and John were impressed and they prayed and laid their hands on the new converts to receive the Holy Spirit.\nSimon attempted to bribe Peter to give him the power to impart the Holy Spirit to others, but, Peter rebuked him saying, \"your silver perish with you ...\". Simon became frightened after the words of Peter and asked Peter to pray for him.\n(b) The activity of the Holy Spirit was manifested in Samaria in the following ways:.\n(i) Healing of the sick;\n(ii) Casting out of demons;\n(iii) Working of miracles;\n(iv) Exposure of Simon's selfishness/condemnation of Simon;\n(v) Conversion of unbelievers;\n(vi) Pressure of the Holy Spirit to empower the disciples/the church.",
    "explanation": "(a) Mass persecution started in Jerusalem after Stephen's death. The Church became panicky and fled from Jerusalem to other places (Judea, Samaria, etc). Wherever they went, they preached and converted many to the faith. Philip, one of the seven deacons fled to Samaria and proclaimed the Gospel message in Samaria. When the people of Samaria heard and saw the miracles he performed, many were converted. He cast out demons from those possessed and healed those who were paralysed. Philip encountered a magician called Simon who had deceived many people who thought he had the power of God. Simon too was converted and was baptized. The good work of Philip in Samaria reached the apostles in Jerusalem. Peter and John were impressed and they prayed and laid their hands on the new converts to receive the Holy Spirit.\nSimon attempted to bribe Peter to give him the power to impart the Holy Spirit to others, but, Peter rebuked him saying, \"your silver perish with you ...\". Simon became frightened after the words of Peter and asked Peter to pray for him.\n(b) The activity of the Holy Spirit was manifested in Samaria in the following ways:.\n(i) Healing of the sick;\n(ii) Casting out of demons;\n(iii) Working of miracles;\n(iv) Exposure of Simon's selfishness/condemnation of Simon;\n(v) Conversion of unbelievers;\n(vi) Pressure of the Holy Spirit to empower the disciples/the church.",
    "year": "2001"
  },
  {
    "number": "198",
    "text": "(a) Explain why Paul advocated submission to the people in authority\n \n(b) State four ways by which you can help your school authority to maintain law and order in your school.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51881?exam_type=waec&type=theory&page=40",
    "correct_answer": "(a) Paul admonishes everybody to subject themselves to the governing authorities, for God Himself permits all authorities. He asserts that those that exist are either authorized or permitted by God to operate. Therefore, anybody who resists the authorities is resisting God and will incure this judgement, for leaders are not appointed to be a terror to good conduct but to bad conduct. If any one is to avoid being afraid of authorities, he must do what is good and right, then he will receive approval from the authority for he is God's servant for His goal. However, if one does wrong, then one will be afraid, for the authority does not wield the sword in vain. He is the servant of God to execute God's wrath on the wrong doer. Therefore, every one must be subject to civil authority to avoid God's wrath. For the sake of conscience, they should pay respect to whom it is due and honour to whom honour is due.\n(b) To help authorities maintain law and order in schools, the following steps must be taken into consideration:\n(i) Obeying all laws and regulations of the school;\n(ii)Applying oneself fully to school work, studies and games including extra-curricula activities;\n(iii) Paying of fees as and when due;\n(iv) Being regular and punctual at all times;\n(v)Avoiding cult activities;\n(vi)Avoiding all forms of cheating, examination malpractices and stealing/pilferings;\n(vii) Being neat and tidy (in body and soul).",
    "explanation": "(a) Paul admonishes everybody to subject themselves to the governing authorities, for God Himself permits all authorities. He asserts that those that exist are either authorized or permitted by God to operate. Therefore, anybody who resists the authorities is resisting God and will incure this judgement, for leaders are not appointed to be a terror to good conduct but to bad conduct. If any one is to avoid being afraid of authorities, he must do what is good and right, then he will receive approval from the authority for he is God's servant for His goal. However, if one does wrong, then one will be afraid, for the authority does not wield the sword in vain. He is the servant of God to execute God's wrath on the wrong doer. Therefore, every one must be subject to civil authority to avoid God's wrath. For the sake of conscience, they should pay respect to whom it is due and honour to whom honour is due.\n(b) To help authorities maintain law and order in schools, the following steps must be taken into consideration:\n(i) Obeying all laws and regulations of the school;\n(ii)Applying oneself fully to school work, studies and games including extra-curricula activities;\n(iii) Paying of fees as and when due;\n(iv) Being regular and punctual at all times;\n(v)Avoiding cult activities;\n(vi)Avoiding all forms of cheating, examination malpractices and stealing/pilferings;\n(vii) Being neat and tidy (in body and soul).",
    "year": "2001"
  },
  {
    "number": "199",
    "text": "(a) What did Paul teach the Philippians about humility?\n \n(b) Highlight two ways by which a Chrisitian could manifest the spirit of humility.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51882?exam_type=waec&type=theory&page=40",
    "correct_answer": "(a) Paul appealed to the Philippians to live a life worthy of the gospel (of Christ) which makes for good relationship among Christians. Such a life is built on love, affection and sympathy for one another. Christians should, therefore, not do anything out of selfishness or conceit, but, in humility they should count others better than themselves. Nobody should look only for his own selfish interests, but, everybody should also be concerned with others' interest. They should always have the nature of Christ in mind who, though was divine, did not count equality with God but he emptied himself and took the form of a servant so that he was born in human likeness, humbled himself and became obedient unto death, even death on a cross. This is a thing to be emulated by Christians. As a result of Christ's humility, God richly exalted him and bestowed on him the name that is above all other names; that at the name of Jesus, every knee should bow in heaven, and on earth, every tongue should confess that Jesus Christ is the Lord to the glory of God.\n(b) Christian manifestation of spirit of humility is as follows:\n(i) A Christian should not be proud but humble. He should ask for what he could do for the church of God rather than what he could gain thereby.\n(ii) With the hope of salvation as a motivation, a Christian should be a doer of the word and not a hearer only.\n(iii) A Christian should preach the word of God and thereby make converts into the kingdom of God.",
    "explanation": "(a) Paul appealed to the Philippians to live a life worthy of the gospel (of Christ) which makes for good relationship among Christians. Such a life is built on love, affection and sympathy for one another. Christians should, therefore, not do anything out of selfishness or conceit, but, in humility they should count others better than themselves. Nobody should look only for his own selfish interests, but, everybody should also be concerned with others' interest. They should always have the nature of Christ in mind who, though was divine, did not count equality with God but he emptied himself and took the form of a servant so that he was born in human likeness, humbled himself and became obedient unto death, even death on a cross. This is a thing to be emulated by Christians. As a result of Christ's humility, God richly exalted him and bestowed on him the name that is above all other names; that at the name of Jesus, every knee should bow in heaven, and on earth, every tongue should confess that Jesus Christ is the Lord to the glory of God.\n(b) Christian manifestation of spirit of humility is as follows:\n(i) A Christian should not be proud but humble. He should ask for what he could do for the church of God rather than what he could gain thereby.\n(ii) With the hope of salvation as a motivation, a Christian should be a doer of the word and not a hearer only.\n(iii) A Christian should preach the word of God and thereby make converts into the kingdom of God.",
    "year": "2001"
  },
  {
    "number": "200",
    "text": "(a) Explain Peter's advice to the elders and members of the church in their interpersonal relationships.\n \n(b) State two duties of a good church leader.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51883?exam_type=waec&type=theory&page=40",
    "correct_answer": "(a)(1) Peter advised elders to look after God's flock with tender care. They should work not as being under any external constraint, but willingly; not with the desire to make material gains, but with the eagerness that comes from the heart; not with a presumptuous and domineering spirit but as examples to be copied by the flock, so that at the appropriate time, they might attain the crown of glory.\n(ii) Peter advised the young ones to be in humble subjection to the leaders, for God humiliates the proud and exalts the humble. However, for both young and old, Peter recommends the humble approach. They should leave all cases of anxiety in the able hands of God. They should, in all soberness, be vigilant against the temptation of the devil who is always around to lead the spiritually weak ones to destruction in hell. Armed with patient faith, they should remember that suffering is part of their Christian calling, knowing that suffering will lead to glory in Christ who has eternal dominion.\n(b)The duties of a good church leader are:\n(i) His first concern should be the spiritual and physical well being of the flock.\n(ii) He must adjust his life as to practically show that he lives modestly.\n(iii) He should be a shining example to the congregation.\n(iv) He should encourage evangelism.\n(v) He should pray for the congregation and intercede on their behalf.\n(vi) He should give them spiritual counsel and moral courage.",
    "explanation": "(a)(1) Peter advised elders to look after God's flock with tender care. They should work not as being under any external constraint, but willingly; not with the desire to make material gains, but with the eagerness that comes from the heart; not with a presumptuous and domineering spirit but as examples to be copied by the flock, so that at the appropriate time, they might attain the crown of glory.\n(ii) Peter advised the young ones to be in humble subjection to the leaders, for God humiliates the proud and exalts the humble. However, for both young and old, Peter recommends the humble approach. They should leave all cases of anxiety in the able hands of God. They should, in all soberness, be vigilant against the temptation of the devil who is always around to lead the spiritually weak ones to destruction in hell. Armed with patient faith, they should remember that suffering is part of their Christian calling, knowing that suffering will lead to glory in Christ who has eternal dominion.\n(b)The duties of a good church leader are:\n(i) His first concern should be the spiritual and physical well being of the flock.\n(ii) He must adjust his life as to practically show that he lives modestly.\n(iii) He should be a shining example to the congregation.\n(iv) He should encourage evangelism.\n(v) He should pray for the congregation and intercede on their behalf.\n(vi) He should give them spiritual counsel and moral courage.",
    "year": "2001"
  },
  {
    "number": "201",
    "text": "How did James prove that `faith apart from works, is dead'?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51884?exam_type=waec&type=theory&page=41",
    "correct_answer": "James began his exposition on faith and works by calling upon Christians to be doers of the word and not deceive themselves as men of faith by not doing what they profess, for if they are mere hearers, they are like a man who observes his face in a mirror, but as soon as he goes away, forgets what his face looks like. He who has heard the perfect law, the gospel of Christ (which liberates us from the curse of the law) and perseveres in it by his actions, shall be blessed in his doing. For somebody to be truly religious, he must bridle his tongue or else his religion is in vain and he is deceiving himself. Pure and undiluted religion involves visiting orphans/widows (in their affliction)and keeping away from the stain of sin.\nTo butress his teaching, James cited the biblical instances of faith and works operating in unison. He spoke about Abraham's justification not merely because of his faith, but for matching his faith with requisite work. When he heard and obeyed God and showed his readiness to sacrifice his son-Isaac, he proved that his faith would have been incomplete without taking the appropriate action. Abraham believed God and it was reckoned for him as righteousness. Consequently, he was called the friend of God, having been justified by his works, and not by faith alone.\nAgain, Rahab had faith in the God of Israel and proved it by receiving God's messengers. She then deceived even her own people who came to capture and to slay the messengers by sending them on a wild goose chase and ensuring the escape of the messengers and was thus justified by her actions. In conclusion, James said that as the body apart from the spirit is dead, so faith apart from works is dead.",
    "explanation": "James began his exposition on faith and works by calling upon Christians to be doers of the word and not deceive themselves as men of faith by not doing what they profess, for if they are mere hearers, they are like a man who observes his face in a mirror, but as soon as he goes away, forgets what his face looks like. He who has heard the perfect law, the gospel of Christ (which liberates us from the curse of the law) and perseveres in it by his actions, shall be blessed in his doing. For somebody to be truly religious, he must bridle his tongue or else his religion is in vain and he is deceiving himself. Pure and undiluted religion involves visiting orphans/widows (in their affliction)and keeping away from the stain of sin.\nTo butress his teaching, James cited the biblical instances of faith and works operating in unison. He spoke about Abraham's justification not merely because of his faith, but for matching his faith with requisite work. When he heard and obeyed God and showed his readiness to sacrifice his son-Isaac, he proved that his faith would have been incomplete without taking the appropriate action. Abraham believed God and it was reckoned for him as righteousness. Consequently, he was called the friend of God, having been justified by his works, and not by faith alone.\nAgain, Rahab had faith in the God of Israel and proved it by receiving God's messengers. She then deceived even her own people who came to capture and to slay the messengers by sending them on a wild goose chase and ensuring the escape of the messengers and was thus justified by her actions. In conclusion, James said that as the body apart from the spirit is dead, so faith apart from works is dead.",
    "year": "2001"
  }
]