[
  {
    "number": "52",
    "text": "All your burette readings (initial and final), as well as the size of your pipette, must be recorded but no account of experimental procedure is required. All calculations must be done in your answer book. A is a solution of HCl containing 7.30g dm\\(^{-3}\\), B is a solution of X\\(_2\\)CO\\(_{3}\\) containing 10.6 gdm\\(^{-3}\\)\n(i) Put A into your burette and titrate readings against 20.0 cm\\(^3\\) or 25.0cm\\(^3\\) portions of B using methyl orange as indicator. Tabulate your burette reading and calculate the average volume of A used. The equation for the reaction involved in the titration is ;\nX\\(_2\\)CO\\(_{3(aq)}\\) + 2HCl\\(_{(aq)}\\) \\(\\to\\) 2XCl\\(_{(aq)}\\) + H\\(_2\\)O\\(_{(l)}\\) + CO\\(_{2(g)}\\)\n(ii) From your results and the information provided above, calculate the (i) concentration or A in mol dm\\(^{3-}\\)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60093?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "53",
    "text": "Credit will be given for strict adherence to instructions, for observations precisely recorded, and for accurate interference. All tests, Observations and inferences must be clearly entered in your answer book, in ink at the time they are made. C and D are aqueous solutions of simple salt and an inorganic compound respectively. Carry out the following exercises on C and D. Record your observations and identify the gasses evolved. State the conclusion and draw from the result in the test and add sodium hydroxide in excess.\n(b)(i) Test D with litmus paper \n(ii) Put about 5cm\\(^3\\) of D in a test tube and add sodium hydroxide solution in drops and then in excess \n(iii) Add about 1cm\\(^3\\) of the soap solution provided to about 10 cm\\(^3\\) of D mixture. Repeat the test using distilled water in place D",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60096?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "54",
    "text": "State what you would see on;\n(i) bubbling SO\\(_2\\) into acidified KMnO\\(_4\\) solution\n(ii) mixing zinc dust with CuSO\\(_4\\) solution\n(iii) adding concentrated HNO\\(_3\\) to freshly prepared FeSO\\(_4\\) solution.\n(b) List two substances in case which, if added to dilute H\\(_2\\)SO\\(_4\\), would give you\n(i) H\\(_{2(g)}\\)\n(ii) ZnSO\\(_{4(aq)}\\)\n \n(c)  The diagram labeled I to IV ABOVE illustrate different laboratory set-ups used in the separation of mixtures.\n(i) Name the separation technique illustrated by each diagram\n(ii) Which of the set-ups is used for concentrating dilute salt solutions, for the purpose of crystallization?\n(iii) Which of the set-ups is used in obtaining clear water from muddy water?\n(iv) Mention the set-up you would use to separate a polar solvent from a non-polar solvent\n(v) State the modification you would make to the set-up labelled IV in order to use it for separating a mixture of NaCl and NH\\(_4\\)CI",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60097?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  }
]