[
  {
    "number": "338",
    "text": "Explain five reasons for the study of government?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57667?exam_type=waec&type=theory&page=68",
    "correct_answer": "The following are reasons for the study of government:\n1)To Have Knowledge of How the State is Managed and Governed:Studying government provides individuals with an understanding of the structures, functions and processes of government. This knowledge helps citizens comprehend how decisions are made, how public policies are formulated and implemented, and how different branches and levels of government interact. It enables individuals to understand their role in the political system and how they can influence governance.\n2)To Be Abreast with National and Global Political Occurrences/Developments:The study of government keeps individuals informed about current events and political developments both within their country and internationally. Understanding the political landscape helps citizens make sense of news and events, understand their implications and respond appropriately.\n3)To Be Equipped with the Basic Knowledge of One's Rights and How to Defend Them When Violated:Knowledge of government includes understanding citizens' rights and responsibilities. Studying government helps individuals learn about their constitutional and legal rights, how these rights are protected and what recourse they have if their rights are violated. This empowers citizens to advocate for themselves and others.\n4)Deepens the Understanding of International Relations and a State's Commitment to International Organisations:The study of Government encompass the analysis of international relations and the role of international organizations. This understanding is essential for comprehending how states interact, cooperate and resolve conflicts. It highlights the importance of treaties, alliances and global governance institutions like the United Nations and helps individuals appreciate their country's foreign policy and its implications on global peace and development.\n5)Create Interest for Active Political Participation:Studying government can inspire individuals to become more actively involved in politics. By understanding the political system, citizens may be motivated to participate in elections, join political parties, engage in advocacy, or even run for office. This active participation ensures that a diverse range of voices and perspectives are represented in the political process.",
    "explanation": "The following are reasons for the study of government:\n1)To Have Knowledge of How the State is Managed and Governed:Studying government provides individuals with an understanding of the structures, functions and processes of government. This knowledge helps citizens comprehend how decisions are made, how public policies are formulated and implemented, and how different branches and levels of government interact. It enables individuals to understand their role in the political system and how they can influence governance.\n2)To Be Abreast with National and Global Political Occurrences/Developments:The study of government keeps individuals informed about current events and political developments both within their country and internationally. Understanding the political landscape helps citizens make sense of news and events, understand their implications and respond appropriately.\n3)To Be Equipped with the Basic Knowledge of One's Rights and How to Defend Them When Violated:Knowledge of government includes understanding citizens' rights and responsibilities. Studying government helps individuals learn about their constitutional and legal rights, how these rights are protected and what recourse they have if their rights are violated. This empowers citizens to advocate for themselves and others.\n4)Deepens the Understanding of International Relations and a State's Commitment to International Organisations:The study of Government encompass the analysis of international relations and the role of international organizations. This understanding is essential for comprehending how states interact, cooperate and resolve conflicts. It highlights the importance of treaties, alliances and global governance institutions like the United Nations and helps individuals appreciate their country's foreign policy and its implications on global peace and development.\n5)Create Interest for Active Political Participation:Studying government can inspire individuals to become more actively involved in politics. By understanding the political system, citizens may be motivated to participate in elections, join political parties, engage in advocacy, or even run for office. This active participation ensures that a diverse range of voices and perspectives are represented in the political process.",
    "year": "2019"
  },
  {
    "number": "339",
    "text": "(a)Who is a citizen?\n (b) Outline four responsibilities of a citizen to the state.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57677?exam_type=waec&type=theory&page=68",
    "correct_answer": "(a) A citizen is a legal member of the state who enjoys all the rights and privileges and owes allegiance to the state.\n(b) (i) Obedience to the laws of the state\n(ii)Payment of taxes\n(iii) Defence of the state against any external attacks and internal insurrection\n(iv) Voting during election\n(v) Protection of state/public property\n(vi) Respect for national symbols",
    "explanation": "(a) A citizen is a legal member of the state who enjoys all the rights and privileges and owes allegiance to the state.\n(b) (i) Obedience to the laws of the state\n(ii)Payment of taxes\n(iii) Defence of the state against any external attacks and internal insurrection\n(iv) Voting during election\n(v) Protection of state/public property\n(vi) Respect for national symbols",
    "year": "2019"
  },
  {
    "number": "340",
    "text": "Highlight five roles played by the mass media in strengthening modern democracy",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57682?exam_type=waec&type=theory&page=68",
    "correct_answer": "(i) It serves as an instrument for public education/enlightens the masses\n(ii) It is an agent of political socialization\n(iii) It moulds public opinion\n(iv) It keeps the government in check to ensure good governance\n(v) It exposes the ills in the society\n(vi) It provides employment opportunities for the people",
    "explanation": "(i) It serves as an instrument for public education/enlightens the masses\n(ii) It is an agent of political socialization\n(iii) It moulds public opinion\n(iv) It keeps the government in check to ensure good governance\n(v) It exposes the ills in the society\n(vi) It provides employment opportunities for the people",
    "year": "2019"
  },
  {
    "number": "341",
    "text": "(a)What is Local Government?\n(b) Outline four reasons for the creation of Local Government.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57689?exam_type=waec&type=theory&page=69",
    "correct_answer": "(a) Local Government is a sub government unit created by the central/state government through an act of parliament to administer a local area.\n(b) (I) It is created to bring government closer to the people\n(ii) it is created to provide certain basic services at the local level\n(iii) To encourage local participation in governance\n(iv) To give the local people a sense of belonging\n(v) To decentralize power from the centre",
    "explanation": "(a) Local Government is a sub government unit created by the central/state government through an act of parliament to administer a local area.\n(b) (I) It is created to bring government closer to the people\n(ii) it is created to provide certain basic services at the local level\n(iii) To encourage local participation in governance\n(iv) To give the local people a sense of belonging\n(v) To decentralize power from the centre",
    "year": "2019"
  },
  {
    "number": "342",
    "text": "(a) State three types of elections\n(b) explain four purposes elections serve in a democratic state",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57693?exam_type=waec&type=theory&page=69",
    "correct_answer": "(a) (i) Direct election\n(ii) Indirect election/electoral college system\n(iii) Bye election\n(iv) General Election\n(v) Primary Election\n(b) The following are purposes that elections serve in a democratic state\n(i)Choice/Selection of Leadership:Elections provide a mechanism through which citizens can choose their leaders. By casting their votes, citizens have the opportunity to select individuals who they believe will best represent their interests and govern the country effectively.\n(ii)Confers Legitimacy on Government/Officeholders:Elections confer legitimacy on the government and its officeholders by providing a mandate from the people. When leaders are elected through a fair and transparent process, their authority is recognized as legitimate.\n(iii)Promotion of Accountability and Transparency in Government:Elections promote accountability and transparency by enabling citizens to hold their leaders responsible for their actions. Elected officials are aware that they must deliver on their promises and govern effectively, or they risk being voted out in the next election.\n(iv)Promotion of Political Participation:Elections encourage political participation by providing a platform for citizens to engage in the political process. Voting is a direct way for people to express their preferences and influence government policies. This participation strengthens democracy by ensuring that the government is responsive to the needs and desires of the populace.\n(v)Ensure Smooth Transfer of Political Power/Change of Government:Elections facilitate the peaceful and orderly transfer of power from one administration to the next. By establishing a regular schedule for elections, a democratic state can ensure that changes in leadership occur without resorting to violence or upheaval. This process helps to maintain political stability and continuity.\n(vi)Promote Political Education through Competition Between or Among Political Parties:The competitive nature of elections promotes political education among citizens. Political parties and candidates campaign on various platforms, presenting their policies and visions for the future. This competition encourages voters to become informed about the issues, evaluate different viewpoints and make educated choices.",
    "explanation": "(a) (i) Direct election\n(ii) Indirect election/electoral college system\n(iii) Bye election\n(iv) General Election\n(v) Primary Election\n(b) The following are purposes that elections serve in a democratic state\n(i)Choice/Selection of Leadership:Elections provide a mechanism through which citizens can choose their leaders. By casting their votes, citizens have the opportunity to select individuals who they believe will best represent their interests and govern the country effectively.\n(ii)Confers Legitimacy on Government/Officeholders:Elections confer legitimacy on the government and its officeholders by providing a mandate from the people. When leaders are elected through a fair and transparent process, their authority is recognized as legitimate.\n(iii)Promotion of Accountability and Transparency in Government:Elections promote accountability and transparency by enabling citizens to hold their leaders responsible for their actions. Elected officials are aware that they must deliver on their promises and govern effectively, or they risk being voted out in the next election.\n(iv)Promotion of Political Participation:Elections encourage political participation by providing a platform for citizens to engage in the political process. Voting is a direct way for people to express their preferences and influence government policies. This participation strengthens democracy by ensuring that the government is responsive to the needs and desires of the populace.\n(v)Ensure Smooth Transfer of Political Power/Change of Government:Elections facilitate the peaceful and orderly transfer of power from one administration to the next. By establishing a regular schedule for elections, a democratic state can ensure that changes in leadership occur without resorting to violence or upheaval. This process helps to maintain political stability and continuity.\n(vi)Promote Political Education through Competition Between or Among Political Parties:The competitive nature of elections promotes political education among citizens. Political parties and candidates campaign on various platforms, presenting their policies and visions for the future. This competition encourages voters to become informed about the issues, evaluate different viewpoints and make educated choices.",
    "year": "2019"
  },
  {
    "number": "343",
    "text": "(a)List three pre-independence constitutions in Nigeria\n(b) identify four features of 1960 independence constitution of Nigeria",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57706?exam_type=waec&type=theory&page=69",
    "correct_answer": "(a) (i)Clifford constitution 1922\n(ii) Richard's constitution 1946\n(iii) Macpherson constitution 1951\n(iv) Lyttleton constitution 1954\n(b) (i) it provides for a Bicameral legislature made up of the senate and house of representative\n(ii) it made provision for citizenship in Nigeria\n(iii) it granted emergency powers to the central government\n(iv) it provides for a parliamentary system of government\n(v) it made provision for the protection of fundamental human rights and freedom\n(vi) it granted the federal supreme court the power of judicial review",
    "explanation": "(a) (i)Clifford constitution 1922\n(ii) Richard's constitution 1946\n(iii) Macpherson constitution 1951\n(iv) Lyttleton constitution 1954\n(b) (i) it provides for a Bicameral legislature made up of the senate and house of representative\n(ii) it made provision for citizenship in Nigeria\n(iii) it granted emergency powers to the central government\n(iv) it provides for a parliamentary system of government\n(v) it made provision for the protection of fundamental human rights and freedom\n(vi) it granted the federal supreme court the power of judicial review",
    "year": "2019"
  },
  {
    "number": "344",
    "text": "(a) State two problems confronting Nigeria Federalism\n(b) Highlight three features of Nigeria Federalism",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57709?exam_type=waec&type=theory&page=69",
    "correct_answer": "(a) The following are some of the problems confronting Nigerian Federalism:\n(i)Problem of Acceptable Revenue Allocation Formula:The allocation of revenue among the different levels of government in Nigeria has been a contentious issue. The debate centres around the appropriate formula for distributing national revenue to ensure fairness among the federal, state and local governments. Disagreements over revenue sharing often lead to conflicts and accusations of favouritism.\n(ii)Over-concentration of Powers at the Centre:The federal system in Nigeria has historically seen a significant concentration of powers at the federal level. This centralisation limits the autonomy of state and local governments and reduces their ability to effectively manage local affairs. The over-centralisation of power often leads to inefficiencies as the federal government may be too far removed from local issues to address them effectively.\n(iii)Ethnicity and Tribalism:Nigeria is a diverse country with numerous ethnic groups, and ethnic and tribal loyalties often influence political decisions and alignments. This diversity can lead to ethnic tensions and conflicts especially when some groups are unfairly treated. Ethnicity and tribalism can undermine national unity and make it difficult to develop a cohesive national identity.\n(iv)Fear of Majority Domination:Smaller ethnic groups often fear domination by larger ethnic groups, particularly in political and economic spheres. This fear can lead to resistance against central policies and increase demands for greater autonomy or even secession. The fear of majority domination exacerbates ethnic tensions and poses a threat to national unity.\n(v)Threat to National Unity/Integration:The combination of ethnic diversity, unequal resource distribution and political centralisation can threaten national unity and integration. Regional differences and feelings of marginalisation among certain groups can lead to calls for secession or increased autonomy and this can pose a significant challenge to maintaining a united and stable nation.\n(b) The following are features of Nigeria's Federalism:\n(i)Division of Powers between the Centre and Component Units:In Nigeria's federal system, powers are divided between the federal, state and local governments. This division is outlined in the constitution, specifying which powers are exclusive to the federal government, which are concurrent (shared between federal and state governments), and which are residual (left to the local government). This structure is intended to allow for a balance of power and ensure that all levels of government can function effectively.\n(ii)Existence of a Written and Rigid Constitution:Nigeria operates under a written constitution that clearly defines the structure, powers and functions of the government. The Constitution is considered rigid because it requires a complex process to amend, involving both federal and state legislatures. This rigidity ensures stability and predictability in the governance system, though it can also make adapting to new challenges more difficult.\n(iii)Supremacy of the Constitution:The Constitution is the supreme law of the land in Nigeria. All laws and actions by the government must conform to the Constitution, and any law or action that contravenes the Constitution can be declared invalid by the courts. This principle ensures that the government operates within a legal framework and protects the rights of the citizens.\n(iv)Existence of a Bicameral Legislature:Nigeria's federal system features a bicameral legislature at the federal level, consisting of the Senate and the House of Representatives. The Senate represents the states, with equal representation from each state, while the House of Representatives represents the population, with seats allocated based on population size. This structure aims to balance the interests of different regions and populations.\n(v)Existence of a Supreme Court:The Supreme Court of Nigeria is the highest judicial authority in the country. It has the power to interpret the Constitution and adjudicate disputes between the federal and state governments. The existence of the Supreme Court ensures that there is a final arbiter in legal and constitutional matters, maintaining the rule of law and the balance of power within the federal system.",
    "explanation": "(a) The following are some of the problems confronting Nigerian Federalism:\n(i)Problem of Acceptable Revenue Allocation Formula:The allocation of revenue among the different levels of government in Nigeria has been a contentious issue. The debate centres around the appropriate formula for distributing national revenue to ensure fairness among the federal, state and local governments. Disagreements over revenue sharing often lead to conflicts and accusations of favouritism.\n(ii)Over-concentration of Powers at the Centre:The federal system in Nigeria has historically seen a significant concentration of powers at the federal level. This centralisation limits the autonomy of state and local governments and reduces their ability to effectively manage local affairs. The over-centralisation of power often leads to inefficiencies as the federal government may be too far removed from local issues to address them effectively.\n(iii)Ethnicity and Tribalism:Nigeria is a diverse country with numerous ethnic groups, and ethnic and tribal loyalties often influence political decisions and alignments. This diversity can lead to ethnic tensions and conflicts especially when some groups are unfairly treated. Ethnicity and tribalism can undermine national unity and make it difficult to develop a cohesive national identity.\n(iv)Fear of Majority Domination:Smaller ethnic groups often fear domination by larger ethnic groups, particularly in political and economic spheres. This fear can lead to resistance against central policies and increase demands for greater autonomy or even secession. The fear of majority domination exacerbates ethnic tensions and poses a threat to national unity.\n(v)Threat to National Unity/Integration:The combination of ethnic diversity, unequal resource distribution and political centralisation can threaten national unity and integration. Regional differences and feelings of marginalisation among certain groups can lead to calls for secession or increased autonomy and this can pose a significant challenge to maintaining a united and stable nation.\n(b) The following are features of Nigeria's Federalism:\n(i)Division of Powers between the Centre and Component Units:In Nigeria's federal system, powers are divided between the federal, state and local governments. This division is outlined in the constitution, specifying which powers are exclusive to the federal government, which are concurrent (shared between federal and state governments), and which are residual (left to the local government). This structure is intended to allow for a balance of power and ensure that all levels of government can function effectively.\n(ii)Existence of a Written and Rigid Constitution:Nigeria operates under a written constitution that clearly defines the structure, powers and functions of the government. The Constitution is considered rigid because it requires a complex process to amend, involving both federal and state legislatures. This rigidity ensures stability and predictability in the governance system, though it can also make adapting to new challenges more difficult.\n(iii)Supremacy of the Constitution:The Constitution is the supreme law of the land in Nigeria. All laws and actions by the government must conform to the Constitution, and any law or action that contravenes the Constitution can be declared invalid by the courts. This principle ensures that the government operates within a legal framework and protects the rights of the citizens.\n(iv)Existence of a Bicameral Legislature:Nigeria's federal system features a bicameral legislature at the federal level, consisting of the Senate and the House of Representatives. The Senate represents the states, with equal representation from each state, while the House of Representatives represents the population, with seats allocated based on population size. This structure aims to balance the interests of different regions and populations.\n(v)Existence of a Supreme Court:The Supreme Court of Nigeria is the highest judicial authority in the country. It has the power to interpret the Constitution and adjudicate disputes between the federal and state governments. The existence of the Supreme Court ensures that there is a final arbiter in legal and constitutional matters, maintaining the rule of law and the balance of power within the federal system.",
    "year": "2019"
  },
  {
    "number": "345",
    "text": "(a) List three key members of the Nigerian Youth Movement (NYM)\n(b) Highlight four achievements of the Nigerian Youth Movement (NYM) in the political development of Nigeria",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57719?exam_type=waec&type=theory&page=69",
    "correct_answer": "(a) (i) H. O. Davies\n(ii) Ernest Ikoli\n(iii) J. C. Vaughan\n(iv) Samuel Akinsanya\n(v) Kofo Abayomi\n(b) (i) the movement won all the legislative seats allocated to Lagos in 1938\n(ii) it led to the struggle for national identity and political independence\n(iii) it helped to put pressure on the colonial government to speed up the constitutional development and independence of Nigeria\n(iv) the movement established a newspaper called Daily Service to create political awareness among the people of Nigeria\n(v) it fought for equality of opportunities for all Nigerians.",
    "explanation": "(a) (i) H. O. Davies\n(ii) Ernest Ikoli\n(iii) J. C. Vaughan\n(iv) Samuel Akinsanya\n(v) Kofo Abayomi\n(b) (i) the movement won all the legislative seats allocated to Lagos in 1938\n(ii) it led to the struggle for national identity and political independence\n(iii) it helped to put pressure on the colonial government to speed up the constitutional development and independence of Nigeria\n(iv) the movement established a newspaper called Daily Service to create political awareness among the people of Nigeria\n(v) it fought for equality of opportunities for all Nigerians.",
    "year": "2019"
  },
  {
    "number": "346",
    "text": "(a) What is the New Partnership for Africa's Development (NEPAD)\n(b) identify four objectives of the new Partnership for Africa's  Development (NEPAD)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57733?exam_type=waec&type=theory&page=70",
    "correct_answer": "a) What is the New Partnership for Africa's Development (NEPAD)?\nThe New Partnership for Africa's Development (NEPAD) is a strategic framework for the socio-economic and political development of Africa. It was established by the African Union in 2001. NEPAD addresses the continent's development challenges by promoting sustainable development, economic growth,and integration into the global economy. It focuses on key areas such as agriculture, infrastructure, education, health and governance, with the goal of reducing poverty, fostering socio-economic development and improving living standards across Africa.\n(b) Four Objectives of the New Partnership for Africa's Development (NEPAD) include:\n1.Promotion of Economic Development:NEPAD aims to promote economic growth and development. It seeks to create an environment conducive to investment and trade, which in turn can lead to job creation, increased income levels and improved living standards for the African population. The partnership focuses on ensuring that development is sustainable in the long term.\n3.Promoting Good Governance and Democracy:NEPAD emphasises the importance of good governance, democracy and human rights. It aims to strengthen institutions, promote transparency and reduce corruption, thereby creating a stable and predictable environment that is essential for development and investment.\n4.Upholding Democracy and Human Rights:NEPAD aims to promote the ideals of democracy, the rule of law and the protection of the fundamental human rights of Africans by ensuring that the African government upholds the standards set by the international community.\nOthers include:\n5. Achieving peace, security and stability in Africa\n6. Acceleration of the empowerment of women in Africa\n7. To make Africa attractive to both domestic and foreign investors",
    "explanation": "a) What is the New Partnership for Africa's Development (NEPAD)?\nThe New Partnership for Africa's Development (NEPAD) is a strategic framework for the socio-economic and political development of Africa. It was established by the African Union in 2001. NEPAD addresses the continent's development challenges by promoting sustainable development, economic growth,and integration into the global economy. It focuses on key areas such as agriculture, infrastructure, education, health and governance, with the goal of reducing poverty, fostering socio-economic development and improving living standards across Africa.\n(b) Four Objectives of the New Partnership for Africa's Development (NEPAD) include:\n1.Promotion of Economic Development:NEPAD aims to promote economic growth and development. It seeks to create an environment conducive to investment and trade, which in turn can lead to job creation, increased income levels and improved living standards for the African population. The partnership focuses on ensuring that development is sustainable in the long term.\n3.Promoting Good Governance and Democracy:NEPAD emphasises the importance of good governance, democracy and human rights. It aims to strengthen institutions, promote transparency and reduce corruption, thereby creating a stable and predictable environment that is essential for development and investment.\n4.Upholding Democracy and Human Rights:NEPAD aims to promote the ideals of democracy, the rule of law and the protection of the fundamental human rights of Africans by ensuring that the African government upholds the standards set by the international community.\nOthers include:\n5. Achieving peace, security and stability in Africa\n6. Acceleration of the empowerment of women in Africa\n7. To make Africa attractive to both domestic and foreign investors",
    "year": "2019"
  },
  {
    "number": "347",
    "text": "(a) List three contributions of the National Congress of British West Africa (NCBWA) to the nationalist struggle\n(b) identify four contributions of Nnamdi Azikwe to the nationalist struggle of Nigeria",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/government/57758?exam_type=waec&type=theory&page=70",
    "correct_answer": "(a) (i) Brought the four British West African territories together to fight for self government\n(ii) it sent a delegation to London to press home demands for certain key reforms in their respective territories\n(iii) the congress awakened the political consciousness of the people through newspaper publications, seminars, public/town hall meetings\n(iv) it demanded and fought for electoral reforms/elective principle\n(v) demanded the Africanization of the civil service\n(b) (I) He founded different newspapers to help propagate nationalism in Nigeria\n(ii) Zik Group established these newspapers in political and economical important cities throughout the country to whip up the interest and enthusiasm of the populace as well as the direction of the independence struggle\n(iii)He co-founded the National Council of Nigeria and the Cameroons (NCNC)\n(iv) Zik's opposition to Richard's constitution of 1946 which sought to increase only by four, African representations on the legislative council with the rest being nominated by the Governor\n(v) his opposition to Richard's constitution led to the promulgation of Macpherson constitution.",
    "explanation": "(a) (i) Brought the four British West African territories together to fight for self government\n(ii) it sent a delegation to London to press home demands for certain key reforms in their respective territories\n(iii) the congress awakened the political consciousness of the people through newspaper publications, seminars, public/town hall meetings\n(iv) it demanded and fought for electoral reforms/elective principle\n(v) demanded the Africanization of the civil service\n(b) (I) He founded different newspapers to help propagate nationalism in Nigeria\n(ii) Zik Group established these newspapers in political and economical important cities throughout the country to whip up the interest and enthusiasm of the populace as well as the direction of the independence struggle\n(iii)He co-founded the National Council of Nigeria and the Cameroons (NCNC)\n(iv) Zik's opposition to Richard's constitution of 1946 which sought to increase only by four, African representations on the legislative council with the rest being nominated by the Governor\n(v) his opposition to Richard's constitution led to the promulgation of Macpherson constitution.",
    "year": "2019"
  }
]