[
  {
    "number": "166",
    "text": "(a) Narrate the second creation story.\n \n(b) In what four ways did God provide comfort for man?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51789?exam_type=waec&type=theory&page=34",
    "correct_answer": "(a) In the day that God made the earth and the heavens, the earth was covered with mist and water covered the whole face of the ground. Then, the Lord formed man out of the dust of the earth and breathed the breath of life into his nostrils. God planted the Garden of Eden and put man there. In addition to the garden, God caused trees to grow and provide shelter and a source of food to man. God also planted the tree of life, and the tree of the knowledge of good and evil in the midst of the garden. He caused a river, which was divided into four, to surround the garden and supply water to it. Man was given the liberty to till the garden and was also allowed to eat freely of the trees except the tree of the knowledge of good and evil to avoid spiritual death. God saw the need to find a helpmate for man, since it is not good for man to stay alone. God gave man the authority to name beast, birds and all crawling animals he has created. God caused a deep sleep to befall man and made a woman out of his ribs for Adam. Man recognized his similarity with the woman and called her woman because she was created out of his rib.\n(b) God provide comfort for man in the following ways:\n(i) Provision of water to give constant supply to the garden.\n(ii) Provision of trees, beasts and birds for food among others.\n(iii) God also provided suitable environment in the garden of Eden.\n(iv) He further gave them authority over all other creation, and also gave them names.\n(v) God made a suitable partner for Adam in the person of 'Eve'.",
    "explanation": "(a) In the day that God made the earth and the heavens, the earth was covered with mist and water covered the whole face of the ground. Then, the Lord formed man out of the dust of the earth and breathed the breath of life into his nostrils. God planted the Garden of Eden and put man there. In addition to the garden, God caused trees to grow and provide shelter and a source of food to man. God also planted the tree of life, and the tree of the knowledge of good and evil in the midst of the garden. He caused a river, which was divided into four, to surround the garden and supply water to it. Man was given the liberty to till the garden and was also allowed to eat freely of the trees except the tree of the knowledge of good and evil to avoid spiritual death. God saw the need to find a helpmate for man, since it is not good for man to stay alone. God gave man the authority to name beast, birds and all crawling animals he has created. God caused a deep sleep to befall man and made a woman out of his ribs for Adam. Man recognized his similarity with the woman and called her woman because she was created out of his rib.\n(b) God provide comfort for man in the following ways:\n(i) Provision of water to give constant supply to the garden.\n(ii) Provision of trees, beasts and birds for food among others.\n(iii) God also provided suitable environment in the garden of Eden.\n(iv) He further gave them authority over all other creation, and also gave them names.\n(v) God made a suitable partner for Adam in the person of 'Eve'.",
    "year": "2003"
  },
  {
    "number": "167",
    "text": "(a) Describe David's reaction to the death of the child born to him by Bathsheba.\n \n(b) What two lessons can be learnt from this reaction?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51790?exam_type=waec&type=theory&page=34",
    "correct_answer": "David committed adultery with Bathsheba, Uriah's wife and had a child. For this, God was displeased. God sent prophet Nathan who decreed the death of the child and the child was struck with sickness. When David realised that God was displeased with his act, he interceded for the life of the child and fasted and laid upon the ground. The intercession and admonition of the elders did not change God's anger, and the child died on the seventh day. Out of fright, the servants could not report to David lest he harmed himself. The news of the death of his son was later reported to him. On hearing the news, he arose and had his bath, anointed himself and changed his apparel. He later went to the temple, worshipped God for answering his prayer and requested for food. His servants were surprised at his behaviour. David fasted and wept so that God would reverse his intention to take the son's life. Unfortunately, the child died and he thought fasting is no more necessary. David summed up his courage and believed that He could go to the child but the child could no more come to him.\n(b) God reserves the right to give and take anything from us at will. Again all human beings should submit himself to the will of God. In every situation we find ourselves we should give God praise",
    "explanation": "David committed adultery with Bathsheba, Uriah's wife and had a child. For this, God was displeased. God sent prophet Nathan who decreed the death of the child and the child was struck with sickness. When David realised that God was displeased with his act, he interceded for the life of the child and fasted and laid upon the ground. The intercession and admonition of the elders did not change God's anger, and the child died on the seventh day. Out of fright, the servants could not report to David lest he harmed himself. The news of the death of his son was later reported to him. On hearing the news, he arose and had his bath, anointed himself and changed his apparel. He later went to the temple, worshipped God for answering his prayer and requested for food. His servants were surprised at his behaviour. David fasted and wept so that God would reverse his intention to take the son's life. Unfortunately, the child died and he thought fasting is no more necessary. David summed up his courage and believed that He could go to the child but the child could no more come to him.\n(b) God reserves the right to give and take anything from us at will. Again all human beings should submit himself to the will of God. In every situation we find ourselves we should give God praise",
    "year": "2003"
  },
  {
    "number": "168",
    "text": "(a) Trace the events that led to Elijah's pronouncement of draught in Israel.\n \n(b) What two lessons can be learnt fron the action of Elijah?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51792?exam_type=waec&type=theory&page=34",
    "correct_answer": "From the story, it is revealed that when Ahab, son of Omri became the king of Israel in the thirty-eight year of Asa, King of Judah. He turned away from Jehovah's commandment and did evil in the sight of the Lord more than all his predecessors, he also walked in the sins of Jeroboam the son of Nebat. After taking Jezebel, daughter of Ethbaal, King of Sidon as wife. Jezebel introduced the worship of Baal which Ahab approved and worshipped. King Ahab later built an altar for Baal and also made Asherah. Ahab institutionalized the worship of Baal made it a national religion in Israel and people were forced to comply with his directives. People that did not worship Baal were persecuted. God became angry and sent Prophet Elijah, who then pronounced, drought in the name of the Lord.\n(b) Elijah's action shows that the weakness of a leader may ruin a nation, Ahab's weakness enabled Jezebel to replace Yahwism with Baalism as the national religion. God is always on hand to defend course hence the call on Elijah to defend Yahwism. Most people still have moral courage to challenge unpopular authority, most inter-religious marriage has its consequences.",
    "explanation": "From the story, it is revealed that when Ahab, son of Omri became the king of Israel in the thirty-eight year of Asa, King of Judah. He turned away from Jehovah's commandment and did evil in the sight of the Lord more than all his predecessors, he also walked in the sins of Jeroboam the son of Nebat. After taking Jezebel, daughter of Ethbaal, King of Sidon as wife. Jezebel introduced the worship of Baal which Ahab approved and worshipped. King Ahab later built an altar for Baal and also made Asherah. Ahab institutionalized the worship of Baal made it a national religion in Israel and people were forced to comply with his directives. People that did not worship Baal were persecuted. God became angry and sent Prophet Elijah, who then pronounced, drought in the name of the Lord.\n(b) Elijah's action shows that the weakness of a leader may ruin a nation, Ahab's weakness enabled Jezebel to replace Yahwism with Baalism as the national religion. God is always on hand to defend course hence the call on Elijah to defend Yahwism. Most people still have moral courage to challenge unpopular authority, most inter-religious marriage has its consequences.",
    "year": "2003"
  },
  {
    "number": "169",
    "text": "Explain Isaiah's prophecy to the rulers and people of Israel on the worthlessness of empty rituals",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51794?exam_type=waec&type=theory&page=34",
    "correct_answer": "Prophet Isaiah addressed rulers and the people of Israel and called upon them to listen to the teaching and the commandments of God and his divine will. The man of God was equally worried about the genuineness of their rituals, their sacrifices and their burnt offerings. The prophet of God stated that God was tired of their wrong doings, He was not interested in their sacrifices of blood of animals. He advised that they should worship God in the temple and approach God with cleanliness and holiness of heart, not with incense or offerings. God equally stated that their new moon, Sabbath, and other festive occasions were no longer pleasing to the Lord. The prophet put it to them that when they spread their hands in prayer, what God saw were their blood-stained hands.\nAccording to the prophet, God will no longer have respect for their prayers. However, the prophet of God put it that to avert God's anger they were required to make themselves spiritually clean and remove all evil from their lives, in addition to that, they must pursue righteousness and justice, and stop all oppression of the poor. They were also advised to defend the fatherless, and plead the cause of widows The prophet sounded a note of hope that God was still interested in their plight if they are ready to change. The man of God added that should they come to repentance, God will forgive their sins no matter the nature of the sins. The prophet assured them that if they were willing and obedient to do the divine will of God, God will restore them to enjoy the fruits of their land and its full benefits. The prophet warned them on the dangers of sin and how they would be devoured by the sword.",
    "explanation": "Prophet Isaiah addressed rulers and the people of Israel and called upon them to listen to the teaching and the commandments of God and his divine will. The man of God was equally worried about the genuineness of their rituals, their sacrifices and their burnt offerings. The prophet of God stated that God was tired of their wrong doings, He was not interested in their sacrifices of blood of animals. He advised that they should worship God in the temple and approach God with cleanliness and holiness of heart, not with incense or offerings. God equally stated that their new moon, Sabbath, and other festive occasions were no longer pleasing to the Lord. The prophet put it to them that when they spread their hands in prayer, what God saw were their blood-stained hands.\nAccording to the prophet, God will no longer have respect for their prayers. However, the prophet of God put it that to avert God's anger they were required to make themselves spiritually clean and remove all evil from their lives, in addition to that, they must pursue righteousness and justice, and stop all oppression of the poor. They were also advised to defend the fatherless, and plead the cause of widows The prophet sounded a note of hope that God was still interested in their plight if they are ready to change. The man of God added that should they come to repentance, God will forgive their sins no matter the nature of the sins. The prophet assured them that if they were willing and obedient to do the divine will of God, God will restore them to enjoy the fruits of their land and its full benefits. The prophet warned them on the dangers of sin and how they would be devoured by the sword.",
    "year": "2003"
  },
  {
    "number": "170",
    "text": "(a) Highlight Jesus' sermon on the mount under the following headings: (i) treasures; (ii) the sound eye; (iii) Serving of two masters. \n \n(b) Give two reasons why misuse of earthly wealth can lead to serious consequences for a nation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51796?exam_type=waec&type=theory&page=34",
    "correct_answer": "(a)Treasures: Jesus taught the multitude on the need to lay up treasures in heaven where moth and rust will not consume and where thieves will not break in and steal. He warned them against laying up treasure on earth where thieves and moth will break in and steal. This admonition was necessary because where one's treasures is, there would be his heart also. Sound Eyes: Jesus was of the view that the eye is the lamp of the body. Jesus taught them that if the eye is sound, the whole body will be full of light. On the contrary, if the eye is not sound, the whole body will be full of darkness, they were to be careful that if the light in them is darkness, the darkness would be awesome. Two Masters: Jesus taught them that it is not possible for one person to serve two masters, since he will either hate one and love the other, or be devoted to one and despise another. Jesus admonished them to serve God rather than mammon.\n(b) Misuse of earthly wealth can lead to serious consequence for a nation. Going by Jesus teaching, earthly wealth.is synonymous with mammon and abuse of it leads to extreme selfishness and lack of concern for others and this will bring about suffering to the entire nation. Outright use of earthly wealth leads to the worship of materialism. When this happens, such a nation loses its spiritual balance, becomes ungodly and gradually degenerates until it perishes like Sodom and Gomorrah. Misuse of earthly wealth widens the gap between the rich and the poor. Oppression of the poor by the rich will become the order of the day. In social parlance, the situation brings about general underdevelopment since the wealth of the nation is not well utilized.",
    "explanation": "(a)Treasures: Jesus taught the multitude on the need to lay up treasures in heaven where moth and rust will not consume and where thieves will not break in and steal. He warned them against laying up treasure on earth where thieves and moth will break in and steal. This admonition was necessary because where one's treasures is, there would be his heart also. Sound Eyes: Jesus was of the view that the eye is the lamp of the body. Jesus taught them that if the eye is sound, the whole body will be full of light. On the contrary, if the eye is not sound, the whole body will be full of darkness, they were to be careful that if the light in them is darkness, the darkness would be awesome. Two Masters: Jesus taught them that it is not possible for one person to serve two masters, since he will either hate one and love the other, or be devoted to one and despise another. Jesus admonished them to serve God rather than mammon.\n(b) Misuse of earthly wealth can lead to serious consequence for a nation. Going by Jesus teaching, earthly wealth.is synonymous with mammon and abuse of it leads to extreme selfishness and lack of concern for others and this will bring about suffering to the entire nation. Outright use of earthly wealth leads to the worship of materialism. When this happens, such a nation loses its spiritual balance, becomes ungodly and gradually degenerates until it perishes like Sodom and Gomorrah. Misuse of earthly wealth widens the gap between the rich and the poor. Oppression of the poor by the rich will become the order of the day. In social parlance, the situation brings about general underdevelopment since the wealth of the nation is not well utilized.",
    "year": "2003"
  },
  {
    "number": "171",
    "text": "(a) Explain how Jesus healed the Demoniac.\n \n(b) Give two reasons why the devils were sent into the swine.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51799?exam_type=waec&type=theory&page=35",
    "correct_answer": "(a). When Jesus and his disciples arrived at the land of the Gerasenes which is opposite Galilee, there was a man who had demons. Before now, the man had lived naked in a cemetery. When he met Jesus, he fell down before Jesus and cried with a loud voice, and begged him not to torment him, for the demon that torment him was violent so much that it drives him into the desert. As the Demoniac broke the fetters of iron; Jesus asked to know his name, when he answered Legion, for many demons had entered him. The demons in him implore Jesus not to send them into the abyss, but demanded that they be sent to the hill side, where a large herd of swine were feeding. As Jesus obliged, the demons immediately left the man and entered the swine, the swine rushed into the lake and got drowned. The shepherd were worried and fled to report what they saw. The demoniac was later seen beside Jesus, well dressed and full of confidence. Most people that saw what happened were terrified, while eye witnesses narrated their story to others. On seeing Jesus miracle, the inhabitants of Gerasenes sought to expel Jesus from their land because they were afraid. Jesus left the neighbourhood by a boat. When the demoniac insisted on going with Jesus he refused and entreated him to go declare the goodnews of what God has done.\n(b) God had to send the demons into the swine because they were evil that must be destroyed. The Jews also regarded the swine as unclean animals that were not tolerated. Therefore, Jesus merely used an evil to destroy another one. Jesus would not allow the demoniac to go with him since he wanted his fame to spread abroad.",
    "explanation": "(a). When Jesus and his disciples arrived at the land of the Gerasenes which is opposite Galilee, there was a man who had demons. Before now, the man had lived naked in a cemetery. When he met Jesus, he fell down before Jesus and cried with a loud voice, and begged him not to torment him, for the demon that torment him was violent so much that it drives him into the desert. As the Demoniac broke the fetters of iron; Jesus asked to know his name, when he answered Legion, for many demons had entered him. The demons in him implore Jesus not to send them into the abyss, but demanded that they be sent to the hill side, where a large herd of swine were feeding. As Jesus obliged, the demons immediately left the man and entered the swine, the swine rushed into the lake and got drowned. The shepherd were worried and fled to report what they saw. The demoniac was later seen beside Jesus, well dressed and full of confidence. Most people that saw what happened were terrified, while eye witnesses narrated their story to others. On seeing Jesus miracle, the inhabitants of Gerasenes sought to expel Jesus from their land because they were afraid. Jesus left the neighbourhood by a boat. When the demoniac insisted on going with Jesus he refused and entreated him to go declare the goodnews of what God has done.\n(b) God had to send the demons into the swine because they were evil that must be destroyed. The Jews also regarded the swine as unclean animals that were not tolerated. Therefore, Jesus merely used an evil to destroy another one. Jesus would not allow the demoniac to go with him since he wanted his fame to spread abroad.",
    "year": "2003"
  },
  {
    "number": "172",
    "text": "(a) Describe the miracle of \"walking on the sea\", according to Mark.\n \n(b) In what two ways is this miracle significant?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51800?exam_type=waec&type=theory&page=35",
    "correct_answer": "(a). Jesus directed his disciples to get into the boat and go before him to the other side, after feeding the five thousand. This was done to dismiss the crowd, Jesus later went to the mountain to pray. In the evening, the boat was already out on the sea while Jesus was alone on the land, Jesus got to know that the wind was blowing against the boat at the fourth watch, Jesus walked on the sea when there was no boat to convey him.When the disciples noticed Jesus as he was approaching them they were afraid because they thought he was a ghost. They therefore cried out. Jesus assured them - to take heart and not to exercise any fear since the person on the sea is him. Soon, Jesus entered the boat while the wind ceased instantly.\n(b) From the story, it is clear that Jesus had openly manifested himself to his disciples as the son of God (Messiah), by walking on the sea, He demonstrated that he has power over nature. Jesus disciples exhibited lack of faith when they became surprise at seeing Jesus walking on the sea.",
    "explanation": "(a). Jesus directed his disciples to get into the boat and go before him to the other side, after feeding the five thousand. This was done to dismiss the crowd, Jesus later went to the mountain to pray. In the evening, the boat was already out on the sea while Jesus was alone on the land, Jesus got to know that the wind was blowing against the boat at the fourth watch, Jesus walked on the sea when there was no boat to convey him.When the disciples noticed Jesus as he was approaching them they were afraid because they thought he was a ghost. They therefore cried out. Jesus assured them - to take heart and not to exercise any fear since the person on the sea is him. Soon, Jesus entered the boat while the wind ceased instantly.\n(b) From the story, it is clear that Jesus had openly manifested himself to his disciples as the son of God (Messiah), by walking on the sea, He demonstrated that he has power over nature. Jesus disciples exhibited lack of faith when they became surprise at seeing Jesus walking on the sea.",
    "year": "2003"
  },
  {
    "number": "173",
    "text": "(a) Narrate the events on the Day of Pentecost.\n \n(b) State two ways in which the Holy Spirit still influences the life of Christians today.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51805?exam_type=waec&type=theory&page=35",
    "correct_answer": "(a) The disciples were together in one place on the day of Pentecost, when a sound came from heaven and filled the Suddenly there appeared on their heads tongues as of fire. The disciples were filled with Holy spirit and they as the spirit led them. Various people who dwelt in Jerusalem as well as the disciples also spoke in tongues. people who heard them were amazed, and were forced to asked whether the disciples were not all Galileans and wondered why they all spoke in diverse tongues. Some by standers mocked them that the disciples were drunk. .\n(b) Through the Holy spirit, active evangelism still goes on today. Former citadels of atheism are crumbling giving way to acceptance of the Gospel. The Holy spirit is still assisting the world which has gone crazy with hatred, envy, man's inhumanity to man, indiscipline, murder, corruption. etc, The Holy Spirit, is recognized as the lonely voice in the wilderness, appealing to human conscience to be more humane and ensure survival of human race. The Holy Spirit, is helping through the building of hospital, homes for poor and aged. In spite of economic recessions, the Holy spirit still des the church with the strength to carry on. Through the Holy Spirit miracle of healing are daily being recorded in Churches and hospitals.",
    "explanation": "(a) The disciples were together in one place on the day of Pentecost, when a sound came from heaven and filled the Suddenly there appeared on their heads tongues as of fire. The disciples were filled with Holy spirit and they as the spirit led them. Various people who dwelt in Jerusalem as well as the disciples also spoke in tongues. people who heard them were amazed, and were forced to asked whether the disciples were not all Galileans and wondered why they all spoke in diverse tongues. Some by standers mocked them that the disciples were drunk. .\n(b) Through the Holy spirit, active evangelism still goes on today. Former citadels of atheism are crumbling giving way to acceptance of the Gospel. The Holy spirit is still assisting the world which has gone crazy with hatred, envy, man's inhumanity to man, indiscipline, murder, corruption. etc, The Holy Spirit, is recognized as the lonely voice in the wilderness, appealing to human conscience to be more humane and ensure survival of human race. The Holy Spirit, is helping through the building of hospital, homes for poor and aged. In spite of economic recessions, the Holy spirit still des the church with the strength to carry on. Through the Holy Spirit miracle of healing are daily being recorded in Churches and hospitals.",
    "year": "2003"
  },
  {
    "number": "174",
    "text": "How did Paul prove to the Galatians that Christians are children of God?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51807?exam_type=waec&type=theory&page=35",
    "correct_answer": "The notion that Christians were children of God was clearly shown in Paul's teaching on faith. His teaching further showed that the Christian were no longer held under the law. According to him, all Christians are sons of God through faith in Christ Jesus, baptism to them means putting on Christ. To them there is no discrimination (neither Jew nor Greek, neither male nor female, neither slave nor free born) to any believer in Christ Jesus. He held the view that if we all Christ we are all Abraham offspring and heirs, because of the provision of the promise and the covenant. According to Paul, their sonship can be compared to a slave who owns the estate, but could not exercise control because he is held bound by the guardian. At appointed time, God sent His son born of a woman to liberate those who were held under the law. This redemption, enabled them to to be adopted as sons and have their freedom. On our adoption as sons through faith, we receive the spirit of His son in our hearts, since we are redeemed through Christ, we seize to become slaves but sons of God and fellow heirs of the kingdom. .",
    "explanation": "The notion that Christians were children of God was clearly shown in Paul's teaching on faith. His teaching further showed that the Christian were no longer held under the law. According to him, all Christians are sons of God through faith in Christ Jesus, baptism to them means putting on Christ. To them there is no discrimination (neither Jew nor Greek, neither male nor female, neither slave nor free born) to any believer in Christ Jesus. He held the view that if we all Christ we are all Abraham offspring and heirs, because of the provision of the promise and the covenant. According to Paul, their sonship can be compared to a slave who owns the estate, but could not exercise control because he is held bound by the guardian. At appointed time, God sent His son born of a woman to liberate those who were held under the law. This redemption, enabled them to to be adopted as sons and have their freedom. On our adoption as sons through faith, we receive the spirit of His son in our hearts, since we are redeemed through Christ, we seize to become slaves but sons of God and fellow heirs of the kingdom. .",
    "year": "2003"
  },
  {
    "number": "175",
    "text": "(a) What were Paul's views in his letter to the Colossians on interpersonal relationships in the Christian family?\n \n(b) Mention four ways of avoiding conflicts in the family",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51810?exam_type=waec&type=theory&page=35",
    "correct_answer": "(a) Paul's teaching on this chapter was basically on the need for wives to be subject to their husbands, since this is what God expects from Christians (The man represents God as the Head of family). He also admonished the husband to love their wives by being humane and kind to them. To children, he urged them to obey their parents in everything for by so doing, they please God, Paul warned fathers against provoking their children lest they become violent. In the same vein he adviced slaves to obey their earthly masters in everything not with eye service but in singleness of heart, their service should be with the fear of God, since God will reward their faithful service.\n(b) The husband and wife should act as a role model by religiously playing their expected roles for the children to emulate. The couples should strive to understand themselves by making peace at all times. Fathers should be tolerant with their spouses. Again, parents should be counseling their children and not provoking them to avoid conflict, the family must develop prayer life. Parents should bless their children rather than cursing them, they should exercise prudence in their financial dealings and avoid cursing the children.",
    "explanation": "(a) Paul's teaching on this chapter was basically on the need for wives to be subject to their husbands, since this is what God expects from Christians (The man represents God as the Head of family). He also admonished the husband to love their wives by being humane and kind to them. To children, he urged them to obey their parents in everything for by so doing, they please God, Paul warned fathers against provoking their children lest they become violent. In the same vein he adviced slaves to obey their earthly masters in everything not with eye service but in singleness of heart, their service should be with the fear of God, since God will reward their faithful service.\n(b) The husband and wife should act as a role model by religiously playing their expected roles for the children to emulate. The couples should strive to understand themselves by making peace at all times. Fathers should be tolerant with their spouses. Again, parents should be counseling their children and not provoking them to avoid conflict, the family must develop prayer life. Parents should bless their children rather than cursing them, they should exercise prudence in their financial dealings and avoid cursing the children.",
    "year": "2003"
  },
  {
    "number": "176",
    "text": "How did Paul use the case of Onesimus to emphasize the concept of forgiveness?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51814?exam_type=waec&type=theory&page=36",
    "correct_answer": "Paul believed that Philemon's slave, Onesimus, had run away, with goods stolen from his master and later sought refuge in Rome where he met Paul in prison. Apostle Paul wrote a letter seeking forgiveness for his runaway slave to Philemon. Since Paul converted Philemon, he would have expected him to oblige his request and abide by his will, but because of his conviction it would be wrong to assume such authority over his spiritual son, ( Philemon). He rather preferred to write him not as a command but with a spirit of love and persuasion, on behalf of Onesimus who had become his (Paul's) own son in Christ. His letter was necessary since Onesimus has become a born-again Christian. Paul taught it wise to send Onesimus back to Philemon with love. Ordinarily he would have liked to retain Onesimus as his assistant, but he rather opted to send him to his master. Since it was Paul's strong conviction that Onesimus departure from Philemon was for his moral and spiritual growth,now that forgiveness is in place there would be permanent reconciliation between Master and slave. Onesimus would now be accepted back as a Christian brother not as a slave.Paul believed that if Philemon still regarded him as a true Christian partner and brother, he should extend a similar regard to Onesimus and accepted his claim to undertake all outstanding bills that Onesimus must have owed him, with the view to paying them. Paul believed that if his plea to Philemon for Onesimus should succeed he would be spiritually refreshed.",
    "explanation": "Paul believed that Philemon's slave, Onesimus, had run away, with goods stolen from his master and later sought refuge in Rome where he met Paul in prison. Apostle Paul wrote a letter seeking forgiveness for his runaway slave to Philemon. Since Paul converted Philemon, he would have expected him to oblige his request and abide by his will, but because of his conviction it would be wrong to assume such authority over his spiritual son, ( Philemon). He rather preferred to write him not as a command but with a spirit of love and persuasion, on behalf of Onesimus who had become his (Paul's) own son in Christ. His letter was necessary since Onesimus has become a born-again Christian. Paul taught it wise to send Onesimus back to Philemon with love. Ordinarily he would have liked to retain Onesimus as his assistant, but he rather opted to send him to his master. Since it was Paul's strong conviction that Onesimus departure from Philemon was for his moral and spiritual growth,now that forgiveness is in place there would be permanent reconciliation between Master and slave. Onesimus would now be accepted back as a Christian brother not as a slave.Paul believed that if Philemon still regarded him as a true Christian partner and brother, he should extend a similar regard to Onesimus and accepted his claim to undertake all outstanding bills that Onesimus must have owed him, with the view to paying them. Paul believed that if his plea to Philemon for Onesimus should succeed he would be spiritually refreshed.",
    "year": "2003"
  },
  {
    "number": "177",
    "text": "(a) Why did Peter advise Christians to rejoice despite the trials they may be going through?\n \n(b) State two virtues which Christians should manifest to show their joy.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51815?exam_type=waec&type=theory&page=36",
    "correct_answer": "(a) Since the hope of Glory that awaits the Christian was enormous because of the resurrection from the death of Jesus, Paul exhorts them to rejoice. He adviced them not to lay claim to the present life which might be limited by trials and persecution, since such trials are mere test of their faith. According to him, they should have confidence in the fact Jesus himself passed through greater suffering than they were passing through.\nTheir suffering will make them reap the great reward of salvation when Jesus is revealed to them. For them to gain Insight of this hope (of salvation) they should live holy lives, having the knowledge that God, the impartial Judge, would reward their suffering.\nHe equally stated that if they are cursed for the sake of Christ, they shall count themselves blessed since they are not suffering as murderers, thieves or for any wrong-doing, they should glorify God for their tribulation. According to Paul, if judgement would begin in the church, the fate of the unbelievers would be unbearable.\n(b) Christians should desist from the carnal nature of the men of this world.They should remain sober expectant of the salvation and glory that would be theirs when Jesus shall be revealed to them. Total submission and reverence to God should guard them jealously since God is an important judge. They should be steadfast in their Christian faith, and refused to be shaken by the cares of this world and the machination of the enemy, giving praises to God in bad times and in the season of Joy should always be part of their lives.",
    "explanation": "(a) Since the hope of Glory that awaits the Christian was enormous because of the resurrection from the death of Jesus, Paul exhorts them to rejoice. He adviced them not to lay claim to the present life which might be limited by trials and persecution, since such trials are mere test of their faith. According to him, they should have confidence in the fact Jesus himself passed through greater suffering than they were passing through.\nTheir suffering will make them reap the great reward of salvation when Jesus is revealed to them. For them to gain Insight of this hope (of salvation) they should live holy lives, having the knowledge that God, the impartial Judge, would reward their suffering.\nHe equally stated that if they are cursed for the sake of Christ, they shall count themselves blessed since they are not suffering as murderers, thieves or for any wrong-doing, they should glorify God for their tribulation. According to Paul, if judgement would begin in the church, the fate of the unbelievers would be unbearable.\n(b) Christians should desist from the carnal nature of the men of this world.They should remain sober expectant of the salvation and glory that would be theirs when Jesus shall be revealed to them. Total submission and reverence to God should guard them jealously since God is an important judge. They should be steadfast in their Christian faith, and refused to be shaken by the cares of this world and the machination of the enemy, giving praises to God in bad times and in the season of Joy should always be part of their lives.",
    "year": "2003"
  }
]