[
  {
    "number": "56",
    "text": "1. Study Specimens B, C and D and answer questions 1(a) To 1(f).\n(a) i) Place two drops of specimen B on a white tile and add two drops of iodine solution.\nComplete the table below with the test, observation and inference:\n\n\n\n\ntest\n\nobservation\n\ninference\n\n\n\n \n \n \n\n\n\n(aii) Put 5 ml of specimen B into a test tube and add 2 ml of sodium hydroxide solution followed by three drops of copper (ii) tetraoxosulphate (VI) solution and shake Complete the table below with the test, observation and inference.\n\n\n\n\ntest\n\nobservation\n\ninference\n\n\n\n \n \n \n\n\n\n(b) Give the name of each of the tests in 1(a)i) and 1(a)(ii). (i) ____________   (ii) _____________\n(c) State two ways by which specimen C is of economic importance.\n(d)(i) Name the Kingdom to (1) (ii) which specimen C belongs. (ii) State three reasons for the. answer in 1(d)(i). (iii) Name four other organisms that belong to the same Kingdom as specimen C.\n(ei) Name the Phylum to which specimen D belongs. (ii) State three reasons for the answer in 1(d)(i).\n(f)(i) Explain briefly the role of specimen C in nutrient cycling. (ii) What is the mode of nutrition of specimen C.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60255?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "58",
    "text": "Study Specimens E, F, and H and answer questions 2(a) to 2(f).\n(a) What types of fruits are specimens E, F, and H?\nE: _________   F:_________  H: ___________\n(b) Name the types of placentation possessed by each of specimens E, F and H:\n(c) Name one agent of dispersal each of specimens E, F and H? E: H: F: F:\n(d)(i) Explain briefly how specimen E is dispersed. (ii) State two types of nutrients present in specimen E.\n(e)(i) What is the color of specimen H? (ii) What does the color of specimen H signify?\n(f) Using the scalpel/blunt knife provided, cut open specimen H along the line of split from one side only.\n(i) Name the type of placentation found in specimen H.\n(ii) Make a drawing, 6 cm to 8 cm long of the two split halves of specimen H while still joined at one length and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60284?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "59",
    "text": "Study Specimens P, Q and R and answer questions 4(a) to 4(d).\n(a) Use the information below to complete the following table. (i) Add two drops of specimen P into a beaker containing water, leave it undisturbed and note the time it completely disperses in water. (ii) Add a leveled teaspoonful of specimen Q into another beaker containing water, stir for one second and note the time it takes to completely dissolve. (iii) Cut open specimen R and note the time the odor was perceived. (iv) Give the medium of spread for each of the tests in 4(a)(i) to 4(a) i).\n(v) Name the sense organ in humans involved in each of the observations in 4(a)(i) to 4(a)(iii).\n\n\n\nspecimen\nTest\nObservation time(sec)\nMedium of spread\nsense organ\n\n\n \n \n \n \n \n\n\n \n \n \n \n \n\n\n \n \n \n \n \n\n\n\n(b) Name the biological phenomenon that occurred in 4(a)(iii).\n(c) State two factors each that will increase the rate of the phenomenon named in 4(b) for each of the activities in 4(a)(i). (ii) and (iii)\n(i) _____________  (ii)  _____________  (iii) _____________\n(d) Gently place your thumb on the inked stamp pad provided. (i) Neatly thumbprint clearly showing the pattern in the box below.\n\n\n\n \n\n\n\n(ii) Name the type of pattern in the fingerprint in 4(e)(i).\n(iii) List three other types of fingerprints. (iv) State three advantages of fingerprints.\n(v) What type of variation is fingerprint?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60285?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  }
]