[
  {
    "number": "17",
    "text": "The diagram above illustrates an experimental setup to determine a soil property.\nStudy them carefully and answer the question that follows;\n(a) Suggest a suitable title for the experiment. [1 mark]\n(b) Outline the procedure for carrying out the experiment.[ 7 marks]\n(c) identify the soil samples in diagrams 1, Il, and ll\n(d) State two precautions to be taken when carrying out the experiment.[ 2 marks )\n(e)(i) Which of the soil samples is prone to waterlogging? \n(ii) Give one reason four your answer in (e)(i)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59720?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "18",
    "text": "Study specimens A (RANGING POLE), B (SURVEY PIN) and C (MEASURING TAPE) carefully and answer the following question.\n(a) Describe specimen A. (3 mark)\n(b) State two uses each of the specimens A, B and C.\n(c) State two ways of maintaining each of specimens A, B, and C",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59721?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "19",
    "text": "Study specimens G (GRASSHOPPER), H (BEAN BEETLE), I (BIRD), and J (RAT) carefully and answer the following questions.\n(a)(i) Classify specimens G and H according to their feeding habits.\n(ii) Name one part of crops damaged by each of specimens G and H.\n(ii) State three ways in which specimen H is economically important. (3 marks ]\n \n(b) State four ways of controlling each of specimens I and J",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59722?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "20",
    "text": "Study specimens N (BONE), 0 (EGG), P (ROUNDWORM) and Q (TICK) carefully and answer the following questions.\n(a) Name three industries that use each of specimens N and O\n(b) State five effects of specimen P on the host. (5 marks ]\n(c) State four ways of controlling specimen Q on the farm. [4 marks)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59723?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  }
]