[
  {
    "number": "1683",
    "text": "Which of the following creatures did God command into existence on the second day of creation?",
    "options": {
      "A": "Light",
      "B": "firmament",
      "C": "birds",
      "D": "vegetation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72048?exam_type=waec&type=obj&page=337",
    "correct_answer": "B",
    "explanation": "B: Genesis 1:6-8: \"And God said, Let there be a firmament in the midstof the waters, and let it divide the waters from the waters, And God made the firmament, and divided the waters which were under firmament from the waters which above the firmament: and it was so. And God called the firmament Heaven. And the evening and the morning were the second day.\"",
    "year": "2024"
  },
  {
    "number": "1684",
    "text": "The determination of times and seasons was made possible with the creation of ?",
    "options": {
      "A": "light",
      "B": "ray",
      "C": "stars",
      "D": "moon"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72050?exam_type=waec&type=obj&page=337",
    "correct_answer": "A",
    "explanation": "God created light for the determination of times and seasons. Genesis 1:14 -16. Genesis 1:14 - 19 provides the explanation; \"and God said let there be light in the firmament of the heaven to divide the day from the night; and let them be for signs and for seasons and for days and years.",
    "year": "2024"
  },
  {
    "number": "1685",
    "text": "Which of the following was man's responsibility to other creatures?",
    "options": {
      "A": "Provide them with food",
      "B": "Have dominion over them",
      "C": "Preserve them",
      "D": "Respect them"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72053?exam_type=waec&type=obj&page=337",
    "correct_answer": "B",
    "explanation": "B. Genesis 1: 26 - 28, \"and God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, andover the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.\"",
    "year": "2024"
  },
  {
    "number": "1686",
    "text": "In which of the following ways did God prepare Joseph for his leadership role in Egypt? Through the",
    "options": {
      "A": "love his brothers had for him",
      "B": "tribulations of his early life",
      "C": "disagreement with his brothers",
      "D": "enmity with other prison inmates"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72055?exam_type=waec&type=obj&page=338",
    "correct_answer": "B",
    "explanation": "B: God prepared Joseph for his leadership role in Egypt through the trials and tribulations he endured in his early life. Genesis 37-50 counts forJoseph's story, where he faces numerous challenges, including being sold into slavery by his jealous brothers, being falsely accused and imprisoned,and enduring years of separation from his family. Despite these hardships, Joseph remained faithful to God and continued to trust in His plan for his life. Through these trials Joseph developed important qualities such as resilience, humility, wisdom, and reliance on God. These experiences also provided him with valuable leadership skills, aqs he learnt to interpret dreams, manage resources,and govern effectively during his time in Egypt.",
    "year": "2024"
  },
  {
    "number": "1687",
    "text": "Which of the following was the greatest reason for which Joseph's brothers decided to do away with him?",
    "options": {
      "A": "he was over pampered",
      "B": "his father made him a special robe",
      "C": "he was loved most by their father",
      "D": "the meaning of his dreams"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72096?exam_type=waec&type=obj&page=338",
    "correct_answer": "D",
    "explanation": "D: The correct answer is the meaning of his dreams. Gemesis 37:3-8 provides insight into the reason why Josephs brothers haboured resentment towards him. Joseph's dreams further exacerbated the situation as they depicted him ruling over his brothers which angered them even more (Genesis 37:5-11). It was clearly stated in Genesis 37: 20 that Joseph's dreams of superiority contributed to their decision to plot against him and eventually sell him into slavery.",
    "year": "2024"
  },
  {
    "number": "1688",
    "text": "The twelve men Moses sent to spy out the land of Canaan were meant to verify the following except the",
    "options": {
      "A": "strength and weakness of the inhabitants",
      "B": "population and size of the land",
      "C": "size of the army and their weaponery",
      "D": "topography and fertility of the land"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72097?exam_type=waec&type=obj&page=338",
    "correct_answer": "C",
    "explanation": "C: The correct answer to the question is size of the army and their weaponry. When Moses the twelve spies to explore the land of Canaan, their main objectives were to assess the strength and weaknesses of the inhabitants, the population and size of the land, and the topography and fertility of the land. This is detailed in Numbers 13:17-20.",
    "year": "2024"
  },
  {
    "number": "1689",
    "text": "the presence of God among His people during the day on their way out of Egypt to the wilderness of Sinai was felt in the form of",
    "options": {
      "A": "fire",
      "B": "light",
      "C": "cloud",
      "D": "rainbow"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72098?exam_type=waec&type=obj&page=338",
    "correct_answer": "C",
    "explanation": "C: During the Isrealites' journey from Egypt to the wilderness of Sinai, God's presence among them was manifested in the form of a cloud during the day and a pillar of fire at night. Exodus13:21-22.",
    "year": "2024"
  },
  {
    "number": "1690",
    "text": "Which of the following was God's condition to Joshua if he wishes to be successful? He should",
    "options": {
      "A": "fast all the time",
      "B": "humble himself before the people",
      "C": "meditate on the book of the law",
      "D": "follow Moses' footsteps"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72099?exam_type=waec&type=obj&page=338",
    "correct_answer": "C",
    "explanation": "C: God's condition for Joshua's success is clearly outlined in Joshua 1:8: \"Do not let this Book of the Law depart from your mouth; meditate on it day and night, so that you may be careful to do everything written in it. Then you will be prosperous and successful.\"",
    "year": "2024"
  },
  {
    "number": "1691",
    "text": "When the people of Israel heard the majority report of the spies, they took a decision to",
    "options": {
      "A": "pray to God to come to their aid",
      "B": "fight the descendants of Anak",
      "C": "choose a leader and return to egypt",
      "D": "stone joshua and caleb for blasphemy"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72100?exam_type=waec&type=obj&page=339",
    "correct_answer": "C",
    "explanation": "C: The correct answer is choose a leader and return to Egypt. After hearing the majority report of thespies, the Israelites responded with fear and unbelief. Numbers 14:1- 4 describes their reaction.",
    "year": "2024"
  },
  {
    "number": "1692",
    "text": "The history of Barak's war, story flawed by the fact he",
    "options": {
      "A": "consulted the oracles to find out the outcome of his battle.",
      "B": "conspired with Jael to take out Sisera and Canaanites",
      "C": "took the tribes of Zebulun and NaphtaIi to war with him",
      "D": "sought the presence of Deborah as a reinforcement to his courage."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72101?exam_type=waec&type=obj&page=339",
    "correct_answer": "D",
    "explanation": "D: Barak's story is recorded in Judges 4-5. He was a commander chosen by the prophetess, deborah to lead Israels army against line Canaanites, particularly Sisera the commander of king jabin's army Barak's faith and courage were initially lacking, as seen in judges 4:8-9. the history of Baraks war story was flawed by the fact that he sought the prescence of Deborah as an reinforcemennt to his courage.",
    "year": "2024"
  },
  {
    "number": "1693",
    "text": "After whose death did God sell the isrealites into the hands of king Jabin?",
    "options": {
      "A": "Moses",
      "B": "Ehud",
      "C": "aaron",
      "D": "caleb"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72102?exam_type=waec&type=obj&page=339",
    "correct_answer": "B",
    "explanation": "B: After the death of Ehud. God sold the Israelites into the hands of king Jabin. Judges 4:1-2: 'After the death of Ehud, the Israelites again did evil In the eyes of the Lord. And the Lord sold them into the hand of jabin king of Canaan, who reigned in Hazor. The commander of his army was Sisera, who lived in Harosheth-Haggoyim.\"",
    "year": "2024"
  },
  {
    "number": "1694",
    "text": "Which of the folllowing led to the death of Ei?",
    "options": {
      "A": "the death of his of sons",
      "B": "the defeat of the isrealites",
      "C": "the capture of the ark",
      "D": "it was his time to die"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72103?exam_type=waec&type=obj&page=339",
    "correct_answer": "C",
    "explanation": "C: The capture of the ark of the covenant by the Philistines directly contributed to the death of Eli, the high priest of Israel, as recounted in 1 Samuel 4. A messenger arrived at Shiloh and informed Eli about the defeat of the Israelite army, the capture of the ark, and the death of his sons (l Samuel 4:12-18). Upon hearing the news, Eli, who was old and blind, fell backward off his chair and broke his neck, resulting in his death (l Samuel 4:18).",
    "year": "2024"
  },
  {
    "number": "1695",
    "text": "Yet his sons did not walk in his ways but turned aside for gains, they took bribes ... The sons being referred to\nhere were",
    "options": {
      "A": "Hophni and phinehas",
      "B": "jonathan and abinadab",
      "C": "joab and asahel",
      "D": "joel and abijah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72104?exam_type=waec&type=obj&page=339",
    "correct_answer": "D",
    "explanation": "D: The quote \"Yet his sons did not walk in his ways but aside for gains, they took bribes...\" refers to Samuel's two sons, Joel and Abijah. Unlike Samuel who was known for being a just judge, his two sons, Joel and Abijah, did not walk in his ways but turned aside for gains, taking bribes. I Samuel 8:3",
    "year": "2024"
  },
  {
    "number": "1696",
    "text": "The account of Saul's rejection as a king is intended to",
    "options": {
      "A": "explain the breach between samuel and saul",
      "B": "teach the consequences of disobedience",
      "C": "show how unfit saul was as a leader",
      "D": "show the desire for power by men of God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72105?exam_type=waec&type=obj&page=340",
    "correct_answer": "B",
    "explanation": "B: The correct answer is: teach the consequences of disobedience. The account of Saul's rejection as a king serves primarily to teach the consequences of disobedience. Throughout Saul's reign, he repeatedly disobeyed Göd's commands, which ultimately led to his rejection as king. This narrative illustrates the principle that disobedience to God's will carries serious consequences. Several Bible verses support this interpretation: l. 1 Samuel 15:22-23. Therefore, the primary Purpose of Saul's rejection as king is to teach the consequences of disobedience.",
    "year": "2024"
  },
  {
    "number": "1697",
    "text": "Rather than killing Saul, David took his spear and jar of water and rebuked Abner for",
    "options": {
      "A": "sabotage and complicity",
      "B": "insurbordination and inefficiency",
      "C": "negligence and dereliction",
      "D": "gross, misconduct and ineptitude"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72106?exam_type=waec&type=obj&page=340",
    "correct_answer": "C",
    "explanation": "C: The correct answer is David rebuked Abner for negligence and derliction of duty. 1 Samuel 26, David had the opportunity to kill King Saul while he was sleeping in the camp. However, chose not to harm Saul, recognizing him as the Lord's anointed king. Instead, David, accompanied by his nephew Abishai, snuck into Saul's camp while. he and his army were asleep. David took Saul's spear and the jar of water that was beside his head as proof that he could have killed him but chose not to. After leaving the camp, David stood on a hill opposite Saul's camp and called out to Saul's army and to Abner, Saul's commander, rebuking them for their failure to protect the king.",
    "year": "2024"
  },
  {
    "number": "1698",
    "text": "Saul's death on Mount Giiboa was as a consequence of his",
    "options": {
      "A": "inability to obey God's instructions",
      "B": "armor bearer's obedience to his command.",
      "C": "loss of confidence in David the musician",
      "D": "sorcery by consulting the witch of Endor."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72111?exam_type=waec&type=obj&page=340",
    "correct_answer": "A",
    "explanation": "A: saul's death on mount gilboa was indeed a consequence of his inability to obey God's instructions. Throughout saul's reign he repeatedly disobeyed Gods commands which ultimately led to his downfall. One significant instance of saul's disobedience was in 1 Samuel 15 when he failed to completely destroy the amalekites as God had commanded him.",
    "year": "2024"
  },
  {
    "number": "1699",
    "text": "Solomon enjoyed the following gifts during his reign as King except _____",
    "options": {
      "A": "peaceful succession",
      "B": "a discerning mind",
      "C": "having many wives",
      "D": "fame and wealth"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72369?exam_type=waec&type=obj&page=340",
    "correct_answer": "C",
    "explanation": "C: The correct answer is having many wives. Solomon enjoyed peaceful succession, a discerning mind, fame, and wealth during his as king, as recorded in the Bible. However, having many wives is not listed as a gift. 1 Kings 2. 1 Kings 4:20-21•. \"The people of Judah and Israel were as numerous as the sand on the sea-shore; they ate, they drank and they were happy. And Solomon ruled overall the kingdoms from the Euphrates River to the land of the Philistines, as far as the border of Egypt. These countries brought tribute and were Solomon's subjects all his life.",
    "year": "2024"
  },
  {
    "number": "1700",
    "text": "God registered His displeasure with David for bearing a child with Uriah's wife by striking the child with _____",
    "options": {
      "A": "deafness",
      "B": "sickness",
      "C": "blindness",
      "D": "death."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72372?exam_type=waec&type=obj&page=340",
    "correct_answer": "D",
    "explanation": "D: God registered His displeasure with David for bearing a child with Uriah's wife (Bathsheba) by striking the child with death. This event is recorded in 2 Samuel 12:15-18.",
    "year": "2024"
  },
  {
    "number": "1701",
    "text": "Solomon the elders and leaders of the tribes of Israel in order to ____",
    "options": {
      "A": "discuss how to build the temple",
      "B": "bring back the ark of the Lord",
      "C": "settle important disputes",
      "D": "dine and make merry"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72378?exam_type=waec&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "B: Solomon' summoned the elders and leaders of the tribes of Israel in order to bring back the ark of the Lord. 1 Kings 8:1: Solomon the assembled the  elders of Israel and all the heads of the tribes, the leaders of the fathers' houses of people of Israel, before King Solomon in Jerusalem, to bring up the ark of the covenant of the LORD out of the city of David, which is Zion.",
    "year": "2024"
  },
  {
    "number": "1702",
    "text": "Which of the following punishment was meted out to Solomon as a result of his idolatrous?",
    "options": {
      "A": "He would lose all his wives and concubines to his enemies",
      "B": "All the tribes of Judah would be taken away from him",
      "C": "All his children and wives would go into exile",
      "D": "All the palaces and store houses would be occupied by his enemies"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72379?exam_type=waec&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "B: The answer to the question 2 is all the tribes of Judah would be taken away from him. As a result of Solomon's idolatrous ways, God punished him by decreeing that all the tribes but Judah would be taken away from him, leading to the division of the kingdom of Israel. This punishment was fulfilled during the reign of Solomon's son, Rehoboam, when ten tribes rebelled against him and formed the northern kingdom of Israel under Jeroboam (1 Kings 11:11-13, 1 Kings 12; 16 - 20)",
    "year": "2024"
  },
  {
    "number": "1703",
    "text": "Obadiah demonstrated his loyalty to God during Ahab's reign where he ___",
    "options": {
      "A": "refused to serve the king's idols",
      "B": "divorced his idolatrous wife",
      "C": "hid the prophets of God in caves",
      "D": "tore down the altars of Baal"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72384?exam_type=waec&type=obj&page=341",
    "correct_answer": "C",
    "explanation": "During the reign ofKing Ahab, a time marked bywidespread idolatry and persecutionof true prophets due to the influence ofQueen Jezebel, Obadiah—who was in charge of the king's household—remainedfaithful to God.\nAccording to1 Kings 18:3–4 (RSV):\n\"Now Obadiah feared the Lord greatly; and when Jezebel cut off the prophets of the Lord,Obadiah took a hundred prophets and hid them by fifties in a cave, and fed them with bread and water.\"\nThis action wasa courageous demonstration of loyalty to God, as it risked his life and position in Ahab’s court.",
    "year": "2024"
  },
  {
    "number": "1704",
    "text": "The miraculous healing of Naaman teaches mankind that",
    "options": {
      "A": "God's mercy applies to all",
      "B": "river Jordan is full of healing powers",
      "C": "God is not limited to Israel",
      "D": "Servants can help great men"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72386?exam_type=waec&type=obj&page=341",
    "correct_answer": "A",
    "explanation": "The story ofNaaman’s healingis found in2 Kings 5:1–19. Naaman was a Syrian army commander who suffered from leprosy. He was healed after following the prophetElisha’s instructionto wash in theRiver Jordanseven times. This story contains multiple lessons, but thecentral spiritual messageis aboutGod’s mercy and grace being available to all people, regardless of nationality or status.\nNaaman was a foreigner (a Syrian), yet he received healing from the God of Israel. This highlights God's universal mercy and willingness to bless even those outside Israel who have faith and obedience.",
    "year": "2024"
  },
  {
    "number": "1705",
    "text": "Which of the following reasons cause Naboth not to part with his vineyard?",
    "options": {
      "A": "Ahab had become greedy",
      "B": "It was a family property",
      "C": "Parting with it meant defeat",
      "D": "The king had become dictorial"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72389?exam_type=waec&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "B: The correct answer is It was a family property. Naboth refused to part with his vineyard because it was a family property. In 1 Kings 21, Ahab, the king of Israel, desired Naboth's vineyard, which was adjacent to his palace.",
    "year": "2024"
  },
  {
    "number": "1706",
    "text": "King Josiah took a courageous step in the presence of the Israelites by the pillar when he ___",
    "options": {
      "A": "dismissed the high preist",
      "B": "made a covenant before the Lord",
      "C": "killed all the male prostitutes",
      "D": "disposed of the idolatrous priest."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72391?exam_type=waec&type=obj&page=342",
    "correct_answer": "B",
    "explanation": "b: The correct answer is made a covenant before the Lord. King Josiah took a courageous step in the presence of the Israelites by making a covenant before the Lord. This event is de[scribed in 2 Kings 23:1-3, where Josiah gathered all the people, including the elders, priests, and prophets, and read aloud the Book of the Covenant found in the temple.",
    "year": "2024"
  },
  {
    "number": "1707",
    "text": "The immediate action King Josiah took during his religious reforms was the ___",
    "options": {
      "A": "breaking down of the house of the male-cult prostitutes.",
      "B": "removal of all idolatrous priests from offices",
      "C": "removal and burning of the vessels of Baal and Asherah",
      "D": "defiling of the high places where the priest burnt incense"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72392?exam_type=waec&type=obj&page=342",
    "correct_answer": "C",
    "explanation": "C: The correct answer is removal and burning of the vessels of Baal and Asherah. The immediate action King Josiah took during his religious reforms was the removal and burning of the vessels of Baal and Asherah. This is described in 2 Kings 23:4-5.",
    "year": "2024"
  },
  {
    "number": "1708",
    "text": "In which of the following ways was Nehemiah said to have displayed patriotism? When he ____",
    "options": {
      "A": "permission to visit his home",
      "B": "mobilized people to return home",
      "C": "collected taxes from the Jews for the home country",
      "D": "felt the plight of his people and took remedial steps"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72393?exam_type=waec&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "D: In Nehemiah 1:3-4 Nehemiah hears about the distress of his fellow Jews and the desolate condition of Jerusalem, leading him to mourn, fast, and pray for his people. He confesses the sins of Israel and pleads with God for mercy. This demonstrates Nehemiah's deep concern for his people and his homeland.",
    "year": "2024"
  },
  {
    "number": "1709",
    "text": "What are these feeble Jews doing? These words of Sanballat teach us that ___",
    "options": {
      "A": "no matter what we do, people will ridicule us",
      "B": "certain jokes are very destructive",
      "C": "we must be vigilant while we work",
      "D": "people would appreciate our weakness and assist"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72399?exam_type=waec&type=obj&page=342",
    "correct_answer": "A",
    "explanation": "A: Regarding the quote \"What are these feeble Jews doing?\" spoken by Sanballat, Tobiah, and Geshem (Nehemiah 4:2), it teaches us that no matter what we do people will ridicule us.",
    "year": "2024"
  },
  {
    "number": "1710",
    "text": "That Daniel, who is one of the exiles from Judah, pays no heed to you, O king ... The king being addressed here was",
    "options": {
      "A": "Cyrus",
      "B": "Ashurbanipal",
      "C": "Nebuchadnezzar",
      "D": "Darius"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72400?exam_type=waec&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "D: The correct answer is Darius. The king being addressed in the statement \"That Daniel, who is one of the exiles from Judah, pays no heed to you, O king...\" is Darius, This statement is found in Daniel 6:13.",
    "year": "2024"
  },
  {
    "number": "1711",
    "text": "Seek me and live; but do not seek Bethel and do not enter Gilgah and Bethel shall come to naught. This text from Amos which was a reaction to the mode of worship of the Israelites express the ____",
    "options": {
      "A": "Omnipresence nature of God",
      "B": "People's trust in God",
      "C": "futility of false and cultic worship",
      "D": "people's desire to escape justice."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72401?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "C: The correct answer is futility of false and cultic worship. The text from Amos, \"Seek me and live; but do not seek Bethel and do not enter Gilgal...and Bethel shall come to naught,\" expresses the futility of false and cultic worship.",
    "year": "2024"
  },
  {
    "number": "1712",
    "text": "The saying that the children of Israel shall dwell many days without ephod means ___",
    "options": {
      "A": "complete starvation in israel is inevitable",
      "B": "Sleeping without clothes is immenent",
      "C": "no preistly activities will be in Israel",
      "D": "Israel will be exposed to calamity."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72402?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "C: The correct answer is no priestly activities will be in Israel. The saying that the children of Israel shall dwell many days without ephod means that no priestly activities will be in Israel. The ephod was a ceremonial garment worn by the priest during religious rituals, and its absence symbolizes the cessation of priestly activities and the spiritual decline of Israel. Hosea 3:4.",
    "year": "2024"
  },
  {
    "number": "1713",
    "text": "Immediately after Jesus was baptized, the following Incidents occurred except",
    "options": {
      "A": "the heavens were opened",
      "B": "angels came and ministered to him",
      "C": "the Spirit of God descended on him like a dove",
      "D": "a voice from heaven introduced him as son of God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72454?exam_type=waec&type=obj&page=343",
    "correct_answer": "B",
    "explanation": "B: The correct answer is angels came and ministered to him. After Jesus was baptized. the Bible records that the heavens were opened, the Spirit of God descended on him like a dove, and a voice from heaven introduced him as the Son of God. However, there is no mention of angels coming and ministering to him immediately after his baptism. Matthew 3:16-17.",
    "year": "2024"
  },
  {
    "number": "1714",
    "text": "Which of the following attributes of Jesus was demonstrated during his temptation?",
    "options": {
      "A": "His humble nature",
      "B": "Special relation with God",
      "C": "reliance on the Holy Spirit in him",
      "D": "abundant knowledge of the scriptures"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72455?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "C: The correct answer is reliance on the Holy Spirit in Him. During his temptation in the wilderness Jesus demonstrated reliance on the Holy spirit in him. This is evident in Matthew 4:1",
    "year": "2024"
  },
  {
    "number": "1715",
    "text": "Whoever does not bear his own cross come after me, cannot be my disciple. This statement implies?",
    "options": {
      "A": "readiness to fast and pray",
      "B": "ability to carry Jesus' cross",
      "C": "readiness to deny one self",
      "D": "bearing the cross of others"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72456?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "C: The correct answer is readiness to deny oneself. The statement \"Whosoever does not bear his own cross and come after me, cannot be my disciple\" implies readiness to deny oneself. This statement is found in Luke 9:23, where Jesus speaks to the crowds and his about the cost of discipleship.",
    "year": "2024"
  },
  {
    "number": "1716",
    "text": "Jesus' call of Matthew, the tax collector, is a demonstration that Christians ___",
    "options": {
      "A": "are free to call anyone they like",
      "B": "need to study people closely before calling them",
      "C": "must be careful with people of character",
      "D": "need not discriminate against sinners"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72457?exam_type=waec&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "D: - The correct answer is need not discriminate against sinners. Jesus' call of Matthew, the tax collector, demonstrates that Christians need not discriminate against sinners. In Matthew 9:9-13, Jesus called Matthew, a tax collector, to follow Him, despite social associated with tax collectors as sinners and collaborators. with roman authorities.",
    "year": "2024"
  },
  {
    "number": "1717",
    "text": "which of the following virtues enhances forgiveness?",
    "options": {
      "A": "Humility",
      "B": "Kindness",
      "C": "Mercy",
      "D": "Faithfulness"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72505?exam_type=waec&type=obj&page=344",
    "correct_answer": "A",
    "explanation": "A: Humility enhances forgiveness. If one is humble, one is forgiven one's sins and trespasses. God forgives the humble because they recognize their need for His mercy and grace. James 4:6 states, \"But he gives us more grace. That is why Scripture says: 'God opposes the proud but shows favour to the humble.'\" God's forgiveness is extended to those who humble themselves before him, acknowledging their need for His forgiveness and mercy.",
    "year": "2024"
  },
  {
    "number": "1718",
    "text": "During the trial of Jesus, what was Peter's reaction when the bystanders detected that he was a Galilean? He",
    "options": {
      "A": "Confronted them in disagreement",
      "B": "Disagreed with tears and sorrows",
      "C": "Swore and cursed himself with disagreement",
      "D": "regretted coming to the porch"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72516?exam_type=waec&type=obj&page=344",
    "correct_answer": "C",
    "explanation": "C: The correct answer is swore and cursed himself in disagreement. During the trial of Jesus, when bystanders that Peter was a Galilean, his reaction was to swear and curse himself in disagreement. This event is described in Matthew 26:69- 75",
    "year": "2024"
  },
  {
    "number": "1719",
    "text": "What significant incident occurred during Jesus' resurection that was unique to the gospel of matthew?",
    "options": {
      "A": "There was thunder and lighting",
      "B": "Many angels came around singing",
      "C": "A great earthquake took place",
      "D": "Darkness covered the tomb"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72518?exam_type=waec&type=obj&page=344",
    "correct_answer": "C",
    "explanation": "C: The correct answer is A great earthquake took place. A significant incident that occurred during Jesus' unique to the Gospel of Matthew, was a great earthquake. This earthquake is described in Matthew 28:2.",
    "year": "2024"
  },
  {
    "number": "1720",
    "text": "All the following characteristics were true of the early church except",
    "options": {
      "A": "sharpening of possessions among themselves",
      "B": "complaints about unfair distribution of food",
      "C": "admission into the church through baptism",
      "D": "facing prosecution boldy after Stephen's death"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72520?exam_type=waec&type=obj&page=344",
    "correct_answer": "B",
    "explanation": "B: The answer is complaints about unfair distribution of food. All the characteristics listed were true of the early church, except complaints about unfair distribution of food. In the early chapters of the Book of Acts, we the early church sharing possessions among themselves (Acts 2:44-45), admitting new believers into the church through baptism (Acts 2:41), and facing persecution boldly after Stephen's death (Acts 8:1-3).",
    "year": "2024"
  },
  {
    "number": "1721",
    "text": "The arrival of the Holy Spirit on the day of pentecost was experienced by the disciples through___",
    "options": {
      "A": "The sound of a trumpet",
      "B": "a mighty thunder",
      "C": "the bodily appearance of Christ",
      "D": "the rush of a mighty win"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72525?exam_type=waec&type=obj&page=345",
    "correct_answer": null,
    "explanation": "D: The answer is the rush of a mighty wind. The arrival of the Holy Spirit on the day of Pentecost was experienced by the disciples through the rush of å mighty wind, This event is described in Acts 2:1-4.",
    "year": "2024"
  },
  {
    "number": "1722",
    "text": "Which of the following incedents occured following peters post pentecost sermon which led to the baptism of the thousand souls? The converts ____",
    "options": {
      "A": "Devoted themselves to the apostles teaching and fellowship",
      "B": "created disciplinary problems for the apostles",
      "C": "occasioned the appointment of the deacons",
      "D": "contributed to the welfare of the members"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72537?exam_type=waec&type=obj&page=345",
    "correct_answer": null,
    "explanation": "A: The correct answer is the converts devoted themselves to the apostles' teaching and fellowship. Following Peter's post-Pentecost sermon. which led to the baptism of three thousand souls, the converts devoted themselves to the apostles' teaching and fellowship. This is described in Acts 2:42-47.",
    "year": "2024"
  },
  {
    "number": "1723",
    "text": "One of the qualifications set out by tb apostles a requirement for the appointment of the deacons was ___",
    "options": {
      "A": "moral uprightness",
      "B": "speaking in tongues",
      "C": "Kindness and boldness",
      "D": "baptism and confirmation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72540?exam_type=waec&type=obj&page=345",
    "correct_answer": "A",
    "explanation": "A: The correct answer is moral uprightness. One of the qualifications set out by the apostles as a requirement for the appointment of the deacons was moral uprightness. This is evident in Acts 6:3.",
    "year": "2024"
  },
  {
    "number": "1724",
    "text": "One of the outcomes of the persecutions lions of the early church was that ___",
    "options": {
      "A": "beleivers left jerusalem to settle in other towns",
      "B": "fear gripped the followers into utter silence",
      "C": "the enrollment of the church community dwindle",
      "D": "those who were scattered carried out evangelism"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72542?exam_type=waec&type=obj&page=345",
    "correct_answer": "D",
    "explanation": "D: The correct answer is those who were scattered carried out evangelism. One of the outcomes of the persecution of the early church was that those who were scattered carried out evangelism. This is described in Acts 8:4, where after the martyrdom of Stephen and the subsequent persecution of the church in Jerusalem, believers were scattered throughout Judea and Samaria, preaching the gospel wherever they went. -Acts 8:4.",
    "year": "2024"
  },
  {
    "number": "1725",
    "text": "Jesus told the story of the servant who owed his master in order to teach?",
    "options": {
      "A": "Compassion",
      "B": "faithfulness",
      "C": "forgiveness",
      "D": "sincerity"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72558?exam_type=waec&type=obj&page=345",
    "correct_answer": "C",
    "explanation": "C: The correct answer is forgiveness. Jesus told the story of the servant who owed his master in order to teach forgiveness. This story, is found in matthew 18: 21 - 35.",
    "year": "2024"
  },
  {
    "number": "1726",
    "text": "For which of the following reasons was the thief at the right hand of Jesus promised paradise? He",
    "options": {
      "A": "was very clever",
      "B": "was good to Jesus",
      "C": "was not among those who crucified Jesus",
      "D": "acknowledged and regretted his deeds"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72561?exam_type=waec&type=obj&page=346",
    "correct_answer": "D",
    "explanation": "D: The correct answer is acknowledged and regretted his deeds. The thief at the right hand of Jesus was promised paradise because he acknowledged and regretted his deeds. This is evident in Luke 23:39-43.",
    "year": "2024"
  },
  {
    "number": "1727",
    "text": "Eli Eli lama sabachthani. This citation by Jesus on the cross was constructed to mean ____",
    "options": {
      "A": "crying to God",
      "B": "calling on Elijah",
      "C": "calling Eli, the priest",
      "D": "crying to his mother"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72564?exam_type=waec&type=obj&page=346",
    "correct_answer": "A",
    "explanation": "A: The correct answer is crying to God. Jesus uttered these words while he was on the cross, and they are recorded in the New Testament, specifically in the Gospel of Matthew 27:46 and the Gospel of Mark 15:34",
    "year": "2024"
  },
  {
    "number": "1728",
    "text": "According to James, unanswered prayers are caused by the following factors except",
    "options": {
      "A": "Lack of faith",
      "B": "persistence in prayer",
      "C": "selfishness in prayer",
      "D": "praying outside God's will"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72565?exam_type=waec&type=obj&page=346",
    "correct_answer": "B",
    "explanation": "B: The answer is persistence in prayer. According to James, unanswered prayers are not caused by persistence in prayer. James 5:16 emphasizes the effectiveness of fervent and righteous prayer. Rather, James highlights other factors that can hinder prayers, such as lack of faith, selfishness, and praying outside God's will. James 5:16.",
    "year": "2024"
  },
  {
    "number": "1729",
    "text": "Religion that is pure and undefiled before God demands ___",
    "options": {
      "A": "keeping the commandment of God",
      "B": "loving your neighbour as yourself",
      "C": "keeping oneself unstained from the world",
      "D": "accepting Jesus as your Lord and saviour."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72566?exam_type=waec&type=obj&page=346",
    "correct_answer": "C",
    "explanation": "C: The correct answer is keeping oneself unstained from the world. According to James, religion that is pure and undefiled before God demands keeping oneself unstained from the world. This is stated in James 1:27..",
    "year": "2024"
  },
  {
    "number": "1730",
    "text": "Which of the following, according to Peter, is a characteristic of a good citizen? One who",
    "options": {
      "A": "builds houses and rents to those who do not have",
      "B": "provides transport at reduced cost for other citizens",
      "C": "obeys the law of the state and fulfills his obligation",
      "D": "helps to finance the government all the time"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72567?exam_type=waec&type=obj&page=346",
    "correct_answer": "C",
    "explanation": "C: The answer is obeys the law of the state and fulfills his obligation. According to Peter, a characteristic of a good citizen is one who obeys the law of the state and fulfills his obligation. This is emphasized in I Peter 2:13-17, where Peter instructs believers to submit themselves to every human authority for the Lord's sake, whether to the emperor as the supreme authority or to governors who are sent by him to punish those who do wrong and to commend those who do right.",
    "year": "2024"
  },
  {
    "number": "1731",
    "text": "In the teaching of Peter, when Christians become good citizens, they",
    "options": {
      "A": "receive the crown of glory in heaven",
      "B": "silence the ignorance of foolish men",
      "C": "overcome the evil intentions of men",
      "D": "attract blessings and upliftment"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72568?exam_type=waec&type=obj&page=347",
    "correct_answer": "B",
    "explanation": "B: The correct answer is silence the ignorance of foolish men. In the teaching of Peter, when Christians become good citizens, they silence the ignorance of foolish men. This concept is discussed in 1 Peter 2:15.",
    "year": "2024"
  },
  {
    "number": "1732",
    "text": "For christians to continue their priviledged freedom Peter suggests that they should ___",
    "options": {
      "A": "claim superiority at all cost",
      "B": "use it as a pretext for evil",
      "C": "do what is right always",
      "D": "endure pain and suffering"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/72570?exam_type=waec&type=obj&page=347",
    "correct_answer": "C",
    "explanation": "C: The correct answer is do what is right always. For Christians to exercise their privileged freedom, Peter suggests that they should do what is right always. In 1 Peter 2:16, Peter warns believers not to use their freedom as a pretext for evil, but rather to live as God's slaves.",
    "year": "2024"
  }
]