[
  {
    "number": "29",
    "text": "(a). Mention one use each of specimens A and C.\n(b). State four disadvantages of using specimen A in poultry production.\n(c) Give four reasons that could be responsible for the choice of specimen B in poultry production.\n(d). (i) Give three reasons why specimen C could be used in the construction of poultry house. (ii) Name two farm animals other than poultry for which the housing unit could be constructed with specimen C.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69764?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2023"
  },
  {
    "number": "30",
    "text": "(a). Mention four activities that should be carried out on the farm before the arrival of specimen D.\n(b). State two observable reactions of specimen D when the temperature provided by specimen F in a poultry house is: (i) high; (ii) low; (iii) moderate. (c). State three disadvantages of using specimen E.\n(d). State two uses of specimen F in animal production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69765?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2023"
  },
  {
    "number": "31",
    "text": "(a)(i) Name five processes involved in the production of specimen G (ii) Mention two uses of specimen G.\n(b). Give three ways in which specimen H is of importance to humans.\n(c). State two functions of specimen J in its host.\n(d)(i) Name one management practice that could be carried out on specimen J. (ii) Give two reasons for carrying out the management practice named in 3 (d) (i).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69766?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2023"
  },
  {
    "number": "32",
    "text": "(a)(i) State three uses of specimen K in animal production. (ii) Mention three precautions that should be taken when using specimen K on livestock farm.\n(b)(i) Name two major nutrients in specimen L. (ii) State three advantages of using specimen M in feeding rabbits.\n(c)(i) Name the management practice that could be carried out on farm animals using specimen N. (ii) Name three farm animals that specimen N could be used on,",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/69767?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2023"
  }
]