[
  {
    "number": "1325",
    "text": "Economics is regarded as a science because it?",
    "options": {
      "A": "studies laws that govern human behaviour",
      "B": "uses scientific method to explain human behaviour",
      "C": "makes use of controlled experiments to explain human behaviour",
      "D": "makes use of machines to study human behaviour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49375?exam_type=waec&type=obj&page=265",
    "correct_answer": "B",
    "explanation": "Economicsisregardedas asciencebecause it uses scientific methods to build theories that can help explain the behaviour of individuals, groups and organisations.Economicsattempts to explain economic behaviour, which arises when scarce resources are exchanged.",
    "year": "2015"
  },
  {
    "number": "1326",
    "text": "which of the following can be described as land",
    "options": {
      "A": "forest",
      "B": "diamond",
      "C": "roads",
      "D": "crude oil"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49379?exam_type=waec&type=obj&page=266",
    "correct_answer": "C",
    "explanation": "Land, sometimes referred to as dry land, is the solid surface of Earth that is not permanently covered by water and is immovable",
    "year": "2015"
  },
  {
    "number": "1327",
    "text": "An outward shift of the production possibility curve shows that?",
    "options": {
      "A": "production is shifting to the left",
      "B": "resources are under-utilized",
      "C": "economic growth has taken place",
      "D": "factors of production are moving outward"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49382?exam_type=waec&type=obj&page=266",
    "correct_answer": "D",
    "explanation": "Increases in theproduction possibilities curve arerepresented byshifts outward, or to the right, while decreasesarerepresented byshiftsinward, or to the left.\nWhen using aPPc, growth is defined as an increase in potential output over time, and illustrated by anoutward shiftin the curve. Anoutward shiftof aPPcmeans that an economy has increased its capacity to produce all goods.",
    "year": "2015"
  },
  {
    "number": "1328",
    "text": "The following constitute the criteria for identifying an economic system except?",
    "options": {
      "A": "ownership of resources",
      "B": "scarcity of resources",
      "C": "method of decision making",
      "D": "motivation for production"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49385?exam_type=waec&type=obj&page=266",
    "correct_answer": "B",
    "explanation": "Economic systemsare the means by which countries and governments distribute resources and trade goods and services. They are used to control the five factors of production, including: labor, capital, entrepreneurs, physical resources and information resources. Aneconomic systemis asystemof production, resource allocation, exchange and distribution of goods and services in a society or a given geographic area.",
    "year": "2015"
  },
  {
    "number": "1329",
    "text": "A disadvantage of the mean as measure of central tendency is that?",
    "options": {
      "A": "is affected by extreme values",
      "B": "can only be used for continuous data",
      "C": "cannot be used to measure the qualities of a population",
      "D": "cannot be determined in group data"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49390?exam_type=waec&type=obj&page=266",
    "correct_answer": "A",
    "explanation": "The important disadvantage of mean is that it is sensitive to extreme values/outliers, especially when the sample size is small. Therefore, it is not an appropriate measure of central tendency for skewed distribution. Mean cannot be calculated for nominal or nonnominal ordinal data.",
    "year": "2015"
  },
  {
    "number": "1330",
    "text": "which of the following is not an effect of many middlemen in the chain of production",
    "options": {
      "A": "shortage of commodities",
      "B": "low retail prices",
      "C": "hoarding of goods",
      "D": "high retail prices"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49394?exam_type=waec&type=obj&page=266",
    "correct_answer": "B",
    "explanation": "middlemenintervention raise price for consumers. The real profit goes to themiddlemenwho buy up the farm products at almost give away prices and sell at outrageous prices to the consumers.",
    "year": "2015"
  },
  {
    "number": "1331",
    "text": "If the price of floor rises, then bread",
    "options": {
      "A": "demand curve will shift to the left while supply curve will shift to the right",
      "B": "supply curve will shift to the left",
      "C": "supply curve will shift to the right",
      "D": "demand curve will shift to the right while supply curve remains unchanged"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49396?exam_type=waec&type=obj&page=267",
    "correct_answer": "B",
    "explanation": "if the cost of resources used to produce a good increases, sellerswillbe less inclined tosupplythe same quantity at a given price, and thesupply curve will shift to the left.",
    "year": "2015"
  },
  {
    "number": "1332",
    "text": "which of the following is not a reason for abnormal demand",
    "options": {
      "A": "price of the commodity",
      "B": "goods of ostentation",
      "C": "giffen goods",
      "D": "rare commodity"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49399?exam_type=waec&type=obj&page=267",
    "correct_answer": "A",
    "explanation": "Abnormal demand refers to demand patterns that deviate from typical behavior, often influenced by specific factors, such as:\ni. Goods of ostentation: These are luxury items sought after for their status, leading to demand that doesn't follow normal consumption patterns.ii. Giffen goods: These are a unique category of inferior goods where demand increases as prices rise, defying standard economic expectations.iii. Rare commodities: Scarcity can drive abnormal demand, as consumers often place higher value on items that are perceived as rare or hard to obtain.\nThe option that is not a reason for abnormal demand is A. price of the commodity.",
    "year": "2015"
  },
  {
    "number": "1333",
    "text": "increase in production subsidies will shift",
    "options": {
      "A": "the demand curve to the left",
      "B": "the supply curve to the right",
      "C": "both the supply demand curves to the left",
      "D": "supply curve to the left and demand curve to the right"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49401?exam_type=waec&type=obj&page=267",
    "correct_answer": "B",
    "explanation": "Subsidy impact.Marginal subsidies on production will shift the supply curve to the right until the vertical distance between the two supply curves is equal to the per unit subsidy; when other things remain equal, this will decrease price paid by the consumers (which is equal to the new market price) and increase the price received by the producers.",
    "year": "2015"
  },
  {
    "number": "1334",
    "text": "The market supply curve slopes upward from left to right indicating that?",
    "options": {
      "A": "producers pay high taxes",
      "B": "two commodities can be supplied at the same time",
      "C": "at a lower price, less is supplied",
      "D": "at a lower price, more is supplied and demanded"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49404?exam_type=waec&type=obj&page=267",
    "correct_answer": "C",
    "explanation": "In most cases, thesupply curveis drawn as asloperisingupward from left to right, since product price and quantity supplied are directly related (i.e., as the price of a commodity increases in themarket, the amount supplied increases, and at a lower price, supply decreases).",
    "year": "2015"
  },
  {
    "number": "1335",
    "text": "if a given change in price brings a proportionately larger change in quantity demanded, the",
    "options": {
      "A": "demand is relatively price elastic",
      "B": "demand is relatively price inelastic",
      "C": "price elasticity of demand is unitary",
      "D": "price elasticity of demand is constant"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49405?exam_type=waec&type=obj&page=267",
    "correct_answer": "A",
    "explanation": "Price elasticityis a measure of the responsiveness of demand or supply of a good or service to changes inprice. Theprice elasticityof demand measures the ratio of the proportionate change in quantity demanded to the proportionate change of theprice.",
    "year": "2015"
  },
  {
    "number": "1336",
    "text": "Government revenue will increase if taxes are levied on goods with?",
    "options": {
      "A": "perfectly elastic demand",
      "B": "fairly elastic demand",
      "C": "perfectly inelastic demand",
      "D": "unitary elastic demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49406?exam_type=waec&type=obj&page=268",
    "correct_answer": "C",
    "explanation": "A good with a perfectly inelastic demand will always sell irrespective of the change in the price of the product. This is one way the government can increase revenue generation through taxation.\nAn example of perfectly inelastic demand would be a lifesaving drug that people will pay any price to obtain",
    "year": "2015"
  },
  {
    "number": "1337",
    "text": "if the price of a commodity Z falls and a consumer buys less of it, then commodity Z is a",
    "options": {
      "A": "necessity",
      "B": "good of ostentation",
      "C": "normal good",
      "D": "giffen good"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49407?exam_type=waec&type=obj&page=268",
    "correct_answer": "B",
    "explanation": "An ostentatiousGoodis agoodwhere demand is often greater when the price of it is higher.  These aregoodswe buy in order to 'keep up with the Jones'. Thegoodmay give little actual utility apart from the pride of owning something very few other people own.",
    "year": "2015"
  },
  {
    "number": "1338",
    "text": "In order to calculate total utility (TU) from given levels of marginal utility (MU), one has to?",
    "options": {
      "A": "subtract MU from TU",
      "B": "Add MU from the various levels",
      "C": "multiply MU by the initial TU",
      "D": "Divide current MU by previous MU"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49409?exam_type=waec&type=obj&page=268",
    "correct_answer": "B",
    "explanation": "“Marginal utility is addition made to total utility by consuming one more unit of a commodity”.\nTotal Utility is Summation of Marginal Utilities:in order to get the total utility, you will have to sum up the additional/extra utility (MU) from the given levels of consumption",
    "year": "2015"
  },
  {
    "number": "1339",
    "text": "which of the following will not affect the market price of a commodity",
    "options": {
      "A": "increase in demand",
      "B": "change in taste",
      "C": "intersection of demand and supply",
      "D": "increase in supply"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49411?exam_type=waec&type=obj&page=268",
    "correct_answer": "C",
    "explanation": "6 Factors Affecting Price Determination of...\nProduct CostThe Utility and DemandExtent ofCompetitionin theMarketGovernment andLegalRegulationsPricing ObjectivesMarketing MethodsUsed",
    "year": "2015"
  },
  {
    "number": "1340",
    "text": "All the following are methods of determing prices except?",
    "options": {
      "A": "maximum pricing",
      "B": "rationing",
      "C": "minimum pricing",
      "D": "auctioning"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49420?exam_type=waec&type=obj&page=268",
    "correct_answer": "D",
    "explanation": "A maximum price occurs when a government sets a legal limit on the price of a good or service – with the aim of reducing prices below the market equilibrium price.\nMinimum Prices. It is known asminimum priceorpricefloor when the government sets aminimumlegal limit of apriceof a particular good or service.\nIn economics,rationingrefers to an artificial control of the supply and demand of commodities.",
    "year": "2015"
  },
  {
    "number": "1341",
    "text": "The law of diminishing marginal returns relate to?",
    "options": {
      "A": "total utility",
      "B": "average utility",
      "C": "total product",
      "D": "marginal utility"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49422?exam_type=waec&type=obj&page=269",
    "correct_answer": "D",
    "explanation": "Marginal utilityis the additional satisfaction a consumer gains from consuming one more unit of a good or service.  As a consumer consumes more units of a product, the marginal utility derived eventually drops. This relates with the law of diminishing marginal returns which states that, there will be  a decrease in the marginal output of a production process as the amount of a single factor of production is incrementally increased, while the amounts of all other factors of production stay constant.",
    "year": "2015"
  },
  {
    "number": "1342",
    "text": "Total cost is obtain by?",
    "options": {
      "A": "adding up the marginal cost at each level",
      "B": "dividing the total cost of output at each level",
      "C": "adding up the average variable cost at each level",
      "D": "adding up the total variable cost and total fixed cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49428?exam_type=waec&type=obj&page=269",
    "correct_answer": "D",
    "explanation": "Total costrefers to thetotalexpense incurred in reaching a particular level of output.  TC (total cost) = TFC (totalfixedcost) + TVC (totalvariablecost).",
    "year": "2015"
  },
  {
    "number": "1343",
    "text": "By adding all the marginal products at each level of employment of the variable input, we obtain a value equal to",
    "options": {
      "A": "average product",
      "B": "total product",
      "C": "average variable cost",
      "D": "total cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49433?exam_type=waec&type=obj&page=269",
    "correct_answer": "B",
    "explanation": "Total productis the overall quantity of output that a firm produces, usually specified in relation to a variable input.Total productis the starting point for the analysis of short-runproduction. It indicates how much output a firm can produce according to the law of diminishing marginal returns.\nMarginal Product (MP) = Change in Total Product / Change in Variable Factor\nTotal Product (TP) = AP X Variable Factor",
    "year": "2015"
  },
  {
    "number": "1344",
    "text": "which of the following curves is not U shaped",
    "options": {
      "A": "marginal cost curve",
      "B": "average fixed cost curve",
      "C": "average total cost curve",
      "D": "average variable cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49435?exam_type=waec&type=obj&page=269",
    "correct_answer": "B",
    "explanation": "The average fixed costs AFC curve isdownward slopingbecause fixed costs are distributed over a larger volume when the quantity produced increases. AFC is equal to the vertical difference between ATC and AVC. Variable returns to scale explains why the other cost curves are U-shaped.",
    "year": "2015"
  },
  {
    "number": "1345",
    "text": "which of the following business organisations is likely to experience disagreements between management and shareholders",
    "options": {
      "A": "co-operative society",
      "B": "sole trader",
      "C": "partnership",
      "D": "joint-stock company"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49442?exam_type=waec&type=obj&page=269",
    "correct_answer": "D",
    "explanation": "joint-stock company is  a company whose stock is owned jointly by the shareholders.\nA joint-stock company is a business entity in which shares of the company's stock can be bought and sold by shareholders. Each shareholder owns company stock in proportion, evidenced by their shares.",
    "year": "2015"
  },
  {
    "number": "1346",
    "text": "which of the following is not a method of controlling monopoly",
    "options": {
      "A": "preventing mergers",
      "B": "indigenization",
      "C": "privatization",
      "D": "imposing high profit tax"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49445?exam_type=waec&type=obj&page=270",
    "correct_answer": "A",
    "explanation": "Monopoly can be prevented through the following ways\n1. By regulation through taxation.;The Govt. can regulate monopoly through taxation. Govt. can levy a tax per unit of output (Specific Tax) or impose a lump sum tax irrespective to its output.\n2. By regulation of conditions of monopoly, as in case of natural and regulated monopolies (MC pricing).;The term “public utilities” is applied to such essential services such as water supply, power supply, passenger transport facilities, communication facilities and railway facility. These services should be made available to the society at reasonable prices. Most public utility firms are natural monopolies and are also called as regulated monopolies.\n3. By anti-monopoly laws and policies to prevent unfair price discrimination amongst different consumers (Peak load pricing);This is a case of price discrimination peak and off-peak supplies at different prices. Some examples are, electricity has different demand curves at different times during the day. When demand is more, it is called peak period, when less the off-peak period. Hotels at hill stations have peak period in summer and off-peak period in monsoon. Demand for woolens is more in winter (peak period) and less in summer (off- peak period). The traffic rush on roads is more after office hours.",
    "year": "2015"
  },
  {
    "number": "1347",
    "text": "which of the following features distinguishes a public limited company from a private limited company",
    "options": {
      "A": "perpetual existence",
      "B": "limited liability",
      "C": "legal entity",
      "D": "sales of shares to the public"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49452?exam_type=waec&type=obj&page=270",
    "correct_answer": "D",
    "explanation": "Aprivate limited company isa business entity thatisheld byprivateowners. However,private limited companiesdo not need to issue a prospectus because thepublic isnot invited to subscribeforthe sharesof the company. Aprivate limited companyneeds a minimum of only 2 directors.private company, the number of shares traded is relatively smaller and also the traded shares are owned by limited individuals.\nOn the other hand, the shareholdersin a public limited companyare thepublic. Acompanywhose securitiesaretraded on a stock exchange andcanbe bought and sold by anyone.Public companies arestrictly regulated, andarerequired by law to publish their complete and true financial position so that investorscandetermine the true worth of its stock (shares). Also called publicly heldcompany.",
    "year": "2015"
  },
  {
    "number": "1348",
    "text": "Inflation may occur if there is?",
    "options": {
      "A": "excess supply over demand",
      "B": "increase in productivity",
      "C": "excessive demand with limited supply",
      "D": "increased government spending in a depressed economy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49453?exam_type=waec&type=obj&page=270",
    "correct_answer": "C",
    "explanation": "excessive demand with limited supply;itcausesrise in prices and increases in equalities: Generally,excess demandresults ininflation(continuous rise in prices) withoutincreasein output and employment. people will be will to pay high prices for few goods. which is generally what in flation is about. a fall in the purchasing power of money as more money will be chasing few goods",
    "year": "2015"
  },
  {
    "number": "1349",
    "text": "Frictional unemployment occurs when?",
    "options": {
      "A": "there is a change in the technique of production",
      "B": "job seekers lack information where jobs exist",
      "C": "bad weather prevents work from progressing",
      "D": "job seekers have disabilities"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49456?exam_type=waec&type=obj&page=270",
    "correct_answer": "B",
    "explanation": "Frictional unemploymentis a type ofunemploymentthat arises when workers are searching for new jobs or are transitioning from one job to another\nFrictional unemploymentrefers to people who are simply moving from one job to another, but are taking their time. It is part of the jobless total caused by individuals who are spending time searching for another job, or perhaps are taking a break before beginning with a new employer. Even in a country where there is technically full employment, there will always be some frictional employment, simply because employees change jobs occasionally.",
    "year": "2015"
  },
  {
    "number": "1350",
    "text": "which of the following will increase the demand for labour",
    "options": {
      "A": "Increase wage rate",
      "B": "labour's demand for output",
      "C": "low wage rate",
      "D": "low marginal productivity"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49463?exam_type=waec&type=obj&page=270",
    "correct_answer": "C",
    "explanation": "Factorsthat can shift thedemandcurve forlaborinclude: a change in the quantity demanded of the product that thelaborproduces; a change in the production process that uses more or lesslabor; and a change in government policy thataffectsthe quantity oflaborthat firms wish to hire at a given wage. When the payment for labour is low, fills will be willing to employ more people than with an increased wage rate",
    "year": "2015"
  },
  {
    "number": "1351",
    "text": "one reason for low agrictural productivity in most west African countries is that?",
    "options": {
      "A": "farmers are not capable of producing cash crops",
      "B": "it does not provide income to farmers with large families",
      "C": "farmers find it difficult getting help from financial institutions",
      "D": "it is not the only source of raw materials for agro-based industries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49467?exam_type=waec&type=obj&page=271",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2015"
  },
  {
    "number": "1352",
    "text": "The movement of labour from one grade to an entirely different grade is an example of?",
    "options": {
      "A": "industrial labour mobility",
      "B": "horizontal occupational mobility",
      "C": "vertical occupational mobility",
      "D": "geographical mobility"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49473?exam_type=waec&type=obj&page=271",
    "correct_answer": "C",
    "explanation": "When a worker of a lower grade and status in an occupation moves to another occupation in a higher grade and status, it is vertical mobility. Just as a school lecturer becomes a college lecturer, a clerk becomes a manager, etc.",
    "year": "2015"
  },
  {
    "number": "1353",
    "text": "which of the following is not a strong basis for trade unions demand for higher wages",
    "options": {
      "A": "company is making higher profit",
      "B": "productivity of workers has increased",
      "C": "members of the union have high qualifications",
      "D": "commodity produced by the workers is very essential"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49479?exam_type=waec&type=obj&page=271",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2015"
  },
  {
    "number": "1354",
    "text": "The difference between the gross domestic product (GDP) and gross national product (GNP) IS?",
    "options": {
      "A": "depreciation",
      "B": "transfer payment",
      "C": "net income from abroad",
      "D": "direct taxes"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49483?exam_type=waec&type=obj&page=271",
    "correct_answer": "C",
    "explanation": "The most important distinguishing point between these two is that while we calculate GDP, we take into consideration whatever is produced within the local borders of the country and so it includes the goods and services produced by the foreign nationals also but if we talk about GNP, only the production done by the country’s citizens is considered whether they are inside or outside the country and the contribution of foreign citizens are completely excluded.\nNet income from abroad is income earned by ANY person {including Artificial} i.e citizen of that country, earned even outside political boundaries i.e land + 20 nautical miles of water. This is GNP. Income earned by anyone {including foreign citizen} within the country is GDP.",
    "year": "2015"
  },
  {
    "number": "1355",
    "text": "location of firms of an industry is not influenced by?",
    "options": {
      "A": "availability of raw material",
      "B": "existence of other firms",
      "C": "nearness to the source of money supply",
      "D": "government policy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49488?exam_type=waec&type=obj&page=271",
    "correct_answer": "B",
    "explanation": "Industrial locations are complex in nature. These are influenced by theavailabilityof many factors. Some of them are: raw material, land, water, labor, capital, power, transport, and market. For ease of convenience, we can classify the location factors into two:geographicalfactors and non-geographicalfactors.",
    "year": "2015"
  },
  {
    "number": "1356",
    "text": "In national income accounting, the term ''net'' is used to indicate that a value-----",
    "options": {
      "A": "includes income of foreigners",
      "B": "includes income of citizens",
      "C": "includes depreciation",
      "D": "excludes depreciation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49501?exam_type=waec&type=obj&page=272",
    "correct_answer": "D",
    "explanation": "In national income accounting, net national income (NNI) is the gross domestic product plus net receipts of wages, salaries, and property income from abroad, minus the depreciation of fixed capital assets through wear and tear and obsolescence.\nNNI = GDP + factor income received from abroad - depreciation of Fixed Capital.",
    "year": "2015"
  },
  {
    "number": "1357",
    "text": "which of the following best describes token money?",
    "options": {
      "A": "money in the vaults of commercial banks",
      "B": "currency and coins in circulation",
      "C": "money with face value higher than its material content",
      "D": "coins and notes made of poor quality material"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49511?exam_type=waec&type=obj&page=272",
    "correct_answer": "C",
    "explanation": "token money; money where the face value of notes or coins is unrelated to the value of the material of which they are composed. In economics, Token money, or Token, is money that has little intrinsic value compared to its face value.\nThetokenis a smallamountofmoney(compared to the market value of theproperty) that has to be paid by the buyer as an indication of serious intent to purchase aproperty.",
    "year": "2015"
  },
  {
    "number": "1358",
    "text": "In developing countries, a larger percentage of the labour force is employed in the",
    "options": {
      "A": "trade sector",
      "B": "tertiary sector",
      "C": "primary sector",
      "D": "secondary sector"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49523?exam_type=waec&type=obj&page=272",
    "correct_answer": "C",
    "explanation": "primary sector; the sector of the economy concerned with or relating to primary industry.Examplesinclude mining, quarrying, farming, fishing and forestry, all of which produce raw materials that can be processed in to a finished product.",
    "year": "2015"
  },
  {
    "number": "1359",
    "text": "An industry is best described as",
    "options": {
      "A": "firm that sells a set of closely related commodities",
      "B": "a factory that produces different lines of product",
      "C": "a group of firms that sells a closely related set of products",
      "D": "industrial concern that is into production and selling of goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49526?exam_type=waec&type=obj&page=272",
    "correct_answer": "D",
    "explanation": "An industry; economic activity concerned with the processing of raw materials and manufacture of goods in factories.",
    "year": "2015"
  },
  {
    "number": "1360",
    "text": "The main item traded on a stock exchange market is",
    "options": {
      "A": "treasury bills",
      "B": "travellers cheque",
      "C": "foreign currencies",
      "D": "new shares"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49530?exam_type=waec&type=obj&page=272",
    "correct_answer": "D",
    "explanation": "In financial markets, a share is a unit used as mutual funds, limited partnerships, and real estate investment trusts. The owner of shares in the corporation/company is a shareholder of the corporation. A share is an indivisible unit of capital, expressing the ownership relationship between the company and the shareholder",
    "year": "2015"
  },
  {
    "number": "1361",
    "text": "The proportion of commercial banks' total assets kept in the form of highly liquid assets is known as",
    "options": {
      "A": "demand deposit",
      "B": "fixed deposit",
      "C": "cash ratio",
      "D": "moral suasion"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49533?exam_type=waec&type=obj&page=273",
    "correct_answer": "A",
    "explanation": "Demand deposit; is a deposit of money that can be withdrawn without prior notice, e.g. in a current account.  Ademand depositis money that youdepositinto a bank account from which you can withdraw ondemand, at any time, without any advance notice to the bank.",
    "year": "2015"
  },
  {
    "number": "1362",
    "text": "which of the following is not an objective of economic planning",
    "options": {
      "A": "need to direct economic development of the country towards the desired direction",
      "B": "desire to ensure a sustained cultural development of the country",
      "C": "desire to widen the gap between developing countries and the developed world",
      "D": "management of scarce resources in the face of unlimited wants of the citizens"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49545?exam_type=waec&type=obj&page=273",
    "correct_answer": "C",
    "explanation": "Economic planning  consist of economic decisions, schemes formed to meet certain pre-determined economic objectives and a road map of directions to achieve specific goals within specific period of time.By the conscious decisions of Central and State Government, based on in-depth study of the existing and potential resources of a country through surveys and a careful study of the needs of the people the planning takes place.",
    "year": "2015"
  },
  {
    "number": "1363",
    "text": "In order to control inflation, the government should",
    "options": {
      "A": "reduce the cost of borrowing",
      "B": "buy securities in the open market",
      "C": "adopt restrictive monetary policy",
      "D": "discourage savings"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49548?exam_type=waec&type=obj&page=273",
    "correct_answer": "C",
    "explanation": "One popular method of controllinginflationis through a contractionary monetary policy. The goal of a contractionary policy is to reduce the money supply within an economy by decreasing bond prices and increasing interest rates.",
    "year": "2015"
  },
  {
    "number": "1364",
    "text": "when the demand for foreign exchange exceeds its supply, the value of the domestic currency",
    "options": {
      "A": "appreciates",
      "B": "depreciates",
      "C": "remains inchanged",
      "D": "expands"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49552?exam_type=waec&type=obj&page=273",
    "correct_answer": "B",
    "explanation": "if thedemand for a foreign currencyexceeds its supply, the exchange rate will increase rate will increase. This will cause the local currency to suffer. because more of the local currency will be used to exchange for less of the foreign currency",
    "year": "2015"
  },
  {
    "number": "1365",
    "text": "The export of west A frican countries are mostly composed of",
    "options": {
      "A": "service",
      "B": "raw materials",
      "C": "manufactured goods",
      "D": "consumer goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49554?exam_type=waec&type=obj&page=273",
    "correct_answer": "B",
    "explanation": "A raw material, also known as a feedstock, unprocessed material, or primary commodity, is a basic material that is used to produce goods, finished products, energy, or intermediate materials which are feedstock for future finished products.As feedstock, the term connotes these materials are bottleneck assets and are highly important with regard to producing other products.",
    "year": "2015"
  },
  {
    "number": "1366",
    "text": "A concious effort of government to achieve a specific set of goals is?",
    "options": {
      "A": "economic planning",
      "B": "economic development",
      "C": "economic growth",
      "D": "economic target"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49558?exam_type=waec&type=obj&page=274",
    "correct_answer": "A",
    "explanation": "An economic plan is an outline of schemes designed to achieve certain pre-determined economic objectives, in a particular order of priorities within a specified period of time. This is the technique that a state follows to achieve economic development.\nThe main features of economic planning are as follows:\n1. Determining the objectives that are to be achieved.\n2. Estimating the resources that are available in the country.\n3. Determining the order in which the objectives are to be achieved.\n4. Designing suitable schemes for realizing of the objectives.\n5. Determining the plan outlay and investment.\n6. Allocation of resources between different sectors as per the priority of objectives\n7. Establishing a body for the formulation, organization and appraisal of the plans",
    "year": "2015"
  },
  {
    "number": "1367",
    "text": "A country has favourable terms of trade when the prices of her",
    "options": {
      "A": "exports rises relative to the price of her imports",
      "B": "exports falls relative to the price of her imports",
      "C": "imports rise faster than the prices of imports",
      "D": "imports and exports move in the same direction"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49565?exam_type=waec&type=obj&page=274",
    "correct_answer": "A",
    "explanation": "If the prices of a country's exports rise relative to the prices of its imports, one says that its terms of trade have moved in a favourable direction, because, in effect, it now receives more imports for each unit of goods exported.",
    "year": "2015"
  },
  {
    "number": "1368",
    "text": "The abolition of all forms of trade barriers among member countries while maintaining common external tariffs against non members is a feature of a",
    "options": {
      "A": "free trade",
      "B": "custom union",
      "C": "common market",
      "D": "economic union"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49566?exam_type=waec&type=obj&page=274",
    "correct_answer": "D",
    "explanation": "An economic union is an agreement between two or more nations to allow goods, services, money and workers to move over borders freely. The countries may also coordinate social and financial policies to support this common market.",
    "year": "2015"
  },
  {
    "number": "1369",
    "text": "In order to correct adverse balance of payments problem, government should?",
    "options": {
      "A": "reduce tariffs",
      "B": "increase subsidies on exports",
      "C": "increase tax on local industries",
      "D": "reduce personal income tax"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49572?exam_type=waec&type=obj&page=274",
    "correct_answer": "B",
    "explanation": "Methods of correcting adverse balance of payments\nWell- knownMethods of CorrectinginAdverse Balanceof Payment\nTrade Policy Measures: Expanding, Exports and Restraining ImportsExpenditure-Reducing PoliciesTight Monetary PolicyContractionary Fiscal PolicyExpenditure – Switching Policies: DevaluationDevaluation: Marshall Lerner Condition",
    "year": "2015"
  },
  {
    "number": "1370",
    "text": "which of the following is a benefit to a member country of World Bank?",
    "options": {
      "A": "easy access to long term loans",
      "B": "management of foreign exchange",
      "C": "mediating in labour dispute",
      "D": "financing balance of payment deficit"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49574?exam_type=waec&type=obj&page=274",
    "correct_answer": "A",
    "explanation": "TheWorld Bankis a vital source of financial and technical assistance to developingcountriesaround theworld. We are not abankin the ordinary sense but a unique partnership to reduce poverty and support development.",
    "year": "2015"
  },
  {
    "number": "1371",
    "text": "what is the total revenue from indirect tax",
    "options": {
      "A": "$686.0 m",
      "B": "$400.20 m",
      "C": "$135.80 m",
      "D": "$100.00 m"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49583?exam_type=waec&type=obj&page=275",
    "correct_answer": "B",
    "explanation": "Inditect tax is a tax levied on goods and services rather than on income or profits. Thus we have;\nIndirect tax = customs and excise duties + value added tax300.20 + 100.00 = 400.20",
    "year": "2015"
  },
  {
    "number": "1372",
    "text": "what is the total revenue from non tax sources",
    "options": {
      "A": "$400.20 m",
      "B": "$375.20 m",
      "C": "$135.00 m",
      "D": "$75.00 m"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49587?exam_type=waec&type=obj&page=275",
    "correct_answer": "C",
    "explanation": "Total revenue can be written as P × Q, which is the price of the goods multiplied by the quantity of the sold goods.Non-tax revenue or non-tax receipts are revenue not generated from taxes and from the table above, only rents and royalties do not fall under taxes.\nThey include\nrents and Royalties + fees and fines75.00 + 60.00 = 135.00m",
    "year": "2015"
  }
]