[
  {
    "number": "141",
    "text": "(a ) State five objectives each (i) of Farm Settlement Scheme and (ii) Agricultural Development Programme. (b) State roles of cooperative organisations in agricultural production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52367?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a)(i) The objectives of farm settlement scheme are: (1) To stimulate small rural farmers to increase their productivity and improve their standard of living\n(2) to develop a modern farming system in order to attract the young and educated people into farming\n(3) to induce rural development thereby halting the drift to urban areas\n(4) to alleviate unemployment or provide job for the teaming population\n(5) to check the land tenure system.\n(6) to bring about changes in agricultural methods and teach modern farming practices to the youths.\n(ii) The objectives of Agricultural Development Programme (ADP) are:\n(1) It helps in supporting farmers to increase agricultural production.\n(2) It makes for the provision of rural infrastructure like roads, schools, health services, rural electrification among others.\n(3) It also helps in the provision of clean drinking water.\n(4) It assists in the supply of modern farm input namely; Chemical, seeds and fertilizers.\n(5) The programme makes provision for facilities for mechanised agriculture.\n(6) It increases the level of extension contact with farmers.\n(b) Roles of co-operative organizations in agricultural production are: (i) The organizations make provision for employment (labour).\n(ii) They provide farm input.\n(iii) Co-operative organizations provide processing facilities for their members.\n(iv) They make provision for storage facilities for members.\n(v) The organizations make provision for a ready market for farm produce.\n(vi) Co-operative organizations also provide training facilities and opportunities to their members.\n(vii) Co-operative organizations provide funds or capital for their members\n(viii) They create awareness among -members on what, when and how to Produce.\n(ix) Cooperative organizations enhance investment opportunities.\n(x) They encourage large scale production and expansion of members' investment frontiers.",
    "explanation": "(a)(i) The objectives of farm settlement scheme are: (1) To stimulate small rural farmers to increase their productivity and improve their standard of living\n(2) to develop a modern farming system in order to attract the young and educated people into farming\n(3) to induce rural development thereby halting the drift to urban areas\n(4) to alleviate unemployment or provide job for the teaming population\n(5) to check the land tenure system.\n(6) to bring about changes in agricultural methods and teach modern farming practices to the youths.\n(ii) The objectives of Agricultural Development Programme (ADP) are:\n(1) It helps in supporting farmers to increase agricultural production.\n(2) It makes for the provision of rural infrastructure like roads, schools, health services, rural electrification among others.\n(3) It also helps in the provision of clean drinking water.\n(4) It assists in the supply of modern farm input namely; Chemical, seeds and fertilizers.\n(5) The programme makes provision for facilities for mechanised agriculture.\n(6) It increases the level of extension contact with farmers.\n(b) Roles of co-operative organizations in agricultural production are: (i) The organizations make provision for employment (labour).\n(ii) They provide farm input.\n(iii) Co-operative organizations provide processing facilities for their members.\n(iv) They make provision for storage facilities for members.\n(v) The organizations make provision for a ready market for farm produce.\n(vi) Co-operative organizations also provide training facilities and opportunities to their members.\n(vii) Co-operative organizations provide funds or capital for their members\n(viii) They create awareness among -members on what, when and how to Produce.\n(ix) Cooperative organizations enhance investment opportunities.\n(x) They encourage large scale production and expansion of members' investment frontiers.",
    "year": "2002"
  },
  {
    "number": "142",
    "text": "(a)List six types of land tenure systems. (b) Discuss five reasons why the government should enforce the land use legislation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52368?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) The various types of land tenure systems are: (i) gift (ii) communal (iii) purchase, freehold or individual ownership (iv) inheritance (v) leasing or leasehold (vi) pledge (vii) share cropping, rent or tenancy (viii) Tenancy at the will of Government\n(b) Reasons why government should enforce the land use legislation include:\n(i) Security of tenure: to safeguard farmers against unreasonable eviction\n(ii) Ensuring proper land use: To ensure that agricultural land is not unnecessarily diverted to non-agricultural purpose.\n(iii) Government projects: To make large tracts of land available for government sponsored development of large scale farms or resettlement schemes\n(iv) Land improvement: to carry out large scale improvement such as irrigation, drainage and soil water conservation in order to ensure a reasonable standard of efficient production for a long time, and such a requirement should be obligatory, irrespective of land tenure system.\n(v) Influence on size of holdings: To prevent land fragmentation and encourage the consolidation of small holdings into large units\n(vi) Freedom of enterprise: To encourage freedom of farming in cases where there are regulations or traditional views that militate against such freedom\n(vii) Control of production: To encourage the production of certain produce and curtail the production of others through the control of land use (viii) Land litigation: To reduce the number of land litigation amongst the citizens.",
    "explanation": "(a) The various types of land tenure systems are: (i) gift (ii) communal (iii) purchase, freehold or individual ownership (iv) inheritance (v) leasing or leasehold (vi) pledge (vii) share cropping, rent or tenancy (viii) Tenancy at the will of Government\n(b) Reasons why government should enforce the land use legislation include:\n(i) Security of tenure: to safeguard farmers against unreasonable eviction\n(ii) Ensuring proper land use: To ensure that agricultural land is not unnecessarily diverted to non-agricultural purpose.\n(iii) Government projects: To make large tracts of land available for government sponsored development of large scale farms or resettlement schemes\n(iv) Land improvement: to carry out large scale improvement such as irrigation, drainage and soil water conservation in order to ensure a reasonable standard of efficient production for a long time, and such a requirement should be obligatory, irrespective of land tenure system.\n(v) Influence on size of holdings: To prevent land fragmentation and encourage the consolidation of small holdings into large units\n(vi) Freedom of enterprise: To encourage freedom of farming in cases where there are regulations or traditional views that militate against such freedom\n(vii) Control of production: To encourage the production of certain produce and curtail the production of others through the control of land use (viii) Land litigation: To reduce the number of land litigation amongst the citizens.",
    "year": "2002"
  },
  {
    "number": "143",
    "text": "(a) State five effects. of each of the following practices on crop production: (1) irrigation; (ii) drainage. (b) List four methods of surface irrigation. (c) Give two main reasons why surface drainage is often necessary in crop production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52370?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a)(i) The effects of irrigation on crop production are: (1) Irrigation softens the soil for easy tillage operations. (2) It provides moisture in the soil for root absorption. (3) It reduces the amount of salts accumulated in the top soil, which could be harmful to crop plants. (4) It also cools the soil by reducing the soil temperature during the dry season when the soil temperature is very high and plant growth is thus improved. (5) Irrigation enables the crop to be well established even when rain is erratic. (6) It increases crop productivity or crop yield. (7) Irrigation provides humid environment for the breeding of pest and pathogens of crops. (8) It helps in the improvement of microbial decomposition of organic manure to release nutrients for crop plant. (9) Irrigation dissolves nutrients for root absorption. (10) It assists in facilitating crop production all year round. (11) Irrigation encourages the spread of weed seeds.\n(ii) The effects of drainage on crop production are: (1) Drainage helps in reclaiming waterlogged soil for crop production. (2) Drainage improves the soil structure thereby improving the water holding capacity of the soil. (3) It improves soil aeration for good root respiration. (4) It gives suitable conditions for the growth of soil microbes responsible for the decomposition of soil organic matter which provides nutrients for plant growth (5) It helps to increase the soil temperature for the benefit of crop plants (6) Drainage also leaches excess salts from soil thereby preventing the death of plants arising from poisoning (7) It makes tillage operations easier. (8) It reduces the incidence of crop diseases. (9) It enhances harvesting of crops, especially swamp rice. (10) It enhances early planting of crops.\n(b) The methods of surface irrigation are (i) Contour ditch (ii) border dyke (iii) border ditch (iv) furrow irrigation (v) basin irrigation (vi) wild flooding.\n(c) Surface drainage is necessary in crop production because: (i) It removes excess water caused by heavy rainfall especially in heavy soils (ii) it is easier to construct (iii) Irrigation is cheap to establish and maintain (iv) It prevents accumulation of alkalis (v) It increases the activities of microbes in top soil (vi) It helps in the collection and disposal of surface run-off.",
    "explanation": "(a)(i) The effects of irrigation on crop production are: (1) Irrigation softens the soil for easy tillage operations. (2) It provides moisture in the soil for root absorption. (3) It reduces the amount of salts accumulated in the top soil, which could be harmful to crop plants. (4) It also cools the soil by reducing the soil temperature during the dry season when the soil temperature is very high and plant growth is thus improved. (5) Irrigation enables the crop to be well established even when rain is erratic. (6) It increases crop productivity or crop yield. (7) Irrigation provides humid environment for the breeding of pest and pathogens of crops. (8) It helps in the improvement of microbial decomposition of organic manure to release nutrients for crop plant. (9) Irrigation dissolves nutrients for root absorption. (10) It assists in facilitating crop production all year round. (11) Irrigation encourages the spread of weed seeds.\n(ii) The effects of drainage on crop production are: (1) Drainage helps in reclaiming waterlogged soil for crop production. (2) Drainage improves the soil structure thereby improving the water holding capacity of the soil. (3) It improves soil aeration for good root respiration. (4) It gives suitable conditions for the growth of soil microbes responsible for the decomposition of soil organic matter which provides nutrients for plant growth (5) It helps to increase the soil temperature for the benefit of crop plants (6) Drainage also leaches excess salts from soil thereby preventing the death of plants arising from poisoning (7) It makes tillage operations easier. (8) It reduces the incidence of crop diseases. (9) It enhances harvesting of crops, especially swamp rice. (10) It enhances early planting of crops.\n(b) The methods of surface irrigation are (i) Contour ditch (ii) border dyke (iii) border ditch (iv) furrow irrigation (v) basin irrigation (vi) wild flooding.\n(c) Surface drainage is necessary in crop production because: (i) It removes excess water caused by heavy rainfall especially in heavy soils (ii) it is easier to construct (iii) Irrigation is cheap to establish and maintain (iv) It prevents accumulation of alkalis (v) It increases the activities of microbes in top soil (vi) It helps in the collection and disposal of surface run-off.",
    "year": "2002"
  },
  {
    "number": "144",
    "text": "(a) State three functions of nitrogen in crop plants. (b) Mention four effects of excess soil nitrogen and three effects of nitrogen deficiency on plants. (c) Apart from lightning, state three other ways by which nitrogen is added to the soil? (d) List six soil micro nutrients.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52372?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) The functions of nitrogen in crop plants are: (i) It improves growth and reproduction because it is a constituent of protein and protoplasm (ii) It improves the growth of the shoot system (iii) it assists the leaves to have a deep green colour especially in vegetables (iv) It increases the size of grains in cereal crops (v) It promotes the uptake of potassium and phosphorus from the soil.\n(b)(i) The effects of excess soil nitrogen on plants are: (1) It causes excessive vegetative growth (2) It delays flowering, fruiting and ripening i.e it leads to reduction in reproductive growth (3) It weakens plant stems (4) It causes lodging, especially in cereals (5) It may decrease resistance in grains and thereby lower the quality of the grains (6) It enhances disease attack in crops.\n(ii) The effects of nitrogen deficiency on plants are: (1) It leads to general yellowing of aerial plant parts (2) It leads to stunted growth (3) It leads to premature dropping of leaves (4) It causes poor flowering or fruiting (5) It makes stems to become thin and chaffy, especially in grain crops:\n(c) Apart from lightning, nitrogen is also added to the soil through: (i) decay of organic matter (ii) application of inorganic fertilizers (iii) symbiotic nitrogen fixation by microbes in the root nodules of leguminous plants as a result of crop rotation (iv) nitrogen fixation by free living bacteria in the soil.\n(d) The soil micro nutrients are: boron, iron, manganese, cobalt, copper, molybdenum, zinc and chlorine.",
    "explanation": "(a) The functions of nitrogen in crop plants are: (i) It improves growth and reproduction because it is a constituent of protein and protoplasm (ii) It improves the growth of the shoot system (iii) it assists the leaves to have a deep green colour especially in vegetables (iv) It increases the size of grains in cereal crops (v) It promotes the uptake of potassium and phosphorus from the soil.\n(b)(i) The effects of excess soil nitrogen on plants are: (1) It causes excessive vegetative growth (2) It delays flowering, fruiting and ripening i.e it leads to reduction in reproductive growth (3) It weakens plant stems (4) It causes lodging, especially in cereals (5) It may decrease resistance in grains and thereby lower the quality of the grains (6) It enhances disease attack in crops.\n(ii) The effects of nitrogen deficiency on plants are: (1) It leads to general yellowing of aerial plant parts (2) It leads to stunted growth (3) It leads to premature dropping of leaves (4) It causes poor flowering or fruiting (5) It makes stems to become thin and chaffy, especially in grain crops:\n(c) Apart from lightning, nitrogen is also added to the soil through: (i) decay of organic matter (ii) application of inorganic fertilizers (iii) symbiotic nitrogen fixation by microbes in the root nodules of leguminous plants as a result of crop rotation (iv) nitrogen fixation by free living bacteria in the soil.\n(d) The soil micro nutrients are: boron, iron, manganese, cobalt, copper, molybdenum, zinc and chlorine.",
    "year": "2002"
  },
  {
    "number": "145",
    "text": "(a) Describe briefly four methods of weed dispersal. (b) Describe three mechanical and three cultural methods of weed control.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52373?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) The methods of weed dispersal are:- (i) Dispersal by Animals: Weed seeds such as desmodium possess adhesive substances which make them stick to passing people or animals and hence are carried to some distance by the people or animals they stick to. Some also have hooks, while rodents and birds carry edible fruits of weeds from one place to another (ii) Dispersal by wind: Some weeds have fruits or seeds with structures which adapt them to wind dispersal. They are light, e.g. Tridax, Aspillia africana. (iii) Dispersal through Explosive Mechanisms: Some weeds possess pods which, when dry, explode and scatter. e.g. Calapogonium, centrasema, pureria etc. (iv) Dispersal by water: Weed seeds like coconut are carried to long distances in water. Seeds dispersed by this method have light, hollow fruits which enhances their buoyancy.\n(b) The mechanical methods of controlling weeds are: (i) Hand pulling/hand picking:- This Involves uprooting weeds from the soil by hand. It is mostly used by peasant farmers and it is most effective for the control of annual and biennial weeds of raw crops. (ii) Hoeing: This involves uprooting weeds with hoes before or after planting. Roots of uprooted weeds are exposed to sunlight and killed. Hoes may be used to bury the weeds. (iii) Slashing: Through this method, the aerial part of the weeds are removed with cutlasses, leaving behind the roots in the soil. This can also be done using mowers mounted on tractor. (iv) Rotary cultivation: This involves using hand drawn implements to undertake the ploughing and burying of weeds.\n(c) The cultural methods of weed control are: (i) Flooding:- Flooding is one of the best ways of cultural weed control. Under this method, the farmland is surrounded by dikes and water is led into it, up to a height of 15-30 cm for about 6 weeks. The method is effective for controlling weeds with underground perennial organs.\n(ii) Burning: Burning as a cultural method of weed control involves setting the vegetation on fire, usually when preparing the land for planting. This method is effective for controlling weeds propagated by seeds and aerial portions.\n(iii) Mulching:- Mulching involves the placement of dead inactive materials e.g. grass or straw around planted crops. It also prevents weeds from sprouting and smothers those that have sprung up.\n(iv) Cover cropping:- This involves the planting of fast growing crops especially legumes such as mucuna and calopogonium on land to act as cover and to smother weeds. This method is effective in controlling weeds on plantation farms.\n(v) Crop rotation:- Crop rotation is an effective way of Controlling weeds associated with specific crop. The crops grown on the land are rotated to exclude the preferred crops and the weed is starved to death.",
    "explanation": "(a) The methods of weed dispersal are:- (i) Dispersal by Animals: Weed seeds such as desmodium possess adhesive substances which make them stick to passing people or animals and hence are carried to some distance by the people or animals they stick to. Some also have hooks, while rodents and birds carry edible fruits of weeds from one place to another (ii) Dispersal by wind: Some weeds have fruits or seeds with structures which adapt them to wind dispersal. They are light, e.g. Tridax, Aspillia africana. (iii) Dispersal through Explosive Mechanisms: Some weeds possess pods which, when dry, explode and scatter. e.g. Calapogonium, centrasema, pureria etc. (iv) Dispersal by water: Weed seeds like coconut are carried to long distances in water. Seeds dispersed by this method have light, hollow fruits which enhances their buoyancy.\n(b) The mechanical methods of controlling weeds are: (i) Hand pulling/hand picking:- This Involves uprooting weeds from the soil by hand. It is mostly used by peasant farmers and it is most effective for the control of annual and biennial weeds of raw crops. (ii) Hoeing: This involves uprooting weeds with hoes before or after planting. Roots of uprooted weeds are exposed to sunlight and killed. Hoes may be used to bury the weeds. (iii) Slashing: Through this method, the aerial part of the weeds are removed with cutlasses, leaving behind the roots in the soil. This can also be done using mowers mounted on tractor. (iv) Rotary cultivation: This involves using hand drawn implements to undertake the ploughing and burying of weeds.\n(c) The cultural methods of weed control are: (i) Flooding:- Flooding is one of the best ways of cultural weed control. Under this method, the farmland is surrounded by dikes and water is led into it, up to a height of 15-30 cm for about 6 weeks. The method is effective for controlling weeds with underground perennial organs.\n(ii) Burning: Burning as a cultural method of weed control involves setting the vegetation on fire, usually when preparing the land for planting. This method is effective for controlling weeds propagated by seeds and aerial portions.\n(iii) Mulching:- Mulching involves the placement of dead inactive materials e.g. grass or straw around planted crops. It also prevents weeds from sprouting and smothers those that have sprung up.\n(iv) Cover cropping:- This involves the planting of fast growing crops especially legumes such as mucuna and calopogonium on land to act as cover and to smother weeds. This method is effective in controlling weeds on plantation farms.\n(v) Crop rotation:- Crop rotation is an effective way of Controlling weeds associated with specific crop. The crops grown on the land are rotated to exclude the preferred crops and the weed is starved to death.",
    "year": "2002"
  },
  {
    "number": "146",
    "text": "(a) In a tabular form, name one fungal disease, one viral disease and one pest of any four of the following crops: (i) citrus; (ii) banana; (iii) tomato; (iv) yam; (v) groundnut. (b) State six general control measures of diseases of crops.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52374?exam_type=waec&type=theory&page=30",
    "correct_answer": "CROPFUNGAL DISEASEVIRAL DISEASEPESTCitrusgummosis, Citrus scaletristeza, citrus leaf curlscale insects, caterpillar, mealy bug, termites, fruitfliesBananapanama, sigatoka or cercosposa, leafspotbunchytopbats, monkeys, eel worm, banana borerTomatoroot rot or fusarium, wilt, leaf spotmosaic virusbudworms, grasshoppers, moths, white flies, red bugs, tomato miridYamleaf spot, dry rotmosaic virusyam bettle, yam eelworm, rodents, locust, scale insectsGroundnuttikka, wilt, seed rotrosettebruchid or beetle, cricket, aphid, rodent, weevil.\n(b) The general measures that can be adopted to control diseases of crops are:- (i) Crop rotation (ii) Soil treatment or sterilization (iii) Burning of infected crops or crop residue, (iv) Roguing or uprooting of infected crops, (v) Timely and regular spraying of crops with pesticides against vectors of diseases (vi) Maintenance of farm hygiene, (vii) Use of resistant varieties, (viii) Timely planting and harvesting of crops.",
    "explanation": "CROPFUNGAL DISEASEVIRAL DISEASEPESTCitrusgummosis, Citrus scaletristeza, citrus leaf curlscale insects, caterpillar, mealy bug, termites, fruitfliesBananapanama, sigatoka or cercosposa, leafspotbunchytopbats, monkeys, eel worm, banana borerTomatoroot rot or fusarium, wilt, leaf spotmosaic virusbudworms, grasshoppers, moths, white flies, red bugs, tomato miridYamleaf spot, dry rotmosaic virusyam bettle, yam eelworm, rodents, locust, scale insectsGroundnuttikka, wilt, seed rotrosettebruchid or beetle, cricket, aphid, rodent, weevil.\n(b) The general measures that can be adopted to control diseases of crops are:- (i) Crop rotation (ii) Soil treatment or sterilization (iii) Burning of infected crops or crop residue, (iv) Roguing or uprooting of infected crops, (v) Timely and regular spraying of crops with pesticides against vectors of diseases (vi) Maintenance of farm hygiene, (vii) Use of resistant varieties, (viii) Timely planting and harvesting of crops.",
    "year": "2002"
  },
  {
    "number": "147",
    "text": "(a) (i) What is culling? (ii) Give three reasons why culling is practised in livestock management. (b) State three advantages and three disadvantages of each of the following management systems in poultry production: (i) deep litter system; (ii) battery cage system.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52376?exam_type=waec&type=theory&page=30",
    "correct_answer": "(a)(i) Culling is the practice of removing all diseased or unproductive animals from the flock. (ii) Reasons for culling are: (1) Culling prevents the spread of diseases among animals. (2) It helps to get rid of unproductive animals. (3) It prevents overcrowding and reduces vices among birds. (4) It enhances the growth rate of the healthy animals (5) It also reduces losses that could have been incurred on feeding unproductive animals.\n(b)(i) The advantages of deep litter system are: (1) Deep litter system makes it possible to raise many birds under one roof. (2) The method makes birds to be completely under the control of the farmer. (3) Labour is also minimized through the system, as birds are all together. (4) The security of the birds is guaranteed as birds are protected from thieves and predators. (5) The system favours the production of fertile eggs. (6) It is a good system for raising broilers. (7) The capital to start the system is minimal.\nThe disadvantages of the system are:- (1) It leads to overcrowding which can bring about cannibalism, feather pecking and egg eating. (2) The system requires an efficient management. (3) Diseases can spread fast among the birds (4) A lot of energy is expended by birds as they roam about. (5) A large amount of feed is wasted during feeding.\n(ii) The advantages of the battery cage system are: (1) Battery cage system is suitable in areas where land is scarce. (2) It helps the farmer to keep proper record on the individual performance of birds. (3) The extent of cannibalism and other vices is reduced and this ensures that birds are protected from predators. (4) it is a good system for commercial and industrial egg production. (5) The system makes it possible for birds to eat and drink at a relative comfort. (6) It makes it easy to dispose of the waste (litter) and clean the house.\nThe disadvantages of the system are: (1) The system is very expensive. (2) It requires a very efficient management. (3) Birds are denied enough exercise. (4) Diets must be properly balanced at extra cost. (5) The system also brings about leg weakness and leg fatigue among birds.",
    "explanation": "(a)(i) Culling is the practice of removing all diseased or unproductive animals from the flock. (ii) Reasons for culling are: (1) Culling prevents the spread of diseases among animals. (2) It helps to get rid of unproductive animals. (3) It prevents overcrowding and reduces vices among birds. (4) It enhances the growth rate of the healthy animals (5) It also reduces losses that could have been incurred on feeding unproductive animals.\n(b)(i) The advantages of deep litter system are: (1) Deep litter system makes it possible to raise many birds under one roof. (2) The method makes birds to be completely under the control of the farmer. (3) Labour is also minimized through the system, as birds are all together. (4) The security of the birds is guaranteed as birds are protected from thieves and predators. (5) The system favours the production of fertile eggs. (6) It is a good system for raising broilers. (7) The capital to start the system is minimal.\nThe disadvantages of the system are:- (1) It leads to overcrowding which can bring about cannibalism, feather pecking and egg eating. (2) The system requires an efficient management. (3) Diseases can spread fast among the birds (4) A lot of energy is expended by birds as they roam about. (5) A large amount of feed is wasted during feeding.\n(ii) The advantages of the battery cage system are: (1) Battery cage system is suitable in areas where land is scarce. (2) It helps the farmer to keep proper record on the individual performance of birds. (3) The extent of cannibalism and other vices is reduced and this ensures that birds are protected from predators. (4) it is a good system for commercial and industrial egg production. (5) The system makes it possible for birds to eat and drink at a relative comfort. (6) It makes it easy to dispose of the waste (litter) and clean the house.\nThe disadvantages of the system are: (1) The system is very expensive. (2) It requires a very efficient management. (3) Birds are denied enough exercise. (4) Diets must be properly balanced at extra cost. (5) The system also brings about leg weakness and leg fatigue among birds.",
    "year": "2002"
  },
  {
    "number": "148",
    "text": "(a) Define the term \"disease.\" (b) State the difference between resistance and susceptibility to diseases. (c) Enumerate four economic importance of animal disease. (d) List three factors which determine the degree of resistance of an animal to a disease. (e) Outline three conditions that may inactivate a pathogenic organism.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52378?exam_type=waec&type=theory&page=30",
    "correct_answer": "(a) A disease can be defined as any abnormality in the functions of the tissues, organs or system of the animal body.\n(b) The difference between resistance and susceptibility to diseases is that an animal is said to be resistant to disease when it is not affected by an invading pathogenic disease-causing organism or pathogen while the animal is said to be susceptible to disease when it is not able to ward off the effect of the invading pathogenic organism, in which case it manifests disease symptoms.\n(c) The economic importance of animal diseases are: (i) The diseases bring about poor growth of animals (ii) Diseases lead to poor feed utilization by animals due to loss of appetite or anorexia (iii) Diseases bring about low yield of products (iv) Diseases in animals produce low income for farmers due to reduced quantity and quality of products and death of the animals.\n(d) The factors which determine the degree of an animal's resistance to a disease are: (i) development of immunity, (ii) specie of animal, (iii) innoculation, (iv) level of feeding, (v) age of animal, (vi) physiological condition of the animal. (e) The conditions that may inactivate a pathogen are: (i) low temperature (ii) high temperature (iii) sunlight and x-rays, (iv) high PH medium (v) low PH medium, (vi) dryness or low relative humidity.",
    "explanation": "(a) A disease can be defined as any abnormality in the functions of the tissues, organs or system of the animal body.\n(b) The difference between resistance and susceptibility to diseases is that an animal is said to be resistant to disease when it is not affected by an invading pathogenic disease-causing organism or pathogen while the animal is said to be susceptible to disease when it is not able to ward off the effect of the invading pathogenic organism, in which case it manifests disease symptoms.\n(c) The economic importance of animal diseases are: (i) The diseases bring about poor growth of animals (ii) Diseases lead to poor feed utilization by animals due to loss of appetite or anorexia (iii) Diseases bring about low yield of products (iv) Diseases in animals produce low income for farmers due to reduced quantity and quality of products and death of the animals.\n(d) The factors which determine the degree of an animal's resistance to a disease are: (i) development of immunity, (ii) specie of animal, (iii) innoculation, (iv) level of feeding, (v) age of animal, (vi) physiological condition of the animal. (e) The conditions that may inactivate a pathogen are: (i) low temperature (ii) high temperature (iii) sunlight and x-rays, (iv) high PH medium (v) low PH medium, (vi) dryness or low relative humidity.",
    "year": "2002"
  },
  {
    "number": "149",
    "text": "Explain the following terms used in agricultural production: (a) hired labour; (b) fixed capital; (c) working capital; (d) management.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52379?exam_type=waec&type=theory&page=30",
    "correct_answer": "(a) Hired labour is the labour from outside the farmer's family. Such labour is normally paid for as the work done in the farm. It is common where a farmer has a large farm size e.g. commercial farms where hired labour is engaged on either a permanent or time rate basis. Hired labour can be skilled or unskilled labour and it is always scarce and very expensive.\n(b). Fixed capital is also known as durable capital. It lasts longer than one production season i.e it cannot be consumed in. the course of one production. It includes all items which have more than one year of useful life, e.g. .buildings, machinery, equipment and dams. It is usually subject to depreciation as a result of the wear and tear of the item due to continued use. The size of the fixed capital is an indicator of the scale of production on the farm.\n(c) Working capital is also known as circulating or variable capital. It includes cash to pay for hired labour, seeds, fertilizers, feeds and fuel. This type of capital is used up within the season and it has to be replaced every season. It is the difference between total current assets and total current liabilities. It also determines the scale of operation on the farm.\n(d) Management is the mental energy used in production. It involves the effective combination of the other three factors of production i.e. capital, labour and land for maximum output. It is a form of skilled labour. It involves the management of the organisation and operation of its affairs to achieve some predetermined goals. It is a special skill which is usually acquired through a process of learning and training. Good management involves setting objectives, decision making, implementation, control and evaluation. Management arranges for the provision of finance for under-taking production and expansion.",
    "explanation": "(a) Hired labour is the labour from outside the farmer's family. Such labour is normally paid for as the work done in the farm. It is common where a farmer has a large farm size e.g. commercial farms where hired labour is engaged on either a permanent or time rate basis. Hired labour can be skilled or unskilled labour and it is always scarce and very expensive.\n(b). Fixed capital is also known as durable capital. It lasts longer than one production season i.e it cannot be consumed in. the course of one production. It includes all items which have more than one year of useful life, e.g. .buildings, machinery, equipment and dams. It is usually subject to depreciation as a result of the wear and tear of the item due to continued use. The size of the fixed capital is an indicator of the scale of production on the farm.\n(c) Working capital is also known as circulating or variable capital. It includes cash to pay for hired labour, seeds, fertilizers, feeds and fuel. This type of capital is used up within the season and it has to be replaced every season. It is the difference between total current assets and total current liabilities. It also determines the scale of operation on the farm.\n(d) Management is the mental energy used in production. It involves the effective combination of the other three factors of production i.e. capital, labour and land for maximum output. It is a form of skilled labour. It involves the management of the organisation and operation of its affairs to achieve some predetermined goals. It is a special skill which is usually acquired through a process of learning and training. Good management involves setting objectives, decision making, implementation, control and evaluation. Management arranges for the provision of finance for under-taking production and expansion.",
    "year": "2002"
  },
  {
    "number": "150",
    "text": "(a) Explain the term \"marketing.\" (b) State five importance of marketing in agriculture. (c) Mention five marketing functions. (d) In which four ways can the marketing of agricultural produce be encouraged?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/52381?exam_type=waec&type=theory&page=30",
    "correct_answer": "(a) Marketing is the exchange of agricultural produce and money between the consumer and the farmer. It includes all the processes involved in the transfer of produce from the farmer to the ultimate consumer.\n(b) The importance of marketing in Agriculture are: (i) Marketing locates areas of surplus production and relocates the produce to areas of shortages. (ii) It provides income from export trade and also provides foreign exchange for import of agricultural machines. (iii) It provides information to the farmer on what and how much of a produce he is to produce. (iv) Marketing ensures the availability of seasonal produce at off season. (v) It creates employment. (vi) It attracts basic amenities to rural communities. (vii) Through it, consumers' taste is known, thus enabling researchers to evolve varieties and better forms of produce.(viii) It encourages or motivates farmers to produce more.\n(c) The functions of marketing can be enumerated as follows: (i) Assembling, (ii) processing, (hi) financing; (iv) transportation, (v) distribution, (vi) storage, (vii) grading and standardization, (viii) packaging, (ix) advertising. (d) Marketing may be encouraged through the provision of: (i) good roads (ii) capital or finance; (iii) standard units of measurement, (iv) adequate market infrastructure (v) storage facilites. (vi) market research (vii) good government policies",
    "explanation": "(a) Marketing is the exchange of agricultural produce and money between the consumer and the farmer. It includes all the processes involved in the transfer of produce from the farmer to the ultimate consumer.\n(b) The importance of marketing in Agriculture are: (i) Marketing locates areas of surplus production and relocates the produce to areas of shortages. (ii) It provides income from export trade and also provides foreign exchange for import of agricultural machines. (iii) It provides information to the farmer on what and how much of a produce he is to produce. (iv) Marketing ensures the availability of seasonal produce at off season. (v) It creates employment. (vi) It attracts basic amenities to rural communities. (vii) Through it, consumers' taste is known, thus enabling researchers to evolve varieties and better forms of produce.(viii) It encourages or motivates farmers to produce more.\n(c) The functions of marketing can be enumerated as follows: (i) Assembling, (ii) processing, (hi) financing; (iv) transportation, (v) distribution, (vi) storage, (vii) grading and standardization, (viii) packaging, (ix) advertising. (d) Marketing may be encouraged through the provision of: (i) good roads (ii) capital or finance; (iii) standard units of measurement, (iv) adequate market infrastructure (v) storage facilites. (vi) market research (vii) good government policies",
    "year": "2002"
  }
]