[
  {
    "number": "741",
    "text": "The first agent of political socialization is",
    "options": {
      "A": "school",
      "B": "mass media",
      "C": "community",
      "D": "family"
    },
    "answer_url": "https://myschool.ng/classroom/government/18972?exam_type=waec&type=obj&page=149",
    "correct_answer": "D",
    "explanation": "The family is typically the first and most influential agent of political socialization. From early childhood, family members influence attitudes, beliefs and values, shaping one's understanding of politics and society long before exposure to other socializing agents like school or media.",
    "year": "2001"
  },
  {
    "number": "742",
    "text": "Baron Montesquieu was noted for the theory of",
    "options": {
      "A": "the rule of law",
      "B": "delegated legislation",
      "C": "separation of powers",
      "D": "equality before the law"
    },
    "answer_url": "https://myschool.ng/classroom/government/18974?exam_type=waec&type=obj&page=149",
    "correct_answer": "C",
    "explanation": "Baron Montesquieu is best known for advocating the theory of separation of powers. He proposed that dividing government power among three branches—executive, legislative, and judicial—would prevent any one branch from becoming too powerful and ensure a balance of power.",
    "year": "2001"
  },
  {
    "number": "743",
    "text": "Political sovereignty in the state resides with the",
    "options": {
      "A": "executive",
      "B": "people",
      "C": "national assembly",
      "D": "international community"
    },
    "answer_url": "https://myschool.ng/classroom/government/18975?exam_type=waec&type=obj&page=149",
    "correct_answer": "B",
    "explanation": "In a democratic system, political sovereignty ultimately resides with the people, as they hold the ultimate authority over the state's governance. They exercise this power by electing representatives and, in some cases, participating directly in decisions.",
    "year": "2001"
  },
  {
    "number": "744",
    "text": "Which of the following best describe an absolute monarchy?",
    "options": {
      "A": "He wields the supreme power in a state",
      "B": "is elected by an electoral college",
      "C": "is elected by the electorate",
      "D": "had fixed tenure of office"
    },
    "answer_url": "https://myschool.ng/classroom/government/18977?exam_type=waec&type=obj&page=149",
    "correct_answer": "A",
    "explanation": "In an absolute monarchy, the monarch holds supreme and unrestricted power over the state. They make decisions without any legal limitations or input from other branches of government.",
    "year": "2001"
  },
  {
    "number": "745",
    "text": "The modern idea of democracy includes all the following except",
    "options": {
      "A": "unlimited freedom",
      "B": "universal suffrage",
      "C": "periodic elections",
      "D": "equality before the law"
    },
    "answer_url": "https://myschool.ng/classroom/government/18980?exam_type=waec&type=obj&page=149",
    "correct_answer": "A",
    "explanation": "In a democracy, freedom is not unlimited. There are laws and regulations that limit individual freedoms to protect public order, security and the rights of others. Unlimited freedom could lead to anarchy, which is not compatible with the principles of democratic governance.",
    "year": "2001"
  },
  {
    "number": "746",
    "text": "Which of the following is a method of acquiring political power in a democracy?",
    "options": {
      "A": "heredity",
      "B": "election",
      "C": "imposition",
      "D": "selection"
    },
    "answer_url": "https://myschool.ng/classroom/government/18981?exam_type=waec&type=obj&page=150",
    "correct_answer": "B",
    "explanation": "In a democracy, political power is acquired through elections. Citizens vote to choose their representatives, who then hold office based on the mandate they receive from the people.",
    "year": "2001"
  },
  {
    "number": "747",
    "text": "One of the arguments against delegated legislation is that it",
    "options": {
      "A": "encroaches on the functions of the judiciary",
      "B": "is against the principle of separation of power",
      "C": "promotes limited government",
      "D": "wastes the time of the legislature"
    },
    "answer_url": "https://myschool.ng/classroom/government/18984?exam_type=waec&type=obj&page=150",
    "correct_answer": "B",
    "explanation": "One of the main criticisms of delegated legislation is that it can blur the lines between the executive and legislative branches of government. By allowing the executive (such as ministers or regulatory bodies) to make laws or rules without direct involvement from the legislature, it can undermine the separation of powers and give too much legislative authority to the executive.",
    "year": "2001"
  },
  {
    "number": "748",
    "text": "A practice by which semi autonomous units are given part of governmental powers and functions is known as",
    "options": {
      "A": "deconcentration",
      "B": "distribution",
      "C": "devolution",
      "D": "decongestion"
    },
    "answer_url": "https://myschool.ng/classroom/government/18986?exam_type=waec&type=obj&page=150",
    "correct_answer": "C",
    "explanation": "Devolutionis the process by which central government transfers certain powers and functions to semi-autonomous units (such as regional or local governments), giving them more control over their own affairs while remaining part of the state structure.",
    "year": "2001"
  },
  {
    "number": "749",
    "text": "A disadvantage of centralized administration is that",
    "options": {
      "A": "wide powers are allocated to sub-national bodies",
      "B": "the influence of the administration is easily felt by the local people",
      "C": "local people are not easily exploited by the sub-national agents",
      "D": "sub-national bodies are denied initiative in decision making"
    },
    "answer_url": "https://myschool.ng/classroom/government/18987?exam_type=waec&type=obj&page=150",
    "correct_answer": "D",
    "explanation": "In a centralised administration, most of the decision-making power is concentrated in the central government. This means that sub-national bodies, such as local governments or regional authorities, have limited autonomy and are unable to make decisions or implement policies without the approval of the central government.",
    "year": "2001"
  },
  {
    "number": "750",
    "text": "Judicial independence means that the courts are independent of the",
    "options": {
      "A": "Civil Service and the Bar",
      "B": "Executive and the Legislature",
      "C": "Legislature and the Ministry of Justice",
      "D": "Executive and the Military"
    },
    "answer_url": "https://myschool.ng/classroom/government/18999?exam_type=waec&type=obj&page=150",
    "correct_answer": "B",
    "explanation": "Judicial independence is the principle that the judiciary should be independent of the executive and legislative branches of government. This ensures that judges are free to make decisions based on the law and their interpretation of it, without interference or influence from political bodies, such as the executive (e.g., the president or government ministers) or the legislature (e.g., parliament or congress).",
    "year": "2001"
  },
  {
    "number": "751",
    "text": "A citizen can express loyalty to his nation by",
    "options": {
      "A": "participating in sports",
      "B": "supporting political parties",
      "C": "singing the national anthem when required",
      "D": "lobbying for ministrial appointment"
    },
    "answer_url": "https://myschool.ng/classroom/government/19001?exam_type=waec&type=obj&page=151",
    "correct_answer": "C",
    "explanation": "Loyalty to one's nation is expressed through acts of respect, unity, and pride.Singing the national anthem when requiredis a ceremonial act that reflects a citizen's loyalty to the nation. It is a symbol of national unity and respect for the country.",
    "year": "2001"
  },
  {
    "number": "752",
    "text": "A citizen can participate in the politics of his country by",
    "options": {
      "A": "acquiring university education",
      "B": "attending international meetings",
      "C": "contesting for an elective post",
      "D": "being a good sportsman"
    },
    "answer_url": "https://myschool.ng/classroom/government/19008?exam_type=waec&type=obj&page=151",
    "correct_answer": "C",
    "explanation": "A citizen can participate in the politics of his country bycontesting for an elective post. This is a direct way to engage in the political process by running for office and seeking to represent the interests of the people in government.",
    "year": "2001"
  },
  {
    "number": "753",
    "text": "The office of the ombudsman is created to acts as",
    "options": {
      "A": "spy for government",
      "B": "an agency to redress maladministration",
      "C": "regulator of government activities",
      "D": "sole administrator of public corporations"
    },
    "answer_url": "https://myschool.ng/classroom/government/19009?exam_type=waec&type=obj&page=151",
    "correct_answer": "B",
    "explanation": "The office of theombudsmanis designed to investigate complaints made by individuals against public authorities, government officials or public institutions. The primary role of an ombudsman is to address cases ofmaladministration, which can include issues like corruption, abuse of power or inefficiency in government. The ombudsman acts as a neutral party that helps to resolve disputes between citizens and the state.",
    "year": "2001"
  },
  {
    "number": "754",
    "text": "A constitution that has special rules for its amendment is said to be",
    "options": {
      "A": "written",
      "B": "federal",
      "C": "confederal",
      "D": "rigid"
    },
    "answer_url": "https://myschool.ng/classroom/government/19012?exam_type=waec&type=obj&page=151",
    "correct_answer": "D",
    "explanation": "Arigid constitutionis one that has specific and complex procedures for amendment. This type of constitution is the opposite aflexible constitution, which can be amended with ease by a simple majority in the legislature.",
    "year": "2001"
  },
  {
    "number": "755",
    "text": "Which of following statements best describes an unwritten constitution?",
    "options": {
      "A": "The legislature is always unicameral",
      "B": "The source of the constitution is supreme court verdicts",
      "C": "There are no limitations on the powers of government",
      "D": "The body of rules and laws cannot all be found in a single document"
    },
    "answer_url": "https://myschool.ng/classroom/government/19013?exam_type=waec&type=obj&page=151",
    "correct_answer": "D",
    "explanation": "Anunwritten constitutionis not contained in a single written document. Instead, it consists of a collection of laws, customs, practices and precedents that have developed over time. These rules can include statutes, judicial decisions and conventions, which together form the constitutional framework of a country. The United Kingdom is a prime example of a country with an unwritten constitution, as much of its constitutional framework is based on tradition and legal precedents rather than a single written document.",
    "year": "2001"
  },
  {
    "number": "756",
    "text": "The process by which people vote to elect their representatives is called",
    "options": {
      "A": "electoral system",
      "B": "plebiscite",
      "C": "electoral college",
      "D": "franchise"
    },
    "answer_url": "https://myschool.ng/classroom/government/19015?exam_type=waec&type=obj&page=152",
    "correct_answer": "A",
    "explanation": "Theelectoral systemrefers to the method or process through which people vote to elect their representatives. It includes the rules and procedures involved in the election, including how votes are cast, counted and translated into election results.",
    "year": "2001"
  },
  {
    "number": "757",
    "text": "Apart from making laws, the legislature has the important function of",
    "options": {
      "A": "implementing executive decisions",
      "B": "advising the judiciary",
      "C": "appointing the civil servants",
      "D": "checking the executive powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/19016?exam_type=waec&type=obj&page=152",
    "correct_answer": "D",
    "explanation": "Apart from making laws, one of the most important functions of the legislature is tocheck the executive powers. This is done through oversight functions, including scrutinising government actions, approving budgets and holding hearings or investigations into executive policies. This serves as a vital check on the executive branch.",
    "year": "2001"
  },
  {
    "number": "758",
    "text": "Which of the following is a demerit of bicameral legislature?",
    "options": {
      "A": "The scope for political participation is limited",
      "B": "Passing of bills into acts is delayed",
      "C": "No safeguard for the minority groups",
      "D": "There is tendency for despotic rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/19020?exam_type=waec&type=obj&page=152",
    "correct_answer": "B",
    "explanation": "Abicameral legislatureconsists of two chambers (e.g., the House of Commons and the House of Lords in the UK, or the Senate and House of Representatives in Nigeria). While this system provides a check and balance within the legislature, one of itsdemeritsis that it candelay the passage of bills. This happens because a bill has to go through both chambers before it can become law, which can lead to lengthy debates and delays, especially if the two chambers disagree.",
    "year": "2001"
  },
  {
    "number": "759",
    "text": "One from of delegated legislation is",
    "options": {
      "A": "case laws",
      "B": "statutory instruments",
      "C": "conventions",
      "D": "man-made laws"
    },
    "answer_url": "https://myschool.ng/classroom/government/19023?exam_type=waec&type=obj&page=152",
    "correct_answer": "B",
    "explanation": "Delegated legislationrefers to laws or regulations made by an authority (usually a government minister or body) under powers granted by an act of parliament. One form of delegated legislation isstatutory instruments, which are rules or orders issued by ministers that have the force of law. These are typically used to fill in the details or administrative aspects of primary legislation passed by parliaments.",
    "year": "2001"
  },
  {
    "number": "760",
    "text": "A system in which one level of government exercises an overwhelming authority over others can best be described as",
    "options": {
      "A": "confederal",
      "B": "parliamentary",
      "C": "unitary",
      "D": "presidential"
    },
    "answer_url": "https://myschool.ng/classroom/government/19029?exam_type=waec&type=obj&page=152",
    "correct_answer": "C",
    "explanation": "In aunitary system, one central government holds the majority of the power and authority over the entire country. While there may be local or regional governments, their powers are delegated by the central government and can be altered or taken away. This system contrasts with a federal system, where power is shared between a central government and regional (state or provincial) governments.",
    "year": "2001"
  },
  {
    "number": "761",
    "text": "A major weakness of a one-party system is that it",
    "options": {
      "A": "encourages the emergence of dictators",
      "B": "ensures freedom of political choice",
      "C": "negates the principle of one man one vote",
      "D": "requires a bicameral legislature"
    },
    "answer_url": "https://myschool.ng/classroom/government/19031?exam_type=waec&type=obj&page=153",
    "correct_answer": "A",
    "explanation": "Aone-party systemis a political system in which only one political party is allowed to hold power, and opposition parties are either banned or heavily restricted. This concentration of power in one party often reduces political competition and can pave the way for the emergence ofdictators, as there are no rival political forces to challenge the ruling party's authority.",
    "year": "2001"
  },
  {
    "number": "762",
    "text": "A multi-party system often leads to the formation of",
    "options": {
      "A": "Coalition government",
      "B": "dual government",
      "C": "dictatoral governmnet",
      "D": "monarchical government"
    },
    "answer_url": "https://myschool.ng/classroom/government/19035?exam_type=waec&type=obj&page=153",
    "correct_answer": "A",
    "explanation": "In amulti-party system, where several political parties exist and none may secure an outright majority in the legislature, parties often come together to form acoalition government. This is a partnership between different political parties, where they agree to work together to form a government and share executive power. This is common in parliamentary systems.",
    "year": "2001"
  },
  {
    "number": "763",
    "text": "Under a two-party system, the opposition party is as important as the ruling party because it",
    "options": {
      "A": "has equal unmber of supporters as the ruling party",
      "B": "is as strong as the ruling party",
      "C": "may force the government to resign",
      "D": "is the alternative government"
    },
    "answer_url": "https://myschool.ng/classroom/government/19038?exam_type=waec&type=obj&page=153",
    "correct_answer": "D",
    "explanation": "In atwo-party system, the opposition party serves as thealternative government. If the ruling party loses the confidence of the electorate or fails to perform effectively, the opposition party is ready to step in and take power. The opposition provides a counterbalance and offers policies and solutions that may appeal to voters who are dissatisfied with the current government.",
    "year": "2001"
  },
  {
    "number": "764",
    "text": "The dissolution of parliament is usually following by a",
    "options": {
      "A": "general election",
      "B": "referendum",
      "C": "plebiscite",
      "D": "resolution"
    },
    "answer_url": "https://myschool.ng/classroom/government/19040?exam_type=waec&type=obj&page=153",
    "correct_answer": "A",
    "explanation": "The dissolution of parliament leads to ageneral election. In many parliamentary systems, when the parliament is dissolved, it marks the end of its current term and the beginning of the process of electing a new parliament. This is done to elect new members to the legislative body, and sometimes, the ruling party may call for elections to form a new government.",
    "year": "2001"
  },
  {
    "number": "765",
    "text": "A major function of public corporation is to",
    "options": {
      "A": "construct roads and bridges",
      "B": "compete with private companies",
      "C": "provide certain essential service for all",
      "D": "collect revenue for government"
    },
    "answer_url": "https://myschool.ng/classroom/government/19041?exam_type=waec&type=obj&page=153",
    "correct_answer": "C",
    "explanation": "Apublic corporationis established by the government to provide essential services that are considered important for the public good. These services can include utilities (like water, electricity and gas), transportation (such as national airlines or railway systems) and communication services. The main goal is to ensure that all citizens have access to these services.",
    "year": "2001"
  },
  {
    "number": "766",
    "text": "Carpet-crossing is a characteristic of",
    "options": {
      "A": "monarchical system",
      "B": "Cabinet system",
      "C": "presidential system",
      "D": "unitary system"
    },
    "answer_url": "https://myschool.ng/classroom/government/19048?exam_type=waec&type=obj&page=154",
    "correct_answer": "B",
    "explanation": "Carpet-crossingis the practice of a member of a political party switching allegiance to another party, especially in a parliamentary orCabinet systemof government. This can be for personal interests, political pressures or ideological differences.",
    "year": "2001"
  },
  {
    "number": "767",
    "text": "A minister controls public corporations by",
    "options": {
      "A": "auditing the accounts of the corporations himself",
      "B": "giving general policy dirctives",
      "C": "criticzing the corporations through the mass media",
      "D": "undertaking day-to-day administration of the corporations"
    },
    "answer_url": "https://myschool.ng/classroom/government/19051?exam_type=waec&type=obj&page=154",
    "correct_answer": "B",
    "explanation": "In a government system, aministeroversees public corporations and parastatals by setting broadpolicy directivesand ensuring that these organizations follow the policy blueprint of the government in power. The minister does not involve themselves in the day-to-day administration of the corporation but provides the overarching guidance and policy framework within which the corporation operates. The day-to-day administration is handled by the General Manager of the corporation under the guidance of the Board of Directors.",
    "year": "2001"
  },
  {
    "number": "768",
    "text": "When there is a second chamber in a federal state, it",
    "options": {
      "A": "makes up for the imbalance in the representation in the lower house",
      "B": "ensures that the judicary is independent of the executive",
      "C": "reduces the power of the electorate",
      "D": "alone makes laws for the country"
    },
    "answer_url": "https://myschool.ng/classroom/government/19053?exam_type=waec&type=obj&page=154",
    "correct_answer": "A",
    "explanation": "In a federal system, the second chamber (often called theSenateorUpper House) is designed to ensure fair representation of the states or regions, especially when the first chamber (theLower House) is based on population. The second chamber gives equal representation to each state or region, regardless of size or population and balances the influence of more populous areas and less populous regions.",
    "year": "2001"
  },
  {
    "number": "769",
    "text": "Countries adopt federal system of government because of",
    "options": {
      "A": "uneven development",
      "B": "adoption of a state religion",
      "C": "the fear of domination of minorities",
      "D": "the availability of limited resources"
    },
    "answer_url": "https://myschool.ng/classroom/government/19055?exam_type=waec&type=obj&page=154",
    "correct_answer": "C",
    "explanation": "Countries adopt afederal system of governmentprimarily to address issues such asethnic diversityor thefear of domination of minoritiesby a majority group. In a federal system, power is shared between the central government and regional or state governments, which helps to prevent any single group from monopolizing power and ensures that different regions or ethnic groups have a degree of autonomy in governance. This is especially important in multi-ethnic, multi-lingual, or diverse societies.",
    "year": "2001"
  },
  {
    "number": "770",
    "text": "The three main contesting issues about revenue allocation in Nigeria are",
    "options": {
      "A": "oil, cocoa, and groundnut",
      "B": "oil, minority and majority",
      "C": "ethnicity, corruption",
      "D": "derivation, population and even development"
    },
    "answer_url": "https://myschool.ng/classroom/government/19057?exam_type=waec&type=obj&page=154",
    "correct_answer": "D",
    "explanation": "The three main contesting issues aboutrevenue allocationin Nigeria typically focus on:\nDerivation: This concerns the revenue allocation from natural resources, especially oil, and how much the producing states should receive in relation to their contribution.Population: This refers to how population size impacts the allocation of resources to different states, with more populous states potentially receiving more funding.Even development: This involves ensuring that resources are allocated in such a way that fosters balanced development across Nigeria, addressing regional disparities.\nThese issues have been central to debates over Nigeria's federal revenue allocation formula, with various stakeholders advocating for adjustments based on these factors.",
    "year": "2001"
  },
  {
    "number": "771",
    "text": "In Nigeria, the concurrent list of powers belongs to the",
    "options": {
      "A": "local authority only",
      "B": "executive, the judiciary and the legisture",
      "C": "federal and state governments",
      "D": "state and local government"
    },
    "answer_url": "https://myschool.ng/classroom/government/19060?exam_type=waec&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "In Nigeria, theConcurrent Listrefers to areas where both thefederal governmentandstate governmentsshare responsibility and have the authority to legislate. These are areas where both levels of government can make laws and exercise powers.",
    "year": "2001"
  },
  {
    "number": "772",
    "text": "Rule by decrees is associated with",
    "options": {
      "A": "military government",
      "B": "totalitarian governments",
      "C": "democratic system",
      "D": "delegated legislation"
    },
    "answer_url": "https://myschool.ng/classroom/government/19062?exam_type=waec&type=obj&page=155",
    "correct_answer": "A",
    "explanation": "Rule by decreesis primarily associated with themilitary government. In such systems, the military leadership governs the country without a legislative body or a constitution that is publicly debated or voted on. Instead, military leaders issue decrees, which are legal orders that do not require the approval of elected representatives. These decrees have the force of law and are often used to bypass democratic processes.",
    "year": "2001"
  },
  {
    "number": "773",
    "text": "Which of the following Nigerian constitutions brought the Northern Provinces into the Legislative Council?",
    "options": {
      "A": "The 1979 Constitution",
      "B": "The Richards Constitution",
      "C": "The Clifford Constitution",
      "D": "The Lyttletion Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/19064?exam_type=waec&type=obj&page=155",
    "correct_answer": "B",
    "explanation": "TheRichards Constitutionof 1946 introduced theNorthern Provincesinto theLegislative Councilof Nigeria. Prior to this, the Northern Provinces were not represented in the council, which had been composed mainly of representatives from the Southern regions.",
    "year": "2001"
  },
  {
    "number": "774",
    "text": "Under the Independence Constitutions of Nigeria, the Court of Appeal was the",
    "options": {
      "A": "West African Court of Appeal",
      "B": "Sharia Court of Nigeria",
      "C": "Privy Council in Britain",
      "D": "Supreme Millitary Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/19066?exam_type=waec&type=obj&page=155",
    "correct_answer": "C",
    "explanation": "ThePrivy Councilin Britain was the highest court of appeal for Nigeria until 1963 where the Supreme Court in Nigeria became the final court of aoppeal.",
    "year": "2001"
  },
  {
    "number": "775",
    "text": "The Nigerian Youth Movement (NYM) collapsed because of",
    "options": {
      "A": "leadership struggle",
      "B": "the ban on the press by the government",
      "C": "high-handedness by the leadership",
      "D": "corruption and nepotism"
    },
    "answer_url": "https://myschool.ng/classroom/government/19070?exam_type=waec&type=obj&page=155",
    "correct_answer": "A",
    "explanation": "TheNigerian Youth Movement (NYM)collapsed primarily due toleadership struggles. The NYM, which was one of the first significant political parties in Nigeria, faced internal divisions over leadership.",
    "year": "2001"
  },
  {
    "number": "776",
    "text": "A major reason why the warrant chiefs were rejected in Eastern Nigeria was that",
    "options": {
      "A": "the chiefs were illiterates",
      "B": "they were no indigenes",
      "C": "they usurped the positions of the nationalists",
      "D": "the system was not customary"
    },
    "answer_url": "https://myschool.ng/classroom/government/19073?exam_type=waec&type=obj&page=156",
    "correct_answer": "D",
    "explanation": "TheWarrant Chiefsin Eastern Nigeria were rejected primarily because the system wasnot customary. The British colonial administration created theWarrant Chiefsin the early 20th century as part of their indirect rule system. These chiefs were appointed by the British in Eastern Nigeria because they had no centralised administration. The appointed chiefs lacked legitimacy in the eyes of the local people because they were not chosen through indigenous systems of leadership and they were seen as foreign impositions.",
    "year": "2001"
  },
  {
    "number": "777",
    "text": "After the annexation in 1861, Lagos became a",
    "options": {
      "A": "trust territory",
      "B": "crown colony",
      "C": "protectorate",
      "D": "consular territory"
    },
    "answer_url": "https://myschool.ng/classroom/government/19076?exam_type=waec&type=obj&page=156",
    "correct_answer": "B",
    "explanation": "After theannexation of Lagos in 1861, Lagos became aCrown Colonyin 1865. This means it was directly governed by the British government, with a colonial administration appointed by the British Crown. As a Crown Colony, Lagos was under British control and subject to the authority of a British-appointed governor.",
    "year": "2001"
  },
  {
    "number": "778",
    "text": "In the Hause/Fulani traditional political administration, the Madawaki was the",
    "options": {
      "A": "chief judge",
      "B": "chief tax collector",
      "C": "head of fishermen",
      "D": "commander of the calvary"
    },
    "answer_url": "https://myschool.ng/classroom/government/19078?exam_type=waec&type=obj&page=156",
    "correct_answer": "D",
    "explanation": "In theHausa/Fulanitraditional political administration, theMadawakiwas thecommander of the calvary. He led the army in the emirate.",
    "year": "2001"
  },
  {
    "number": "779",
    "text": "The chairman of the Unity Party of Nigeria (UPN) during the Second republic in Nigeria was",
    "options": {
      "A": "Aminu Kano",
      "B": "Joseph Wayas",
      "C": "Ume Ezeoke",
      "D": "Obafemi Awolowo"
    },
    "answer_url": "https://myschool.ng/classroom/government/19081?exam_type=waec&type=obj&page=156",
    "correct_answer": "D",
    "explanation": "During theSecond Republicin Nigeria (1979–1983),Obafemi Awolowowas thechairmanof theUnity Party of Nigeria (UPN). Awolowo, a prominent Nigerian statesman, was the founder and leader of the UPN.",
    "year": "2001"
  },
  {
    "number": "780",
    "text": "Among the Yoruba, the presentation of parrot egg to the Oba indicates",
    "options": {
      "A": "outright rejection by his subjects",
      "B": "acceptance of royal order",
      "C": "obeisance and homage to the king",
      "D": "prayer for long life for the king"
    },
    "answer_url": "https://myschool.ng/classroom/government/19083?exam_type=waec&type=obj&page=156",
    "correct_answer": "A",
    "explanation": "Among theYoruba people, presenting aparrot eggto theOba (king)is a symbolic gesture that signifies the outright rejection of the king by his subjects. On this occasion, he is required to abdicate the throne and commit suicide.",
    "year": "2001"
  },
  {
    "number": "781",
    "text": "One important effect of the 1922 Constitution of Nigeria was the",
    "options": {
      "A": "formation of political parties",
      "B": "establishment of university in West Africa",
      "C": "fusion of both the legislative and executive powers",
      "D": "establishment of a military government"
    },
    "answer_url": "https://myschool.ng/classroom/government/19088?exam_type=waec&type=obj&page=157",
    "correct_answer": "A",
    "explanation": "The Clifford Constitution of 1922 created a conducive atmosphere for political activities and the formation of political parties in Lagos and Calabar e.g the NNDP of Herbert Macauley.",
    "year": "2001"
  },
  {
    "number": "782",
    "text": "During the 1964 Federal elections in Nigeria, there was a total boycott of voting in",
    "options": {
      "A": "Lagos",
      "B": "the Northern Region",
      "C": "the Eastern Region",
      "D": "the Mid-Western Region"
    },
    "answer_url": "https://myschool.ng/classroom/government/19094?exam_type=waec&type=obj&page=157",
    "correct_answer": "C",
    "explanation": "During the1964 Federal electionsin Nigeria, theEastern Regionexperienced atotal boycottof voting. This was due to political unrest and the dissatisfaction of theEastern Region's leadersunder the umbrella of theNational Convention of Nigerian Citizens (NCNC), with the conduct of the election and the political situation at the time. The boycott was a protest against alleged electoral malpractice and irregularities in the elections.",
    "year": "2001"
  },
  {
    "number": "783",
    "text": "In pre-colonial West Africa no centralized political administration existed among the",
    "options": {
      "A": "Hausa",
      "B": "Igbo",
      "C": "Yoruba",
      "D": "Kanuri"
    },
    "answer_url": "https://myschool.ng/classroom/government/19098?exam_type=waec&type=obj&page=157",
    "correct_answer": "B",
    "explanation": "In pre-colonial West Africa, the Igbo people were known for theirdecentralized political structure. Unlike the Hausa, Yoruba, and Kanuri, who had more centralized systems of governance with powerful kings or rulers, the Igbo practised a system of governance that was moreegalitariananddecentralized. They had various forms of community-based leadership, includingage grades,councils of eldersandmarket leaders. There was no single centralized authority or king and decisions were made through consensus among the community members.",
    "year": "2001"
  },
  {
    "number": "784",
    "text": "Under the Nigeria Constitution of 1979 representation in the lower House was based on",
    "options": {
      "A": "equality of states",
      "B": "the gepgraphical size of each state",
      "C": "the population of each state",
      "D": "number of local government in each state"
    },
    "answer_url": "https://myschool.ng/classroom/government/19104?exam_type=waec&type=obj&page=157",
    "correct_answer": "C",
    "explanation": "Under theNigeria Constitution of 1979, the representation in theHouse of Representatives(the lower house) was based on thepopulation of each state. This was done to ensure that each state had representation proportionate to its population size.",
    "year": "2001"
  },
  {
    "number": "785",
    "text": "Who among the following was dismissed from the Action Group at the Jos Congress of February, 1962?",
    "options": {
      "A": "Anthony Enahoro",
      "B": "Ladoke Akintola",
      "C": "Dauda Adegbenro",
      "D": "Adesoji Aderemi"
    },
    "answer_url": "https://myschool.ng/classroom/government/19111?exam_type=waec&type=obj&page=157",
    "correct_answer": "B",
    "explanation": "At theJos Congress of February 1962,Ladoke Akintolawas dismissed from theAction Group (AG). This led to a split within the Action Group. Akintola, who was the deputy premier of Western Nigeria at the time, had differences with the party leader, Chief Obafemi Awolowo and this is what led to his expulsion from the party.",
    "year": "2001"
  },
  {
    "number": "786",
    "text": "If the receiving state does not approve a diplomat on account of his past activities, he is considered",
    "options": {
      "A": "a dozen of diploma corps",
      "B": "an extra-ordinary ambassador",
      "C": "an ambassador plenipotentiary",
      "D": "a persona non grata"
    },
    "answer_url": "https://myschool.ng/classroom/government/19119?exam_type=waec&type=obj&page=158",
    "correct_answer": "D",
    "explanation": "Apersona non gratais a diplomatic term used when a host country rejects or does not approve of a foreign diplomat due to the diplomat's past actions, behaviour or activities that are deemed unacceptable by the receiving state. Once declared persona non grata, the diplomat must be recalled by their home country.",
    "year": "2001"
  },
  {
    "number": "787",
    "text": "Nigeria's ideal of Africa as the centerpiece of her foreign policy includes all the following except",
    "options": {
      "A": "support for Apartheid policy in South Africa",
      "B": "promotion of African unity",
      "C": "creation of more Nigerian missions in Africa",
      "D": "Settling of disputes in Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/19126?exam_type=waec&type=obj&page=158",
    "correct_answer": "A",
    "explanation": "Nigeria's foreign policy, particularly with regard to Africa, has been centred on promotingAfrican unity,settling disputes in Africa, andcreating more Nigerian missions in Africa. Nigeria has consistently supported thefight against apartheid in South Africa.Nigeria's stance has always been in favour ofpromoting equalityand supporting anti-apartheid movements, especially through its involvement with theOrganization of African Unity (OAU)and other international efforts.",
    "year": "2001"
  },
  {
    "number": "788",
    "text": "The organ of the Organization of African Unity (OAU) responsible for the appointment of the Secretary-General is the",
    "options": {
      "A": "Appointment Commission",
      "B": "Liberation Committee",
      "C": "Assembly of the Heads of State and Goverments",
      "D": "Economic and Social Commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/19133?exam_type=waec&type=obj&page=158",
    "correct_answer": "C",
    "explanation": "TheAssembly of the Heads of State and Governmentsis the highest decision-making body of theOrganization of African Unity (OAU). It was responsible for appointing theSecretary-Generalof the OAU. The Assembly consists of the heads of state or government of all member countries, and they make key decisions on major issues, including the appointment of the Secretary-General.",
    "year": "2001"
  },
  {
    "number": "789",
    "text": "Which of the following is an organ of the United Nations Organization (UNO)?",
    "options": {
      "A": "Assembly of Heads of State",
      "B": "International Labour Organization",
      "C": "Council of Ministers",
      "D": "The Security Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/19136?exam_type=waec&type=obj&page=158",
    "correct_answer": "D",
    "explanation": "TheSecurity Councilis one of the six main organs of theUnited Nations Organization (UNO). Its primary responsibility is to maintain international peace and security. The Security Council can take measures to address threats to peace, including sanctions, peacekeeping missions or military action.",
    "year": "2001"
  }
]