[
  {
    "number": "49",
    "text": "(a) Give the reason in each case why it is necessary to:\n(i) moisten a piece of litmus paper used in testing for the acidity or alkalinity of a gas.\n(i) acidify the test solution with dilute hydrochloric acid in the confirmatory test for SO\\(_4^2\\)\n \n(b)(i) List two gases that must not be prepared in the open laboratory\n(ii) Mention one precaution that should be taken in the laboratory to prevent excessive inhalation of these gases during their preparation.\n(iii) State one use of each of the following pieces of apparatus in the laboratory. I. Wash bottle II. Tripod stand\n(c) State what would be observed when:\n(i) Pb(NO\\(_3\\))\\(_2\\) is needed\n(ii) concentrated HCI is added to MnO\\(_2\\)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60084?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "50",
    "text": "All your burette readings (initial and final), as well as the size of your pipette, must be recorded but no account of experimental procedure is required. All calculations must be done in your answer book.\nA is a solution of HCI containing 5.0g dm\\(^{-3}\\). B is a solution of impure KOH containing 6.50g dm\\(^{-3}\\).\na) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portions of B using methyl orange as indicator Tabulate your burette readings and calculate the average volume of A used. The equation for the reaction involved in the titration is: HCI\\(_{(aq)}\\)  KOH\\(_{(aq)}\\) \\(\\to\\) Cl\\(_{(aq)}\\)  H\\(_2\\)O\\(_{(l)}\\)\n(b) From your results and the information provided above, calculate the:\n(i) concentration of A in mol dm\\(^{-3}\\)\n(ii) concentration of B in mol dm\\(^{-3}\\)\n(iii) percentage purity of KOH in B [H= 1; CI = 35.5; KOH = 56.0g mol\\(^{-1}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60085?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "51",
    "text": "Credit will be given for strict adherere to the instructions, for observations precisely recorded and for accurate inferences. All tests, observations, and inferences must be clearly entered in your answer book, in ink, at the time they are made.\nC is a sample of iron (ii) tetraoxosulphate (VI). D is a sample of zinc trioxocarbonate (IV). Carry out the following exercises on C and D. Record your observations and identify any gases evolved. State the conclusion you draw from the result of each test.\n(a)(i) Put all of C in a test tube and add about 5 cm\\(^3\\) of distilled water. Stir and test with litmus paper. Divide the solution into two portions\n(ii) To the first portion, add sodium hydroxide solution in drops and then in excess.\n(iii) To the second portion, add few drops of barium chloride solution, followed by dilute hydrochloric acid in excess.\n \n(b)(i) Put half of D in a dry test tube and heat strongly. Allow to cool.\n(ii) Add about 5 cm\\(^3\\) of dilute hydrochloric acid to the residue and divide the solution into two portions.\n(iii) To the first portion, add sodium hydroxide solution in drops and then in excess.\n(iv) To the second portion, add aqueous ammonia in drops and then in excess.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60086?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  }
]