[
  {
    "number": "1769",
    "text": "Which political system allows only one ideology for the state?",
    "options": {
      "A": "socialism",
      "B": "aristocracy",
      "C": "communalism",
      "D": "capitalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/62806?exam_type=waec&type=obj&page=354",
    "correct_answer": "A",
    "explanation": "In a socialist state, the government typically controls the means of production and distribution of goods, and the state ideology is centred around the principles of socialism. This often leads to a situation where other ideologies are not officially tolerated or are suppressed.",
    "year": "2022"
  },
  {
    "number": "1770",
    "text": "In a representative government, citizens exercise their political power",
    "options": {
      "A": "directly",
      "B": "indirectly",
      "C": "in reverence for the political system",
      "D": "under undue political pressure"
    },
    "answer_url": "https://myschool.ng/classroom/government/62981?exam_type=waec&type=obj&page=354",
    "correct_answer": "B",
    "explanation": "In a representative government, citizens elect representatives to make decisions on their behalf. These elected representatives then formulate and implement policies, laws, and decisions. The process of citizens choosing representatives is an indirect way for the public to exercise political power within the system.",
    "year": "2022"
  },
  {
    "number": "1771",
    "text": "The essence of the concept of devolution is to cater for the interests of the",
    "options": {
      "A": "ruling governement",
      "B": "majority",
      "C": "minority",
      "D": "rule of law"
    },
    "answer_url": "https://myschool.ng/classroom/government/62983?exam_type=waec&type=obj&page=355",
    "correct_answer": "B",
    "explanation": "Devolution involves transferring powers and responsibilities from central to regional or local governments, often to address the needs and preferences of the majority or local populations more effectively.",
    "year": "2022"
  },
  {
    "number": "1772",
    "text": "A country's constitution may be derived from which one of the following sources?",
    "options": {
      "A": "Educated elites",
      "B": "Civil society organisations",
      "C": "civil disobedience",
      "D": "Customs and conventions"
    },
    "answer_url": "https://myschool.ng/classroom/government/62986?exam_type=waec&type=obj&page=355",
    "correct_answer": "D",
    "explanation": "Customs and conventions, along with other sources like statutory laws, judicial precedents and historical documents can influence and shape a country's constitution. These unwritten practices and norms often play a significant role in the development and interpretation of constitutional frameworks.",
    "year": "2022"
  },
  {
    "number": "1773",
    "text": "One major problem associated with the cabinet system of government is the",
    "options": {
      "A": "abuse of power",
      "B": "frequent change of government",
      "C": "large number of ministers",
      "D": "supremacy of the executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/62990?exam_type=waec&type=obj&page=355",
    "correct_answer": "A",
    "explanation": "In a cabinet system, where the executive is drawn from the legislature and holds significant power, there is potential for abuse if checks and balances are not effectively maintained. This can occur when the cabinet or its members act beyond their authority or in self-interest rather than the public interest.",
    "year": "2022"
  },
  {
    "number": "1774",
    "text": "Representative governments around the world pay attention to public opinion because of the following factors except",
    "options": {
      "A": "protection of the government from media scrutiny",
      "B": "indication of government in good standing with the people",
      "C": "provision of feedback on implementation of government policies",
      "D": "national security concerns"
    },
    "answer_url": "https://myschool.ng/classroom/government/62992?exam_type=waec&type=obj&page=355",
    "correct_answer": "A",
    "explanation": "Governments typically monitor public opinion to gauge their standing with the people, receive feedback on policy implementation and address national security concerns but the protection from media scrutiny is not a primary reason for paying attention to public opinion.",
    "year": "2022"
  },
  {
    "number": "1775",
    "text": "The determination and execution of government policies is the core function of",
    "options": {
      "A": "Public Complain Commission",
      "B": "Public Service Commission",
      "C": "Civil Service",
      "D": "Judicial Service"
    },
    "answer_url": "https://myschool.ng/classroom/government/62994?exam_type=waec&type=obj&page=355",
    "correct_answer": "C",
    "explanation": "The Civil Service is responsible for implementing government policies and managing the day-to-day operations of government departments and agencies.",
    "year": "2022"
  },
  {
    "number": "1776",
    "text": "Public corporation has a legal personality which means that",
    "options": {
      "A": "no legal suit can be brought against",
      "B": "it can sue and can be sued",
      "C": "it has ultimate power to make its own laws",
      "D": "there is a legal department that represents it"
    },
    "answer_url": "https://myschool.ng/classroom/government/62996?exam_type=waec&type=obj&page=356",
    "correct_answer": "B",
    "explanation": "Legal personality grants a public corporation the ability to engage in legal actions, such as initiating lawsuits or defending itself in court, just like a private individual or business entity.",
    "year": "2022"
  },
  {
    "number": "1777",
    "text": "Local Government authorities may not receive cooperation from the local people due to  the issue of",
    "options": {
      "A": "top bottom approach to development",
      "B": "accessibility to internet facilities",
      "C": "lack of support for the ruling governemnt",
      "D": "non availability of spiritual centres"
    },
    "answer_url": "https://myschool.ng/classroom/government/62999?exam_type=waec&type=obj&page=356",
    "correct_answer": "C",
    "explanation": "When local communities do not support the ruling government or perceive that the local government is not addressing their needs effectively, it can lead to a lack of cooperation and engagement with local government initiatives.",
    "year": "2022"
  },
  {
    "number": "1778",
    "text": "Delegated legislation can be controlled by",
    "options": {
      "A": "report writing",
      "B": "press conferences",
      "C": "parliamentary question time",
      "D": "threat of secession"
    },
    "answer_url": "https://myschool.ng/classroom/government/63004?exam_type=waec&type=obj&page=356",
    "correct_answer": "C",
    "explanation": "Parliamentary question time allows members of the legislature to question government officials about the implementation and impact of delegated legislation, ensuring oversight and accountability.",
    "year": "2022"
  },
  {
    "number": "1779",
    "text": "A one-party system imposed by law with all other parties proscribed is",
    "options": {
      "A": "a social party system",
      "B": "a de jure one party system",
      "C": "a communist political system",
      "D": "an elitist party system"
    },
    "answer_url": "https://myschool.ng/classroom/government/63010?exam_type=waec&type=obj&page=356",
    "correct_answer": "B",
    "explanation": "A one-party system imposed by law with all other parties proscribed is referred to as a \"de jure one-party system.\" This means that the single-party rule is established by legal or official means, and the existence of other political parties is explicitly prohibited. This type of system is often associated with authoritarian or totalitarian regimes where political power is concentrated in a single party, and opposition parties are not allowed to operate legally.",
    "year": "2022"
  },
  {
    "number": "1780",
    "text": "Multi-party system is saddled with the problem of",
    "options": {
      "A": "divisiveness",
      "B": "limited choice",
      "C": "weak opposition",
      "D": "political consciousness"
    },
    "answer_url": "https://myschool.ng/classroom/government/63012?exam_type=waec&type=obj&page=356",
    "correct_answer": "A",
    "explanation": "With many parties representing a wide range of interests and ideologies, a multi-party system can lead to fragmentation and division within the political landscape and make it challenging to form stable governments and achieve consensus.",
    "year": "2022"
  },
  {
    "number": "1781",
    "text": "One of the importance of voting in a democracy is that, it",
    "options": {
      "A": "is less expensive",
      "B": "ensures development for all voters",
      "C": "commits citizens to the political system",
      "D": "ensures winner takes all policy."
    },
    "answer_url": "https://myschool.ng/classroom/government/63022?exam_type=waec&type=obj&page=357",
    "correct_answer": "C",
    "explanation": "Voting engages citizens in the democratic process, giving them a stake in the governance and direction of their country. It fosters a sense of responsibility and involvement in shaping public policy and leadership.",
    "year": "2022"
  },
  {
    "number": "1782",
    "text": "An electoral system in which the electorate elects a small group of people who in turn elects political office holders is known as",
    "options": {
      "A": "general election",
      "B": "second ballot system",
      "C": "Electoral college",
      "D": "local election"
    },
    "answer_url": "https://myschool.ng/classroom/government/63024?exam_type=waec&type=obj&page=357",
    "correct_answer": "C",
    "explanation": "The Electoral College is used in some electoral systems, such as in the United States, where electors chosen by the voters then select the president and vice president.",
    "year": "2022"
  },
  {
    "number": "1783",
    "text": "Most pressure groups especially in West Africa fail to achieve their goals as a result of",
    "options": {
      "A": "good governance",
      "B": "charisma of the president",
      "C": "transparency of the legislature",
      "D": "corrupt leadership"
    },
    "answer_url": "https://myschool.ng/classroom/government/63025?exam_type=waec&type=obj&page=357",
    "correct_answer": "D",
    "explanation": "Corruption within leadership can undermine the effectiveness of pressure groups by hindering their ability to advocate for change by influencing decision-making processes and affecting overall governance and policy implementation.",
    "year": "2022"
  },
  {
    "number": "1784",
    "text": "A pressure group which resorts to violence as a means of pressing home its demands is described as",
    "options": {
      "A": "anomic",
      "B": "associational",
      "C": "labour",
      "D": "attitudinal"
    },
    "answer_url": "https://myschool.ng/classroom/government/63026?exam_type=waec&type=obj&page=357",
    "correct_answer": "A",
    "explanation": "Anomic pressure groups are characterised by their use of unconventional or violent methods to achieve their goals, often due to frustration with traditional channels of influence.",
    "year": "2022"
  },
  {
    "number": "1785",
    "text": "Press control is necessary for a state, particularly in the area of",
    "options": {
      "A": "the economy",
      "B": "auditor general's report",
      "C": "state security and secrets",
      "D": "foreign trade"
    },
    "answer_url": "https://myschool.ng/classroom/government/63028?exam_type=waec&type=obj&page=357",
    "correct_answer": "C",
    "explanation": "Regulating press activities can be important for protecting sensitive information related to national security and state secrets. However, it is essential to balance such controls with the need for freedom of the press and public transparency.",
    "year": "2022"
  },
  {
    "number": "1786",
    "text": "The media helps to enrich discourse on national issues through its",
    "options": {
      "A": "marketing",
      "B": "editorial comments",
      "C": "sales and advertisement",
      "D": "correspondents"
    },
    "answer_url": "https://myschool.ng/classroom/government/63029?exam_type=waec&type=obj&page=358",
    "correct_answer": "B",
    "explanation": "Editorial comments provide analysis, opinions and perspectives on current events and national issues by contributing to public debate and understanding.",
    "year": "2022"
  },
  {
    "number": "1787",
    "text": "Information dissemination and communication in a political environment had been made faster and easier with the advent of",
    "options": {
      "A": "educated practitioners",
      "B": "press censorship",
      "C": "government spokemen",
      "D": "social media"
    },
    "answer_url": "https://myschool.ng/classroom/government/63033?exam_type=waec&type=obj&page=358",
    "correct_answer": "D",
    "explanation": "Social media platforms enable rapid and widespread sharing of information and allow for quicker communication and greater engagement with the public on political issues.",
    "year": "2022"
  },
  {
    "number": "1788",
    "text": "The passing of laws by an arm of government to regulate society is the function of the",
    "options": {
      "A": "judiciary",
      "B": "executive",
      "C": "legislature",
      "D": "police"
    },
    "answer_url": "https://myschool.ng/classroom/government/63034?exam_type=waec&type=obj&page=358",
    "correct_answer": "C",
    "explanation": "The legislature, also known as the legislative branch, is responsible for creating, debating and enacting laws that govern society.",
    "year": "2022"
  },
  {
    "number": "1789",
    "text": "Militant nationalism in British West Africa after World War II sought to",
    "options": {
      "A": "kill British nationals",
      "B": "overthrow colonialism",
      "C": "stop the export of raw materials",
      "D": "stop the denigration of the African culture."
    },
    "answer_url": "https://myschool.ng/classroom/government/63035?exam_type=waec&type=obj&page=358",
    "correct_answer": "B",
    "explanation": "Militant nationalism was driven by the desire to end colonial rule and achieve independence from British control. The focus was on political liberation and self-determination rather than targeting individuals or specific policies.",
    "year": "2022"
  },
  {
    "number": "1790",
    "text": "Proto-nationalism was a movement limited to the demands for",
    "options": {
      "A": "immediate end to colonialism",
      "B": "reforms of the political class and respect for African religion",
      "C": "western education",
      "D": "social amenities and political participation"
    },
    "answer_url": "https://myschool.ng/classroom/government/63036?exam_type=waec&type=obj&page=358",
    "correct_answer": "B",
    "explanation": "Proto-nationalism refers to the early forms of nationalist sentiment and movements that emerged in various parts of Africa prior to gaining independence from colonial rule. During this period, there was a focus on advocating for reforms within the existing political structures, as well as a demand for respect for African cultures, religions, and traditions. The emphasis was on addressing social and political issues within the colonial framework rather than an immediate end to colonialism.",
    "year": "2022"
  },
  {
    "number": "1791",
    "text": "The youth movement across British West African territories served as a spring board for the formation of",
    "options": {
      "A": "militant groups to fight and kill British officials",
      "B": "political parties to champion the course of self-rule",
      "C": "committees to represent the people",
      "D": "associations in pursuit of justice for the people"
    },
    "answer_url": "https://myschool.ng/classroom/government/63038?exam_type=waec&type=obj&page=359",
    "correct_answer": "B",
    "explanation": "These movements played a crucial role in mobilising support for political parties that advocated for independence and self-rule and contributed to the broader struggle for decolonization in West Africa.",
    "year": "2022"
  },
  {
    "number": "1792",
    "text": "A country's foreign policy is foremost driven by",
    "options": {
      "A": "economy",
      "B": "location",
      "C": "natural resources",
      "D": "national interest"
    },
    "answer_url": "https://myschool.ng/classroom/government/63039?exam_type=waec&type=obj&page=359",
    "correct_answer": "D",
    "explanation": "National interest encompasses a country's strategic, economic and security goals, and it guides decisions and actions in foreign policy. While factors such as economy, location and natural resources are important, they are considered within the context of the overarching national interests.",
    "year": "2022"
  },
  {
    "number": "1793",
    "text": "The first inter-territorial political movement organized in the 1920s which sought to bring all the British West African territories together to fight the colonial establishment was the",
    "options": {
      "A": "Aborigines Right Protection Society",
      "B": "West African Youth League",
      "C": "National Congress of British West African",
      "D": "WestAfrican Students Union"
    },
    "answer_url": "https://myschool.ng/classroom/government/63040?exam_type=waec&type=obj&page=359",
    "correct_answer": "C",
    "explanation": "The first inter-territorial political movement organized in the 1920s which sought to bring all the British West African territories together to fight the colonial establishment was the National Congress of British West Africa.  This movement aimed to unite the British West African territories in their struggle for political and economic reforms under colonial rule.",
    "year": "2022"
  },
  {
    "number": "1794",
    "text": "The African Union is unable to play its role on the global political scene very well due to the",
    "options": {
      "A": "inadequate system of education",
      "B": "low level of wages in the member countries",
      "C": "Outbreak of pandemic on the African continent",
      "D": "divided loyalty among member states."
    },
    "answer_url": "https://myschool.ng/classroom/government/63043?exam_type=waec&type=obj&page=359",
    "correct_answer": "D",
    "explanation": "Divided loyalty among member states hinders the African Union's ability to act cohesively and effectively on global issues. Differences in national interests and priorities affects the AU's unified stance and decision-making capabilities on the international stage.",
    "year": "2022"
  },
  {
    "number": "1795",
    "text": "Which of the following options does the Commonwealth of Nations commit resources to?",
    "options": {
      "A": "Use of a common currency",
      "B": "Superiority of the British Crown",
      "C": "British Leadership on all matters of diplomacy",
      "D": "Promotion of representative democracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/63045?exam_type=waec&type=obj&page=359",
    "correct_answer": "D",
    "explanation": "The Commonwealth supports democratic governance and practices among its member states, promoting principles such as democratic elections, good governance, and the protection of human rights.",
    "year": "2022"
  },
  {
    "number": "1796",
    "text": "Which summit drew the road map for the implementation of the African Union?",
    "options": {
      "A": "Sirte Summit",
      "B": "Lusaka Summit",
      "C": "Lome Summit",
      "D": "Lagos summit"
    },
    "answer_url": "https://myschool.ng/classroom/government/63046?exam_type=waec&type=obj&page=360",
    "correct_answer": "B",
    "explanation": "The Lusaka Summit, held in Lusaka, Zambia, in July 2001, was pivotal in setting the framework for the establishment of the African Union, which was officially launched in Durban, South Africa, in 2002.",
    "year": "2022"
  },
  {
    "number": "1797",
    "text": "One of the benefits which the West African state derives from the United Nations is",
    "options": {
      "A": "equal opportunities of appointments to its highest office",
      "B": "permanent membership of the Security Council",
      "C": "greater access to all the organs of the United Nations",
      "D": "total eradication of poverty from the African continent"
    },
    "answer_url": "https://myschool.ng/classroom/government/63047?exam_type=waec&type=obj&page=360",
    "correct_answer": "A",
    "explanation": "The United Nations provides a platform for member states, including West African countries, to participate in its various organs and positions, offering equal opportunities for representation and appointments in roles such as the General Assembly, Security Council and specialized agencies.",
    "year": "2022"
  },
  {
    "number": "1798",
    "text": "The Atlantic Charter gave birth to the",
    "options": {
      "A": "Commonwealth of Nations",
      "B": "Allied powers",
      "C": "United Nations",
      "D": "North Atlantic Treaty Organisation"
    },
    "answer_url": "https://myschool.ng/classroom/government/63049?exam_type=waec&type=obj&page=360",
    "correct_answer": "C",
    "explanation": "The Atlantic Charter, agreed upon by President Franklin D. Roosevelt and Prime Minister Winston Churchill in 1941, outlined the goals for the post-World War II world and laid the groundwork for the creation of the United Nations, which was established in 1945 to promote international cooperation and prevent future conflicts.",
    "year": "2022"
  },
  {
    "number": "1799",
    "text": "Which of the following factors does not influence a country's foreign policy?",
    "options": {
      "A": "Human resources",
      "B": "Geographical location",
      "C": "System of education and number of universities",
      "D": "International laws and conventions"
    },
    "answer_url": "https://myschool.ng/classroom/government/63050?exam_type=waec&type=obj&page=360",
    "correct_answer": "C",
    "explanation": "Factors that typically influence a country's foreign policy include:\n- Human resources: The skills and capabilities of a nation's workforce can impact its international relations and economic strategies.- Geographical location: A country’s location affects its strategic interests, security concerns and trade opportunities.- International laws and conventions: These shape a country’s international behaviour and obligations.\nWhile the system of education and the number of universities can contribute to a nation's development and global influence, they do not directly dictate foreign policy decisions.",
    "year": "2022"
  },
  {
    "number": "1800",
    "text": "In which political system does the government control every aspect of a citizen's life?",
    "options": {
      "A": "communism",
      "B": "Dictatorship",
      "C": "Totalitarianism",
      "D": "Aristocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/63051?exam_type=waec&type=obj&page=360",
    "correct_answer": "C",
    "explanation": "Totalitarian regimes seek to have complete and centralised control over all aspects of public and private life, including political, social, economic, and cultural spheres, often through extensive surveillance, propaganda, and repression.",
    "year": "2022"
  },
  {
    "number": "1801",
    "text": "The administrative head of the ministry is the",
    "options": {
      "A": "official of the ruling government",
      "B": "general manager",
      "C": "permanent secretary",
      "D": "chief coordinating officer"
    },
    "answer_url": "https://myschool.ng/classroom/government/63052?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "The permanent secretary is a senior civil servant responsible for the day-to-day administration of the ministry and for ensuring that policies and programs are implemented effectively. This position is usually non-political and remains in place regardless of changes in the ruling government.",
    "year": "2022"
  },
  {
    "number": "1802",
    "text": "The sovereignty of a state can be limited to a great extent by",
    "options": {
      "A": "Rule of law",
      "B": "separation of powers",
      "C": "International Laws and conventions",
      "D": "Legislative Assembly"
    },
    "answer_url": "https://myschool.ng/classroom/government/63061?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "International laws and conventions can place constraints on a state's actions, particularly in areas such as human rights, environmental protection and trade. States that are parties to international treaties and agreements agree to adhere to certain rules and standards that can limit their sovereign actions.",
    "year": "2022"
  },
  {
    "number": "1803",
    "text": "A coalition government is a common feature of a",
    "options": {
      "A": "two party systems",
      "B": "multi-party system",
      "C": "one party system",
      "D": "non-party system"
    },
    "answer_url": "https://myschool.ng/classroom/government/63063?exam_type=waec&type=obj&page=361",
    "correct_answer": "B",
    "explanation": "In a multi-party system, no single party often has an outright majority, so parties may form coalitions to create a majority and govern effectively. This arrangement allows for a more inclusive representation of various political viewpoints.",
    "year": "2022"
  },
  {
    "number": "1804",
    "text": "The appointment of judges is based on the recommendation of the",
    "options": {
      "A": "Civil Service\nCommission",
      "B": "Public Service Commission",
      "C": "Eminent persons in society",
      "D": "Judicial Service Commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/63064?exam_type=waec&type=obj&page=361",
    "correct_answer": "D",
    "explanation": "The Judicial Service Commission is responsible for recommending candidates for judicial appointments, ensuring that the selection process is fair and based on merit.",
    "year": "2022"
  },
  {
    "number": "1805",
    "text": "Which of the following options is not a function of political parties?",
    "options": {
      "A": "Policy implementation",
      "B": "Political socialisation",
      "C": "Political education",
      "D": "Aggregation of interest"
    },
    "answer_url": "https://myschool.ng/classroom/government/63065?exam_type=waec&type=obj&page=361",
    "correct_answer": "A",
    "explanation": "Political parties generally focus on functions such as:\n-Political socialisation: Educating and influencing individuals about political values and norms.- Political education: Informing the public about political processes and issues.- Aggregation of interests: Bringing together various interests and viewpoints to form a cohesive political platform.\nPolicy implementation is primarily the role of the government and its agencies, rather than the political parties themselves.",
    "year": "2022"
  },
  {
    "number": "1806",
    "text": "In an election, a secret ballot is described as the process where the voter",
    "options": {
      "A": "is screened off to conceal the vote",
      "B": "cast the vote in a sealed box",
      "C": "is searched before casting the vote"
    },
    "answer_url": "https://myschool.ng/classroom/government/63067?exam_type=waec&type=obj&page=362",
    "correct_answer": "B",
    "explanation": "This system ensures that the voter's choices are private and confidential, preventing any external influence or intimidation and protecting the integrity of the voting process.",
    "year": "2022"
  },
  {
    "number": "1807",
    "text": "In which system of government does the legislature pass a vote of no confidence in the government?",
    "options": {
      "A": "Federal",
      "B": "Cabinet",
      "C": "De jure",
      "D": "Monarchical"
    },
    "answer_url": "https://myschool.ng/classroom/government/63068?exam_type=waec&type=obj&page=362",
    "correct_answer": "B",
    "explanation": "In parliamentary/cabinet systems, the legislature has the power to express its lack of confidence in the government or its leaders. If a vote of no confidence is passed, it typically leads to the resignation of the government or a call for new elections.",
    "year": "2022"
  },
  {
    "number": "1808",
    "text": "The concept of social justice implies that the state must ensure",
    "options": {
      "A": "sharing of political power with opponents",
      "B": "security for multi- national businesses",
      "C": "equality of citizens",
      "D": "fairmess to foreign nationals"
    },
    "answer_url": "https://myschool.ng/classroom/government/63070?exam_type=waec&type=obj&page=362",
    "correct_answer": "C",
    "explanation": "Social justice focuses on creating a fair and equitable society where all individuals have equal access to opportunities, resources and rights. It emphasises addressing inequalities and ensuring that all citizens are treated with fairness and respect.",
    "year": "2022"
  },
  {
    "number": "1809",
    "text": "The basic human right of citizens in a state are",
    "options": {
      "A": "freedom of movement, free education and free health",
      "B": "free social services, speech and religion",
      "C": "right to life, liberty and property",
      "D": "Right to higher education, property and freedom of thought"
    },
    "answer_url": "https://myschool.ng/classroom/government/63079?exam_type=waec&type=obj&page=362",
    "correct_answer": "C",
    "explanation": "The basic human rights of citizens in a state typically include theright to life, liberty and property. These rights are fundamental and are often considered essential for the protection and dignity of individuals.",
    "year": "2022"
  },
  {
    "number": "1810",
    "text": "A quasi-federal structure is so arranged in order for the",
    "options": {
      "A": "citizens to have dual allegiance and dual citizenship",
      "B": "component units to breakaway at will",
      "D": "president to amend the constitution at will"
    },
    "answer_url": "https://myschool.ng/classroom/government/63083?exam_type=waec&type=obj&page=362",
    "correct_answer": "A",
    "explanation": "A quasi-federal structure typically refers to a system of government that incorporates elements of both federalism and unitarism. The primary purpose of a quasi-federal structure is to allow the central or federal government to coordinate and implement national-level programs and policies effectively. While there may be regional or state governments with certain powers and responsibilities, the central authority retains the ability to address issues of national importance, such as defence, foreign affairs, and overarching economic policies.",
    "year": "2022"
  },
  {
    "number": "1811",
    "text": "When a superior court declares an action of the executive ultra-vires, it means that",
    "options": {
      "A": "the executive should leave power",
      "B": "a vote of no confidence had been passed on the government",
      "C": "the judiciary is more powerful than the executive",
      "D": "the action is illegal and of no effect"
    },
    "answer_url": "https://myschool.ng/classroom/government/63090?exam_type=waec&type=obj&page=363",
    "correct_answer": "D",
    "explanation": "\"Ultra vires\" is a Latin term meaning \"beyond the powers.\" If a court rules that an executive action is ultra vires, it means that the action was taken beyond the authority granted to the executive, making it invalid and unenforceable.",
    "year": "2022"
  },
  {
    "number": "1812",
    "text": "Which of the following options does not constitute the main objectives of the United Nations?",
    "options": {
      "A": "The maintenance of international peace and security",
      "B": "The promotion of the well-being of the peoples of the world",
      "C": "International cooperation",
      "D": "The use of force to comply with its provisions"
    },
    "answer_url": "https://myschool.ng/classroom/government/63115?exam_type=waec&type=obj&page=363",
    "correct_answer": "D",
    "explanation": "While the UN may authorize the use of force in certain circumstances, such as peacekeeping missions or military interventions approved by the Security Council, the use of force is not one of its main objectives. The primary focus is on diplomacy, cooperation and peaceful resolution of conflicts.",
    "year": "2022"
  },
  {
    "number": "1813",
    "text": "The Economic Community of West African States was established with the following aims except to",
    "options": {
      "A": "use force to depose unconstitutional regimes",
      "B": "improve the living standard of its people",
      "C": "contribute to the progress and development of the African continent",
      "D": "foster relations among membe states"
    },
    "answer_url": "https://myschool.ng/classroom/government/63116?exam_type=waec&type=obj&page=363",
    "correct_answer": "A",
    "explanation": "The primary aims of ECOWAS include improving the living standards of its people, contributing to the progress and development of the African continent and fostering relations among member states. While ECOWAS does sometimes intervene in political crises, its foundational objectives focus on economic integration and cooperation rather than using force to change regimes.",
    "year": "2022"
  },
  {
    "number": "1814",
    "text": "The process of international integration arising from the inter-change of world views, products, ideas and other aspects of culture is known as",
    "options": {
      "A": "national interest",
      "B": "globalisation",
      "C": "geopolitics",
      "D": "interest aggregation"
    },
    "answer_url": "https://myschool.ng/classroom/government/63118?exam_type=waec&type=obj&page=363",
    "correct_answer": "B",
    "explanation": "Globalization refers to the process by which businesses, cultures and economies become interconnected and interdependent on a global scale. This phenomenon is driven by the exchange of goods, services, information, technology and cultural practices across international borders.",
    "year": "2022"
  },
  {
    "number": "1815",
    "text": "One negative effect of colonialism on the people of West Africa over the years is the",
    "options": {
      "A": "introduction of modern idea of governance",
      "B": "creation of large political units",
      "C": "change of the socio-political systems of living",
      "D": "development of political institutions"
    },
    "answer_url": "https://myschool.ng/classroom/government/63119?exam_type=waec&type=obj&page=363",
    "correct_answer": "B",
    "explanation": "Colonial powers often drew arbitrary borders and combined diverse ethnic and cultural groups into single political entities, leading to tension and conflict among these groups. This legacy of artificial borders and imposed political units has contributed to ongoing challenges in nation-building and governance in many West African countries.",
    "year": "2022"
  },
  {
    "number": "1816",
    "text": "The Council of Elders in the pre-colonial political institutions of West Africa best served on the Council as",
    "options": {
      "A": "warriors of the state",
      "B": "go-between the gods and the people",
      "C": "custodians of the wealth of the state",
      "D": "representative of the commoners"
    },
    "answer_url": "https://myschool.ng/classroom/government/63120?exam_type=waec&type=obj&page=364",
    "correct_answer": "D",
    "explanation": "The Council of Elders acted as a governing body that represented the interests and voices of the common people in the community. They provided leadership, settled disputes and made decisions that affected the welfare of the community. They ensured that the perspectives and needs of the commoners were considered in the governance process.",
    "year": "2022"
  },
  {
    "number": "1817",
    "text": "Public corporations are struggling in the West African States as a result of",
    "options": {
      "A": "heavy social and political cost",
      "B": "private-public partnership",
      "C": "public scrutiny and accountability",
      "D": "direct foreign investment"
    },
    "answer_url": "https://myschool.ng/classroom/government/63122?exam_type=waec&type=obj&page=364",
    "correct_answer": "C",
    "explanation": "Public scrutiny and accountability often expose inefficiencies, corruption and mismanagement within public corporations. This leads to challenges in their operations and performance and can make it difficult for these corporations to function effectively and meet their objectives.",
    "year": "2022"
  },
  {
    "number": "1818",
    "text": "The following options are today the biggest threat to the democracy of West African States except",
    "options": {
      "A": "election disputes and related violence",
      "B": "military intervention in politics",
      "C": "youth unemployment",
      "D": "non involvement of traditional rulers in politics."
    },
    "answer_url": "https://myschool.ng/classroom/government/63124?exam_type=waec&type=obj&page=364",
    "correct_answer": "D",
    "explanation": "When election results are disputed or there are irregularities in the electoral process, it undermines the legitimacy of elected officials and can lead to political instability. Violence related to election disputes further exacerbates this issue, creating an environment of fear and intimidation that hampers democratic practices. Military interventions, such as coups or direct involvement in governance, undermine the principles of democratic rule and can lead to authoritarian regimes. Youth unemployment can lead them to violence or to assist political figures to rig elections and this can be a threat to democracy.\nHowever the non-involvement of traditional rulers in politics is not necessarily a threat to democracy.",
    "year": "2022"
  }
]