[
  {
    "number": "79",
    "text": "AFRICAN PROSE \nASARE KONADU: A WOMAN IN HER PRIME \n \nWhat role does tradition play in the relationship between Pokuwaa and her mother?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52609?exam_type=waec&type=theory&page=16",
    "correct_answer": "Tradition plays a very significant role in the relationship between Pokuwaa and her mother. Being the only daughter among the five sons of her mother, the old woman tends to be closer to her than her sons. By tradition of matrilineal inheritance, the offspring of sons belong to the families of the sons' wives. So, although Pokuwaa has brothers, who have children, it is to Pokuwaa that her mother looks for her grandchildren, properly so called. Because of this the old woman takes keen interest in Pokuwaa's affairs, especially her search for a child.\nBeing old and a custodian of their traditional beliefs, she supervises the offering to the river and the god of Tano. This is what the priest says will open the way for Pokuwaa to get a child. Pokuwaa goes along well enough and her mother takes care of her interest and is watchful that she does not come to harm through ignorance. When Pokuwaa deprives the eagle of its meal at the Ananse stream on a taboo day and brings the hornbill home, her mother sees disaster looming for Pokuwaa. Quickly she arranges the necessary purification for Pokuwaa. If Pokuwaa dies now, how will her mother get a grandchild? This is a serious matter for the old woman.\nIt is evident that Pokuwaa's mother's involvement in the affairs of her daughter is deep. She closely directs Pokuwaa's observance of the rites concerning Pokuwaa's search for a child. She keeps her daughter alert to her responsibilities to Tano.\nAll along, however, Pokuwaa seems to have ideas of her own. She is obedient to the directives of her mother and the priest. Somehow, she looks higher up the ladder to Almighty Onyankopon. When things seem to be taking too long to happen, she feels frustrated She simply repudiates Tano and devotes herself direct to Onyankopon in her own manner.\nThe revelation of Pokuwaa's decision to reject Tano has a shattering effect on her mother. For the older woman, it is unthinkable to do what Pokuwaa does. She reports the matter to the head of the clan, Opanin Kofi Owusu, whose assurances that things will work out do no convince her. She sobs for a doomed state whose women refuse to bear children. If can be seen also that more seriously, she laments because she will not get a grandchild if Pokuwaa does not bear a child.\nThere is much natural motherly love borne towards Pokuwaa by her mother. Driving this love appears to be the expectation of an old woman who wants to count her grandchildren in her final days on earth, and be assured of their tears when she dies. Pokuwaa's mother does not hide her ardent desire and this urges her into getting very deeply involved in her daughter's affairs.",
    "explanation": "Tradition plays a very significant role in the relationship between Pokuwaa and her mother. Being the only daughter among the five sons of her mother, the old woman tends to be closer to her than her sons. By tradition of matrilineal inheritance, the offspring of sons belong to the families of the sons' wives. So, although Pokuwaa has brothers, who have children, it is to Pokuwaa that her mother looks for her grandchildren, properly so called. Because of this the old woman takes keen interest in Pokuwaa's affairs, especially her search for a child.\nBeing old and a custodian of their traditional beliefs, she supervises the offering to the river and the god of Tano. This is what the priest says will open the way for Pokuwaa to get a child. Pokuwaa goes along well enough and her mother takes care of her interest and is watchful that she does not come to harm through ignorance. When Pokuwaa deprives the eagle of its meal at the Ananse stream on a taboo day and brings the hornbill home, her mother sees disaster looming for Pokuwaa. Quickly she arranges the necessary purification for Pokuwaa. If Pokuwaa dies now, how will her mother get a grandchild? This is a serious matter for the old woman.\nIt is evident that Pokuwaa's mother's involvement in the affairs of her daughter is deep. She closely directs Pokuwaa's observance of the rites concerning Pokuwaa's search for a child. She keeps her daughter alert to her responsibilities to Tano.\nAll along, however, Pokuwaa seems to have ideas of her own. She is obedient to the directives of her mother and the priest. Somehow, she looks higher up the ladder to Almighty Onyankopon. When things seem to be taking too long to happen, she feels frustrated She simply repudiates Tano and devotes herself direct to Onyankopon in her own manner.\nThe revelation of Pokuwaa's decision to reject Tano has a shattering effect on her mother. For the older woman, it is unthinkable to do what Pokuwaa does. She reports the matter to the head of the clan, Opanin Kofi Owusu, whose assurances that things will work out do no convince her. She sobs for a doomed state whose women refuse to bear children. If can be seen also that more seriously, she laments because she will not get a grandchild if Pokuwaa does not bear a child.\nThere is much natural motherly love borne towards Pokuwaa by her mother. Driving this love appears to be the expectation of an old woman who wants to count her grandchildren in her final days on earth, and be assured of their tears when she dies. Pokuwaa's mother does not hide her ardent desire and this urges her into getting very deeply involved in her daughter's affairs.",
    "year": "2015"
  },
  {
    "number": "80",
    "text": "AFRICAN PROSE \nASARE KONADU: A WOMAN IN HER PRIME\n \nDiscuss the significance of Tano Kofi in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52610?exam_type=waec&type=theory&page=16",
    "correct_answer": "Tano Kofi seems to occupy a central position in the small village of Brenhoma. Although it is not the highest God - Nyankopon Twedeampong - its activities as a god are observed throughout the story. This is so because the people are traditionalists and highly superstitious.There are seventy-seven other lesser gods, but the great Tano's name is mentioned with awe, He seems to be the founding god of Brenhoma as the Asafo captain calls his people in his song during the search for Yaw Boakye. Tano is a uniting force and a custodian of the welfare of the people.This is evident in the way the people throng to his shrine for consultation and sacrifice. The haste and excitement displayed by Pokuwaa at the beginning of the novel show that the shrine is no doubt a melting point where people go to either put their requests forward to the great Tano or to offer thanks.\nThis is why we meet Pokuwaa making frantic efforts to look for the lost jet-black hen which she has been asked-to present at Tanofie on the day of sacrifice. Pokuwaa's friend, Koramoa, has had a baby boy through the intervention of great god Tano and that is why every Fofie, she goes there and dances to the beat of the drumming.\nIn their routine prayer during the Odwira festival the name of Tano and the seventy-seven gods are invoked to bring healing, blessing and happiness to the people. This is the activity we see Pokuwaa engaged in through a good part of the novel until she gets fed up with the practice and stops.Because of the respect accorded to this god by the people. Pokuwaa's decision to discontinue following the directives recommended by the Tano priest is not taken lightly by her mother. Pokuwaa's decision angers her and prompts the Old Lady to report Pokuwaa to the head of the Asona Clan, Opanyin Kofi Owusu. When Pokuwaa discontinues making sacrifices to the god Tano, her mother continues to make the sacrifices.\nWhen Pokuwaa eventually becomes pregnant, Kwadwo and her mother attribute the pregnancy to the great god Tano. It is therefore obvious that for the people of Brenhoma, no good thing happens without being attributed to the god Tano.",
    "explanation": "Tano Kofi seems to occupy a central position in the small village of Brenhoma. Although it is not the highest God - Nyankopon Twedeampong - its activities as a god are observed throughout the story. This is so because the people are traditionalists and highly superstitious.There are seventy-seven other lesser gods, but the great Tano's name is mentioned with awe, He seems to be the founding god of Brenhoma as the Asafo captain calls his people in his song during the search for Yaw Boakye. Tano is a uniting force and a custodian of the welfare of the people.This is evident in the way the people throng to his shrine for consultation and sacrifice. The haste and excitement displayed by Pokuwaa at the beginning of the novel show that the shrine is no doubt a melting point where people go to either put their requests forward to the great Tano or to offer thanks.\nThis is why we meet Pokuwaa making frantic efforts to look for the lost jet-black hen which she has been asked-to present at Tanofie on the day of sacrifice. Pokuwaa's friend, Koramoa, has had a baby boy through the intervention of great god Tano and that is why every Fofie, she goes there and dances to the beat of the drumming.\nIn their routine prayer during the Odwira festival the name of Tano and the seventy-seven gods are invoked to bring healing, blessing and happiness to the people. This is the activity we see Pokuwaa engaged in through a good part of the novel until she gets fed up with the practice and stops.Because of the respect accorded to this god by the people. Pokuwaa's decision to discontinue following the directives recommended by the Tano priest is not taken lightly by her mother. Pokuwaa's decision angers her and prompts the Old Lady to report Pokuwaa to the head of the Asona Clan, Opanyin Kofi Owusu. When Pokuwaa discontinues making sacrifices to the god Tano, her mother continues to make the sacrifices.\nWhen Pokuwaa eventually becomes pregnant, Kwadwo and her mother attribute the pregnancy to the great god Tano. It is therefore obvious that for the people of Brenhoma, no good thing happens without being attributed to the god Tano.",
    "year": "2015"
  },
  {
    "number": "81",
    "text": "AFRICAN PROSE\nADICHIE CHIMAMANDA NGOZI: PURPLE HIBISCUS \n \nExamine the relationship between Eugene and his wife in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52611?exam_type=waec&type=theory&page=17",
    "correct_answer": "Eugene seems brutally oppressive and aggressive in his relationship with his wife, Beatrice, who is loving and submissive. He does not seem to consider her condition or feeling when he decides what to order her to dol. Sometimes, he even appears to punish Beatrice for nothing at all. This treatment of her detracts from Eugene's show of love in the things he provides her and the children.\nWhereas Eugene explains carefully to the children that the excessive punishment he metes out to them is for their sins and necessary for their recovery and redemption, Eugene does not care to tell his wife, or anyone else, why he treats her as he does. His beating her, from Kambili's brief comment, is routine. And he seems to relish hitting her only on the belly and particularly when she is pregnant.\nOnce, when the pregnant Beatrice, unsure of what may happen in the priest's house if she goes there, asks to excused, Eugene bullies her into going. He is livid and implacably condemns the woman at dinner. At night, Kambili keeps count of the thudding of brutal punches. Then Eugene carries Beatrice off to hospital. She has been bleeding She comes back home without the pregnancy.\nBesides, Eugene expects his wife to concur in all he does and keep her place in line. When her figurines are broke she meekly clears the debris. Eugene's wife is so totally under his thumb that she dare not offer reasonable objection to anything. She looks on as Kambili is beaten to unconsciousness. Yet she has her silent resentment\nThe last straw is the beating she gets while the children are away in Nsukka. This makes her miscarry yet another pregnancy. From her own account to her sister-in-law, this time, Eugene does not know that she is pregnant. All same, he breaks a table on her belly. This mild attempt to excuse Eugene's brutality rather brings his cruelty Beatrice into focus: even when he knows that his wife is pregnant, he will hit her bulging belly. Beatrice's docile resignation to Eugene's treatment of her is unacceptable. She cannot risk leaving him for another woman to take her place. if she cannot change him, no other woman must have Eugene. So she poisons him slowly.\nEugene's wife does not deserve the harshness he metes out to her. Quietly, she takes extreme steps to deal will the situation.",
    "explanation": "Eugene seems brutally oppressive and aggressive in his relationship with his wife, Beatrice, who is loving and submissive. He does not seem to consider her condition or feeling when he decides what to order her to dol. Sometimes, he even appears to punish Beatrice for nothing at all. This treatment of her detracts from Eugene's show of love in the things he provides her and the children.\nWhereas Eugene explains carefully to the children that the excessive punishment he metes out to them is for their sins and necessary for their recovery and redemption, Eugene does not care to tell his wife, or anyone else, why he treats her as he does. His beating her, from Kambili's brief comment, is routine. And he seems to relish hitting her only on the belly and particularly when she is pregnant.\nOnce, when the pregnant Beatrice, unsure of what may happen in the priest's house if she goes there, asks to excused, Eugene bullies her into going. He is livid and implacably condemns the woman at dinner. At night, Kambili keeps count of the thudding of brutal punches. Then Eugene carries Beatrice off to hospital. She has been bleeding She comes back home without the pregnancy.\nBesides, Eugene expects his wife to concur in all he does and keep her place in line. When her figurines are broke she meekly clears the debris. Eugene's wife is so totally under his thumb that she dare not offer reasonable objection to anything. She looks on as Kambili is beaten to unconsciousness. Yet she has her silent resentment\nThe last straw is the beating she gets while the children are away in Nsukka. This makes her miscarry yet another pregnancy. From her own account to her sister-in-law, this time, Eugene does not know that she is pregnant. All same, he breaks a table on her belly. This mild attempt to excuse Eugene's brutality rather brings his cruelty Beatrice into focus: even when he knows that his wife is pregnant, he will hit her bulging belly. Beatrice's docile resignation to Eugene's treatment of her is unacceptable. She cannot risk leaving him for another woman to take her place. if she cannot change him, no other woman must have Eugene. So she poisons him slowly.\nEugene's wife does not deserve the harshness he metes out to her. Quietly, she takes extreme steps to deal will the situation.",
    "year": "2015"
  },
  {
    "number": "82",
    "text": "AFRICAN PROSE\nADICHIE CHIMAMANDA NGOZI: PURPLE HIBISCUS \n \nExamine the importance of the military in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52612?exam_type=waec&type=theory&page=17",
    "correct_answer": "The military play a peculiar role in the novel. They show what human beings are essentially like:.greedy, passionate biased and corrupt, besides other attributes. The military highlight the inclination of man towards treating his fellow man harshly for whatever reason. Human beings pursue their principles passionately, however their actions affect others. Whether a soldier or a civilian, mat is greedy.\nLife under civilian administration is, therefore, not different from that under the military. Eugene's prosperity is affected by the conduct of the civilian administration that is overthrown by soldiers who claim that the civilians corrupt. Certainly, it is not soldiers who order university professors to victimize university workers or treat oth lecturers shabbily. The favouritism in University of Nsukka is an exhibition of human nature. Besides, milit administrators are deployed to the university and they paralyzed the school system by short funding and embezzling the funds. There is students' unrest and the university is closed, unnecessarily. Aunty Ifeoma takes all that w equanimity and is pragmatic. She takes her chance when things become intolerable and leaves for America.\nEugene's treatment of his own father and other, \"heathens\" and of his wife and children is based on his rather strong religiosity. However much the others may be distressed by his zealous pursuit of his principles and love for God, simply must do his duty - by them and by himself. He tells his, children that he punished them severely for their o' good.When the soldiers arrive by a coup-d' etat, they allege corruption against the civilian regime they overthrow. However, in the pursuit of their principles of assumed legitimacy they run rough shod over everyone to the extent eliminating whoever is in the way. Nwankiti Ogechi disappears and nobody is expected to talk. After his arrest ai release, Ade Coker should have learnt that the military will stop at nothing. As he will not relent, he receives a lets bomb. It is clear that the military have suppressed opposition and freedom of speech is minimal. Their hold on the people is significant in that it shows their intention to have things their way.\nYet there is the normal side of life that the corruption and whims of neither the military nor civilians can curt Eugene pursues his sternly ordered control of his household, and, according to Kambili, there is laughter in Aunty Ifeoma's home. Business goes on all over the place, and, as Father Benedict notes, there is prosperity that only Eugene, among businessmen, is using to promote God's work.\nThe market women experience military brutality and the soldiers enjoy humiliating the women. If the brutality is in the name of justice and fair dealing and uprightness, it should be commended. But military conduct is uncommendable. Jaja's imprisonment and the unfulfilled promises made towards his release show the rate of degeneration in the society. Justice is delayed.to allow for corruption from the people in government to thrive. Ade Coker dies because he will not stop criticizing military corruption. If civilians are shot for drug offenses how come the soldiers are linked to heroin? The answer is that no one must talk as Ade Coker does to his detriment. Eugene condemns the lack of democracy under civilian rule, and decries the coup. What the country needs he says is \"renewed democracy\", not military rule.\nAll in all, it can be seen that the greed and corruption of politicians that is condemned by all is even more entrenched in soldiers who overthrow the corrupt regimes for being corrupt.",
    "explanation": "The military play a peculiar role in the novel. They show what human beings are essentially like:.greedy, passionate biased and corrupt, besides other attributes. The military highlight the inclination of man towards treating his fellow man harshly for whatever reason. Human beings pursue their principles passionately, however their actions affect others. Whether a soldier or a civilian, mat is greedy.\nLife under civilian administration is, therefore, not different from that under the military. Eugene's prosperity is affected by the conduct of the civilian administration that is overthrown by soldiers who claim that the civilians corrupt. Certainly, it is not soldiers who order university professors to victimize university workers or treat oth lecturers shabbily. The favouritism in University of Nsukka is an exhibition of human nature. Besides, milit administrators are deployed to the university and they paralyzed the school system by short funding and embezzling the funds. There is students' unrest and the university is closed, unnecessarily. Aunty Ifeoma takes all that w equanimity and is pragmatic. She takes her chance when things become intolerable and leaves for America.\nEugene's treatment of his own father and other, \"heathens\" and of his wife and children is based on his rather strong religiosity. However much the others may be distressed by his zealous pursuit of his principles and love for God, simply must do his duty - by them and by himself. He tells his, children that he punished them severely for their o' good.When the soldiers arrive by a coup-d' etat, they allege corruption against the civilian regime they overthrow. However, in the pursuit of their principles of assumed legitimacy they run rough shod over everyone to the extent eliminating whoever is in the way. Nwankiti Ogechi disappears and nobody is expected to talk. After his arrest ai release, Ade Coker should have learnt that the military will stop at nothing. As he will not relent, he receives a lets bomb. It is clear that the military have suppressed opposition and freedom of speech is minimal. Their hold on the people is significant in that it shows their intention to have things their way.\nYet there is the normal side of life that the corruption and whims of neither the military nor civilians can curt Eugene pursues his sternly ordered control of his household, and, according to Kambili, there is laughter in Aunty Ifeoma's home. Business goes on all over the place, and, as Father Benedict notes, there is prosperity that only Eugene, among businessmen, is using to promote God's work.\nThe market women experience military brutality and the soldiers enjoy humiliating the women. If the brutality is in the name of justice and fair dealing and uprightness, it should be commended. But military conduct is uncommendable. Jaja's imprisonment and the unfulfilled promises made towards his release show the rate of degeneration in the society. Justice is delayed.to allow for corruption from the people in government to thrive. Ade Coker dies because he will not stop criticizing military corruption. If civilians are shot for drug offenses how come the soldiers are linked to heroin? The answer is that no one must talk as Ade Coker does to his detriment. Eugene condemns the lack of democracy under civilian rule, and decries the coup. What the country needs he says is \"renewed democracy\", not military rule.\nAll in all, it can be seen that the greed and corruption of politicians that is condemned by all is even more entrenched in soldiers who overthrow the corrupt regimes for being corrupt.",
    "year": "2015"
  },
  {
    "number": "83",
    "text": "NON - AFRICAN PROSE \nWILLIAM GOLDING: LORD OF THE FLIES \n \nComment on the significance of Piggy's glasses",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52613?exam_type=waec&type=theory&page=17",
    "correct_answer": "Ralph and Piggy are the first two boys to appear on the island after a plane conveying them to safety has been attacked. Piggy reveals to Ralph in this first encounter that he has been wearing spectacles since he was three. In many respects Piggy is both physically and health-wise a weak boy. He has asthma so he has been warned by his guardian not to run; and he wears spectacles because he has sight challenges.\nPiggy's glasses are one of the symbols in the novel which are significant to the meaning of the novel. Apart from the conch, the glasses appear to be the next most significant symbol which bear directly on the survival strategies of the boys. After the boys have settled on the issue of the need to have a Chief and the use of the conch as a symbol of authority, the next challenge confronting them is the issue of rescue. This challenge is projected to be addressed by setting up a fire on top of the mountain. Piggy's glasses becomes the useful tool to light the pile of wood for this purpose. Jack instantly points to the glasses and there is a general agreement by the boys. Both Jac and Ralph jointly use the glasses to light the fire.\nThe general enthusiasm which greets the setting up of the fire is shortlived as Jack and his group fail to watch over it. He leads his hunters on hunting adventures and the fire dies down, which makes the dream of rescue to fail when a ship passes by on the sea. However, Ralph leads Piggy and Samneric to re-light the fire. Again Piggy's glasses are used to reenliven the boys' rescue attempts. Even though Jack is not so much concerned about the fire at this point, the significance of the fire is underscored by the equally important glasses.\nUnfortunately, the glasses are stolen by Jack's group in a raid they carry out on the shelter where Ralph, Piggy and Samneric are now camping. Here the glasses are significant in two respects. First is their importance to the tribe. The hunters realize once again that much of their survival depends on having a fire with which they can roast meat and light their part of the island. Second is its significance to the plot. The event of stealing the glasses signifies the beginning of the events that culminate in the final peace and order on the island. Piggy's glasses are partially broken at this point. The attempt to recover the glasses leads to the climax of the story. Jack captures Samneric and engages Ralph in a physical fight. Finally a rock falls and kills Piggy, destroying the conch and breaking the glasses.\nThus, the glasses are not only a symbol of Piggy's weakness as a character but also significant to the development of the plot of the novel.",
    "explanation": "Ralph and Piggy are the first two boys to appear on the island after a plane conveying them to safety has been attacked. Piggy reveals to Ralph in this first encounter that he has been wearing spectacles since he was three. In many respects Piggy is both physically and health-wise a weak boy. He has asthma so he has been warned by his guardian not to run; and he wears spectacles because he has sight challenges.\nPiggy's glasses are one of the symbols in the novel which are significant to the meaning of the novel. Apart from the conch, the glasses appear to be the next most significant symbol which bear directly on the survival strategies of the boys. After the boys have settled on the issue of the need to have a Chief and the use of the conch as a symbol of authority, the next challenge confronting them is the issue of rescue. This challenge is projected to be addressed by setting up a fire on top of the mountain. Piggy's glasses becomes the useful tool to light the pile of wood for this purpose. Jack instantly points to the glasses and there is a general agreement by the boys. Both Jac and Ralph jointly use the glasses to light the fire.\nThe general enthusiasm which greets the setting up of the fire is shortlived as Jack and his group fail to watch over it. He leads his hunters on hunting adventures and the fire dies down, which makes the dream of rescue to fail when a ship passes by on the sea. However, Ralph leads Piggy and Samneric to re-light the fire. Again Piggy's glasses are used to reenliven the boys' rescue attempts. Even though Jack is not so much concerned about the fire at this point, the significance of the fire is underscored by the equally important glasses.\nUnfortunately, the glasses are stolen by Jack's group in a raid they carry out on the shelter where Ralph, Piggy and Samneric are now camping. Here the glasses are significant in two respects. First is their importance to the tribe. The hunters realize once again that much of their survival depends on having a fire with which they can roast meat and light their part of the island. Second is its significance to the plot. The event of stealing the glasses signifies the beginning of the events that culminate in the final peace and order on the island. Piggy's glasses are partially broken at this point. The attempt to recover the glasses leads to the climax of the story. Jack captures Samneric and engages Ralph in a physical fight. Finally a rock falls and kills Piggy, destroying the conch and breaking the glasses.\nThus, the glasses are not only a symbol of Piggy's weakness as a character but also significant to the development of the plot of the novel.",
    "year": "2015"
  },
  {
    "number": "84",
    "text": "NON - AFRICAN PROSE \nWILLIAM GOLDING: LORD OF THE FLIES  \n \n Consider Ralph as the hero in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52616?exam_type=waec&type=theory&page=17",
    "correct_answer": "Ralph plays a dominant role that is inevitably crucial to the development of the plot.\nHe is the first among the boys to emerge from the creepers. When he finds the conch and is taught how to use it by Piggy, he blows it and its sound attracts and draws the other boys to where he and Piggy are. There and then he beings to exercise some form of authority over the boys by assuring that it is only he who has the conch that has permission to speak.\nNext he initiates the democratic process of electing the leader and is thus elected when he squarely beats Jack in the leadership contest. As a practical expression of his leadership, he leads the delegation that explores the island and reveals that they are probably the only inhabitants on the island.\nAs a leader who takes action, he beings to work out the strategy for their survival on the island and their eventual rescue in eranest. This he does by wisely relying on Piggy's exceptional intelligence. And so he assures the other boys that his father, a naval officer, will come to the rescue as soon as possible, ... \"he's commander of the navy. When he gets leave, he'll come and rescue us\", he says. In this regard, he suggests that they make a fire that will raise somke to attract rescuers.\nIn spite of Jack's antagonism to his leadership!, Ralph remains cool-headed and does all he can to run an inclusive administration by conceding the choir boys' leadership to Jack so that he can come on board. Rather than use brute force like Jack, he pursues the peaceful option and places the unity of all the boys over and above all other considerations.\nAs a caring leader, he courageously defends Piggy as much as he can against the unwarranted brutality of Jack. He grieves deeply when Simon's life is abruptly cut short and painfully mourns when Piggy's life is untimely terminated. As a good leader, he never wavers even when he is virtually deserted by all the boys. And when he is constrained to fight for dear life, he does so bravely and tenaciously thwarts the sinister attempts put together by Jack to kill him. As the hero in the novel, Ralph's fighting spirit eventually pays off. As the author's embodiment of civilization and acceptable leadership, he lives on while Jack, the antagonist, is consumed by the uncontrollable inferno he wickedly raises. He is thus able to respond proudly and loudly, \"I am\" to the rescuing naval officer's question: \"Who's the boss here?\"",
    "explanation": "Ralph plays a dominant role that is inevitably crucial to the development of the plot.\nHe is the first among the boys to emerge from the creepers. When he finds the conch and is taught how to use it by Piggy, he blows it and its sound attracts and draws the other boys to where he and Piggy are. There and then he beings to exercise some form of authority over the boys by assuring that it is only he who has the conch that has permission to speak.\nNext he initiates the democratic process of electing the leader and is thus elected when he squarely beats Jack in the leadership contest. As a practical expression of his leadership, he leads the delegation that explores the island and reveals that they are probably the only inhabitants on the island.\nAs a leader who takes action, he beings to work out the strategy for their survival on the island and their eventual rescue in eranest. This he does by wisely relying on Piggy's exceptional intelligence. And so he assures the other boys that his father, a naval officer, will come to the rescue as soon as possible, ... \"he's commander of the navy. When he gets leave, he'll come and rescue us\", he says. In this regard, he suggests that they make a fire that will raise somke to attract rescuers.\nIn spite of Jack's antagonism to his leadership!, Ralph remains cool-headed and does all he can to run an inclusive administration by conceding the choir boys' leadership to Jack so that he can come on board. Rather than use brute force like Jack, he pursues the peaceful option and places the unity of all the boys over and above all other considerations.\nAs a caring leader, he courageously defends Piggy as much as he can against the unwarranted brutality of Jack. He grieves deeply when Simon's life is abruptly cut short and painfully mourns when Piggy's life is untimely terminated. As a good leader, he never wavers even when he is virtually deserted by all the boys. And when he is constrained to fight for dear life, he does so bravely and tenaciously thwarts the sinister attempts put together by Jack to kill him. As the hero in the novel, Ralph's fighting spirit eventually pays off. As the author's embodiment of civilization and acceptable leadership, he lives on while Jack, the antagonist, is consumed by the uncontrollable inferno he wickedly raises. He is thus able to respond proudly and loudly, \"I am\" to the rescuing naval officer's question: \"Who's the boss here?\"",
    "year": "2015"
  },
  {
    "number": "85",
    "text": "NON - AFRICAN PROSE\nERNEST HEMINGWAY: THE OLD MAN AND THE SEA \n \n To what extent was the old man successful on his last fishing trip?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52618?exam_type=waec&type=theory&page=17",
    "correct_answer": "The old man Santiago has fished in the Golf Stream for eighty-four days without catching a single fish. In the first forty days, the boy Manolin has been with him. But after forty days of fruitless search for fish, the boy's parents decide that the old man is unlucky. They, therefore ask the boy to withdraw from the enterprise. On the orders of his parents, Manolin joins another boat on a fishing trip which catches three great fish in the first week.\nThe old man labours day after day with the same ill luck. But he loves the sea and fishing and so persists in spite of repeated failure. One morning Santiago determines to break this cycle of failure and turn defeat into victory. He therefore sails far out to sea, equipped with sardines and two baits wrapped in a newspaper. The old man works hard and long. Eventually he catches a big fish. In his loneliness Santiago has a bird for company.Santiago knows it is a big fish because of its weight. The old man moves with the fish for a number of days. He loses sight of the coastal landscape but he feels at home in his boat on the wide expanse of the ocean. The old man experiences intense pain of endurance with a cramped hand before the fish is caught. The old man feels exhausted. He has little food, feeds on raw fish, and has quite scant sleep at night.\nThe old man is surprised at the enormous size of the fish. Killing the fish is very tasking and strenuous work, but fastening the huge fish to his boat presents a very challenging task. The old man is happy at the turn of events. He makes calculations of the monetary worth of the fish. \"He is my fortune\", he thinks. He cannot believe the size of his fish. His mental calculation pegs the weight of the fish at fifteen hundred pounds, maybe more. It would bring the highest price on the market, which is enough to compensate for all the toil and ill luck of former times and trips.\nFortunately, the winds rise and begging to drive the boat towards the coast. He is homeward bound with a successful catch. But the old man has not reckoned with the sharks which begin to eat the fish. He kills several of them but they came in a pack. He fights hard and bravely, but the sharks are one too many. Besides, he has no weapon to fight with. \"Nothing\", he says aloud, \"I went too far\". By the time he reaches the shore, there is nothing left of the huge fish which measures 'eighteen feet from the nose to tail'. The old man is completely exhausted physically. The big fish which is to have brought in a large amount of money is now a mere skeleton to be taken away by the tide.\nIn spite of his apparent failure to retain his catch, it is worth noting his indomitable courage hugely displayed in his fight against the sharks. The sea defeats him; he is physically broken, but there is much virtue in him having fought hard against tremendous odds.",
    "explanation": "The old man Santiago has fished in the Golf Stream for eighty-four days without catching a single fish. In the first forty days, the boy Manolin has been with him. But after forty days of fruitless search for fish, the boy's parents decide that the old man is unlucky. They, therefore ask the boy to withdraw from the enterprise. On the orders of his parents, Manolin joins another boat on a fishing trip which catches three great fish in the first week.\nThe old man labours day after day with the same ill luck. But he loves the sea and fishing and so persists in spite of repeated failure. One morning Santiago determines to break this cycle of failure and turn defeat into victory. He therefore sails far out to sea, equipped with sardines and two baits wrapped in a newspaper. The old man works hard and long. Eventually he catches a big fish. In his loneliness Santiago has a bird for company.Santiago knows it is a big fish because of its weight. The old man moves with the fish for a number of days. He loses sight of the coastal landscape but he feels at home in his boat on the wide expanse of the ocean. The old man experiences intense pain of endurance with a cramped hand before the fish is caught. The old man feels exhausted. He has little food, feeds on raw fish, and has quite scant sleep at night.\nThe old man is surprised at the enormous size of the fish. Killing the fish is very tasking and strenuous work, but fastening the huge fish to his boat presents a very challenging task. The old man is happy at the turn of events. He makes calculations of the monetary worth of the fish. \"He is my fortune\", he thinks. He cannot believe the size of his fish. His mental calculation pegs the weight of the fish at fifteen hundred pounds, maybe more. It would bring the highest price on the market, which is enough to compensate for all the toil and ill luck of former times and trips.\nFortunately, the winds rise and begging to drive the boat towards the coast. He is homeward bound with a successful catch. But the old man has not reckoned with the sharks which begin to eat the fish. He kills several of them but they came in a pack. He fights hard and bravely, but the sharks are one too many. Besides, he has no weapon to fight with. \"Nothing\", he says aloud, \"I went too far\". By the time he reaches the shore, there is nothing left of the huge fish which measures 'eighteen feet from the nose to tail'. The old man is completely exhausted physically. The big fish which is to have brought in a large amount of money is now a mere skeleton to be taken away by the tide.\nIn spite of his apparent failure to retain his catch, it is worth noting his indomitable courage hugely displayed in his fight against the sharks. The sea defeats him; he is physically broken, but there is much virtue in him having fought hard against tremendous odds.",
    "year": "2015"
  },
  {
    "number": "86",
    "text": "NON - AFRICAN PROSE\nERNEST HEMINGWAY: THE OLD MAN AND THE SEA \n \nComment on the significance of Santiago's dream about lions.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52619?exam_type=waec&type=theory&page=18",
    "correct_answer": "The lion on the beach of Africa appear as a significant symbol in the Old Man and the Sea. Santiago, the protagonist of the story, dreams about them three times in the novel. Each of the times the lions appear in Santiago's dreams they are portrayed as key to the life of the old man and the plot of the story especially this sojourn in Cassablance and his heroic hand wrestling victory over the negro of Cienfuegos.\nFirst, Santiago dreams about the lions as he departs on his three-day fishing expedition. They appear as ordinary cubs and play like young cats in the dusk. Santiago here sees a similarity betwen the cubs and his boy, Manolin. He loves them as he loves Manolin because they are youthful like Manolin who seems to him a sign of great things to come, The image of the lions is also significant in Santiago's dream about them because they always make him, like Manolin, happy; they are also good company to him because he sees them in the image of his apprentice.\nSecondly, the lions appear in Santiago's dream as he sleeps on the boat for few hours during his battle with the ferocious fish, the marlin. This time the lions appear as adults. In their majesty, the lions suggest great strength and honour, providing Santiago with inspiration, a nobility of purpose, and a sense of vitality that keeps him on toward his ambition. They are therefore significant in Santiago's dream because they provide him with inspiration and belief in himself and urge him to be hopeful in hi adventure.\nIn addition, the lions are significant to the story because often, the old man almost simultaneously dreams about them as he reams about Manolin. Whenever the boy appears in Santiago's thoughts, he is depicted as exerting himself and proving his worth. Whenever Santiago thinks about the lions, he relaxes because they appear in his imagination to be in control and thus, inspire him to have confidence in himself.\nFinally, the lions appear in Santiago's dream at the very end of the stroy. Their significance at a time that the old man appears to have been finally defeated is that there are still promises of regeneration and renewal, particularly because Manolin also comes into the picture to rescue his master.\nThe sombre atmosphere at the end of the novel is reinforced by the final image of the lions to suggest the interplay of destruction and renewal in the story of the protagonist.",
    "explanation": "The lion on the beach of Africa appear as a significant symbol in the Old Man and the Sea. Santiago, the protagonist of the story, dreams about them three times in the novel. Each of the times the lions appear in Santiago's dreams they are portrayed as key to the life of the old man and the plot of the story especially this sojourn in Cassablance and his heroic hand wrestling victory over the negro of Cienfuegos.\nFirst, Santiago dreams about the lions as he departs on his three-day fishing expedition. They appear as ordinary cubs and play like young cats in the dusk. Santiago here sees a similarity betwen the cubs and his boy, Manolin. He loves them as he loves Manolin because they are youthful like Manolin who seems to him a sign of great things to come, The image of the lions is also significant in Santiago's dream about them because they always make him, like Manolin, happy; they are also good company to him because he sees them in the image of his apprentice.\nSecondly, the lions appear in Santiago's dream as he sleeps on the boat for few hours during his battle with the ferocious fish, the marlin. This time the lions appear as adults. In their majesty, the lions suggest great strength and honour, providing Santiago with inspiration, a nobility of purpose, and a sense of vitality that keeps him on toward his ambition. They are therefore significant in Santiago's dream because they provide him with inspiration and belief in himself and urge him to be hopeful in hi adventure.\nIn addition, the lions are significant to the story because often, the old man almost simultaneously dreams about them as he reams about Manolin. Whenever the boy appears in Santiago's thoughts, he is depicted as exerting himself and proving his worth. Whenever Santiago thinks about the lions, he relaxes because they appear in his imagination to be in control and thus, inspire him to have confidence in himself.\nFinally, the lions appear in Santiago's dream at the very end of the stroy. Their significance at a time that the old man appears to have been finally defeated is that there are still promises of regeneration and renewal, particularly because Manolin also comes into the picture to rescue his master.\nThe sombre atmosphere at the end of the novel is reinforced by the final image of the lions to suggest the interplay of destruction and renewal in the story of the protagonist.",
    "year": "2015"
  },
  {
    "number": "87",
    "text": "NON - AFRICAN DRAMA \nBERNARD SHAW: ARMS AND THE MAN \n \nHow is romantic love treated in the play?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52621?exam_type=waec&type=theory&page=18",
    "correct_answer": "Romantic love is a predominant theme in the play. But this is welded into a compact whole with the theme of war. In the play, the experiences of the characters show that the romance of war is closely connected to the romance of love.\nAs the play opens, the audience is introduced to Raina's romantic perceptions of love. She is a pretty, yound lady whose reading of two poets, Byron and Pushkin, has impacted her idea of love. Standing on the balcony of her bedroom, she admires the beauty of the night, dreams of her fiance, Sergius, who is currently fighting in the war between Bulgaria and Serbia. Raina, in ecstasy, receives the news of her fiance's bravery on the war front from her mother and in her bedroom, adores her lover's photograph affectionately. She feels that she has beenk, before now, a \"prosaic little coward\" in her doubts about Sergius herosim. Thus, her lover's supposed heroic performance feeds into her romantic perceptions of love. Raina glorifies Sergius as a here. On returning from the war, a \"higher love\" develops between them. Sergius calls her \"My queen\" and \"goddess\" and she calls him her \"king\" and \"hero\". They glorify each other because they are blind to their own failings. Later, both of them have to face the realities of love and submit to their own common human imperfections.\nThis idealized world of romantic love is contrasted with Bluntschli's blunt but realistic perception of both love and war. The fugitive is used to voice the playwright's position on the issue of love. He shocks Raina presenting a realistic view of Sergius' foolhardiness on the war front.\nThe fault in Raina and Sergius' perceptions of love is further brought to the fore as we see them cheating or each other, Raina flirting with Bluntschli behind Sergius' back and sergius flirting with Louka behind Raina's back. Their romantic love is therefore treated as something that cannot last.\nThrough Bluntschli and Louka, the playwright is able to focus the searchlight of truth and reason on the idea of love. Bluntschli and Louka are intellectually superior to Sergius and Raina in this play. The futility c: raomantic love is stressed when Nicola is forced to give up on Louka for business and profit, and Louka for social status. In the final analysis, love is treated as matter of strict realism. Romantic love is more of an illusion",
    "explanation": "Romantic love is a predominant theme in the play. But this is welded into a compact whole with the theme of war. In the play, the experiences of the characters show that the romance of war is closely connected to the romance of love.\nAs the play opens, the audience is introduced to Raina's romantic perceptions of love. She is a pretty, yound lady whose reading of two poets, Byron and Pushkin, has impacted her idea of love. Standing on the balcony of her bedroom, she admires the beauty of the night, dreams of her fiance, Sergius, who is currently fighting in the war between Bulgaria and Serbia. Raina, in ecstasy, receives the news of her fiance's bravery on the war front from her mother and in her bedroom, adores her lover's photograph affectionately. She feels that she has beenk, before now, a \"prosaic little coward\" in her doubts about Sergius herosim. Thus, her lover's supposed heroic performance feeds into her romantic perceptions of love. Raina glorifies Sergius as a here. On returning from the war, a \"higher love\" develops between them. Sergius calls her \"My queen\" and \"goddess\" and she calls him her \"king\" and \"hero\". They glorify each other because they are blind to their own failings. Later, both of them have to face the realities of love and submit to their own common human imperfections.\nThis idealized world of romantic love is contrasted with Bluntschli's blunt but realistic perception of both love and war. The fugitive is used to voice the playwright's position on the issue of love. He shocks Raina presenting a realistic view of Sergius' foolhardiness on the war front.\nThe fault in Raina and Sergius' perceptions of love is further brought to the fore as we see them cheating or each other, Raina flirting with Bluntschli behind Sergius' back and sergius flirting with Louka behind Raina's back. Their romantic love is therefore treated as something that cannot last.\nThrough Bluntschli and Louka, the playwright is able to focus the searchlight of truth and reason on the idea of love. Bluntschli and Louka are intellectually superior to Sergius and Raina in this play. The futility c: raomantic love is stressed when Nicola is forced to give up on Louka for business and profit, and Louka for social status. In the final analysis, love is treated as matter of strict realism. Romantic love is more of an illusion",
    "year": "2015"
  },
  {
    "number": "88",
    "text": "NON — AFRICAN DRAMA \nBERNARD SHAW: ARMS AND THE MAN \n \nHow is the conflict between Bluntschli and Sergius resolved in the play?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52623?exam_type=waec&type=theory&page=18",
    "correct_answer": "Sergius and Bluntschli are soldiers fighting on either side of two warring countries. Bulgaria and Serbia respectively. Bluntschli is, however, a Swiss mercenary on the side of the Serbs Running away from the battlefield after an unprofessional chivalry charge led by Sergius which destabilizes the Serbian army, Bluntschli takes refuge in Raina's chamber. Even though Sergius acknowledges Bluntschli's professional qualities while recalling the last battle before the end of the war, he never realizes until later, that his lover, Raina, Major Petkoff's, daughter is the one who shelters him and helps him to escape. The grounds for a conflict between the two soldiers are being established through Raina's amorous feeling for Bluntschli, in spite of her romantic idealization of Sergius.\nHowever, Rains, in the early part of the play, expresses her scepticism about Sergius' heroism. She tells Catherine, her mother, \"Our ideals of what Sergius would do - our partiotism - our heroic ideals. I sometimes used to doubt whether they were anything but dreams\". Thus, it seems this scepticism is proved right when she meets Bluntschli. Bluntschli demonstrates the reality about war and warring to her as she shields the \"chocolate-cream soldier\". She later rebukes Sergius' \"coarse\" retelling of Bluntschli's escape story in her presence. Bluntschli has apparently related his escape to the Bulgarian army during the exchange of soldiers after the ceasefire.\nLouka's revelations about Raina's secret love escapades to Sergius provides the necessary reasons for his later challenge to Bluntschli. In the third Act, the stage direction portrays Sergius as admirably envious of B Iuntschli as the latter works to map out the disengagement of three cavalry regiments to Philippopolis. Sergius contemplates \"Bluntschli's quick, sure, business-like progress with a mixture of envious imitation at his own incapacity\". The impression given in this regard is that in spite of the initial lack of kinowledge about the identity of his rival, Sergius is already nursing a grudge against Bluntsehii. The revelation of Bluntschli as the man who has won over Raina's love, which Sergius uses as excuses for challenging him is only being underscored by the growing envy which Sergius has already nursed against Bluntschli. The conflict bewtween these two is not, therefore, rooted in Raina's switch over to Bluntschli but on the personality crisis Sergius has.\nThe path to the resolution of the conflict begins to emerge as Bluntschli reappears to return Major Petkoff's coat given to him by Raina to prevent himself from being identified as the tensions and apprehensions that the audience has been put to begin to reach the climax. This also shows how the story of the two men forms a sub plot in the play and the conflict between them a sub confilict of the overall conflict in the play. Bluntschli appears on the scene only to be challenged to a duel by Sergious even though he (Sergius) does not state the grounds for the challenge. Yet, Bluntschli accepts the challenge to fight him without any demand for his offence. As Rains comes in, the truth about Bluntschli's identity as the escaped soldier and the secret romantic advances of Sergius to Louka are all revealed. The Whole business of fighting to resolve the conflict is no longer necessary as bot men have now discovered where their true love belongs and so they become happy people.",
    "explanation": "Sergius and Bluntschli are soldiers fighting on either side of two warring countries. Bulgaria and Serbia respectively. Bluntschli is, however, a Swiss mercenary on the side of the Serbs Running away from the battlefield after an unprofessional chivalry charge led by Sergius which destabilizes the Serbian army, Bluntschli takes refuge in Raina's chamber. Even though Sergius acknowledges Bluntschli's professional qualities while recalling the last battle before the end of the war, he never realizes until later, that his lover, Raina, Major Petkoff's, daughter is the one who shelters him and helps him to escape. The grounds for a conflict between the two soldiers are being established through Raina's amorous feeling for Bluntschli, in spite of her romantic idealization of Sergius.\nHowever, Rains, in the early part of the play, expresses her scepticism about Sergius' heroism. She tells Catherine, her mother, \"Our ideals of what Sergius would do - our partiotism - our heroic ideals. I sometimes used to doubt whether they were anything but dreams\". Thus, it seems this scepticism is proved right when she meets Bluntschli. Bluntschli demonstrates the reality about war and warring to her as she shields the \"chocolate-cream soldier\". She later rebukes Sergius' \"coarse\" retelling of Bluntschli's escape story in her presence. Bluntschli has apparently related his escape to the Bulgarian army during the exchange of soldiers after the ceasefire.\nLouka's revelations about Raina's secret love escapades to Sergius provides the necessary reasons for his later challenge to Bluntschli. In the third Act, the stage direction portrays Sergius as admirably envious of B Iuntschli as the latter works to map out the disengagement of three cavalry regiments to Philippopolis. Sergius contemplates \"Bluntschli's quick, sure, business-like progress with a mixture of envious imitation at his own incapacity\". The impression given in this regard is that in spite of the initial lack of kinowledge about the identity of his rival, Sergius is already nursing a grudge against Bluntsehii. The revelation of Bluntschli as the man who has won over Raina's love, which Sergius uses as excuses for challenging him is only being underscored by the growing envy which Sergius has already nursed against Bluntschli. The conflict bewtween these two is not, therefore, rooted in Raina's switch over to Bluntschli but on the personality crisis Sergius has.\nThe path to the resolution of the conflict begins to emerge as Bluntschli reappears to return Major Petkoff's coat given to him by Raina to prevent himself from being identified as the tensions and apprehensions that the audience has been put to begin to reach the climax. This also shows how the story of the two men forms a sub plot in the play and the conflict between them a sub confilict of the overall conflict in the play. Bluntschli appears on the scene only to be challenged to a duel by Sergious even though he (Sergius) does not state the grounds for the challenge. Yet, Bluntschli accepts the challenge to fight him without any demand for his offence. As Rains comes in, the truth about Bluntschli's identity as the escaped soldier and the secret romantic advances of Sergius to Louka are all revealed. The Whole business of fighting to resolve the conflict is no longer necessary as bot men have now discovered where their true love belongs and so they become happy people.",
    "year": "2015"
  },
  {
    "number": "89",
    "text": "NON — AFRICAN DRAMA \nOSCAR WILDE: THE IMPORTANCE OF BEING EARNEST \n \nComment on the use of irony in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52624?exam_type=waec&type=theory&page=18",
    "correct_answer": "There is much use of irony in the play. In examining the characters and events, there is much more than meets the eye.\nDuring Algenon's arguments with Jack over Jack's cigarette case, Algernon reveals much about himself. One such revelation is the depth of his insight into human nature. He asserts that two women cannot become friends before they have quarrelled. Ironically this is how the relationship between Gwendolen and Cecily develops. The apparently 8greeable women quickly gird themselves for serious confrontation over the personality \"Ernest\" that either claims for her lover.\nThe double identity of Jack is replicated in Algernon's \"Bunburyism\". It is ironical that this is used effectively against Jack. As Jack given his country address to Gwendolen Algernon eavesdrops. He takes down the address and promptly asks Lane to prepare him for \"Bunburying\".\nBy her own confession, Lady Bracknell has gone into marriage with hardly any wealth. She should not be rating people for their wealth, as she does Jack, before being eligible to marry into her class. For this reason her interview of Jack concerning Jack's worth is ironical.\nAdvising Jack regarding his parentage, Lady Bracknell finds Jack's being found in a bag at the railway station unsatisfactory, so she asks him to acquire at least one parent. This appears rather impossible. Soon enough, however, Miss Prism comes to the rescue. Upon Lady Bracknell's own insistence, the whole story of Jack's genealogy is made bare and he does acquire adequate parentage in dramatic fashion. Being called Ernest, as it turns out, is really serious business. The flippant naming of an imaginary wayward brother as Ernest by Jack is ironical. In due time he will need to have to acquire that name to solve a critical problem. This is ironical.",
    "explanation": "There is much use of irony in the play. In examining the characters and events, there is much more than meets the eye.\nDuring Algenon's arguments with Jack over Jack's cigarette case, Algernon reveals much about himself. One such revelation is the depth of his insight into human nature. He asserts that two women cannot become friends before they have quarrelled. Ironically this is how the relationship between Gwendolen and Cecily develops. The apparently 8greeable women quickly gird themselves for serious confrontation over the personality \"Ernest\" that either claims for her lover.\nThe double identity of Jack is replicated in Algernon's \"Bunburyism\". It is ironical that this is used effectively against Jack. As Jack given his country address to Gwendolen Algernon eavesdrops. He takes down the address and promptly asks Lane to prepare him for \"Bunburying\".\nBy her own confession, Lady Bracknell has gone into marriage with hardly any wealth. She should not be rating people for their wealth, as she does Jack, before being eligible to marry into her class. For this reason her interview of Jack concerning Jack's worth is ironical.\nAdvising Jack regarding his parentage, Lady Bracknell finds Jack's being found in a bag at the railway station unsatisfactory, so she asks him to acquire at least one parent. This appears rather impossible. Soon enough, however, Miss Prism comes to the rescue. Upon Lady Bracknell's own insistence, the whole story of Jack's genealogy is made bare and he does acquire adequate parentage in dramatic fashion. Being called Ernest, as it turns out, is really serious business. The flippant naming of an imaginary wayward brother as Ernest by Jack is ironical. In due time he will need to have to acquire that name to solve a critical problem. This is ironical.",
    "year": "2015"
  },
  {
    "number": "90",
    "text": "NON — AFRICAN DRAMA \nOSCAR WILDE: THE IMPORTANCE OF BEING EARNEST \n \nExamine Miss Prism's importance in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52626?exam_type=waec&type=theory&page=18",
    "correct_answer": "When casually observed, Miss Prism is simply a minor character. On close examination. however, she is seen as playing a most revealing role, particularly at certain defining moments.\nHer actions initiate the various mistaken identities that dominate and largely shape the course of events in the play. But it is also through her that the raging confusion is finally and happily resolved.\nHer actions and their ripple effects begin to manifest when she is Jack's nanny. Jack is then christened `Ernest John'. At one time this nanny absent-mindedly drops the toddler in her bag instead of in a pram, at Victoria Railway Station luggage room in London. The bag is mistakenly given to one Mr. Thomas Cardew on his way to Worthing. Mr. Cardew arrives home, adopts the \"abandoned\" baby and names him Jack Worthing. The baby grows up to be known as Uncle Jack for about 29 years. And for that long, Miss Prism inadvertently obscures his true identity.\nIt is Jack's obscured identity that makes him and Algernon, his younger biological brother, to think that they are ordinary friends. The same mistaken identity makes his aunt - Lady Bracknell, believe that he is a poor commoner; unworthy of her daughter's love. It is a fall-out of Miss Prism's absent-mindedness that leads Jack to pledge to convert his name to Ernest to please Gwendolen when in fact he is named Ernest at birth. These situations that give rise to instances of mistaken identities and dramatic irony that are directly or indirectly set in motion by Miss Prism's apparent slip of memory.\nHowever, there is nothing of a slip of memory in her relationship with Casuble. She will not be out done by the other characters in the choice of a partner and in her deliberate, calculating secretive manner, she succeeds in getting married to the Parson. •\nBut it is also Miss Prism that comes to cut the Gordian knot (unravel the mysteries) in a most dramatic way. This comes at a time when the proposed marriage between Jack and Gwendolen is facing the mother's stiffest opposition. As the mother sights Miss Prism and casts her mind back on an earlier event, she calls for explanation. Miss Prism readily obliges and, true to what her name seems to symbolize, She sheds the necessary light on Jack's true identity. There and then all other issues of mistaken identity are resolved in what turns out to be a comedy of errors.",
    "explanation": "When casually observed, Miss Prism is simply a minor character. On close examination. however, she is seen as playing a most revealing role, particularly at certain defining moments.\nHer actions initiate the various mistaken identities that dominate and largely shape the course of events in the play. But it is also through her that the raging confusion is finally and happily resolved.\nHer actions and their ripple effects begin to manifest when she is Jack's nanny. Jack is then christened `Ernest John'. At one time this nanny absent-mindedly drops the toddler in her bag instead of in a pram, at Victoria Railway Station luggage room in London. The bag is mistakenly given to one Mr. Thomas Cardew on his way to Worthing. Mr. Cardew arrives home, adopts the \"abandoned\" baby and names him Jack Worthing. The baby grows up to be known as Uncle Jack for about 29 years. And for that long, Miss Prism inadvertently obscures his true identity.\nIt is Jack's obscured identity that makes him and Algernon, his younger biological brother, to think that they are ordinary friends. The same mistaken identity makes his aunt - Lady Bracknell, believe that he is a poor commoner; unworthy of her daughter's love. It is a fall-out of Miss Prism's absent-mindedness that leads Jack to pledge to convert his name to Ernest to please Gwendolen when in fact he is named Ernest at birth. These situations that give rise to instances of mistaken identities and dramatic irony that are directly or indirectly set in motion by Miss Prism's apparent slip of memory.\nHowever, there is nothing of a slip of memory in her relationship with Casuble. She will not be out done by the other characters in the choice of a partner and in her deliberate, calculating secretive manner, she succeeds in getting married to the Parson. •\nBut it is also Miss Prism that comes to cut the Gordian knot (unravel the mysteries) in a most dramatic way. This comes at a time when the proposed marriage between Jack and Gwendolen is facing the mother's stiffest opposition. As the mother sights Miss Prism and casts her mind back on an earlier event, she calls for explanation. Miss Prism readily obliges and, true to what her name seems to symbolize, She sheds the necessary light on Jack's true identity. There and then all other issues of mistaken identity are resolved in what turns out to be a comedy of errors.",
    "year": "2015"
  },
  {
    "number": "91",
    "text": "AFRICAN POETRY \n \nExamine the identity crisis in \"Boy on a Swing\".",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52628?exam_type=waec&type=theory&page=19",
    "correct_answer": "The poem depicts a boy swinging to and fro on a swing. The emphasis is on the activity and it seems he is enjoying himself immensely as the swing moves \" faster and faster\".\nMore gets known about the boy as the poem progresses. Reference is made to his \"blue shirt\" billowing \"in the breeze\", and its comparison with \"a tattered kite\". What is here revealed is his background and his poverty which the words \"blue\" and \"tattered\" suggest.\nAs the boy's movement on the swing intensifies, more is suggested about the happenings on the swing. Now its rapid motion becomes disorienting as the boy loses bearing in the metaphor of \"east becomes west\". \"north turns to south\" and \"the four cardinal points/ meet in his head\". At this point, it is suggested, confusion sets in and.the boy is no longer at ease in his former state where he seems to be at home in familiar poverty and class.\nThe crisis of identity is then reached in the final stanza in the cry of \"Mother!\", in the one and only first line, to be followed by the series of rhetorical questions in the succeeding lines. These questions allude to the boy's origin and aspiration ending in the profundity of the line - \"Why was my father jailed?\" It seems that at this point the veil has been removed from the boy's face and, like a clairvoyant, he can see the unacceptable situation in which he and his race find themselves. The poignancy of the revelation is felt, rather than said, as a world of innocence crashes before the boy's eyes.",
    "explanation": "The poem depicts a boy swinging to and fro on a swing. The emphasis is on the activity and it seems he is enjoying himself immensely as the swing moves \" faster and faster\".\nMore gets known about the boy as the poem progresses. Reference is made to his \"blue shirt\" billowing \"in the breeze\", and its comparison with \"a tattered kite\". What is here revealed is his background and his poverty which the words \"blue\" and \"tattered\" suggest.\nAs the boy's movement on the swing intensifies, more is suggested about the happenings on the swing. Now its rapid motion becomes disorienting as the boy loses bearing in the metaphor of \"east becomes west\". \"north turns to south\" and \"the four cardinal points/ meet in his head\". At this point, it is suggested, confusion sets in and.the boy is no longer at ease in his former state where he seems to be at home in familiar poverty and class.\nThe crisis of identity is then reached in the final stanza in the cry of \"Mother!\", in the one and only first line, to be followed by the series of rhetorical questions in the succeeding lines. These questions allude to the boy's origin and aspiration ending in the profundity of the line - \"Why was my father jailed?\" It seems that at this point the veil has been removed from the boy's face and, like a clairvoyant, he can see the unacceptable situation in which he and his race find themselves. The poignancy of the revelation is felt, rather than said, as a world of innocence crashes before the boy's eyes.",
    "year": "2015"
  },
  {
    "number": "92",
    "text": "AFRICAN POETRY \n \nHow does the poet present his experiences as a blackman in \"Expelled\"?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52629?exam_type=waec&type=theory&page=19",
    "correct_answer": "The poet presents an image of a world before colonialism which brought great devastation. The dominant image is that of commerce: \"We had traded in this market competitively perfect\", suggesting peace.\nThe picture changes dramatically, however, when colonization sets in to disrupt the erstwhile peaceful co-existence. The metaphor of \"cut our ribs, dried our cows\" and \"burst the cowshed\" presents a picture of devastation affecting agriculture and the economy which have been the bulwark of the people's prosperity. The very natural environment is not spared by the reference to words like \"drought\" and \"famine\". The blackman's confidence is thus crowded as he is cut off from his means of livelihood.\nAfter presenting such a grim picture of life after colonialism the poet enters into a state of personal lamentation. This is captured by the hyperbole in \"my tears flowed to flooded streams\", while the allusion to Sodom and Gomorrah presages the complete penury into which the poet has sunk. The image of the debtors and creditors at \"my rusty door\" is poignant. He has become the laughing stock of others as what is left of his miserable possessions is auctioned. The devastation brought in by colonialism is total and the poet's own life becomes a veritable testament.",
    "explanation": "The poet presents an image of a world before colonialism which brought great devastation. The dominant image is that of commerce: \"We had traded in this market competitively perfect\", suggesting peace.\nThe picture changes dramatically, however, when colonization sets in to disrupt the erstwhile peaceful co-existence. The metaphor of \"cut our ribs, dried our cows\" and \"burst the cowshed\" presents a picture of devastation affecting agriculture and the economy which have been the bulwark of the people's prosperity. The very natural environment is not spared by the reference to words like \"drought\" and \"famine\". The blackman's confidence is thus crowded as he is cut off from his means of livelihood.\nAfter presenting such a grim picture of life after colonialism the poet enters into a state of personal lamentation. This is captured by the hyperbole in \"my tears flowed to flooded streams\", while the allusion to Sodom and Gomorrah presages the complete penury into which the poet has sunk. The image of the debtors and creditors at \"my rusty door\" is poignant. He has become the laughing stock of others as what is left of his miserable possessions is auctioned. The devastation brought in by colonialism is total and the poet's own life becomes a veritable testament.",
    "year": "2015"
  },
  {
    "number": "93",
    "text": "NON —AFRICAN POETRY \n \nDiscuss the changing mood of the poet in \"The Sun Rising\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52630?exam_type=waec&type=theory&page=19",
    "correct_answer": "The Sunne Rising is a dramatization of an imagined confrontation between a lover and the sun. Initially, the poet feigns a foul and angry mood, as the sun shines into the room where he and his mistress are still lying in bed. He not only describes the sun as \"busy\" and \"unruly\" but also calls the sun a \"fool\". The poet directs the sun to its routine rounds - \"goe chide late schoole boyes, and sowre prentices... \" etc. admonishing it to do its job and not annoy him. All this occurs in the first stanza.\nIn the second stanza, the poet's stance appears to soften as he acknowledges the power of the sun's rays. He trivializes it and boasts that he could \"eclipse\" it \"with a wink\". In this, there is both arrogance and sarcasm.\nThe boast continues in the third stanza where he presents his lover as perfection itself. For both of them are an embodiment of royalty and all the riches of the world. The mood here is triumphant. Suddenly (still in the third stanza) the poet's mood becomes conciliatory and amiable. He sees the sun as aging and requiring rest, yet having his work to do. The poet's anger seems to have cooled off considerably. He asks the sun to shine on him and his lover. He is obviously proud that, after all, the best place for the sun to do his job, if he is to do it well, is the closet/room where the lovers are, for that epitomizes the vast world round which the sun must travel daily. This, the poet contends, will ease the suns' burden though he will have fully accomplished his task by simply staying with the lovers. The mood at this point, besides being conciliatory, is also patronizing.\nIt can be said that the initially angry mood of the poet changes to become persuasive, then conciliatory and patronizing.",
    "explanation": "The Sunne Rising is a dramatization of an imagined confrontation between a lover and the sun. Initially, the poet feigns a foul and angry mood, as the sun shines into the room where he and his mistress are still lying in bed. He not only describes the sun as \"busy\" and \"unruly\" but also calls the sun a \"fool\". The poet directs the sun to its routine rounds - \"goe chide late schoole boyes, and sowre prentices... \" etc. admonishing it to do its job and not annoy him. All this occurs in the first stanza.\nIn the second stanza, the poet's stance appears to soften as he acknowledges the power of the sun's rays. He trivializes it and boasts that he could \"eclipse\" it \"with a wink\". In this, there is both arrogance and sarcasm.\nThe boast continues in the third stanza where he presents his lover as perfection itself. For both of them are an embodiment of royalty and all the riches of the world. The mood here is triumphant. Suddenly (still in the third stanza) the poet's mood becomes conciliatory and amiable. He sees the sun as aging and requiring rest, yet having his work to do. The poet's anger seems to have cooled off considerably. He asks the sun to shine on him and his lover. He is obviously proud that, after all, the best place for the sun to do his job, if he is to do it well, is the closet/room where the lovers are, for that epitomizes the vast world round which the sun must travel daily. This, the poet contends, will ease the suns' burden though he will have fully accomplished his task by simply staying with the lovers. The mood at this point, besides being conciliatory, is also patronizing.\nIt can be said that the initially angry mood of the poet changes to become persuasive, then conciliatory and patronizing.",
    "year": "2015"
  },
  {
    "number": "94",
    "text": "NON —AFRICAN POETRY \n \nComment on the errand of the soul in \"The Soul's Errand\".",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/52632?exam_type=waec&type=theory&page=19",
    "correct_answer": "The poet, in acknowledging human frailty vis-a-vis the inviolability and immortality of the could, sends it a an errand to defend the truth against human lies and machinations in all places, high and low. Everywhere, doing the wrong thing holds sway and prevention is rife. Thus the errand involves speaking against the perversion of intellectual, Moral, emotional and other forms of human behaviour.\nThe poet is mainly worried that institutions uphold the reverse of the fundamental values of their existence. Religious and secular institutions as well as ethical values come up for censure. These include Courts, the Potentates, The Church, Honour, Love and Beauty. On his deathbed, he asks the should to pay visits to each and every one of these perverters. While out at it he must \"give the world the lie\" as nothing is done right anywhere in the world. The repetition of the line \"give the world the lie\" acts as a refrain and highlights the poet's preoccupation.\nThat his concept of morality and living right is not easy to uphold is not lost on the poet. He is aware that facing the truth can be a bitter experiment; telling it, even more so. The bearer of the message of truth may be threatened with death \"to give the lie/Deserves no less than stabbing\".\nHowever, it is comforting that the soul has the advantage of immortality and will definitely come out unhurt: \"No stab the soul can kill\".",
    "explanation": "The poet, in acknowledging human frailty vis-a-vis the inviolability and immortality of the could, sends it a an errand to defend the truth against human lies and machinations in all places, high and low. Everywhere, doing the wrong thing holds sway and prevention is rife. Thus the errand involves speaking against the perversion of intellectual, Moral, emotional and other forms of human behaviour.\nThe poet is mainly worried that institutions uphold the reverse of the fundamental values of their existence. Religious and secular institutions as well as ethical values come up for censure. These include Courts, the Potentates, The Church, Honour, Love and Beauty. On his deathbed, he asks the should to pay visits to each and every one of these perverters. While out at it he must \"give the world the lie\" as nothing is done right anywhere in the world. The repetition of the line \"give the world the lie\" acts as a refrain and highlights the poet's preoccupation.\nThat his concept of morality and living right is not easy to uphold is not lost on the poet. He is aware that facing the truth can be a bitter experiment; telling it, even more so. The bearer of the message of truth may be threatened with death \"to give the lie/Deserves no less than stabbing\".\nHowever, it is comforting that the soul has the advantage of immortality and will definitely come out unhurt: \"No stab the soul can kill\".",
    "year": "2015"
  }
]