[
  {
    "number": "49",
    "text": "(a). State five functions of a wholesaler\n(b). Outline five factors that would influence the choice of a distribution channel by a producer",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68800?exam_type=waec&type=theory&page=10",
    "correct_answer": "(a). - Wholesalers purchase goods in large quantities from manufacturers or producers. They buy goods in bulk at discounted prices, leveraging their buying power to negotiate favourable terms and conditions.- wholesalers maintain an inventory of goods to ensure a steady supply to retailers. They forecast demand, monitor trends, and stock a wide range of products to meet the varied needs of retailers.- Wholesalers provide warehousing facilities to store and protect goods. They handle logistics, including receiving, storing, and organizing inventory eficiently.- Wholesalers may inspect, sort, and grade the products they receive from manufacturers. This ensures that the products meet certain quality standards and are appropriately categorized before being distributed to retailers.- Wholesalers repackage products to make them suitable for retail sale. They may remove bulk packaging and repackaging products into smaller units or create customized packaging solutions as per the requirements of retailers.- Wholesalers arrange for the transportation of goods from the manufacturer's location to their own warehouse and subsequently to retailers. They coordinates with shipping companies, freight forwarders, and other logistics providers to ensure timely delivery.- Wholesalers may offer credit facilities to retailers, allowing them to purchase goods on credit terms and pay later. This helps retailers manage their cash flow and inventory levels.\n(b). - Nature of product: the nature of the product has a bearing on the choice of distribution channel. The durability of the product, unit cost of product, type of product must be considered while determining the distribution channel.- Nature of market: the geographical width of the market, number of potential buyer, nature of competition has a bearing on selection of distribution channel.- Size of business: the size of the business, financial strength of the concern determines the channel of distribution. A small producer may sell his distribution. A small producer may sell his product directly, while a large producer may use a longer distribution channel.- Cost of channel: distribution process involves cost of transportation, warehousing, storage insurance, material handling, distribution personnel's compensation and interest on inventory carried at different selling points. Higher cost of distribution will result in the increased cost of product.- Nature of middlemen: the producer must select those middlemen who provide the best marketing services like storage, transportation, credit and packing etc. At the same time the middlemen should ensure various services to customers.",
    "explanation": "(a). - Wholesalers purchase goods in large quantities from manufacturers or producers. They buy goods in bulk at discounted prices, leveraging their buying power to negotiate favourable terms and conditions.- wholesalers maintain an inventory of goods to ensure a steady supply to retailers. They forecast demand, monitor trends, and stock a wide range of products to meet the varied needs of retailers.- Wholesalers provide warehousing facilities to store and protect goods. They handle logistics, including receiving, storing, and organizing inventory eficiently.- Wholesalers may inspect, sort, and grade the products they receive from manufacturers. This ensures that the products meet certain quality standards and are appropriately categorized before being distributed to retailers.- Wholesalers repackage products to make them suitable for retail sale. They may remove bulk packaging and repackaging products into smaller units or create customized packaging solutions as per the requirements of retailers.- Wholesalers arrange for the transportation of goods from the manufacturer's location to their own warehouse and subsequently to retailers. They coordinates with shipping companies, freight forwarders, and other logistics providers to ensure timely delivery.- Wholesalers may offer credit facilities to retailers, allowing them to purchase goods on credit terms and pay later. This helps retailers manage their cash flow and inventory levels.\n(b). - Nature of product: the nature of the product has a bearing on the choice of distribution channel. The durability of the product, unit cost of product, type of product must be considered while determining the distribution channel.- Nature of market: the geographical width of the market, number of potential buyer, nature of competition has a bearing on selection of distribution channel.- Size of business: the size of the business, financial strength of the concern determines the channel of distribution. A small producer may sell his distribution. A small producer may sell his product directly, while a large producer may use a longer distribution channel.- Cost of channel: distribution process involves cost of transportation, warehousing, storage insurance, material handling, distribution personnel's compensation and interest on inventory carried at different selling points. Higher cost of distribution will result in the increased cost of product.- Nature of middlemen: the producer must select those middlemen who provide the best marketing services like storage, transportation, credit and packing etc. At the same time the middlemen should ensure various services to customers.",
    "year": "2023"
  },
  {
    "number": "50",
    "text": "(a) Mr Oke, the head of the purchasing committee in BIQ Ltd bought a television set for his family.\n\nExplain the first four steps Mr Oke took in buying the television\n(b) Mr Oke, the head of the purchasing committee in BIQ Ltd bought a television set for his family.\nList and explain four factors that would influence the committee's buying behaviour",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68803?exam_type=waec&type=theory&page=10",
    "correct_answer": "(a) - Need identification: Mr Oke recognized the need to purchase a television set for his family. This step involves identifying the requirements, preferences, and specifications of the product to meet his family's entertainment needs.- Research and Evaluation: after identifying the need, Mr Oke conducted thorough research on different televisionj models, brands, features and prices. He gathered information from various sources.- Decision making: once Mr. Oke had gathered sufficient information, he analyzed the avaliable options and compared them against his requirements and budget.- Purchase and Post-Purchasr Evaluation: after finalizing his decision, Mr Oke proceeded with the actual purchase of the chosen television set. He identified the most reliable retailer and made payment.\n(b) - Organizational goals and objectives: the committee's buying behaviour is influenced by the goals and objectives of the organization.- Budget and financial considerations: the financial resources available to the committee can greately influence their buying behaviour.- Organizational policies and procedures: committees often have to adhere to specific organizational policies and procedures when making purchasing decisions.- Stakeholders input and influence: committees are composed of multiple individuals representing various departments or functions within the organization.- Product specifications and quality: the specifications and quality of the product or service being considered will impact the committee's buying behaviour- Vendor reputation and relationships: the reputation and relationships with potential vendors can influence the committee's buying behaviour.",
    "explanation": "(a) - Need identification: Mr Oke recognized the need to purchase a television set for his family. This step involves identifying the requirements, preferences, and specifications of the product to meet his family's entertainment needs.- Research and Evaluation: after identifying the need, Mr Oke conducted thorough research on different televisionj models, brands, features and prices. He gathered information from various sources.- Decision making: once Mr. Oke had gathered sufficient information, he analyzed the avaliable options and compared them against his requirements and budget.- Purchase and Post-Purchasr Evaluation: after finalizing his decision, Mr Oke proceeded with the actual purchase of the chosen television set. He identified the most reliable retailer and made payment.\n(b) - Organizational goals and objectives: the committee's buying behaviour is influenced by the goals and objectives of the organization.- Budget and financial considerations: the financial resources available to the committee can greately influence their buying behaviour.- Organizational policies and procedures: committees often have to adhere to specific organizational policies and procedures when making purchasing decisions.- Stakeholders input and influence: committees are composed of multiple individuals representing various departments or functions within the organization.- Product specifications and quality: the specifications and quality of the product or service being considered will impact the committee's buying behaviour- Vendor reputation and relationships: the reputation and relationships with potential vendors can influence the committee's buying behaviour.",
    "year": "2023"
  },
  {
    "number": "51",
    "text": "(a) JK Ltd, a Nigerian company decides to expand its operational to the South African Market.\n\nState four reason that would have necessitated the company's decision\n(b) JK Ltd, a Nigerian company decides to expand its operational to the South African Market.\nList and explain four entry modes the company could use to enter the South African market",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68805?exam_type=waec&type=theory&page=11",
    "correct_answer": "(a) - Access to new customers and markets- Diversifying its business to reduce risk- Taking advantage of new opportunities in South Africa- Increasing profitability through economies of scale\n(b) - Exporting- Franchising- Joint venture- Wholly owned subsidiaryExporting:This mode of entry is suitable for JK Ltd as it requires low investment and allows the company to test the market with minimal risk. The main disadvantage is that it may be difficult to maintain quality control.Franching:This mode of entry allows JK Ltd to expand quickly and takes advantage of an already established business with knowledge of the South African market. However, it may be difficult to maintain control over the franchisee.Joint venture:This mode of entry allows JK Ltd to share the risks and expenses of entering the South African market with a local company. However, Jk Ltd may lose some control over the operations of the joint venture company.Wholly owned subsidiary:This mode of entry gives JK Ltd complete control over its operations in South Africa. However, it requires significant investment and may take longer to establish a presence in the market.",
    "explanation": "(a) - Access to new customers and markets- Diversifying its business to reduce risk- Taking advantage of new opportunities in South Africa- Increasing profitability through economies of scale\n(b) - Exporting- Franchising- Joint venture- Wholly owned subsidiaryExporting:This mode of entry is suitable for JK Ltd as it requires low investment and allows the company to test the market with minimal risk. The main disadvantage is that it may be difficult to maintain quality control.Franching:This mode of entry allows JK Ltd to expand quickly and takes advantage of an already established business with knowledge of the South African market. However, it may be difficult to maintain control over the franchisee.Joint venture:This mode of entry allows JK Ltd to share the risks and expenses of entering the South African market with a local company. However, Jk Ltd may lose some control over the operations of the joint venture company.Wholly owned subsidiary:This mode of entry gives JK Ltd complete control over its operations in South Africa. However, it requires significant investment and may take longer to establish a presence in the market.",
    "year": "2023"
  },
  {
    "number": "52",
    "text": "(a) List two components each of the 4P's of marketing\n(b) List and explain four external factors affecting the marketing environment",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68806?exam_type=waec&type=theory&page=11",
    "correct_answer": "(a) - Product : Quality, Design- Price: Cost, Value- Place: Distribution channels, Location- Promotion: Advertising, Public relations\n(b)- Economic factors- Technological factors- Political factors- Sociocultural factorsEconomic factors:Factors such as inflation, interest rates, and income levels can directly impact consumer spending habits and the overall demand for goods and services.Technological factors:Technology can create new opportunites for marketers, while also rendering existing products and marketing strategies obsolete.Political and legal factors:Changes in laws and regulations related to marketing such as privacy laws, advertising regulations, and product safety requirements, can greatly impact marketing strategies.Sociocultural factorsCultural and social factors such as demographics, social trends, and consumer behaviours can influence consumer preferences and the success of marketing campaigns.",
    "explanation": "(a) - Product : Quality, Design- Price: Cost, Value- Place: Distribution channels, Location- Promotion: Advertising, Public relations\n(b)- Economic factors- Technological factors- Political factors- Sociocultural factorsEconomic factors:Factors such as inflation, interest rates, and income levels can directly impact consumer spending habits and the overall demand for goods and services.Technological factors:Technology can create new opportunites for marketers, while also rendering existing products and marketing strategies obsolete.Political and legal factors:Changes in laws and regulations related to marketing such as privacy laws, advertising regulations, and product safety requirements, can greatly impact marketing strategies.Sociocultural factorsCultural and social factors such as demographics, social trends, and consumer behaviours can influence consumer preferences and the success of marketing campaigns.",
    "year": "2023"
  },
  {
    "number": "53",
    "text": "(a) Jo - Bo, a young graduate established a retail outlet in his neighbourhood instead of seeking for a paid employment.\n\nState five activities Jo-Bo would carry out to ensure continuous patronage by customers.\n(b) Jo - Bo, a young graduate established a retail outlet in his neighbourhood instead of seeking for a paid employment.\nState five benefits Jo -Bo would derive from his decision",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68809?exam_type=waec&type=theory&page=11",
    "correct_answer": "(a)\n- Jo Bo should ensure a different variety of products are available in his retail outlet to cater to different customer preferences and needs.- Jo -Bo should focus on providing high-quality products that meet or exceed customers expectations.- Jo -Bo should offer competitive prices for his products compaired to other retailers in the area.- Jo - Bo should provide excellent customer service for customer retention.- Implementing a loyalty program or offering incentives such as discounts or reward points, for repeat customers.-Jo -Bo should ensure his retail outlet is visually appealing and well organized.- Jo-Bo should engage in effective marketing strategies to create awareness and attract new customers- Jo-Bo should actively seek feedback from customers to understand their needs and preferences better.\n(b)\n- By starting his own retail outlet, Jo-Bo can become financially independent.- Running a business allows Jo-Bo to gain valuable entrepreneurial experience/- By establishing his retail outlet, Jo-Bo contributes to job creation in his neighborhood.- As the owner of his business, Jo-Bo has the freedom to set his own working hours and make decisions independently.- He will be able to learn continously and experience personal growth.- Building a successful businjess can potentially lead to long term wealth creation for Jo-Bo.",
    "explanation": "(a)\n- Jo Bo should ensure a different variety of products are available in his retail outlet to cater to different customer preferences and needs.- Jo -Bo should focus on providing high-quality products that meet or exceed customers expectations.- Jo -Bo should offer competitive prices for his products compaired to other retailers in the area.- Jo - Bo should provide excellent customer service for customer retention.- Implementing a loyalty program or offering incentives such as discounts or reward points, for repeat customers.-Jo -Bo should ensure his retail outlet is visually appealing and well organized.- Jo-Bo should engage in effective marketing strategies to create awareness and attract new customers- Jo-Bo should actively seek feedback from customers to understand their needs and preferences better.\n(b)\n- By starting his own retail outlet, Jo-Bo can become financially independent.- Running a business allows Jo-Bo to gain valuable entrepreneurial experience/- By establishing his retail outlet, Jo-Bo contributes to job creation in his neighborhood.- As the owner of his business, Jo-Bo has the freedom to set his own working hours and make decisions independently.- He will be able to learn continously and experience personal growth.- Building a successful businjess can potentially lead to long term wealth creation for Jo-Bo.",
    "year": "2023"
  },
  {
    "number": "54",
    "text": "(a) State five factors that a manufacturer would consider before setting prices for his products.\n(b) Explain five advantages of television over electronic billboard as a medium of advertising.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68810?exam_type=waec&type=theory&page=11",
    "correct_answer": "(a)\n- Business goals: before setting a price for the product or service, the manufacturer must first consider the overall marketing objectives.- Cost: the cost involved with running the business must be worked out. These include the fixed cost and direct costs.- Customers: know what the customers want from the product or services. Are they driven by the cheapest price or by the value they receive?- Positioning: Where do you want to be in the marketplace. Will the product be expensive or high -end brand in the industry.- Competitiors: the manufacturer will have to give permission to do little competitor snooping. What are they charging for different products and services?\n(b) - Large audience: the television has large audience reach than the electronic billboard as a medium of advert.- Possibility to hear and see: television advert makes it possibvle to see and hear information about the product at the same time.- Quick for viewer: understanding of advertisement is simple and quick for viewers.- True form of the product: the true form and colour of the product can be easily seen.- Gives live and direct display: in this kind of advertising, there is more sensory stimulations as it gives live and direct display.",
    "explanation": "(a)\n- Business goals: before setting a price for the product or service, the manufacturer must first consider the overall marketing objectives.- Cost: the cost involved with running the business must be worked out. These include the fixed cost and direct costs.- Customers: know what the customers want from the product or services. Are they driven by the cheapest price or by the value they receive?- Positioning: Where do you want to be in the marketplace. Will the product be expensive or high -end brand in the industry.- Competitiors: the manufacturer will have to give permission to do little competitor snooping. What are they charging for different products and services?\n(b) - Large audience: the television has large audience reach than the electronic billboard as a medium of advert.- Possibility to hear and see: television advert makes it possibvle to see and hear information about the product at the same time.- Quick for viewer: understanding of advertisement is simple and quick for viewers.- True form of the product: the true form and colour of the product can be easily seen.- Gives live and direct display: in this kind of advertising, there is more sensory stimulations as it gives live and direct display.",
    "year": "2023"
  }
]