[
  {
    "number": "13",
    "text": "Study specimen C, D, E and F and answer the questions that follow.\n(a) Give the botanical names of each of specimens C,D, and E.\n(b) Name the forage type to which each of the sepcimen C,D and E belongs.\n(c) State four ways in which specimen C is important in livestock production.\n(d) State the type of farm animal that is mostly fed with specimen F\n(e) Describe the process of preparing specimen F",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59761?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "14",
    "text": "Study specimen J (Soldier ants),K (Weaver bird) and L (Weevil) and answer the questions that follows\n(a)(i) State two harmful effects of each of specimens J, K, and L in livestock production.\n(ii) State two ways of controlling each of the specimen J, K and L on livestock farms.\n(b) Mention three other storage pests in farm animal production.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59775?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "15",
    "text": "Study specimen P (Wood shavings),Q(Egg tray) and R (Spade) and answer the questions that follow.\n(a)(i) State two uses of each of specimen P and R on animal farm.\n(ii) State three uses of specimen Q.\n(b) Name three other tools that could be used in a poultry farm.\n(c) State two precautions that should v=be taken when using specimen P.\n(d) mention three ways of amaintaining specimen R.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59777?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "16",
    "text": "Study specimens V (Livestock bone), W (Poultry crop) and X (Rumen) and answer the questions that follow.\n(a)(i) Describe how specimen V could processed into bone meal.\n    (ii) Name two nutrients supplied by bone meal in animal feed.\n(b) Name two farm animals from which each of specimens W and X  could be obtained.\n(c) State two functions of each of specimens W and X in farm animals.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59781?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  }
]