[
  {
    "number": "1223",
    "text": "Government as an institution of the state is defined as a body which",
    "options": {
      "A": "conducts elections for the country",
      "B": "makes, enforces and interprets laws for the state",
      "C": "hires and trains political leaders",
      "D": "makes and interprets laws"
    },
    "answer_url": "https://myschool.ng/classroom/government/21663?exam_type=waec&type=obj&page=245",
    "correct_answer": "B",
    "explanation": "A government is an institution entrusted with making and enforcing the rules of a society as well as with regulating relations with other societies. In order to be considered a government, a ruling body must be recognized as such by the people it purports to govern.",
    "year": "2011"
  },
  {
    "number": "1224",
    "text": "The study of government in school is important because the students can",
    "options": {
      "A": "be assisted by political leaders",
      "B": "learn about their rights",
      "C": "quality for elections",
      "D": "be nominated for a trip abroad"
    },
    "answer_url": "https://myschool.ng/classroom/government/21666?exam_type=waec&type=obj&page=245",
    "correct_answer": "B",
    "explanation": "1.It helps the individual to understand the processes by which the affairs of a country are managed.\n2.The study also enhances political awareness among it citizenry.\n3.The study of Government promotes knowledge and mental development.\n4. learn about their rights as citizens of that country",
    "year": "2011"
  },
  {
    "number": "1225",
    "text": "The primary function of government in a state is to",
    "options": {
      "A": "maintain law and order",
      "B": "provide transport services",
      "C": "engage in campaigns and rallies",
      "D": "imprison criminals"
    },
    "answer_url": "https://myschool.ng/classroom/government/21669?exam_type=waec&type=obj&page=245",
    "correct_answer": "A",
    "explanation": "The Primary functions of The Government are to maintain order,settle conflicts,and protect the community. The Government guides us by setting policies, budgets and interact with other communities. They also provide help that certain people cant address independently.",
    "year": "2011"
  },
  {
    "number": "1226",
    "text": "The functions of the state are achieved through",
    "options": {
      "A": "political socialization",
      "B": "separation of powers",
      "C": "organs of government",
      "D": "diplomatic means"
    },
    "answer_url": "https://myschool.ng/classroom/government/21674?exam_type=waec&type=obj&page=246",
    "correct_answer": "C",
    "explanation": "The functions of the state are achieved through the three organs of governments which are Legislature Executive and judiciary",
    "year": "2011"
  },
  {
    "number": "1227",
    "text": "A unique feature of a state is",
    "options": {
      "A": "information",
      "B": "anarchy",
      "C": "organized laws",
      "D": "direct democracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/21684?exam_type=waec&type=obj&page=246",
    "correct_answer": "C",
    "explanation": "In order for an area to be considered a state, it must have a permanent population, a defined territory, a government and sovereignty.",
    "year": "2011"
  },
  {
    "number": "1228",
    "text": "Ability to enforce obedience is known as",
    "options": {
      "A": "legitimacy",
      "B": "power",
      "C": "influence",
      "D": "fame"
    },
    "answer_url": "https://myschool.ng/classroom/government/21686?exam_type=waec&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "power is the ability to influence or outright control the behavior of people. An authority held by a group within a society that allows for the administration of public resources and implement policies for society.Powermay be acquired as a means of governmental direction or in opposition to a government group.",
    "year": "2011"
  },
  {
    "number": "1229",
    "text": "A major source of political power is",
    "options": {
      "A": "election",
      "B": "force",
      "C": "influence",
      "D": "ombudsman"
    },
    "answer_url": "https://myschool.ng/classroom/government/21691?exam_type=waec&type=obj&page=246",
    "correct_answer": "A",
    "explanation": "Political power rests with the citizens. In turn, citizens grant political power to their leaders through elections. This view appeals to our democratic sensibilities, but it may not be correct. After all, throughout most of human history—and in many parts of the world today—strong and stable governments ignored their citizens.",
    "year": "2011"
  },
  {
    "number": "1230",
    "text": "Power is transferred into authority through",
    "options": {
      "A": "force",
      "B": "legitimacy",
      "C": "judiciary",
      "D": "sovereighty"
    },
    "answer_url": "https://myschool.ng/classroom/government/21693?exam_type=waec&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "Authority is having the legitimate right to hold power (police and military commanders have the authority to command others, professors have the authority to teach, certified mechanics have the authority to repair cars.",
    "year": "2011"
  },
  {
    "number": "1231",
    "text": "Political authority is the",
    "options": {
      "A": "legitimate right to exercise political power",
      "B": "ability to control political behaviour",
      "C": "right to participate in political campaigns",
      "D": "right to form political parties"
    },
    "answer_url": "https://myschool.ng/classroom/government/21697?exam_type=waec&type=obj&page=247",
    "correct_answer": "A",
    "explanation": "political authority describes any of the moral principles legitimizing differences between individuals' rights and duties by virtue of their relationship with the state. Political authority grants members of a government the right to rule over citizens using coercion if necessary, while imposing an obligation for the citizens to obey government orders.",
    "year": "2011"
  },
  {
    "number": "1232",
    "text": "The extent to which the citizens accept the institutions, official and activities of government is known as",
    "options": {
      "A": "authority",
      "B": "permission",
      "C": "legitimacy",
      "D": "power"
    },
    "answer_url": "https://myschool.ng/classroom/government/21700?exam_type=waec&type=obj&page=247",
    "correct_answer": "C",
    "explanation": "In political science, legitimacy is the right and acceptance of an authority, usually a governing law or a regime.",
    "year": "2011"
  },
  {
    "number": "1233",
    "text": "The concept of sovereignty was propounded by",
    "options": {
      "A": "Adam Smith",
      "B": "Jeremy Bentham",
      "C": "Kari Marx",
      "D": "Jean Bodin"
    },
    "answer_url": "https://myschool.ng/classroom/government/21713?exam_type=waec&type=obj&page=247",
    "correct_answer": "D",
    "explanation": "Sovereignty is the full right and power of a governing body over itself, without any interference from outside sources or bodies. It was profounded by Jean Bodin,  a French jurist and political philosopher, member of the Parliament of Paris and professor of law in Toulouse. He is best known for his theory of sovereignty; he was also an influential writer on demonology.",
    "year": "2011"
  },
  {
    "number": "1234",
    "text": "Popular sovereignty belongs to the",
    "options": {
      "A": "immigrants",
      "B": "electorate",
      "C": "cabinet",
      "D": "legislature"
    },
    "answer_url": "https://myschool.ng/classroom/government/21717?exam_type=waec&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "Popular sovereignty, or sovereignty of the peoples' rule; is the principle that the authority of a state and its government are created and sustained by the consent of its people, through their elected representatives (Rule by the People), who is the source of all political power.",
    "year": "2011"
  },
  {
    "number": "1235",
    "text": "Which of the following factors places limitation to the application of Sovereignty in a state?",
    "options": {
      "A": "Civil service",
      "B": "International laws",
      "C": "Political culture",
      "D": "Political parties"
    },
    "answer_url": "https://myschool.ng/classroom/government/21722?exam_type=waec&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "CONSTITUTIONAL LIMITATION OF SOVEREIGNTY:The constitution is the basic law of a country. Every law made by the legislature must be in conformity with theconstitutionotherwise such a law will be null and void. Similarly every constitution provides for the fundamental right of the citizens. These rights are inviolable.NATURAL LIMITATION:The Sovereign cannot do certain things, which .are naturally impossible i.e. the sovereign cannot order the sun to rise in the west or cannot change the cycle of seasons. If a sovereign would claim to do that, he will be sent to the lunatic asylum.MORAL LIMITATION:In theory the state can do anything. It cap make any kind of law. In can declare legal things to be illegal and vice versa. But in practice there seems to be difficulties. For example theparliamentcan pass a law saying that all blue eyed babies should be killed. Legally this is un­challengeable but in practice the government will find it very difficult to implement it because the government will not be in a position to face the public opinion which is based on morality. Similarly the government basis its laws on morality because it feels the people would obey and respect such laws. Somebody has very rightly said: there is much difference between law in books and late in action. In short the government and for that matter, the state has to observe moral principles.HUMAN LIMITATION:No human being is perfect. There are limits to one's mental and physical faculties. A person may be able to do certain work for a certain period of time. It is not possible for him to continue to do the same thing for an unlimited and indefinite period. A sovereign has to take into consideration these limitations. If he over-steps these limitations, people will not cooperate with him. Sovereign can make a law ordering the people to sleep during day and to work at night. People will obey such a law but for a very short period because following such a law means overstepping physical limitations of human beings.INTERNATIONAL LAW:Every state has to have relations with other states. These are regulated by a law known as International Law. Under normal circumstances every state is expected to obey international law. Non-observance of International Law would result in chaos and confusion in international field. So every state is compelled to observe International Law. In many states international law is regarded a part of the law of the land.",
    "year": "2011"
  },
  {
    "number": "1236",
    "text": "Democracy originated from",
    "options": {
      "A": "Greece",
      "B": "Britain",
      "C": "USA",
      "D": "Germany"
    },
    "answer_url": "https://myschool.ng/classroom/government/21726?exam_type=waec&type=obj&page=248",
    "correct_answer": "A",
    "explanation": "Democracy, literally, rule by the people. The term is derived from the Greek dēmokratiā, which was coined from dēmos (“people”) and kratos (“rule”) in themiddleof the 5th century bce to denote the political systems then existing in some Greek city-states, notably Athens.",
    "year": "2011"
  },
  {
    "number": "1237",
    "text": "Which of the following is a basic principle of democracy? Rule by",
    "options": {
      "A": "the majority and the protection of the minority",
      "B": "the wealthy few",
      "C": "the minority at the expense of the majority",
      "D": "two political parties"
    },
    "answer_url": "https://myschool.ng/classroom/government/21730?exam_type=waec&type=obj&page=248",
    "correct_answer": "A",
    "explanation": "Democracy is a system of rule by laws, not individuals. In a democracy, the rule of law protects the rights of citizens, maintains order, and limits the power of government. All citizens are equal under the law. No one may be discriminated against on the basis of their race, religion, ethnic group, or gender. A democratic government is one which is chosen by the majority (through elections) and protects the minority",
    "year": "2011"
  },
  {
    "number": "1238",
    "text": "The concept of political culture was introduced by",
    "options": {
      "A": "Friendrich Engels",
      "B": "Abraham Lincoln",
      "C": "Harold Laski",
      "D": "Gabriel Almond"
    },
    "answer_url": "https://myschool.ng/classroom/government/21732?exam_type=waec&type=obj&page=248",
    "correct_answer": "D",
    "explanation": "The term political culture was brought into political science to promote the American political system. The concept was used by Gabriel Almond in the late 50s, and outlined in The Civic Culture (1963, Almond & Verba), but was soon opposed by two European political scientists, Gerhard Lehmbruch and Arend Lijphart.",
    "year": "2011"
  },
  {
    "number": "1239",
    "text": "Which of the following is a component of political culture ?",
    "options": {
      "A": "Injunction",
      "B": "Congnitive orientation",
      "C": "Mandamus",
      "D": "Harbeas corpus"
    },
    "answer_url": "https://myschool.ng/classroom/government/21734?exam_type=waec&type=obj&page=248",
    "correct_answer": "B",
    "explanation": "Congnitive orientation in political culture is the rate of different kind of ideas, affecting orientations toward the political system. Its input aspects, its output aspects and the self as political actor. It deals with beliefs and attitudes.",
    "year": "2011"
  },
  {
    "number": "1240",
    "text": "The teaching and learning of political culture is known as political",
    "options": {
      "A": "participation",
      "B": "socialization",
      "C": "administration",
      "D": "development"
    },
    "answer_url": "https://myschool.ng/classroom/government/21737?exam_type=waec&type=obj&page=248",
    "correct_answer": "B",
    "explanation": "Political socialization is the \"process by which individuals learn and frequently internalize a political idea framing their perceptions of how power is arranged and how the world around them is (and should be) organized; those perceptions, in turn, shape and define individuals' definitions of who they are and how they should behave in the political and economic institutions in which they live.\"\nPolitical socialization also encompasses the way in which people acquire values and opinions that shape their political stance and ideology",
    "year": "2011"
  },
  {
    "number": "1241",
    "text": "Which of the following political concepts promotes sharing and cooperation in a society?",
    "options": {
      "A": "Aristocracy",
      "B": "Capitalism",
      "C": "Communalism",
      "D": "Oligarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/21740?exam_type=waec&type=obj&page=249",
    "correct_answer": "C",
    "explanation": "Communalism usually refers to a system that integrates communal ownership and federations of highly localized independent communities.\nCommunalism is an organized government on the local level that is based on a common purpose and shared values, such as ethnic, cultural, and religious affiliation. It has to do with communal living, sharing and ownership of the means of livelihood",
    "year": "2011"
  },
  {
    "number": "1242",
    "text": "Which of the following can contribute to political socialization?",
    "options": {
      "A": "Gerrymandering",
      "B": "Tourism",
      "C": "Diplomatic immunity",
      "D": "Terrorism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21746?exam_type=waec&type=obj&page=249",
    "correct_answer": "B",
    "explanation": "How a person determines his or her political beliefs is called political socialization. Tourism is an agent of political socialization process that can shape the way people build their political beliefs",
    "year": "2011"
  },
  {
    "number": "1243",
    "text": "Which of the following is true about a capitalist state?",
    "options": {
      "A": "Private individuals control the economy",
      "B": "The workers are not exploited",
      "C": "Government controls the means of production",
      "D": "There is no class struggle"
    },
    "answer_url": "https://myschool.ng/classroom/government/21748?exam_type=waec&type=obj&page=249",
    "correct_answer": "A",
    "explanation": "Capitalist state  is an economic system based on the private ownership of the means of production and their operation for profit. Characteristics of capitalism include private property, capital accumulation, wage labor, voluntary exchange, a price system, and competitive markets.",
    "year": "2011"
  },
  {
    "number": "1244",
    "text": "The highest stage of socialism is",
    "options": {
      "A": "oligarchy",
      "B": "capitalism",
      "C": "totalitarianism",
      "D": "communism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21752?exam_type=waec&type=obj&page=249",
    "correct_answer": "D",
    "explanation": "Communism is a further development or \"higher stage\" of socialism. Communist society, which is the final aim of the struggle for emancipation of the working people in all lands, is the highest and most progressive stage of social development. Communist society passes through two phases of development",
    "year": "2011"
  },
  {
    "number": "1245",
    "text": "Foreign domination by a group of people for social and economic benefits is known as",
    "options": {
      "A": "nationalism",
      "B": "colonialism",
      "C": "feudalism",
      "D": "constitutionalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21756?exam_type=waec&type=obj&page=249",
    "correct_answer": "B",
    "explanation": "Colonialism is the policy of a nation seeking to extend or retain its authority over other people or territories, generally with the aim of opening trade opportunities.",
    "year": "2011"
  },
  {
    "number": "1246",
    "text": "A communist system recognizes",
    "options": {
      "A": "class division",
      "B": "the need of individual",
      "C": "human capital",
      "D": "division of labour"
    },
    "answer_url": "https://myschool.ng/classroom/government/21761?exam_type=waec&type=obj&page=250",
    "correct_answer": "B",
    "explanation": "communism is advocacy of a classless society in which private ownership has been abolished and the means of production and subsistence belong to the community",
    "year": "2011"
  },
  {
    "number": "1247",
    "text": "Which of the following is the lowest in the hierarchy of a feudal system?",
    "options": {
      "A": "Lords",
      "B": "Serfs",
      "C": "Knights",
      "D": "Nobles"
    },
    "answer_url": "https://myschool.ng/classroom/government/21765?exam_type=waec&type=obj&page=250",
    "correct_answer": "B",
    "explanation": "Serfs is a  member of the lowest feudal class, legally bound to a landed estate and required to perform labor for the lord of that estate in exchange for a personal allotment of land.",
    "year": "2011"
  },
  {
    "number": "1248",
    "text": "A common feature of feudalism is",
    "options": {
      "A": "hierarchical land ownership between the lords and the serfs",
      "B": "private ownership of the means of production and distribution",
      "C": "separation of powers",
      "D": "fusion of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/21766?exam_type=waec&type=obj&page=250",
    "correct_answer": "A",
    "explanation": "As with slaves, serfs could be bought, sold, or traded, abused with no rights over their own bodies, and could not leave the land they were bound to. Serfs who occupied a plot of land were required to work for the lord of the manor who owned that land. In return they were entitled to protection, justice etc",
    "year": "2011"
  },
  {
    "number": "1249",
    "text": "An open market economy is a unique feature of",
    "options": {
      "A": "welfarism",
      "B": "socialism",
      "C": "feudalism",
      "D": "capitalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21774?exam_type=waec&type=obj&page=250",
    "correct_answer": "D",
    "explanation": "An open  market economy, also known as a free enterprise system or capitalism, is an economic system wherein goods and services are exchanged freely on an open market.",
    "year": "2011"
  },
  {
    "number": "1250",
    "text": "Which of the following political system discourages socialism?",
    "options": {
      "A": "fascism",
      "B": "feudalism",
      "C": "communalism",
      "D": "welfarism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21775?exam_type=waec&type=obj&page=250",
    "correct_answer": "A",
    "explanation": "Socialism is a political and economic system in which most forms of economically valuable property and resources are owned or controlled by the public or the state. The term socialism also refers to any political or philosophical doctrine that advocates such a system.\nFascism is a form of radical, right-wing, authoritarian ultranationalism, characterized by dictatorial power, forcible suppression of opposition, and strong regimentation of society and of the economy. It is characterized by extreme militant nationalism, hatred of communism and socialism, contempt for democracy, and belief in natural social hierarchy and the rule of elites",
    "year": "2011"
  },
  {
    "number": "1251",
    "text": "The manor is a unique feature of",
    "options": {
      "A": "feudalism",
      "B": "monarchy",
      "C": "totalitarianism",
      "D": "communism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21776?exam_type=waec&type=obj&page=251",
    "correct_answer": "A",
    "explanation": "Under the feudal system land was granted to people for service. It started at the top with the king granting his land to a baron for soldiers all the way down to a peasant getting land to grow crops. The center of life in the Middle Ages was the manor. The manor was run by the local lord.",
    "year": "2011"
  },
  {
    "number": "1252",
    "text": "The principle of rule of law was popularized by",
    "options": {
      "A": "Gabriel Almond",
      "B": "Charles Montesquieu",
      "C": "Jean Bodin",
      "D": "A.V.Dicey"
    },
    "answer_url": "https://myschool.ng/classroom/government/21777?exam_type=waec&type=obj&page=251",
    "correct_answer": "D",
    "explanation": "The Rule of Law doctrine was developed by A.V. DiceyThe principle of rule of law is one whereby, all members of a society (including those in government) are considered equally subject to publicly disclosed legal codes and processes",
    "year": "2011"
  },
  {
    "number": "1253",
    "text": "The body charged with the responsibility of preparing a new constitution in a country is the",
    "options": {
      "A": "electoral commission",
      "B": "constitutuent assembly",
      "C": "judicial service commission",
      "D": "eletoral college"
    },
    "answer_url": "https://myschool.ng/classroom/government/21778?exam_type=waec&type=obj&page=251",
    "correct_answer": "B",
    "explanation": "A constituent assembly or constitutional assembly is a body or assembly of popularly elected representatives composed for the purpose of drafting or adopting a constitutional-type document. The constituent assembly is a subset of a constitutional convention elected entirely by popular vote; that is, all constituent assemblies are constitutional conventions, but a constitutional convention is not necessarily a constituent assembly. As the fundamental document constituting a state, a constitution cannot normally be modified or amended by the state's normal legislative procedures; instead a constitutional convention or a constituent assembly, the rules for which are normally laid down in the constitution, must be set up. A constituent assembly is usually set up for its specific purpose, which it carries out in a relatively short time, after which the assembly is dissolved.",
    "year": "2011"
  },
  {
    "number": "1254",
    "text": "The institution connected with law adjudication is the",
    "options": {
      "A": "judiciary",
      "B": "police",
      "C": "government",
      "D": "executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/21779?exam_type=waec&type=obj&page=251",
    "correct_answer": "A",
    "explanation": "The judiciary is the system of courts that interprets and applies the law in the name of the state. The judiciary can also be thought of as the mechanism for the resolution of disputes. Under the doctrine of the separation of powers, the judiciary generally does not make statutory law or enforce law, but rather interprets law and applies it to the facts of each case.",
    "year": "2011"
  },
  {
    "number": "1255",
    "text": "Which of the following is not a characteristic of confederation?",
    "options": {
      "A": "The right to secede is allowed",
      "B": "Sovereignty resides in the centre",
      "C": "The centre and units agree before taking decisions",
      "D": "Autonomus units are more powerful than the centre"
    },
    "answer_url": "https://myschool.ng/classroom/government/21780?exam_type=waec&type=obj&page=251",
    "correct_answer": "B",
    "explanation": "Usually created by a treaty, confederations of states tend to be established for dealing with critical issues, such as defense, foreign relations, internal trade or currency, with the general government being required to provide support for all its members.",
    "year": "2011"
  },
  {
    "number": "1256",
    "text": "Which of the following is a function of a head of state?",
    "options": {
      "A": "Settles cases",
      "B": "Arbitrates electoral petitions",
      "C": "Creates new constitutions",
      "D": "Receives foreign dignitaries"
    },
    "answer_url": "https://myschool.ng/classroom/government/21781?exam_type=waec&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "Depending on the country's form of government and separation of powers, the head of state may be a ceremonial figurehead or concurrently the head of government. In the parliamentary system the head of state is the de jure leader of the nation, because the leader de facto is the prime minister (the head of government).",
    "year": "2011"
  },
  {
    "number": "1257",
    "text": "Citizenship can be changed through",
    "options": {
      "A": "proclamation",
      "B": "residence",
      "C": "renunciation",
      "D": "announcement"
    },
    "answer_url": "https://myschool.ng/classroom/government/21782?exam_type=waec&type=obj&page=252",
    "correct_answer": "C",
    "explanation": "Renunciation is the voluntary act of giving up one's citizenship or nationality for another. It is the opposite of naturalization–whereby a person voluntarily acquires a citizenship, and is distinct from denaturalization–where the loss of citizenship is forced by a state.",
    "year": "2011"
  },
  {
    "number": "1258",
    "text": "On which of the following platforms do political parties mainly present their manifestoes to the electorate?",
    "options": {
      "A": "Campaigns and rallies",
      "B": "The state controlled mass media",
      "C": "Public lectures",
      "D": "Inter-party debates"
    },
    "answer_url": "https://myschool.ng/classroom/government/21789?exam_type=waec&type=obj&page=252",
    "correct_answer": "A",
    "explanation": "Manifesto is a public declaration of policy and aims, especially one issued before an election by a political party or candidate usually presented during political campaigns and rallies",
    "year": "2011"
  },
  {
    "number": "1259",
    "text": "In a two-party system, only two political parties",
    "options": {
      "A": "exist in the country",
      "B": "dominate the political scene",
      "C": "register their members",
      "D": "undertake political education"
    },
    "answer_url": "https://myschool.ng/classroom/government/21792?exam_type=waec&type=obj&page=252",
    "correct_answer": "B",
    "explanation": "A two-party system is a party system where two major political parties dominate the political landscape. At any point in time, one of the two parties typically holds a majority in the legislature and is usually referred to as the majority or governing party while the other is the minority or opposition party.",
    "year": "2011"
  },
  {
    "number": "1260",
    "text": "Which of the following is not a form of proportional representation?",
    "options": {
      "A": "Alternative vote",
      "B": "Second ballot",
      "C": "List system",
      "D": "Plurality system"
    },
    "answer_url": "https://myschool.ng/classroom/government/21795?exam_type=waec&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "Proportional representation is a system used to elect a country's government. If no party wins over 50% of the vote, then a coalition government usually has to be formed, where a government is formed from two or more different political parties, who together have over 50% of the seats in parliament.",
    "year": "2011"
  },
  {
    "number": "1261",
    "text": "The efficiency of public corporations can be enhanced through",
    "options": {
      "A": "increased production of goods",
      "B": "appointment of staff based on patronage",
      "C": "frequent redeployment of staff",
      "D": "less government interference"
    },
    "answer_url": "https://myschool.ng/classroom/government/21798?exam_type=waec&type=obj&page=253",
    "correct_answer": "D",
    "explanation": "It is important to be able to say whether or not anenterprisein thepublicsector isefficientand to measure this aspect of its performance. One way to ensure efficiency is avoiding unnecessary interference from government.",
    "year": "2011"
  },
  {
    "number": "1262",
    "text": "A chief could be deposed in the pre-colonial era if he",
    "options": {
      "A": "violated the written constitution",
      "B": "persistently neglected the advice of his elders",
      "C": "refused to collect taxes for the British Governor",
      "D": "married too many wives"
    },
    "answer_url": "https://myschool.ng/classroom/government/21801?exam_type=waec&type=obj&page=253",
    "correct_answer": "B",
    "explanation": "One way a chief could be stripped of his title is when he is found to act on his own with no regards to the advice of the elders concerning issues",
    "year": "2011"
  },
  {
    "number": "1263",
    "text": "A common feature in a pre-colonial centralized state was",
    "options": {
      "A": "loyalty to one political superior",
      "B": "absence of single superior political authority",
      "C": "the existence of autocratic rule",
      "D": "existence of separation of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/21803?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2011"
  },
  {
    "number": "1264",
    "text": "Under the British Crown Colony system of administration, the head of the executive council was the",
    "options": {
      "A": "Governor-General",
      "B": "Head of government business",
      "C": "Speaker",
      "D": "Prime minister"
    },
    "answer_url": "https://myschool.ng/classroom/government/21804?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "A Crown colony was usually administered by a governor who directly controlled the executive and was appointed by \"the Crown\" known as the governor-general",
    "year": "2011"
  },
  {
    "number": "1265",
    "text": "Taxation as a feature of Indirect Rule served as a",
    "options": {
      "A": "source of revenue for colonial administration",
      "B": "system of modernizing chieftaincy",
      "C": "policy of making the local people poor",
      "D": "means to ridicule the chiefs"
    },
    "answer_url": "https://myschool.ng/classroom/government/21806?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "Indirect rulewas a system of governance used by the British and French to control parts of their colonial empires. Their colonies were taxed as a source of revenue to run the administration",
    "year": "2011"
  },
  {
    "number": "1266",
    "text": "One effect of the French policy of Assimilation was that it",
    "options": {
      "A": "made all French West Africans French citizens",
      "B": "increased nationalist activites in French West Africa",
      "C": "delayed nationalism in French West Africa",
      "D": "expanded education into the interior of French West Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/21810?exam_type=waec&type=obj&page=254",
    "correct_answer": "C",
    "explanation": "The policy of assimilation undermined African culture as many adopted French culture. Africans from Senegal were allowed to participate in the political affairs of France. This and more delayed nationalism amongst the African countries under the French colonies",
    "year": "2011"
  },
  {
    "number": "1267",
    "text": "The late development of nationalism in French West Africa was due to",
    "options": {
      "A": "absorption of French colonial ex-service men into the French army",
      "B": "implemented government polices",
      "C": "collected and spent taxes and rates",
      "D": "were sources of consultation on customary affairs"
    },
    "answer_url": "https://myschool.ng/classroom/government/21812?exam_type=waec&type=obj&page=254",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2011"
  },
  {
    "number": "1268",
    "text": "The first British West African country to practise the elective principle was",
    "options": {
      "A": "Nigeria",
      "B": "The Gambia",
      "C": "Sierra Leone",
      "D": "Ghana"
    },
    "answer_url": "https://myschool.ng/classroom/government/21814?exam_type=waec&type=obj&page=254",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2011"
  },
  {
    "number": "1269",
    "text": "The first Pan-West African political organization formed by the educated elite in the early twentieth century was the",
    "options": {
      "A": "Aborigines'Rights Protection Society (ARPS)",
      "B": "National Congress of British West Africa (NCBWA)",
      "C": "West African Students'Union (WASU)",
      "D": "West African Youth League (WAYL)"
    },
    "answer_url": "https://myschool.ng/classroom/government/21815?exam_type=waec&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "The National Congress of British West Africa (NCBWA), founded in 1917, was one of the earliest nationalist organizations in West Africa, and one of the earliest formal organizations working toward African emancipation.",
    "year": "2011"
  },
  {
    "number": "1270",
    "text": "Which of the following is a process in the transition from military to civil rule?",
    "options": {
      "A": "Appointment of an Attorney -General",
      "B": "Suspension of the constitution",
      "C": "Setting up of a Constituent  Assembly",
      "D": "Non-implementation of development plans"
    },
    "answer_url": "https://myschool.ng/classroom/government/21816?exam_type=waec&type=obj&page=254",
    "correct_answer": "C",
    "explanation": "Some of the processes in the transition from military to civil rule\nthe creation of new administrative structures (usually states and local [municipal] government units)a constitution preparation processthe lifting of an existing ban on political activities usually imposed (or maintained) by each successive military regimelocal elections on a zero-party basisformation of political parties followed by elections on a party basisConstituent Assembly",
    "year": "2011"
  },
  {
    "number": "1271",
    "text": "The objective of the Economic Community of West African States (ECOWAS) is to",
    "options": {
      "A": "promote economic development among member states",
      "B": "achieve unity",
      "C": "establish political unification of West Africa",
      "D": "eradicate all forms of racism in West Africa"
    },
    "answer_url": "https://myschool.ng/classroom/government/21817?exam_type=waec&type=obj&page=255",
    "correct_answer": "A",
    "explanation": "The aims of the Community are to promote cooperation and integration, leading to the establishment of an economic union in West Africa in order to raise the living standards of its peoples, and to maintain and enhance economic stability, foster relations among Member States and contribute to the progress and growth",
    "year": "2011"
  }
]