[
  {
    "number": "60",
    "text": "Study specimens A, B, C, E and F and answer questions 1(a) to 1(e).\n(a) Name one branch of Biology D which involves the use ot specimens A, B, C, D, E and F. (b) State one function of each of Specimens A. B. C D E and F:\n(c) Describe briefly how each of specimens B and D could be used. \n(d) make a drawing, 10 cm to 12 cm long of specimen D and label fully.\n(e) Name two organisms each associated with the use ot specimens D and F.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60286?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "61",
    "text": "Study specimens H and J and answer questions 2(a) to 2(d).\n(a)i) Name the Kingdom and Class of organisms from which specimen H could be obtained.\n(ii) Name the specific location on the body of the organism from which specimen H could be obtained.\n(iii) Name one example of organism from which specimen H could be obtained.\n(bi) State six observable structural differences between specimens  H and J. \n\n\n\nH\nJ\n\n\n \n \n\n\n \n \n\n\n \n \n\n\n \n \n\n\n \n \n\n\n \n \n\n\n\n\n(c) State one function each of specimens H and J to the organisms that possess them. H:(ii) State three observable structural similarities between specimens H and J.\n(d) Mention: (i) three observable features that adapt specimen H to the function stated against it in 2(c);\n(i) two observable features that adapt specimen J to the function stated against it in 2(c).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60287?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "62",
    "text": "Study Specimens Y, amd Q and answer questions 4(a) to 4(e).\n(a)(i) State the sex of specimen P.\n(ii) Give one reason tor the answer in 4(a).\n(b)(i) Name the habitats of each of specimens P and Q (ii) State three adaptations each of specimens P and Q to their habitats. (c)(i) State one observable structural differences between specimens (ii) State three observable structural similarities between  P and Q. (d)(i) Observe the mouthpart of specimen Q and state its feeding mechanism.\n(ii) List one food which specimen Q feeds on.\n(e) Remove carefully one of the legs on the right side of the metathorax of specimen P. Make a drawing, 6 cm to 8 cm long of the removed leg and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60288?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  }
]