[
  {
    "number": "43",
    "text": "(a) Consider the following compounds: MnO\\(_2\\), NaHCO\\(_3\\), Na\\(_2\\)CO\\(_3\\), NH\\(_4\\)CI cnd Pb(NO\\(_3\\))\\(_2\\) Select the compound(s) which;\n(i) has a black colour\n(ii) is a basic oxide:\n(ii) sublime on heating\n(iv) dissolves in water to give a solution of pH less than 7.\n \n(b) State the colour of each af the following aqueous Solutions:\n(i) Calcium hydroxide;\n(ii) iron (III) trioxonitrate (V):\n(ii) Copper (II) tetraoxosulphate (VI);\n(iv) Poassium heptaoxodichromate (VI).\n \n(c) Give one example of a neutral oxide which is a colourless liquid at room temperature.\n(d) Draw and label a diagram for a set-up that can be used for the separation of two immiscible liquids",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60059?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2006"
  },
  {
    "number": "44",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely recorded and accurate inferences. All tests, observations and inferences must be clearly entered in your als book, in ink, at the time they are made.\nC is a mixture of an inorganic and organic compounds. Carry out the following exercises on C: Record your.observations and identity any gases evolved. State the conclusion you draw from the result of each test.\n(a) Put all of C into a beaker and add 10 cm\\(^3\\) of distilled water: Stir the mixture thoroughly and filter. Keep both the filtrate and residue.\n(b)(i) Test the filtrate with litmus paper.\n(ii) To about 2 cm\\(^3\\) of the filtrate, add BaCI\\(_{2(aq)}\\) followed by dilute HCI:\n(iii) To another 2 cm\\(^3\\) portion of the filtrate add NaOH and heat.\n(c) Transfer the residue into a boiling tube and add few drops of iodine solution",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60060?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2006"
  },
  {
    "number": "45",
    "text": "Burette reading (initial and final) must be given to two decimal places. Volume of pipette used must be recorded but no account of experimental procedure is required. All calculations must be done in you answer book.\nA is a solution containing 6.3 g dm\\(^{-3}\\) of HNO\\(_3\\), B is a solution Na\\(_2\\)CO\\(_3\\)\n(a) Put A Into the burette and titrate it against 20.0 cm\\(^3\\) portions of B using methyl orange indicator. Record the volume of your pipette. Repeat the titration to obtain consistent titres. Tabulate your burette readings and calculate the average volume of A used. The equation for the reaction involved in the titration is:\n2HNO\\(_{3(aq)}\\) + Na\\(_2\\)CO\\(_{3(aq)}\\) \\(\\to\\) 2NaNO\\(_{3(aq)}\\) + CO\\(_{2(g)}\\) + H\\(_{2}\\)O\\(_{(l)}\\)\n(b) From your results and information provided above, calculate the;\n(i) concentration of B in mol dm\\(^{-3}\\)\n(ii) concentration of B in g dm\\(^{-3}\\):\n(iii) mass of sodium ions in 1:0 dm\\(^{-3}\\) of B\n[H = 1; C = 1; O = 16; N = 14; Na = 23]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60061?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2006"
  }
]