[
  {
    "number": "131",
    "text": "Write a letter to your father who has been on a long course abroad, telling him how the family has been faring in his absence.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51488?exam_type=waec&type=theory&page=27",
    "correct_answer": "3 Osomi Street,Ejigbo,Lagos State.20th June, 2001.Dear Daddy,l am sure the weather is beginning to get better over there since summer is approaching. How are you and your course? I hope that everything is going fine. The main purpose of writing you this letter is to tell you how we have all been faring in Nigeria since you left for the United States of America.\nAs you know, before you left the country, I was attending Federal Government Girls' College, Ibussa, Delta State. Since we moved from Delta State to Lagos, Mum transferred me to Queen's College and Olu to Command Children's School in Victoria Island. At first, I couldn't really cope educationally but now I have improved tremendously.\nYour little Dupe also took the National Entrance Examination in primary five and scored 545 marks. We were all very happy and Mum decided to take us out for a celebration dinner. We went to The Peninsula which is a very nice restaurant and had a good meal. She finally got admission into the Nigerian Navy Secondary School, Ojo. She is now in JSS 1 and she is doing very fine.\nDaddy, Aunty Yemi has eventually secured a job at Chevron. Her appointment as a computer programmer at the oil company has helped us to know how powerfully God works. I know that you can still remember how Aunty Yemi struggled very hard to secure a job after her graduation. She now earns a good salary which makes it easy for her to help mummy in some areas.\nIn addition to this, Mummy has been promoted in her office. She is now the chief accountant and she is about to complete her master's degree at the University of Lagos. She has also opened another shop in addition to the big one she had. She is selling computer accessories in this shop and I learnt that she supplies computer accessories to reputable companies. She earns good money from this business which makes us comfortable.\nDaddy, guess what! The uncompleted building which you left behind has been completed. The building was completed last month with a little change in the design and plan that you left behind. It is now a duplex with spacious parking space, a small garden and an orchard in its backyard. The house has sliding doors and windows and it is painted yellow.\nBesides this, mummy has bought a brand new Mercedes Benz car and a Toyota 14-seater bus which is used to convey us to school every day. Daddy, never be disturbed because the family is doing very well. I know that you will have completed your course in two years' time. We shall be looking forward to welcoming you back home. Convey my sincere greetings to your colleagues and friends. Mummy sends her greetings.Yours sincerely,Tolu.",
    "explanation": "3 Osomi Street,Ejigbo,Lagos State.20th June, 2001.Dear Daddy,l am sure the weather is beginning to get better over there since summer is approaching. How are you and your course? I hope that everything is going fine. The main purpose of writing you this letter is to tell you how we have all been faring in Nigeria since you left for the United States of America.\nAs you know, before you left the country, I was attending Federal Government Girls' College, Ibussa, Delta State. Since we moved from Delta State to Lagos, Mum transferred me to Queen's College and Olu to Command Children's School in Victoria Island. At first, I couldn't really cope educationally but now I have improved tremendously.\nYour little Dupe also took the National Entrance Examination in primary five and scored 545 marks. We were all very happy and Mum decided to take us out for a celebration dinner. We went to The Peninsula which is a very nice restaurant and had a good meal. She finally got admission into the Nigerian Navy Secondary School, Ojo. She is now in JSS 1 and she is doing very fine.\nDaddy, Aunty Yemi has eventually secured a job at Chevron. Her appointment as a computer programmer at the oil company has helped us to know how powerfully God works. I know that you can still remember how Aunty Yemi struggled very hard to secure a job after her graduation. She now earns a good salary which makes it easy for her to help mummy in some areas.\nIn addition to this, Mummy has been promoted in her office. She is now the chief accountant and she is about to complete her master's degree at the University of Lagos. She has also opened another shop in addition to the big one she had. She is selling computer accessories in this shop and I learnt that she supplies computer accessories to reputable companies. She earns good money from this business which makes us comfortable.\nDaddy, guess what! The uncompleted building which you left behind has been completed. The building was completed last month with a little change in the design and plan that you left behind. It is now a duplex with spacious parking space, a small garden and an orchard in its backyard. The house has sliding doors and windows and it is painted yellow.\nBesides this, mummy has bought a brand new Mercedes Benz car and a Toyota 14-seater bus which is used to convey us to school every day. Daddy, never be disturbed because the family is doing very well. I know that you will have completed your course in two years' time. We shall be looking forward to welcoming you back home. Convey my sincere greetings to your colleagues and friends. Mummy sends her greetings.Yours sincerely,Tolu.",
    "year": "2001"
  },
  {
    "number": "132",
    "text": "Write an article for publication in a cultural magazine on the advantages and disadvantages of the extended family system.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51496?exam_type=waec&type=theory&page=27",
    "correct_answer": "THE ADVANTAGES AND DISADVANTAGES OF THE EXTENDED FAMILY SYSTEMBefore I go on to discuss the advantages and disadvantages of the system, it is pertinent to describe what is meant by the extended family system. The extended family is much larger than the nuclear family which is sometimes known as the simple, or immediate family. The nuclear family consists of a man and his wife or wives and any number of children they may have while the extended family may include three or four generations of relatives.\nThe extended family system is practised mainly in African countries. The extended family system has some advantages as well as disadvantages. First and foremost, the extended family system offers a child the opportunity to relate to as many relatives as he or she wants. Since a child grows and develops within the family system, a child growing within a larger extended family is open to many values and qualities from which he can learn.\nSecondly, the child receives attention from various people outside his immediate or nuclear family. He has many relations doting on him and he acquires more gifts and benefits than a child who has his immediate family to depend on. If he is ill, he has many people to attend to him and he is loved by many people. In case of the sudden death of any of his parents, the child in the extended family system has some other people to take care of him. In the system, a widow does not suffer. She is taken care of and her children are also taken care of by every member of the extended family. Lastly, a child learns to be friendly, trusting and cooperative in the extended family system. The system makes it easy for a child to relate with other people in a larger society because the system would have given him a wider outlook which cannot be obtained within the narrow nuclear family system.\nHowever, the extended family system could lead to disunity among members of the family if there is a quarrel or disagreement. It is very difficult to manage crises or quarrels within the extended family. Unlike the nuclear family system where the head of the family can easily reconcile two bickering members of the family, it is often difficult to do so in the extended family system. The extended family system is always very difficult to coordinate together.\nThe system could also cause jealousy and unhealthy rivalry among its members. If any member of the family is progressing more than others, there may arise envy and hatred against the person especially if he tries to dominate other members. In Africa, such rivalry and envy could go to the extent of envious people consulting herbalists and charms to hurt one another.\nThe success of the extended family system depends on the operators of the system. It could be a place of respite if there is love and unity among members of the extended family but it could be a hateful system if it is allowed to engender bickering and petty jealousy.\nYemi Oloko,SS 3B.",
    "explanation": "THE ADVANTAGES AND DISADVANTAGES OF THE EXTENDED FAMILY SYSTEMBefore I go on to discuss the advantages and disadvantages of the system, it is pertinent to describe what is meant by the extended family system. The extended family is much larger than the nuclear family which is sometimes known as the simple, or immediate family. The nuclear family consists of a man and his wife or wives and any number of children they may have while the extended family may include three or four generations of relatives.\nThe extended family system is practised mainly in African countries. The extended family system has some advantages as well as disadvantages. First and foremost, the extended family system offers a child the opportunity to relate to as many relatives as he or she wants. Since a child grows and develops within the family system, a child growing within a larger extended family is open to many values and qualities from which he can learn.\nSecondly, the child receives attention from various people outside his immediate or nuclear family. He has many relations doting on him and he acquires more gifts and benefits than a child who has his immediate family to depend on. If he is ill, he has many people to attend to him and he is loved by many people. In case of the sudden death of any of his parents, the child in the extended family system has some other people to take care of him. In the system, a widow does not suffer. She is taken care of and her children are also taken care of by every member of the extended family. Lastly, a child learns to be friendly, trusting and cooperative in the extended family system. The system makes it easy for a child to relate with other people in a larger society because the system would have given him a wider outlook which cannot be obtained within the narrow nuclear family system.\nHowever, the extended family system could lead to disunity among members of the family if there is a quarrel or disagreement. It is very difficult to manage crises or quarrels within the extended family. Unlike the nuclear family system where the head of the family can easily reconcile two bickering members of the family, it is often difficult to do so in the extended family system. The extended family system is always very difficult to coordinate together.\nThe system could also cause jealousy and unhealthy rivalry among its members. If any member of the family is progressing more than others, there may arise envy and hatred against the person especially if he tries to dominate other members. In Africa, such rivalry and envy could go to the extent of envious people consulting herbalists and charms to hurt one another.\nThe success of the extended family system depends on the operators of the system. It could be a place of respite if there is love and unity among members of the extended family but it could be a hateful system if it is allowed to engender bickering and petty jealousy.\nYemi Oloko,SS 3B.",
    "year": "2001"
  },
  {
    "number": "133",
    "text": "The last nationwide strike by secondary school teachers affected your school adversely. Write a letter to the Minister of Education suggesting at least three ways of preventing future strike actions.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51499?exam_type=waec&type=theory&page=27",
    "correct_answer": "Okeira Grammar School,Okeira, Aguda,Lagos.21st July, 2001.\nThe Honourable Minister,Ministry of Education.Abuja.\nDear Sir,\nWAYS OF PREVENTING FUTURE STRIKE ACTION BY SECONDARY SCHOOL TEACHERS\nAs you are aware. the last nationwide strike by secondary school teachers affected many schools; my school is not an exemption. Secondary schools were closed down for over six months across the nation and within that period the nation's educational development came to a standstill. Secondary school students roamed about and many died while engaging themselves in fruitless adventures as teachers were adamant to go back to the classrooms. However. we must begin to look at ways by which future strike actions could be averted and prevented. I, therefore, wish to offer some suggestions on how to prevent strike actions in our secondary schools.\nFirst and foremost, secondary school teachers should be adequately remunerated They deserve to be paid good salaries because of their importance in our educational system. Sir, I believe that they should be equally remunerated as their colleagues in the ministries and other government parastatals. They should also be given other benefits and emoluments as other civil servants in the ministries.\nSecondly, secondary school teachers' salaries should be paid on time. I remember that one of the grievances of these teachers before they embarked on the last nationwide strike was that their salaries were not paid on time It seems as if secondary school teachers are always at the receiving end whenever the government is unable to pay salaries as at when due. They complained that they always received their salaries two or three weeks after their colleagues in the ministries had received theirs.\nIn addition to this, secondary school teachers should be given good conditions of service. One of their grievances is that the condition of the schools is deplorable. Therefore one of the ways to prevent future strike actions is to build modern classroom blocks that are adequately furnished with modern facilities. This will give a conducive atmosphere for the teachers to teach.\nI would be grateful if you could look into all these suggestions so that we could have peaceful academic sessions in our secondary schools nationwide. I am grateful for your cooperation sir.\nYours faithfully,(signature)Ayodeji Bolarin.",
    "explanation": "Okeira Grammar School,Okeira, Aguda,Lagos.21st July, 2001.\nThe Honourable Minister,Ministry of Education.Abuja.\nDear Sir,\nWAYS OF PREVENTING FUTURE STRIKE ACTION BY SECONDARY SCHOOL TEACHERS\nAs you are aware. the last nationwide strike by secondary school teachers affected many schools; my school is not an exemption. Secondary schools were closed down for over six months across the nation and within that period the nation's educational development came to a standstill. Secondary school students roamed about and many died while engaging themselves in fruitless adventures as teachers were adamant to go back to the classrooms. However. we must begin to look at ways by which future strike actions could be averted and prevented. I, therefore, wish to offer some suggestions on how to prevent strike actions in our secondary schools.\nFirst and foremost, secondary school teachers should be adequately remunerated They deserve to be paid good salaries because of their importance in our educational system. Sir, I believe that they should be equally remunerated as their colleagues in the ministries and other government parastatals. They should also be given other benefits and emoluments as other civil servants in the ministries.\nSecondly, secondary school teachers' salaries should be paid on time. I remember that one of the grievances of these teachers before they embarked on the last nationwide strike was that their salaries were not paid on time It seems as if secondary school teachers are always at the receiving end whenever the government is unable to pay salaries as at when due. They complained that they always received their salaries two or three weeks after their colleagues in the ministries had received theirs.\nIn addition to this, secondary school teachers should be given good conditions of service. One of their grievances is that the condition of the schools is deplorable. Therefore one of the ways to prevent future strike actions is to build modern classroom blocks that are adequately furnished with modern facilities. This will give a conducive atmosphere for the teachers to teach.\nI would be grateful if you could look into all these suggestions so that we could have peaceful academic sessions in our secondary schools nationwide. I am grateful for your cooperation sir.\nYours faithfully,(signature)Ayodeji Bolarin.",
    "year": "2001"
  },
  {
    "number": "134",
    "text": "You are a speaker in a debate on the topic “Civilian rule is better than military rule.\" Write your contribution for or against the motion.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51502?exam_type=waec&type=theory&page=27",
    "correct_answer": "Good day, Mr. Chairman, panel of Judges, accurate time-keeper, co-debaters, ladies and gentlemen. I am here to support the motion which says: \"Civilian rule is better than military rule.\"\nFirstly, I would like to take the pains to enlighten some of the younger ones here about what civilian rule and military rule are actually all about. Civilian rule can be likened to a democratic rule. Democracy, in the opinion of the layman, is government for the people, of the people and by the people. From the definition, it can be noted that civilian rulers are actually chosen by the people and they work for the benefit of the people who choose them. On the other hand, military rule can be likened to an autocratic rule where the people are instructed to go and come without any argument from anyone. It is like a do-or-die affair. Let me now get down to the motion.\nFirst and foremost, in every democratic dispensation, there is freedom to vote and be voted for, which is not present in military rule. The civilians only rule when they have been elected by the people. They do not impose themselves on anyone. Meanwhile, the people have no say when the military is ruling. Military rule is imposed on the people and military heads of state rule without the consent of the people. Because military men have guns, the people can not protest, they just have to accept them.\nMoreover, when civilians rule, the people enjoy freedom of speech and of the press. An indigene can criticise a civilian leader either in the newspaper or on television without any fear of molestation. Nowadays, it is very common to see people criticising or admonishing the civilian president of Nigeria on television. Everybody is believed to be equal under a civilian dispensation. However, in military rule, no one has the guts to talk against a ruler even in the enclosure of his room because walls are believed to have ears.\nFurthermore, in military rule, some innocent citizens, being victims of circumstances, are shot down accidentally. This often occurs in a military dispensation. There is little respect or regard for human lives and the military can be likened to armed robbers because instead of using their guns for security purposes, they maim innocent lives. However, in civilian rule, intimidating guns are not present and this actually brings a sense of security to the citizens.\nLastly, civilian rulers execute good and popular projects which are aimed at ameliorating the suffering of the people they rule. They know that the people who vote them into power will judge them by their performance. Therefore, they execute good projects and provide infrastructural facilities that could speak for them when they are called to render account of their stewardship in governance. On the contrary, military rulers are not guided by the wishes and demands of the people they rule when it comes to project execution. This is because they are not accountable to the people.\nI believe that I have been able to convince you that civilian rule is better than military rule. I thank you for your patience.",
    "explanation": "Good day, Mr. Chairman, panel of Judges, accurate time-keeper, co-debaters, ladies and gentlemen. I am here to support the motion which says: \"Civilian rule is better than military rule.\"\nFirstly, I would like to take the pains to enlighten some of the younger ones here about what civilian rule and military rule are actually all about. Civilian rule can be likened to a democratic rule. Democracy, in the opinion of the layman, is government for the people, of the people and by the people. From the definition, it can be noted that civilian rulers are actually chosen by the people and they work for the benefit of the people who choose them. On the other hand, military rule can be likened to an autocratic rule where the people are instructed to go and come without any argument from anyone. It is like a do-or-die affair. Let me now get down to the motion.\nFirst and foremost, in every democratic dispensation, there is freedom to vote and be voted for, which is not present in military rule. The civilians only rule when they have been elected by the people. They do not impose themselves on anyone. Meanwhile, the people have no say when the military is ruling. Military rule is imposed on the people and military heads of state rule without the consent of the people. Because military men have guns, the people can not protest, they just have to accept them.\nMoreover, when civilians rule, the people enjoy freedom of speech and of the press. An indigene can criticise a civilian leader either in the newspaper or on television without any fear of molestation. Nowadays, it is very common to see people criticising or admonishing the civilian president of Nigeria on television. Everybody is believed to be equal under a civilian dispensation. However, in military rule, no one has the guts to talk against a ruler even in the enclosure of his room because walls are believed to have ears.\nFurthermore, in military rule, some innocent citizens, being victims of circumstances, are shot down accidentally. This often occurs in a military dispensation. There is little respect or regard for human lives and the military can be likened to armed robbers because instead of using their guns for security purposes, they maim innocent lives. However, in civilian rule, intimidating guns are not present and this actually brings a sense of security to the citizens.\nLastly, civilian rulers execute good and popular projects which are aimed at ameliorating the suffering of the people they rule. They know that the people who vote them into power will judge them by their performance. Therefore, they execute good projects and provide infrastructural facilities that could speak for them when they are called to render account of their stewardship in governance. On the contrary, military rulers are not guided by the wishes and demands of the people they rule when it comes to project execution. This is because they are not accountable to the people.\nI believe that I have been able to convince you that civilian rule is better than military rule. I thank you for your patience.",
    "year": "2001"
  },
  {
    "number": "135",
    "text": "Write a story, real or imagined, which illustrates the saying \"Make hay while the sun shines.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51506?exam_type=waec&type=theory&page=27",
    "correct_answer": "MAKE HAY WHILE THE SUN SHINESAmos Inyang and Tunde Lukmon were intimate friends while they were classmates in secondary school. Their friendship started on their very first day at school. Amos' parents had brought Tunde in their car. From there, they started their friendship and this blossomed soon after. They were very intimate when they were in the Junior secondary school. They did things together in the hostel and shared the same desk and chair in the school. Things, however, started changing after their Junior Secondary School Certificate Examination. They were both promoted to the Senior Secondary School class one. After their promotion. Tunde began to exhibit a change in his character and behaviour. His disposition to his studies changed and he started keeping bad companies. He played truant and ran away from classes. Tunde's bad conduct made Amos distance himself from him. He decided to be up and doing in his studies while Tunde misbehaved most of the time and got into trouble with the school authority.\nAmos continued to be well-behaved industrious and enterprising. He was hardworking and studious and he believed in making hay while the sun shone. At the end of the year. he was promoted to SS 2 while Tunde was promoted on trial because of his poor performance. When they were promoted. Amos called Tunde and admonished him for his bad behaviour and advised him to make hay while the sun shone and stop wasting his time. Amos' admonition did not have any effect on Tunde as he proved stubborn and recalcitrant. He became more unruly than ever before.\nOne day, Tunde and his gang stole into the school poultry at night to steal eggs and fowl and they were caught. The second day, they were called out on the assembly and their offence was announced to the whole school. They were flogged openly and suspended for two terms. When Tunde was suspended he refused to let his parents knew about his misdemeanour. He went to hide in one of his friend's houses while on suspension. he always sneaked into the school to cause one trouble or the other. His unrepentant attitude made the principal to expel him from school.\nAmos continued to be diligent and hardworking in his studies. He came out of school with flying colours and soon after he got admission into the university to study medicine After seven years in the university, he graduated and became a medical doctor.\nOne day as he was going round the emergency ward of the hospital where he was working, he stumbled on Tunde, his former classmate and friend. Tunde was abandoned on a stretcher half-dead; he was bleeding profusely. Some hours before this time, he had been wounded in a fight which ensued among members of the transport union in one of the motor parks. He was wounded with an axe. Amos took pity on him and took a special interest in his case.\nWhen Tunde was recuperating in his hospital bed, Amos got to know about his life after leaving secondary school. Indeed, he had wasted his time and he was a tout at Ikeja motor park where he was wounded while participating in a fight with touts from a rival motor park. In fact, he had no money to pay his hospital bill and Amos had to pay for him. When Amos revealed to him that he had paid his hospital bill, he burst into tears, weeping profusely. Then Dr. Amos had to pat him on the back to pacify him and he reminded him of his admonition to him some few years back. He said, \"You wouldn't have been in this mess if you had made hay while the sun was shining.\"",
    "explanation": "MAKE HAY WHILE THE SUN SHINESAmos Inyang and Tunde Lukmon were intimate friends while they were classmates in secondary school. Their friendship started on their very first day at school. Amos' parents had brought Tunde in their car. From there, they started their friendship and this blossomed soon after. They were very intimate when they were in the Junior secondary school. They did things together in the hostel and shared the same desk and chair in the school. Things, however, started changing after their Junior Secondary School Certificate Examination. They were both promoted to the Senior Secondary School class one. After their promotion. Tunde began to exhibit a change in his character and behaviour. His disposition to his studies changed and he started keeping bad companies. He played truant and ran away from classes. Tunde's bad conduct made Amos distance himself from him. He decided to be up and doing in his studies while Tunde misbehaved most of the time and got into trouble with the school authority.\nAmos continued to be well-behaved industrious and enterprising. He was hardworking and studious and he believed in making hay while the sun shone. At the end of the year. he was promoted to SS 2 while Tunde was promoted on trial because of his poor performance. When they were promoted. Amos called Tunde and admonished him for his bad behaviour and advised him to make hay while the sun shone and stop wasting his time. Amos' admonition did not have any effect on Tunde as he proved stubborn and recalcitrant. He became more unruly than ever before.\nOne day, Tunde and his gang stole into the school poultry at night to steal eggs and fowl and they were caught. The second day, they were called out on the assembly and their offence was announced to the whole school. They were flogged openly and suspended for two terms. When Tunde was suspended he refused to let his parents knew about his misdemeanour. He went to hide in one of his friend's houses while on suspension. he always sneaked into the school to cause one trouble or the other. His unrepentant attitude made the principal to expel him from school.\nAmos continued to be diligent and hardworking in his studies. He came out of school with flying colours and soon after he got admission into the university to study medicine After seven years in the university, he graduated and became a medical doctor.\nOne day as he was going round the emergency ward of the hospital where he was working, he stumbled on Tunde, his former classmate and friend. Tunde was abandoned on a stretcher half-dead; he was bleeding profusely. Some hours before this time, he had been wounded in a fight which ensued among members of the transport union in one of the motor parks. He was wounded with an axe. Amos took pity on him and took a special interest in his case.\nWhen Tunde was recuperating in his hospital bed, Amos got to know about his life after leaving secondary school. Indeed, he had wasted his time and he was a tout at Ikeja motor park where he was wounded while participating in a fight with touts from a rival motor park. In fact, he had no money to pay his hospital bill and Amos had to pay for him. When Amos revealed to him that he had paid his hospital bill, he burst into tears, weeping profusely. Then Dr. Amos had to pat him on the back to pacify him and he reminded him of his admonition to him some few years back. He said, \"You wouldn't have been in this mess if you had made hay while the sun was shining.\"",
    "year": "2001"
  },
  {
    "number": "136",
    "text": "Read the following passage carefully and answer the questions on it. \n\nBitrus, a middle-aged man, was speeding along the hot tarmac one afternoon, oblivious to the countryside. By his side, reading a magazine was his first son, a twenty-year-old university computer science student. On the man’s mind was the contract he was pursuing in the capital city. It was worth several million dollars. Although he had handled bigger contracts before, Bitrus was preoccupied with this new challenge, his mind far away from the road before him. His son was also buried in the magazine he was reading. So neither saw the goat crossing the road early enough. Like an automaton,  Bitrus jammed on the brakes. In a flash, there was a skid and a somersault. The villagers worked for almost an hour on the huge Mercedes before rescuing the two. \nThere, in the casualty ward, the duo lay on the stretchers. Bitrus was soon in a fairly stable, but anybody would know that the son needed prompt specialist medical attention. The doctor was sent for, a surgeon who regularly handled such cases. Soon enough, the doctor came. The nurses heaved a sigh of relief. But then... “Oh no, I can’t handle this case. He’s my son!” Everyone was shocked. One of the nurses pleaded. “But doctor, you must do something otherwise,... “No, he’s my son. I’ll have to transfer this case.” And so tearfully, more agitated than anybody around, the doctor hurried away to call a colleague. \n\nHere was Bitrus, with multiple injuries, but not in danger. In the adjoining room was his son, still comatose. How then could a doctor come in and say, “This is my son”? Wasn’t Bitrus the father after all? Most people would reason that the doctor was truly the secret biological father. Others, reasoning hard, would conclude that the doctor was Bitrus’s father and thus was right in describing him as his son. But for how long would people continue to think that all doctors must be male? Couldn’t the doctor have simply been Mrs. Bitrus? \n\n(a) (i) What was the remote cause of the accident? (ii) What was the immediate cause? \n(b) What does the passage suggest about doctors’ attitude to the cases they handle? \n(c) Describe the conditions of Mr. Bitrus and his son at the hospital. \n(d) What assumption about doctors does the passage illustrate? \n(e) His son was also buried in the magazine he was reading. \n(i) What type of figurative expression is this? (ii) What is its function as it is used in the sentence? \n(f) ...that the doctor was truly the secret biological father. \n(i) What grammatical name is given to this expression? (ii) What is its function as it is used in the sentence? \n(g) For each of the following, find a word or phrase that means the same and can replace it as it is used in the passage: (i) oblivious (ii) prompt (iii) regularly (iv) pleaded (v) agitated (vi) adjoining",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51510?exam_type=waec&type=theory&page=28",
    "correct_answer": "6(a)(i) The remote cause was that Bitrus was not concentrating on the driving or Bitrus was absentminded.(ii) The immediate cause was the goat crossing the road / the sudden braking / the skidding.(b) The passage suggests that doctors' attitude to the cases they handle depends on their relationship with the patients. or It depends on their emotional involvement in the cases.(c). Mr. Bitrus had multiple (some) injuries and his son was unconscious/comatose.(d) People think/assume that all doctors are male or People think that doctors attend to all cases (patients).(e) (i) Metaphor (ii) It means that the boy was engrossed in what he was reading(f)(i) Noun clause (ii) object of the verb 'Would reason'(g)(i) oblivious — unmindful, forgetful, unaware (ii) prompt — immediate, urgent, quick(iii) regularly — normally, consistently, usually, again and again(iv) pleaded — begged, appealed, implored, entreated, urged(v) agitated — shaken, disturbed, upset, moved, worried(vi) adjoining — next, adjacent",
    "explanation": "6(a)(i) The remote cause was that Bitrus was not concentrating on the driving or Bitrus was absentminded.(ii) The immediate cause was the goat crossing the road / the sudden braking / the skidding.(b) The passage suggests that doctors' attitude to the cases they handle depends on their relationship with the patients. or It depends on their emotional involvement in the cases.(c). Mr. Bitrus had multiple (some) injuries and his son was unconscious/comatose.(d) People think/assume that all doctors are male or People think that doctors attend to all cases (patients).(e) (i) Metaphor (ii) It means that the boy was engrossed in what he was reading(f)(i) Noun clause (ii) object of the verb 'Would reason'(g)(i) oblivious — unmindful, forgetful, unaware (ii) prompt — immediate, urgent, quick(iii) regularly — normally, consistently, usually, again and again(iv) pleaded — begged, appealed, implored, entreated, urged(v) agitated — shaken, disturbed, upset, moved, worried(vi) adjoining — next, adjacent",
    "year": "2001"
  },
  {
    "number": "137",
    "text": "Read the following passage carefully and answer the questions on it.\nIn the 1960s and 1970s undergraduates did not need to apply for employment. Employees usually wooed them by depositing offers of jobs in their halls of residence for those interested to pick and choose from as soon as they finished writing their degree examinations. How things have changed! We have since “progressed” from this age of abundance in which unemployment was hardly heard of to one of economic recession and widespread unemployment. The problem is so acute that one finds unemployment even among engineers and doctors.\nWhat are the causes of this phenomenon? For one thing, our educational system does not train its products for self-employment. Everybody expects the government or the private sector to provide them with a job at the end of their studies. As we have now realised, the government and the private sector combined cannot create enough jobs to go around the army of graduates turned out annually by our universities. For another, many parents encourage their children to enrol in courses leading to prestigious and lucrative professions for which they may be intellectually unsuited. They end up obtaining poor degrees or none at all. Such graduates cannot compete in the job market, so they swell the ranks of the unemployable and the unemployed.\nPerhaps the most important single cause of unemployment is economic recession. During periods of boom, economic activities are generated in abundance and these make plenty of jobs available. But the reverse is the case in times of economic recession.\nThere is no simple solution to the problem. Everyone in the society has a role to play here. The government has a duty to ensure that the economy is buoyant, thus providing the right environment for the creation of jobs. The educational authorities have to orientate the process of education towards the production of job creators rather than job seekers. Guidance and counselling services should be made available in all secondary institutions. Parents, too, should stop misdirecting their children into choosing careers for which they are ill-suited.\n(a)(i) What was the employment situation like in the 1960s and 1970s?\n(ii) What is the situation now?\n(b) In what ways do the education systems, the parents and the students contribute to the unemployment situation?\n(c) Mention three suggestions given in the last paragraph for solving the problem.\n(d) Why does the writer enclose the word progressed (First paragraph) in quotation marks?\n(e) ........for which they may be intellectually unsuited.\n(i) What grammatical name is given to this expression?\n(ii)What is its function as it is used in the sentence?\n(f) For each of the following words, find another word or phrase that means the same and can replace it as it is used in the passage:\n(i) recession\n(ii) acute\n(iii) army\n(iv) lucrative\n(v) boom\n(vi) orientate",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51517?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a)(i) In the 1960s and 1970s it was easy to secure employment or There was no unemployment.\n(ii) Now it is not easy I It is difficult to secure employment or There is unemployment.\n(b)(i) The educational system does not train students to be self-employed\n(ii) Parents enroll their children for courses that they are not suited for.\n(iii) Students obtain poor degrees or none at all or Students are unemployable\n(c)(i) Government should provide the right environment for the creation of jobs or Government should make the economy buoyant. (ii) The educational authorities should channel the process of education towards producing job creators rather than job seekers.\n(iii) Guidance and counselling services should be made available in all secondary schools\n(iv) Parents should not force courses (careers) on their children.\n(a) He has used it ironically or He has used it to describe the opposite of what has really happened (or what he really means) or He has not used the word in its real sense.\n(e)(i) Adjectival / Relative clause (ii) It qualifies the noun 'professions'.\n(f) (I) recession depression, shrink, decline, down-turn, retrogression (ii) acute severe, serious, enormous\n(iii) army — large number, throng, hordes, multitude, host, legion (iv) lucrative --profitable, paying, rewarding, gainful, well-paid\n(v) boom-growth, buoyancy, prosperity, plenty, abundance (vi) orientate-direct, steer, channel, redirect, guide, turn",
    "explanation": "(a)(i) In the 1960s and 1970s it was easy to secure employment or There was no unemployment.\n(ii) Now it is not easy I It is difficult to secure employment or There is unemployment.\n(b)(i) The educational system does not train students to be self-employed\n(ii) Parents enroll their children for courses that they are not suited for.\n(iii) Students obtain poor degrees or none at all or Students are unemployable\n(c)(i) Government should provide the right environment for the creation of jobs or Government should make the economy buoyant. (ii) The educational authorities should channel the process of education towards producing job creators rather than job seekers.\n(iii) Guidance and counselling services should be made available in all secondary schools\n(iv) Parents should not force courses (careers) on their children.\n(a) He has used it ironically or He has used it to describe the opposite of what has really happened (or what he really means) or He has not used the word in its real sense.\n(e)(i) Adjectival / Relative clause (ii) It qualifies the noun 'professions'.\n(f) (I) recession depression, shrink, decline, down-turn, retrogression (ii) acute severe, serious, enormous\n(iii) army — large number, throng, hordes, multitude, host, legion (iv) lucrative --profitable, paying, rewarding, gainful, well-paid\n(v) boom-growth, buoyancy, prosperity, plenty, abundance (vi) orientate-direct, steer, channel, redirect, guide, turn",
    "year": "2001"
  },
  {
    "number": "138",
    "text": "Read the following passage carefully and answer, in your own words as far as possible, the question that follows.\nPoverty! Can anyone who has not really been poor know what poverty is? I really doubt it. How can anyone who enjoys three square meals a day explain what poverty means? Indeed can someone who has two full meals a day claim to know poverty? Perhaps, one begins to grasp the full meaning of poverty when one struggles really hard to have one miserable meal in twenty-four hours. Poverty and hunger are cousins, the former always dragging along the latter wherever he chooses to go.\nIf you were wearing a suit, or a complete traditional attire, and you look naturally rotund in your apparel, you cannot understand what poverty entails. Nor can you have a true feel of poverty if you have some good shirts and pairs of trousers, never mind that all these are casual wear. Indeed, if you can change one dress into another, and these are all you can boast of, you are not really poor. A person begins to have a true feel of what poverty means when, apart from the tattered clothes on his body, he doesn’t have any other; not even a calico sheet to keep away the cold at night.\nLet us face it, how can anyone who has never slept outside, in the open, appreciate the full, harsh import of homelessness? Yet that is what real, naked poverty is. He who can lay claim to a house, however humble, cannot claim to be poor. Indeed, if he can afford to rent a flat, or a room in town or city, without the landlord having cause to eject him, he cannot honestly claim to be poor. The really poor man has no roof over his head, and this is why you find him under a bridge, in a tent or simply in the vast open air. \nBut that is hardly all. The poor man faces the world as a hopeless underdog. In every bargain, every discussion, every event involving him and others, the poor man is constantly reminded of his failure in life. Nobody listens attentively when he makes a point, nobody accepts that his opinion merits consideration. So in most cases, he learns to accept that he has neither wisdom nor opinion.\nThe pauper’s lot naturally rubs off on his child who is subject not only to hunger of the body but also of the mind. The pauper lacks the resources to send his child to school. And even in communities where education is free, the pauper’s child still faces an uphill task because the hunger of the body impedes the proper nourishment of the mind. Denied access to modern communications media, the poor child has very little opportunity to understand the concepts taught him. His mind is rocky soil on which the teacher’s seeds cannot easily germinate. Thus embattled at home and then at school, the pauper’s child soon has very little option but to drop out of school. \nThat is still not all. Weakened by hunger, embattled by cold and exposure to the elements, feeding on poor water and poor food, the pauper is an easy target for diseases. This is precisely why the poorest countries have the shortest life expectancy while the longest life expectancies are recorded among the richest countries. Poverty is really a disease that shortens life! \n \n(a)In six sentences, one for each, summarize the problems of the poor man.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51519?exam_type=waec&type=theory&page=28",
    "correct_answer": "(i) The poor man goes hungry or The poor man has difficulty in finding one (poor) meal a day\n(ii) The poor man has hardly any clothes to wear.\n(iii) The poor man is homeless/has no roof over his head / is exposed to the elements (weather).\n(iv) The poor man's opinion / idea is not recognised / considered or The poor man is not respected / recognised.\n(v) The poor man is unable to send his child to school or He is unable to educate his child\n(vi) The poor man falls prey easily to disease or The poor man dies early / has a short life-span or He is an easy target for diseases.",
    "explanation": "(i) The poor man goes hungry or The poor man has difficulty in finding one (poor) meal a day\n(ii) The poor man has hardly any clothes to wear.\n(iii) The poor man is homeless/has no roof over his head / is exposed to the elements (weather).\n(iv) The poor man's opinion / idea is not recognised / considered or The poor man is not respected / recognised.\n(v) The poor man is unable to send his child to school or He is unable to educate his child\n(vi) The poor man falls prey easily to disease or The poor man dies early / has a short life-span or He is an easy target for diseases.",
    "year": "2001"
  }
]