[
  {
    "number": "83",
    "text": "You had a quarrel with your best friend and have not been on speaking terms ever since. Now that you are about to leave secondary school, write to your friend giving at least three reasons why you should become friends again.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51139?exam_type=waec&type=theory&page=17",
    "correct_answer": "Evans Comprehensive High School,\n26 Chiroma Boulevard,\nEnugu.\n16th May. 2007.\nDear Chioma,\nI don't think that I can ever be happy again until we settle our quarrel and become friends again. I never thought that the little misunderstanding caused by mischievous Ngozi could make us not to be on speaking terms for almost two years now. I referred to Ngozi as being mischievous because what she told me about you as regards the stolen money in our dormitory has been revealed to be untrue. She made me to believe that you were the one who stole the money. I a m very sorry to have joined others to accuse you wrongly which had made you to vow not to be on speaking terms with me again.\nChioma, I want to let you know that the quarrel has caused me a lot of things. In fact, it has strained my good relationship p with my mother. She keeps asking after you. wondering why you've not be visiting me during holidays. I didn't know that she loves you so much until she pestered me to tell her what happened between us. She promised to come and see you and she refused to give me money when I was coming back to school because of the quarrel between us.\nIn addition to this, I missed your companionship and the friendship that has been built over a period of five years. If you could recollect we got admitted into this school the same day and since then we have been known to be friends. We did many things together and because of the quarrel. many people. including some of our teachers, have been wondering what has come between us. I think we should not allow any quarrel to separate us and I sincerely desire that we become friends again.\nFurthermore, what begins well must end well, We are known to be friends right from our junior secondary school and we should pass out of the senior secondary school as friends. It won't be good for us to meet after our stay in this school and refuse to greet each other. We should be able to burry the hatchet so that our friendship could go beyond our stay in secondary school. Don't you think that I will still need your inestimable companionship and advice after we must have left the school?\nMy mother will be very happy to hear that we have put the quarrel behind us and I am sure that your parents must have been asking you about me. Let us put an end to the quarrel and malice and restore our friendship. How are you? I hope that you are doing well academically. I am looking forward to when you are going to pay me a visit in my dormitory.\nYours sincerely.\nOluchi.",
    "explanation": "Evans Comprehensive High School,\n26 Chiroma Boulevard,\nEnugu.\n16th May. 2007.\nDear Chioma,\nI don't think that I can ever be happy again until we settle our quarrel and become friends again. I never thought that the little misunderstanding caused by mischievous Ngozi could make us not to be on speaking terms for almost two years now. I referred to Ngozi as being mischievous because what she told me about you as regards the stolen money in our dormitory has been revealed to be untrue. She made me to believe that you were the one who stole the money. I a m very sorry to have joined others to accuse you wrongly which had made you to vow not to be on speaking terms with me again.\nChioma, I want to let you know that the quarrel has caused me a lot of things. In fact, it has strained my good relationship p with my mother. She keeps asking after you. wondering why you've not be visiting me during holidays. I didn't know that she loves you so much until she pestered me to tell her what happened between us. She promised to come and see you and she refused to give me money when I was coming back to school because of the quarrel between us.\nIn addition to this, I missed your companionship and the friendship that has been built over a period of five years. If you could recollect we got admitted into this school the same day and since then we have been known to be friends. We did many things together and because of the quarrel. many people. including some of our teachers, have been wondering what has come between us. I think we should not allow any quarrel to separate us and I sincerely desire that we become friends again.\nFurthermore, what begins well must end well, We are known to be friends right from our junior secondary school and we should pass out of the senior secondary school as friends. It won't be good for us to meet after our stay in this school and refuse to greet each other. We should be able to burry the hatchet so that our friendship could go beyond our stay in secondary school. Don't you think that I will still need your inestimable companionship and advice after we must have left the school?\nMy mother will be very happy to hear that we have put the quarrel behind us and I am sure that your parents must have been asking you about me. Let us put an end to the quarrel and malice and restore our friendship. How are you? I hope that you are doing well academically. I am looking forward to when you are going to pay me a visit in my dormitory.\nYours sincerely.\nOluchi.",
    "year": "2007"
  },
  {
    "number": "84",
    "text": "Write an article for publication in your school magazine on the problems of indiscipline in schools.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51183?exam_type=waec&type=theory&page=17",
    "correct_answer": "PROBLEMS OF INDISCIPLINE IN SCHOOLS\nThese days, schools have been confronted by problems of indiscipline among students. The current wave of indiscipline among students is most disturbing and it demands immediate attention of all the stakeholders in the education sector. Indiscipline among students manifests mainly in various unruly behaviors exhibited by students in and outside the school. It includes untoward behaviors like violence street fighting and hooliganism, truancy at school, improper dressing even when they wear their uniforms. moral laxity, gambling and other immoral acts.\nIndiscipline in schools can be blamed on the parents who have neglected the discipline of their children at home. Nowadays. parents ignore their duties towards proper upbringing of their children little time is spent with these children which results in moral laxity which is exhibited by students. Many who are undisciplined are products of broken homes and careless parents. The home contributes mainly to indiscipline in our institutions of learning.\nApart from this, our society can not be exonerated either Indiscipline is a societal problem. It originates from our societal values which nowadays have been twisted and corrupted A society demands the type of students it gets. There is a lot of indiscipline acts going on in our society and this can not but rub off on our students. For instance, a student who is fond of gambling in the school has come to realize that there is no honest way of making money and that hardwork is not recognize in the society.\nIndiscipline has done more harm than good to education in the country. it has resulted in poor academic performance in schools. As a result of indiscipline, many students have neglected their studies and this makes them to be involved in examination malpractices and other academic vices. This is done with the assistance of some teachers who also contribute to the problems of indiscipline ravaging our schools.\nIndiscipline among teachers and non-teaching staff in schools also contribute to gross misconduct in schools. It therefore leads to wrong upbringing of students. Since indiscipline is the order of the day in most schools schools, students often think that what they are doing is right after all, if teachers can do it why can't they. With such thoughts, these students grow up and they may never stop indulging in misconduct.\nMost times we see or hear of several corrupt leaders but we never get to realise that it may have started from their school. The problem of indiscipline in schools goes beyond what we can imagine, It starts little by little in school and later causes havoc to the image of the country In conclusion, I think that discipline in schools should be curbed, if not totally eradicated, if we don't want to have a big problem that we can not cope with in future.\nIbrahim Bala YusufSS3C.",
    "explanation": "PROBLEMS OF INDISCIPLINE IN SCHOOLS\nThese days, schools have been confronted by problems of indiscipline among students. The current wave of indiscipline among students is most disturbing and it demands immediate attention of all the stakeholders in the education sector. Indiscipline among students manifests mainly in various unruly behaviors exhibited by students in and outside the school. It includes untoward behaviors like violence street fighting and hooliganism, truancy at school, improper dressing even when they wear their uniforms. moral laxity, gambling and other immoral acts.\nIndiscipline in schools can be blamed on the parents who have neglected the discipline of their children at home. Nowadays. parents ignore their duties towards proper upbringing of their children little time is spent with these children which results in moral laxity which is exhibited by students. Many who are undisciplined are products of broken homes and careless parents. The home contributes mainly to indiscipline in our institutions of learning.\nApart from this, our society can not be exonerated either Indiscipline is a societal problem. It originates from our societal values which nowadays have been twisted and corrupted A society demands the type of students it gets. There is a lot of indiscipline acts going on in our society and this can not but rub off on our students. For instance, a student who is fond of gambling in the school has come to realize that there is no honest way of making money and that hardwork is not recognize in the society.\nIndiscipline has done more harm than good to education in the country. it has resulted in poor academic performance in schools. As a result of indiscipline, many students have neglected their studies and this makes them to be involved in examination malpractices and other academic vices. This is done with the assistance of some teachers who also contribute to the problems of indiscipline ravaging our schools.\nIndiscipline among teachers and non-teaching staff in schools also contribute to gross misconduct in schools. It therefore leads to wrong upbringing of students. Since indiscipline is the order of the day in most schools schools, students often think that what they are doing is right after all, if teachers can do it why can't they. With such thoughts, these students grow up and they may never stop indulging in misconduct.\nMost times we see or hear of several corrupt leaders but we never get to realise that it may have started from their school. The problem of indiscipline in schools goes beyond what we can imagine, It starts little by little in school and later causes havoc to the image of the country In conclusion, I think that discipline in schools should be curbed, if not totally eradicated, if we don't want to have a big problem that we can not cope with in future.\nIbrahim Bala YusufSS3C.",
    "year": "2007"
  },
  {
    "number": "85",
    "text": "Write a letter to the Chairman of your school's Board of Governors on the need for a library in your school, requesting him to build and equip one for the school.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51185?exam_type=waec&type=theory&page=17",
    "correct_answer": "lkeja Senior High School,Oba Akinjobi Road,G.R.A. lkeja.16th June, 2007\nThe Chairman,Board of Governors,Ikeja Senior High School,G.R.A. Ikeja.\nDear Sir.\nREQUEST FOR A STANDARD LIBRARY IN MY SCHOOLI am writing on behalf of the entire student body requesting for a standard library for our school.First and foremost, I want to sincerely thank the board for all the assistance they have been rendering to our school. Every student in the school appreciates you and I believe that we are proud of being associated with you. It is our belief that you will not relent in your efforts to give the school the best it needs to keep the flag of this great institution flying.The effort you put up to meet our need for a school bus still remains evergreen in our memory. We are grateful for it and there is no place we get to with the school bus that our school is not respected.However, this time around. we need a standard library in our school. As our beloved parents, we trust you to give us the best so that we can continue to do everything possible to ensure that we continue to put in our best in ensuring that this school has the best result every year.Sir, you will agree with me that the importance of library in a school such as ours cannot be over-emphasized. Firstly, it will curb the habit of students roaming the school during their free periods. With the library built, no student will have the excuse for roaming the school premises. I know that the students will prefer to make use of the library adequately.Secondly. the present age of technology calls for adequate information and knowledge to keep on updating our awareness on what is obtainable in the present age. We need standard textbooks on all the subjects offered in the school and computers so as to make the students computer literate. We would ever be grateful if you could provide the school with computers as one of the materials we need in the library. I want to assure you that if the school is provided with a well-equipped library, it will become one of the best schools in the country.In addition. provision of a well-equipped library in our school will further improve the reading culture which the school administration is recently trying to inculcate in us. You will agree with me that if the school is provided with a library, students will no longer have any excuse whatsoever not to go there to borrow books and novels which they can read.We know that it will cost a lot of money to build the library but we have no other Board of Governors that we can ask to provide a library for us. We believe that you and other members of the board can build the library and equip it for the school.We would ever be grateful if the request could be granted.Yours faithfully,(Signature)Taiwo Adeoye Latilo.",
    "explanation": "lkeja Senior High School,Oba Akinjobi Road,G.R.A. lkeja.16th June, 2007\nThe Chairman,Board of Governors,Ikeja Senior High School,G.R.A. Ikeja.\nDear Sir.\nREQUEST FOR A STANDARD LIBRARY IN MY SCHOOLI am writing on behalf of the entire student body requesting for a standard library for our school.First and foremost, I want to sincerely thank the board for all the assistance they have been rendering to our school. Every student in the school appreciates you and I believe that we are proud of being associated with you. It is our belief that you will not relent in your efforts to give the school the best it needs to keep the flag of this great institution flying.The effort you put up to meet our need for a school bus still remains evergreen in our memory. We are grateful for it and there is no place we get to with the school bus that our school is not respected.However, this time around. we need a standard library in our school. As our beloved parents, we trust you to give us the best so that we can continue to do everything possible to ensure that we continue to put in our best in ensuring that this school has the best result every year.Sir, you will agree with me that the importance of library in a school such as ours cannot be over-emphasized. Firstly, it will curb the habit of students roaming the school during their free periods. With the library built, no student will have the excuse for roaming the school premises. I know that the students will prefer to make use of the library adequately.Secondly. the present age of technology calls for adequate information and knowledge to keep on updating our awareness on what is obtainable in the present age. We need standard textbooks on all the subjects offered in the school and computers so as to make the students computer literate. We would ever be grateful if you could provide the school with computers as one of the materials we need in the library. I want to assure you that if the school is provided with a well-equipped library, it will become one of the best schools in the country.In addition. provision of a well-equipped library in our school will further improve the reading culture which the school administration is recently trying to inculcate in us. You will agree with me that if the school is provided with a library, students will no longer have any excuse whatsoever not to go there to borrow books and novels which they can read.We know that it will cost a lot of money to build the library but we have no other Board of Governors that we can ask to provide a library for us. We believe that you and other members of the board can build the library and equip it for the school.We would ever be grateful if the request could be granted.Yours faithfully,(Signature)Taiwo Adeoye Latilo.",
    "year": "2007"
  },
  {
    "number": "86",
    "text": "You are the chief speaker in a debate on the topic: It is the home and not the school that contributes more to moral laxity among students. Write your argument for or against the topic.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51186?exam_type=waec&type=theory&page=18",
    "correct_answer": "IT IS THE HOME AND NOT THE SCHOOL THAT CONTRIBUTES MORE TO MORAL LAXITY AMONG STU-DENTSGood day, the Chairman Panel of Judges, Co-debaters, Ladies and Gentlemen. I am here to argue in support of the motion that it is the home and not the school that contributes more to moral laxity among students'. The home is where a child is born brought up and first taught the ethics and norms of his society. The first place of socialization for a child is the home and the child spends most of his time at home than in school. The child spends relatively little time in school where he is taught to read, write and develop professional skills.Judging from the little explanations offered above, you would agree with me that the home is in the best position to educate students on what is morally right and wrong. However, the home has failed in its duty to bring up students to be morally upright. The attitude of most immoral students can be traced to their homes because students tend to exhibit the bad behaviour and attitude of their parents who, in most cases, are fond of fighting, corruption, immorality and other vices. It has been discovered that parents can not be exonerated from examination malpractices being perpetuated by students in schools. Some parents do encourage their children to be involved in examination malpractices.My opponent has said that when a child attends school, he picks up bad immoral traits which he will later exhibit but this is not true. I disagree with my opponent in the sense that if a child is properly brought up, trained and educated on issues of morality from home, even when he comes in contact with bad influence, he will not be influenced negatives He will even detest such immoral and bad behaviour of his classmates.Moreover, parents who are in the best position to take care of their children's emotional needs are not there forth when the children need them most. They are concerned mostly with how to make money, parties and other mundane things which are detrimental to the moral upbringing of their children.In addition, watching violent movies, Pornography and such immoral pictures contributes largely to total moral breakdown and often emotional disorder of students Where else could they have watched such movies if not the homes? There is an adage which says that 'charity begins at home'. in the same vein, it could be said that moral laxity begins at home.In conclusion, the Chairman Sir, Panel of Judges, distinguished Ladies and Gentlemen, I am sure that you have been convinced that it is the home and not the school that contributes more to moral laxity among students. Thank you.",
    "explanation": "IT IS THE HOME AND NOT THE SCHOOL THAT CONTRIBUTES MORE TO MORAL LAXITY AMONG STU-DENTSGood day, the Chairman Panel of Judges, Co-debaters, Ladies and Gentlemen. I am here to argue in support of the motion that it is the home and not the school that contributes more to moral laxity among students'. The home is where a child is born brought up and first taught the ethics and norms of his society. The first place of socialization for a child is the home and the child spends most of his time at home than in school. The child spends relatively little time in school where he is taught to read, write and develop professional skills.Judging from the little explanations offered above, you would agree with me that the home is in the best position to educate students on what is morally right and wrong. However, the home has failed in its duty to bring up students to be morally upright. The attitude of most immoral students can be traced to their homes because students tend to exhibit the bad behaviour and attitude of their parents who, in most cases, are fond of fighting, corruption, immorality and other vices. It has been discovered that parents can not be exonerated from examination malpractices being perpetuated by students in schools. Some parents do encourage their children to be involved in examination malpractices.My opponent has said that when a child attends school, he picks up bad immoral traits which he will later exhibit but this is not true. I disagree with my opponent in the sense that if a child is properly brought up, trained and educated on issues of morality from home, even when he comes in contact with bad influence, he will not be influenced negatives He will even detest such immoral and bad behaviour of his classmates.Moreover, parents who are in the best position to take care of their children's emotional needs are not there forth when the children need them most. They are concerned mostly with how to make money, parties and other mundane things which are detrimental to the moral upbringing of their children.In addition, watching violent movies, Pornography and such immoral pictures contributes largely to total moral breakdown and often emotional disorder of students Where else could they have watched such movies if not the homes? There is an adage which says that 'charity begins at home'. in the same vein, it could be said that moral laxity begins at home.In conclusion, the Chairman Sir, Panel of Judges, distinguished Ladies and Gentlemen, I am sure that you have been convinced that it is the home and not the school that contributes more to moral laxity among students. Thank you.",
    "year": "2007"
  },
  {
    "number": "87",
    "text": "Write a story to illustrate the saying: Strike while the iron is hot.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51188?exam_type=waec&type=theory&page=18",
    "correct_answer": "STRIKE WHILE THE IRON IS HOT\nPa Chima did not stop telling people, who cared to listen to him, about the need to make good use of any favourable occasion without losing valuable time. People living around him wondered why he remained in abject poverty without any breakthrough. In most cases, he would go on memo lane to remember his past of wasted opportunities and tell his neighbours, especially the youths, mainly out of self pity, to make good use of favourable occasions as soon as they come.\nPa Chima, as he was fondly referred to, was a man of seventy-two years of age. He was lonely as nobody knew his wife and children. He was born in the palace of a king who was his father. Though he was brought up in the palace of a king, his old age was spent in penury and abject poverty. Though Pa Chima could be said to have been born with a silver spoon in his mouth, his parents were not the doting type; they were strict and ready to send him to school.\nHe attended primary and secondary schools in the country and he was later sent abroad, on his insistence, to study. When he got there, he felt that he had escaped from the strict control of his parents and he could do anything he wanted. He started to live a wayward life involving himself in gambling, immorality and other social vices. Most times, he would be arrested by the London police for night crawling but he would be let off the hook because his father was known to be influential. Meanwhile, he had dropped out of school and concealed this fact from his parents. It got to a time his father contemplated bringing him back home but his mother prevailed on him not to do so.\nAfter living in London for ten years, Pa Chima was deported home after he had been arrested for raping, charged to a court and found guilty of the offence. He was deported without achieving anything and he could not account for his stay abroad. When he arrived the country, his parents pardoned him and encouraged him to settle down by giving him  to start a business of his own. He told them that he would go into the business of selling American photocopying machines and his parents gave him two million Naira to start the business. However, Pa Chima didn't learn from his past mistakes as he continued his wayward and wanton ways of life. He wasted the money and after some months he could not account for the money.\nMeanwhile, his brothers and sisters were doing well and his parents thought that they should not give up on him so that he would not become a liability on his brothers and sisters. They got him a wife and so after he had his own family, they thought that being a family man would help him out of his wanton living. They set him up in a business again with a large sum of money which he wasted. It was at this point in his life that his father died and soon after he lost his mother in a fatal motor accident. His brothers and sisters neglected him and when things were rough with him, his wife abandoned him and took away his children.\nHe had since then become a lonely man, a failure who found solace only in telling people who cared to listen the story of his life and urged them not live a life of wasted opportunities as he had lived but strike while the iron is hot.",
    "explanation": "STRIKE WHILE THE IRON IS HOT\nPa Chima did not stop telling people, who cared to listen to him, about the need to make good use of any favourable occasion without losing valuable time. People living around him wondered why he remained in abject poverty without any breakthrough. In most cases, he would go on memo lane to remember his past of wasted opportunities and tell his neighbours, especially the youths, mainly out of self pity, to make good use of favourable occasions as soon as they come.\nPa Chima, as he was fondly referred to, was a man of seventy-two years of age. He was lonely as nobody knew his wife and children. He was born in the palace of a king who was his father. Though he was brought up in the palace of a king, his old age was spent in penury and abject poverty. Though Pa Chima could be said to have been born with a silver spoon in his mouth, his parents were not the doting type; they were strict and ready to send him to school.\nHe attended primary and secondary schools in the country and he was later sent abroad, on his insistence, to study. When he got there, he felt that he had escaped from the strict control of his parents and he could do anything he wanted. He started to live a wayward life involving himself in gambling, immorality and other social vices. Most times, he would be arrested by the London police for night crawling but he would be let off the hook because his father was known to be influential. Meanwhile, he had dropped out of school and concealed this fact from his parents. It got to a time his father contemplated bringing him back home but his mother prevailed on him not to do so.\nAfter living in London for ten years, Pa Chima was deported home after he had been arrested for raping, charged to a court and found guilty of the offence. He was deported without achieving anything and he could not account for his stay abroad. When he arrived the country, his parents pardoned him and encouraged him to settle down by giving him  to start a business of his own. He told them that he would go into the business of selling American photocopying machines and his parents gave him two million Naira to start the business. However, Pa Chima didn't learn from his past mistakes as he continued his wayward and wanton ways of life. He wasted the money and after some months he could not account for the money.\nMeanwhile, his brothers and sisters were doing well and his parents thought that they should not give up on him so that he would not become a liability on his brothers and sisters. They got him a wife and so after he had his own family, they thought that being a family man would help him out of his wanton living. They set him up in a business again with a large sum of money which he wasted. It was at this point in his life that his father died and soon after he lost his mother in a fatal motor accident. His brothers and sisters neglected him and when things were rough with him, his wife abandoned him and took away his children.\nHe had since then become a lonely man, a failure who found solace only in telling people who cared to listen the story of his life and urged them not live a life of wasted opportunities as he had lived but strike while the iron is hot.",
    "year": "2007"
  },
  {
    "number": "88",
    "text": "Read the following passage carefully and answer the questions on it.\n      Mr Cissey pulled on his trousers very hurriedly and dragged himself to the veranda. He was bent on getting to his office beforehis workers. The previous day, he had reprimanded his staff for regularly coming to work late, and threatened to give the sack to any of them who would repeat the offence. Today, he must get to work in time not only to serve as a role model but also to show that he really meant what he had said.\n      He managed to squeeze himself behind the wheel of his car which was at least two sizes too small to accommodate his paunch. He inserted the ignition key and turned it but the car would not start; the engine just grumbled. On the second attempt, it coughed and finally roared to life on the third. It moved grudgingly to the gate and stopped. Cissey immediately realised that he would be caught in a traffic jam. It was evident  that he would arrive at his workplace late.\n      For about two hours, Cissey just sat, glued to his seat, fuming. Hard as he tried to control his temper, the misbehaviour of other drivers once prompted  him to bawl at them. Then suddenly, after the interminable wait, the street cleared and Cissey sped off. It was almost three hours after leaving home that he got to his workplace. The staff were already there and when he entered the building, he found his secretary and the clerical staff apparently immersed in their assignments, with an air of dutifulness. One look at their boss warned them that they had better keep quiet to save their skin. But as soon as he closed the door to his office he heard soft voices mumbling words he could not understand. Worst of all, he heard subdued laughter from his secretary.\n      Cissey immediately shot out of the chair ready to vent his spleen on these underlings but suddenly plopped bac into his seat. On second thoughts, he changed his mind. How could he castigate them for what they had not caused?  \n(a) Why was Mr Cissey in a hurry to get to his office?\n(b) What two indications are there in the passage that Mr Cissey was a huge man?\n(c) How did Mr Cissey express his anger while caught in the traffic?\n(d) Why did Mr Cissey become angry with his staff?\n(e) What was the attitude of the staff towards their boss?\n(f) .,,when he entered the building ... What grammatical name is given to this expression as it is used in the passage? (ii) What is its function?\n(g) How could he castigate them for what they had not caused? What literary device is used in the expression above?\n(h) What is meant by the expression vent his spleen in the last paragraph?\n(i) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) reprimanded (ii) evident (iii) prompted (iv) interminable (v) immersed (vi) subdued.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51195?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a) To be there before his staff OR To show an example of punctuality OR To dismiss those who would come late.\n(b) (i) He squeezed himself behind the wheel. (ii) He had a paunch.\n(c) He shouted (bawled) at the other drivers and fumed.\n(d) They laughed at him and mumbled.\n(e) They feared him/fear.\n(f)(i)Adverbial clause (of time). (ii) Modifies (the verb) \"found\".\n(g) Rhetorical question. (h) Show his anger. (I)(i) reprimanded - scolded, rebuked, chided (ii) evident - clear, obvious (iii) prompted - caused, forced, led, provoked (iv) interminable- (very) long, unending, endless, prolonged. (v) immersed - buried, absorbed, engrossed, engulfed (vi) subdued - stifled, suppressed, restrained, repressed, muffled.",
    "explanation": "(a) To be there before his staff OR To show an example of punctuality OR To dismiss those who would come late.\n(b) (i) He squeezed himself behind the wheel. (ii) He had a paunch.\n(c) He shouted (bawled) at the other drivers and fumed.\n(d) They laughed at him and mumbled.\n(e) They feared him/fear.\n(f)(i)Adverbial clause (of time). (ii) Modifies (the verb) \"found\".\n(g) Rhetorical question. (h) Show his anger. (I)(i) reprimanded - scolded, rebuked, chided (ii) evident - clear, obvious (iii) prompted - caused, forced, led, provoked (iv) interminable- (very) long, unending, endless, prolonged. (v) immersed - buried, absorbed, engrossed, engulfed (vi) subdued - stifled, suppressed, restrained, repressed, muffled.",
    "year": "2007"
  },
  {
    "number": "89",
    "text": "Read the following passage carefully and answer the questions on it.\n      Whenever I ask myself the question why I have not left this country for good, many answers rush to my mind, each striving to be.recognized as being the most convincing. I am reminded of the popular slogan that this country belongs to us, for which reason every one of us must join hands in trying to salvage it. I try to dismiss the argument by reasoning that it is foolhardy  attempting to lend a helping hand where one's services are apparently not required. Then I am reminded that if I leave the country in a hurry just because of our political instability and economic hardship, my commitments to my nuclear family and extended family at home will suffer. I reply by saying that as soon as I get settled abroad. I would arrange for my famiiy to Join me. Other financial problems at home would be taken care of by my regular remittances. Would I then never think of going back home in future? Not until the situation in the country improved considerably, I would answer. And who do I expect to carry on with the task of national rehabilitation when the likes of me are all out of the country? Those who messed up the country in the first place, I would argue. And so on. This self-examination has been going on for the last ten years or so: meanwhile. I am yet to leave the country.\n      When I wonder how many people think' as I do. I realize that we must\" be very few. Indeed, not many have the slightest opportunity of absconding  from the country; they do not have the place to run to, nor do they have the means of escape. Even among the elite who consider this possibility. the uncertainty of a future outside their fatherland intimidates them. And so we all end up staying and grumbling.\n(a) Why would the writer like to leave his country?\n(b) Why does the writer believe that he should not join in salvaging his country?'\n(c) What would make the writer return to his country?\n(d) Who does the writer suggest should carry on the task of national rehabilitation?\n(e) Give two reasons why it has not been easy for him and others to leave the country.\n(f) ...many answers rush to my mind. What figure of speech is used in this expression.\n(g). . the uncertainty of a future outside their fatherland (i) What grammatical name is given. to this expression as it is used in the passage? (ii) What is its function?\n(h) For each of the following words or phrase find another word or phrase which means the same and which can replace it as it is used in the passage. (i) for good. (ii) slogan, (iii) foolhardy; (iv) commitments; (v) absconding.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51197?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a) His country is going through political instability and economic hardship.\n(b) He believes/think that his services are not required.\n(c) He would return to his country when there is a considerable improvement of conditions in his country.\n(d) Those who messed up the country/those who caused the political instability and economic hardship.\n(e)Absconding from the country has not been easy for them because (i) they lack the opportunity (i.e. where to go and means of going). (ii) (they are intimidated by) the uncertainty of a future outside home/the country.\n(f) Metaphor (g)(i) Noun phrase (ii) Subject of (the verb) 'intimidates' (h)(i) for good - permanently, for ever. (ii) slogan - saying, motto, belief (iii) foolhardy - stupid, risky, senseless, foolish, ridiculous, irrational, thoughtless. (iv) commitments - responsibilities, duty, obligations (v) absconding - running away, escaping, fleeing, decamping.",
    "explanation": "(a) His country is going through political instability and economic hardship.\n(b) He believes/think that his services are not required.\n(c) He would return to his country when there is a considerable improvement of conditions in his country.\n(d) Those who messed up the country/those who caused the political instability and economic hardship.\n(e)Absconding from the country has not been easy for them because (i) they lack the opportunity (i.e. where to go and means of going). (ii) (they are intimidated by) the uncertainty of a future outside home/the country.\n(f) Metaphor (g)(i) Noun phrase (ii) Subject of (the verb) 'intimidates' (h)(i) for good - permanently, for ever. (ii) slogan - saying, motto, belief (iii) foolhardy - stupid, risky, senseless, foolish, ridiculous, irrational, thoughtless. (iv) commitments - responsibilities, duty, obligations (v) absconding - running away, escaping, fleeing, decamping.",
    "year": "2007"
  },
  {
    "number": "90",
    "text": "Read the following passage carefully and answer the questions on it.\n      Have you always thought that insects are nothing more than a nuisance? Would you like the world to be free of these annoying pests ? Do you spray them swat them. or step on them at every opportunity? Before declaring war on every bug that crosses your path, why not try to learn something about their world? After all, with a population that outnumbers humans by about 200 million to one you can be sure that insects are here to stay! A brief look at just a few of these amazing creatures might well convince you that insects deserve your respect.\n      Consider flying insects for example: Mosquitoes can fly upside down. Some can even fly through the rain without getting wet - yes, actually dodging the raindrops! Some tropical wasps and bees buzz around at speeds of up to 72 kilometres per hour. One monarch butterfly of North America logged 3,010 kilometres on its migration flight. Hover flies can beat their wings more than a thousand times per second - much faster than humming-birds and dragon flies can fly backwards. Clearly then. insects are such accomplished fliers, unmatched by any other winged creature.\n      The eyes of many insects serve as a compass. Bees and wasps, for instance, can detect the plane of polarised light. This enables them to locate the sun's position in the sky - even when it is hidden by clouds. Thanks to this ability, these insects can forage far from their nests and still navigate their way home unerringly.  \n      In the insect world, sounds and aromas are often used to find a mate - no small achievement when prospective mates are few and far between. Female emperor moths find a suitor by emitting a scent that is so potent that a male can i home n on its source from nearly 11 kilometres away. Crickets, grasshoppers, and cicadas prefer to make themselves heard. Even we humans can hear the amorous cicada as it converts its whole body into a sounding board. A large group of courting cicadas can create a noise louder than that of a drilling machine!\n      Insects play a vital role in our daily life, about 30 percent of the foods we eat results from pollination by them. But pollination is only one of their useful functions. Insects keep the earth clean by means of an efficient recycling system, as they reprocess dead plant and animals. Scientists have observed that without insects the earth will be inundated with dead plant and animal matter. Insects also enrich the soil by liberating nutrients that make things grow. They are sorely missed when their work is not done. Consider what happened in Australia, which has become home to millions of cattle. Herds scattered dung everywhere. Besides being unsightly, the dung provided a breeding site for the bush fiy - a plague to both humans and cattle. So dung beetles were imported from Europe and Africa, and the problem was solved!\n      Admittedly, some insects eat crops and carry disease. But only about one percent of the world's insects is considered as pests, and many of these cause damage because of the way man himself altered the environment. Even with their drawbacks, insects are an integral part of the natural world on which we depend. Scientists have pointed out that while insects can survive without us, we cannot survive without them.\n(a) In three sentences, one for each, summarise the characteristics of insects discussed in the passage.\n(b) In three sentences, one for each, summarise the important functions of insects discussed in the passage.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51200?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a)i) Insects are accomplished/skillful fliers. (ii) Insects have good sense of direction. (iii) Insects have keen senses of hearing and smell.\n(b)(i) Insects carry out pollination. (ii) Insects enrich the soil. (iii) Insects clean up the earth.",
    "explanation": "(a)i) Insects are accomplished/skillful fliers. (ii) Insects have good sense of direction. (iii) Insects have keen senses of hearing and smell.\n(b)(i) Insects carry out pollination. (ii) Insects enrich the soil. (iii) Insects clean up the earth.",
    "year": "2007"
  }
]