[
  {
    "number": "16",
    "text": "You are provided with a retort stand, boss head, clamp, stopwatch, slotted weights, hanger, grooved pulley, thread, measuring tape, and other necessary materials.\ni. Measure and record the radius R of the pulley.\nii. Setup the apparatus as illustrated in the diagram above, such that the clamp is 1.5 m above the floor.\niii. Tie one end of the thread to the pulley.\niv. Tie the other end of the thread to the hanger.\nv. Slot a mass m= 50 g on the hanger.\nvi. Wind the thread around the groove of the pulley until the base of the hanger is at a height h = 1.4 m above the floor. Maintain this height h for every other value of m through out the experiment.\nvii. Release the mass to unwind the thread.\nviii. Determine and record the time t taken by the mass m to reach the floor.\nix. Evaluate t\\(^{2}\\)\nx.  Also evaluate\na =\\(\\frac{2h}{t^{2}}\\),T = \\(\\frac{m}{1000}\\) (10 - a) and \\(\\propto\\) = \\(\\frac{a}{R}\\)\nxi. Repeat the procedure for four other values of m = 70 g, 90 g, 110 g and 130 g\nxii. Tabulate your readings.\nxiii. Plot a graph with \\(\\propto\\) on the vertical axis and T on the horizontal axis.\nxiv. Determine the slope s, of the graph.\nxv. Evaluate  I = \\(\\frac{R}{s}\\).\nxvi. State two precautions taken to obtain accurate results.\n(b)i. Define centripetal force\nii. An object drops to the ground from a height of 2.0 m. Calculate the speed with which it strikes the ground. [g=10 ms\\(^{-2}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59960?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "17",
    "text": "You are provided with a triangular glass prism, four optical pins, and other necessary materials.\n\nPlace the triangular glass prism on a drawing paper and draw its outline UMR. Remove the prism.\nMeasure and record the value of the angle at U.\nDraw a normal to the line UM at N. Also, draw another line TN to the normal such that \\(\\phi\\)-60. Fix two pins at P\\(_{1}\\) and P\\(_{2}\\).\nReplace the prism and fix two other pains at P\\(_{3}\\), and P\\(_{4}\\), such that the pins appear to be in a straight line with the images of the pins at P\\(_{1}\\) and P\\(_{2}\\), when viewed from the side UR. Remove the prism.\nJoin points P\\(_{3}\\), and P\\(_{4}\\), producing the line to meet TN produced at Z. Draw the normal XY.\nMeasure and record the angle of emergence e and that of deviation d.\nRepeat the experiment with \\(\\phi\\) = 55°, 50°, 40° and 35°.\nIn each case, measure and record the Corresponding values of e and d.\nTabulate your readings.\nPlot a graph with d on the vertical axis and e on the horizontal axis starting both axes from the origin (0.0) Join your points with a smooth curve.\nFrom your graph, obtain the minimum deviation d\\(_{m}\\) and the corresponding angle of emergence e\\(_{m}\\) . Hence, calculate the refractive index n of the prism using the formula:\n\nn = \\(\\frac{sin (\\frac{d_{m}+U}{2})}{sin{(\\frac{u}{2})}}\\)\n\nState two precautions taken to obtain accurate results. Attach your traces to your answer booklet.\n\n(b)i. State the conditions necessary for total internal reflection of light to occur.\nii. The critical angle for a transparent substance is 39°. Calculate the refractive index of the substance.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59963?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "18",
    "text": "You have been provided with a resistance box, a voltmeter, a key, a battery, and other necessary materials.\n\nConnect the circuit as shown in the diagram above.\nWith the key K closed, read and record the voltmeter reading V\\(_{0}\\).\nSet the resistance R in the resistance box equal to I\\(\\Omega\\).\n Close the key, read and record the potential difference V on the voltmeter.\nEvaluateR\\(^{-1}\\) and V\\(^{-1}\\) .\nRepeat the procedure for five other values or R = 2\\(\\Omega\\), 3\\(\\Omega\\), 4\\(\\Omega\\), 5\\(\\Omega\\) and 6\\(\\Omega\\).\nTabulate your readings.\nPlot a graph with V\\(^{-1}\\) on the vertical axis and R on the horizontal axis.\nDetermine the slope, s, of the graph and the intercept, C, on the vertical axis.\nEvaluate c\\(^{-1}\\)\nState two precautions taken to obtain accurate results.\n\n(b)i. Define the potential difference between two points in an electric circuit.\nii. Explain why the emf of a cell is greater than the p.d. across the call when it is supplying Current through an external resistance.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59971?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  }
]