[
  {
    "number": "321",
    "text": "A source of primary data for marketing research is",
    "options": {
      "A": "inventory report",
      "B": "customer's feedback",
      "C": "marketing budget",
      "D": "sales report"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68745?exam_type=waec&type=obj&page=65",
    "correct_answer": "B",
    "explanation": "A source of primary data for marketing research is customer's feedback. Primary data refers to data that is collected firsthand specifically for the purpose of the research study at hand. Customer feedback can be obtained through surveys, interviews, focus groups, or other direct interactions with customers. This data provides direct insights into customers' opinions, preferences, experiences, and behaviors, which are valuable for understanding consumer needs, improving products or services, and making informed marketing decisions. Sales reports, inventory reports, and marketing budgets are typically considered secondary data sources as they are already existing data within the organization and may have been collected for purposes other than the specific research study.",
    "year": "2023"
  },
  {
    "number": "322",
    "text": "The systematic process of obtaining and analyzing data to provide information for marketing decision making is",
    "options": {
      "A": "market forecasting",
      "B": "market segmentation",
      "C": "marketing planning",
      "D": "marketing research"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68746?exam_type=waec&type=obj&page=65",
    "correct_answer": "D",
    "explanation": "The systematic process of obtaining and analyzing data to provide information for marketing decision making is marketing research. Marketing research involves gathering relevant data and conducting analysis to gain insights into market trends, consumer behavior, competitors, and other factors that can inform marketing strategies and decision-making processes. It helps businesses understand customer preferences, identify market opportunities, evaluate marketing campaigns, and make informed decisions to meet customer needs and achieve business objectives.",
    "year": "2023"
  },
  {
    "number": "323",
    "text": "Use the information above to answer this question\nThe inscription V-Cough on the product is an example of a",
    "options": {
      "A": "patent",
      "B": "brand name",
      "C": "copyright",
      "D": "trademark"
    },
    "diagram_url": "https://myschool.ng/storage/classroom/xaw6hmLX3QoQtrUUQ8wxtfs9BLwweJ67WzkZnb8F.jpeg",
    "answer_url": "https://myschool.ng/classroom/marketing/68748?exam_type=waec&type=obj&page=65",
    "correct_answer": "B",
    "explanation": "The inscription \"V-Cough\" on the product is an example of a brand name.",
    "year": "2023"
  },
  {
    "number": "324",
    "text": "Use the information above to answer this question\nThe part represented by the letter Z is the",
    "options": {
      "A": "brand",
      "B": "copyright",
      "C": "package",
      "D": "label"
    },
    "diagram_url": "https://myschool.ng/storage/classroom/p3F6oHJU9Tvf8Ia38VRgZUpKrEYdm8bVvKGhRoBX.jpeg",
    "answer_url": "https://myschool.ng/classroom/marketing/68749?exam_type=waec&type=obj&page=65",
    "correct_answer": "C",
    "explanation": "The part labelled Z is package. In marketing, a package refers to the physical container or wrapping that holds a product. It includes the design, materials, and functionality of the container, as well as any labeling or branding elements. The package plays a crucial role in attracting consumers, communicating the product's value proposition, and protecting the product during storage and transportation.",
    "year": "2023"
  },
  {
    "number": "325",
    "text": "Which of the following pricing strategies is used by wholesalers of industrial goods?",
    "options": {
      "A": "Penetration pricing",
      "B": "Cost-plus pricing",
      "C": "Demand based pricing",
      "D": "Haggling pricing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68751?exam_type=waec&type=obj&page=65",
    "correct_answer": "B",
    "explanation": "The pricing strategy commonly used by wholesalers of industrial goods is cost-plus pricing. Cost-plus pricing involves determining the selling price of a product by adding a markup percentage to the cost of production or acquisition. In the case of wholesalers, they typically purchase goods in bulk from manufacturers or suppliers and then resell them to retailers or other businesses. To establish the selling price, wholesalers consider the cost of acquiring the goods, including transportation, storage, and any additional costs incurred, and add a markup percentage to cover their desired profit margin. Cost-plus pricing is a straightforward and commonly used method for wholesalers to set prices and ensure they generate a reasonable profit.",
    "year": "2023"
  },
  {
    "number": "326",
    "text": "Which of the following factors would influence a company's decision to change its production process?",
    "options": {
      "A": "Demographic factor",
      "B": "Social factor",
      "C": "Political factor",
      "D": "Technological factor"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68752?exam_type=waec&type=obj&page=66",
    "correct_answer": "D",
    "explanation": "Teachnogical factors include production techniques, information and communication resources etc. These affect how an organisation operates, sells its products, interacts with, and gathers intelligence on customers, suppliers and competitors.",
    "year": "2023"
  },
  {
    "number": "327",
    "text": "The need for an item backed by the ability to pay by a consumer is",
    "options": {
      "A": "utility",
      "B": "want",
      "C": "demand",
      "D": "exchange"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68753?exam_type=waec&type=obj&page=66",
    "correct_answer": "C",
    "explanation": "Demand is an economic concept that relates to a consumer's desire to purchase goods and services and willingness to payt a specific price for them.",
    "year": "2023"
  },
  {
    "number": "328",
    "text": "A specialised facility used for the storage of fruits and vegetables is",
    "options": {
      "A": "silo",
      "B": "tank",
      "C": "refrigerator",
      "D": "barn"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68754?exam_type=waec&type=obj&page=66",
    "correct_answer": "D",
    "explanation": "A specialized facility used for the storage of fruits and vegetables is a refrigerator. Refrigerators are commonly used in homes, supermarkets, and commercial establishments to maintain low temperatures and control humidity levels, which help to extend the shelf life of perishable items like fruits and vegetables. Refrigerators provide a controlled environment that slows down the ripening process and helps to preserve the freshness and quality of the stored produce.",
    "year": "2023"
  },
  {
    "number": "329",
    "text": "Use the following information to answer this question\n\nABC Foods has recently expanded its production capacity and is searching for a medium for advertising its products at a lower cost.\n\nWhich of the folloewing advertising media would be suitable for the company?",
    "options": {
      "A": "Radio",
      "B": "magazine",
      "C": "Newspaper",
      "D": "Television"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68755?exam_type=waec&type=obj&page=66",
    "correct_answer": "A",
    "explanation": "Based on the information provided, a suitable advertising medium for ABC Foods, which is searching for a lower-cost option to advertise its products, would be radio. Radio advertising can be a cost-effective option compared to television, newspaper, or magazine advertising, as it generally requires lower production costs and offers more affordable airtime rates. Radio advertisements can reach a wide audience, especially during peak listening times, and are often used to target specific demographics or geographic areas. Considering the objective of lowering advertising costs, radio advertising can be a suitable choice for ABC Foods to promote its products effectively within a budget.",
    "year": "2023"
  },
  {
    "number": "330",
    "text": "Use the following information to answer this question\n\nABC Foods has recently expanded its production capacity and is searching for a medium for advertising its products at a lower cost.\n\nA benefit the company would derive from advertising the product is",
    "options": {
      "A": "increase in competition",
      "B": "increase in market share",
      "C": "decrease in tax liabilities",
      "D": "decrease in production cost"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68756?exam_type=waec&type=obj&page=66",
    "correct_answer": "B",
    "explanation": "A benefit that ABC Foods would derive from advertising its products is an increase in market share. Advertising plays a crucial role in raising awareness about a company's products or services and attracting customers. By effectively promoting their products through advertising, ABC Foods can reach a larger audience, create brand recognition, and generate interest and demand for their products. As a result, ABC Foods can potentially increase its market share by capturing a larger portion of the target market and competing more effectively against other companies in the industry.",
    "year": "2023"
  },
  {
    "number": "331",
    "text": "The proces of bringing products to the attention of prospective customers is",
    "options": {
      "A": "promotion",
      "B": "distribution",
      "C": "labelling",
      "D": "branding"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68757?exam_type=waec&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "Promotion mix deals with the communication aspect. The purpose is to make the goods and services known to prospective customers, i.e creation of awareness.",
    "year": "2023"
  },
  {
    "number": "332",
    "text": "The last stage in the buying decision process is the",
    "options": {
      "A": "information search",
      "B": "purchase decision",
      "C": "post-purchase behaviour",
      "D": "evaluation of alternatives"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68759?exam_type=waec&type=obj&page=67",
    "correct_answer": "C",
    "explanation": "The last stage in the buying decision process is the post-purchase behavior. After making the purchase decision, consumers engage in post-purchase behavior, which involves evaluating their purchase and deciding whether they are satisfied or dissatisfied with the product or service. This evaluation is based on factors such as performance, quality, value for money, and how well the product or service meets their needs and expectations. The post-purchase behavior can influence future buying decisions and customer loyalty.",
    "year": "2023"
  },
  {
    "number": "333",
    "text": "Which of the following factors is not a price determinant?",
    "options": {
      "A": "Consumer's culture",
      "B": "Level of demand",
      "C": "Cost of production",
      "D": "Competitior's prices"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68760?exam_type=waec&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "The factor that is not a price determinant among the given options is the consumer's culture. While the cost of production, competitor's prices, and the level of demand are all factors that can influence pricing decisions, the consumer's culture is not typically considered a direct determinant of price. Consumer culture refers to the beliefs, values, attitudes, and behaviors of a particular group of consumers, which can influence their purchasing decisions and preferences. However, it is not directly tied to the determination of prices in a market.",
    "year": "2023"
  },
  {
    "number": "334",
    "text": "An activity performed in a warehouse is",
    "options": {
      "A": "production of goods",
      "B": "sorting and labelling",
      "C": "purchasing of raw materials",
      "D": "repairs and maintenance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68761?exam_type=waec&type=obj&page=67",
    "correct_answer": "B",
    "explanation": "An activity performed in a warehouse is sorting and labelling. Warehouses are facilities where goods are stored, managed, and organized. Sorting and labelling involve the process of categorizing and arranging products based on specific criteria, such as product type, size, SKU (stock keeping unit) number, or destination. This activity helps facilitate efficient inventory management and retrieval of goods within the warehouse. By properly sorting and labelling products, warehouse personnel can quickly locate and retrieve specific items when needed, ensuring smooth operations and timely order fulfillment. Sorting and labelling are crucial tasks in maintaining an organized and efficient warehouse environment.",
    "year": "2023"
  },
  {
    "number": "335",
    "text": "Which of the following items is an example of primary product?",
    "options": {
      "A": "Cotten",
      "B": "Head tie",
      "C": "Shirt",
      "D": "Handkerchief"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68762?exam_type=waec&type=obj&page=67",
    "correct_answer": "A",
    "explanation": "Primary product are natural raw materials, it include: crude oil, coal, iron ore, agricultural products such as wheat, cotton, coffee beans etc.",
    "year": "2023"
  },
  {
    "number": "336",
    "text": "Iron ore is classified as",
    "options": {
      "A": "semi-finished product",
      "B": "primary product",
      "C": "consumer product",
      "D": "secondary product"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68763?exam_type=waec&type=obj&page=68",
    "correct_answer": "B",
    "explanation": "Primary product are natural raw materials, it include: crude oil, coal, iron ore, agricultural products etc.",
    "year": "2023"
  },
  {
    "number": "337",
    "text": "The factors that influence the performance of marketing activities of a firm is marketing",
    "options": {
      "A": "orientation",
      "B": "environment",
      "C": "audit",
      "D": "intelligence"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68764?exam_type=waec&type=obj&page=68",
    "correct_answer": "A",
    "explanation": "Market orientation is a customer -centered approach to product design. It involves market research aimed at determining what customers view as their immediate needs, primary concerns, or personal preference within a particular product category.",
    "year": "2023"
  },
  {
    "number": "338",
    "text": "Use of the following information to answer this question\n\nBIK Ltd has developed a new health application for the public.\n\nWhich of the following means would be used by the company to make the service available to the target market?",
    "options": {
      "A": "Mail order business",
      "B": "Direct marketing",
      "C": "Internet",
      "D": "Merchandising"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68765?exam_type=waec&type=obj&page=68",
    "correct_answer": "C",
    "explanation": "The means that would be used by BIK Ltd to make the health application available to the target market is the Internet. The Internet is a widely used platform for the distribution of digital services, including applications. By making the health application available on the Internet, BIK Ltd can reach a broad audience and make the service easily accessible to the target market. Users can download the application from app stores or the company's website, allowing them to access and use the health application on their devices. The Internet provides a convenient and efficient channel for distributing digital products and services like applications.",
    "year": "2023"
  },
  {
    "number": "339",
    "text": "Use of the following information to answer this question\n\nBIK Ltd has developed a new health application for the public.\nWhich of the following illustrations would be used to distribute the application?",
    "options": {
      "A": "Producer --------Agent ---------------Retailer -------------->Consumer",
      "B": "Producer --------------> Retailer --------------------> Consumer",
      "C": "Producer -------------> Consumer",
      "D": "Producer ---------------> Wholesaler --------------> Retailer -------------->Consumer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68766?exam_type=waec&type=obj&page=68",
    "correct_answer": "C",
    "explanation": "The illustration that would be used to distribute the health application developed by BIK Ltd is \"Producer -------------> Consumer.\" In this scenario, BIK Ltd, as the producer, directly provides the health application to the end consumer. This distribution model bypasses the involvement of intermediaries such as retailers, wholesalers, or agents. BIK Ltd may distribute the application through app stores, its website, or other online platforms where consumers can directly access and download the application to their devices. This direct distribution approach allows BIK Ltd to have more control over the distribution process and ensures that the health application reaches the end consumer efficiently.",
    "year": "2023"
  },
  {
    "number": "340",
    "text": "Which of the following institutions is not a marketing intermediary?",
    "options": {
      "A": "Financial firms",
      "B": "Major distributors",
      "C": "Wholesalers",
      "D": "Retailers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68767?exam_type=waec&type=obj&page=68",
    "correct_answer": "A",
    "explanation": "Financial firms are not typically considered marketing intermediaries. Marketing intermediaries are organizations or entities that facilitate the distribution of products or services from the producer to the end consumer. They play a role in the distribution channel by connecting producers with consumers and ensuring that products reach their intended market. Major distributors, wholesalers, and retailers are all examples of marketing intermediaries as they are involved in the movement and sale of products. Financial firms, on the other hand, primarily deal with financial services such as banking, investment, or insurance, and do not have a direct role in the physical distribution of products.",
    "year": "2023"
  },
  {
    "number": "341",
    "text": "An orientation that holds that a company's decision should include consumer satisfaction and community development is",
    "options": {
      "A": "selling product",
      "B": "societal marketing concept",
      "C": "production concept",
      "D": "product concept"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68769?exam_type=waec&type=obj&page=69",
    "correct_answer": "B",
    "explanation": "Societal responsiblity of marketing is a marketing concept that holds that a company should make marketing decisions not only by considering consumer's wants, the company;s requirements, but also societal's long term interests.",
    "year": "2023"
  },
  {
    "number": "342",
    "text": "A delivery note that accompanies goods to the buyer shows",
    "options": {
      "A": "discount on goods bought",
      "B": "quality of goods bought",
      "C": "price of goods bought",
      "D": "quantity of goods bought"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68770?exam_type=waec&type=obj&page=69",
    "correct_answer": "D",
    "explanation": "The delivery note specifies the quantity of goods being delivered to the buyer. It may include details such as the number of units, weight, volume, or any other relevant measurement unit for the specific goods.",
    "year": "2023"
  },
  {
    "number": "343",
    "text": "The concept applied by XYZ Ltd that uses aggressive promotional efforts to attract customers to buy its brand of cosmetics is",
    "options": {
      "A": "production concept",
      "B": "product concept",
      "C": "societal concept",
      "D": "selling concept"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68771?exam_type=waec&type=obj&page=69",
    "correct_answer": "D",
    "explanation": "The selling concept holds that consumers and businesses, if left alone, will ordinarily not buy enough of the selling company's products. The organization must, therefore, undertake an aggressive selling and promotion effort.",
    "year": "2023"
  },
  {
    "number": "344",
    "text": "A form of sales promotion that rewards customers for consistently purchasing a company;s product is",
    "options": {
      "A": "sales contest",
      "B": "quantity discount",
      "C": "loyalty scheme",
      "D": "promotional allowance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68772?exam_type=waec&type=obj&page=69",
    "correct_answer": "C",
    "explanation": "A form of sales promotion that rewards customers for consistently purchasing a company's product is a loyalty scheme. A loyalty scheme, also known as a customer loyalty program or rewards program, is designed to incentivize and reward customers for their continued loyalty and repeated purchases. Customers who participate in a loyalty scheme earn points, rewards, or other benefits based on their purchases or other predefined criteria. These rewards can include discounts, free products, exclusive offers, access to special events, or other incentives. By implementing a loyalty scheme, businesses aim to foster customer loyalty, increase customer retention, and encourage repeat purchases, ultimately strengthening the relationship between the customer and the company.",
    "year": "2023"
  },
  {
    "number": "345",
    "text": "Use the following information to answer this question\n\nOJ Ltd is a bakery that produces bread and confectioneries while Ernest Super Market buys its products.\n\nOJ Ltd is an example of",
    "options": {
      "A": "a reseller market",
      "B": "a consumer market",
      "C": "an industrial market",
      "D": "a government market"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68774?exam_type=waec&type=obj&page=69",
    "correct_answer": "A",
    "explanation": "OJ Ltd, being a bakery that produces bread and confectioneries, is an example of a supplier operating in the reseller market. The reseller market consists of businesses that purchase products or services with the intention of reselling them to customers, rather than using them directly for their own operations. In this case, OJ Ltd sells its bakery products to Ernest Super Market, which acts as a reseller by purchasing the products for resale to consumers.",
    "year": "2023"
  },
  {
    "number": "346",
    "text": "Use the following information to answer this question\n\nOJ Ltd is a bakery that produces bread and confectioneries while Ernest Super Market buys its products.\n\nErnest Super Market is classified as",
    "options": {
      "A": "a producer",
      "B": "a retailer",
      "C": "an agent",
      "D": "a wholesaler"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68775?exam_type=waec&type=obj&page=70",
    "correct_answer": "B",
    "explanation": "Ernest Super Market, which buys products from OJ Ltd for resale, is classified as a retailer. Retailers are businesses that sell products directly to consumers, typically through physical stores or online platforms. In this case, Ernest Super Market acts as the intermediary between OJ Ltd (the producer) and the end consumers by purchasing bakery products from OJ Ltd and selling them to individual customers in its supermarket.",
    "year": "2023"
  },
  {
    "number": "347",
    "text": "Which pricing strategy is adopted by a company that sells its product for ₦200 when the prevailing market price for same product is ₦150?",
    "options": {
      "A": "Psychological pricing",
      "B": "Skimming pricing",
      "C": "Competitive pricing",
      "D": "Penetrating pricing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68776?exam_type=waec&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "The pricing strategy adopted by a company that sells its product for ₦200 when the prevailing market price for the same product is ₦150 is competitive pricing. Competitive pricing involves setting the price of a product or service based on the prices charged by competitors in the market. The company sets its price at a similar or slightly higher level compared to competitors' prices to remain competitive and attract customers. In this case, the company is pricing its product at ₦200, which is aligned with the prevailing market price of ₦150, indicating a competitive pricing strategy.",
    "year": "2023"
  },
  {
    "number": "348",
    "text": "Air transport is preferred to other modes because it is",
    "options": {
      "A": "faster in transporting goods for long distance",
      "B": "relatively cheaper than other modes",
      "C": "suitable for door-to-door services",
      "D": "affected by weather conditions"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68777?exam_type=waec&type=obj&page=70",
    "correct_answer": "A",
    "explanation": "Air transport is preferred to other modes because it is faster in transporting goods for long distances. Air transportation offers rapid delivery times, especially for long distances, due to its high speed compared to other modes of transportation such as sea or land. Airplanes can cover large distances in a relatively short amount of time, making it ideal for time-sensitive shipments or perishable goods that require quick delivery. While air transport may not always be the most cost-effective option compared to other modes, its speed and efficiency make it highly desirable for time-critical shipments or when the priority is on fast delivery.",
    "year": "2023"
  },
  {
    "number": "349",
    "text": "Use the following information to answer the question\n\nThe yam sellers in Alesinloye trading area in Kano formed an organization.\n\nWhat type of organization formed by the yam sellers is a",
    "options": {
      "A": "market union",
      "B": "trade union",
      "C": "trade association",
      "D": "market operator"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68780?exam_type=waec&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "Based on the given information, the organization formed by the yam sellers in Alesinloye trading area in Kano is most likely a trade association. A trade association is a voluntary organization composed of individuals or businesses in a specific industry or trade. It aims to promote the common interests and welfare of its members and may engage in activities such as advocating for industry-specific issues, providing resources and support to members, and fostering collaboration and networking within the industry.",
    "year": "2023"
  },
  {
    "number": "350",
    "text": "Use the following information to answer the question\n\nThe yam sellers in Alesinloye trading area in Kano formed an organization.\n\nWhich of the following functions would be performed by the organization?",
    "options": {
      "A": "Provision of overdraft to members",
      "B": "Rendering security services to members",
      "C": "Disseminating information to members",
      "D": "Provision of employment to members"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68781?exam_type=waec&type=obj&page=70",
    "correct_answer": "C",
    "explanation": "Disseminating information to members: The organization would likely serve as a platform to distribute relevant information to its members. This could include updates about market conditions, price fluctuations, government policies, or any other information that may affect the yam sellers' business.",
    "year": "2023"
  },
  {
    "number": "351",
    "text": "Use the following information to answer the question\n\nThe yam sellers in Alesinloye trading area in Kano formed an organization.\n\nWhich of the following reasons would have informed the formation of the association? To",
    "options": {
      "A": "provide warehouse facilities to producers",
      "B": "provide insurance services to members",
      "C": "advertise goods for producers",
      "D": "protect the interest of members"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68782?exam_type=waec&type=obj&page=71",
    "correct_answer": "D",
    "explanation": "Based on the information provided, the most likely reason for the formation of the organization by the yam sellers in Alesinloye trading area in Kano would be to protect the interest of its members.",
    "year": "2023"
  },
  {
    "number": "352",
    "text": "A person who carries out point-of-sales promotion is",
    "options": {
      "A": "a merchandiser",
      "B": "a retailer",
      "C": "a wholesaler",
      "D": "an agent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68783?exam_type=waec&type=obj&page=71",
    "correct_answer": "A",
    "explanation": "A person who carries out point-of-sales promotion is a merchandiser. A merchandiser is responsible for promoting and marketing products at the point of sale, typically within a retail environment. They work closely with retailers to ensure that products are displayed effectively, attractively, and prominently to maximize sales. Merchandisers may set up product displays, arrange product placements, create eye-catching signage, provide product information to customers, and implement promotional activities to drive sales at the point of sale. Their role is to enhance the visibility and appeal of products to encourage customers to make purchases.",
    "year": "2023"
  },
  {
    "number": "353",
    "text": "An organizational factor that influences a manager's decision to but raw materials from a particular source is company's",
    "options": {
      "A": "structure",
      "B": "procedure",
      "C": "reward system",
      "D": "image"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68784?exam_type=waec&type=obj&page=71",
    "correct_answer": "D",
    "explanation": "An organizational factor that influences a manager's decision to buy raw materials from a particular source is the company's image. The image of a company refers to its reputation, brand perception, and how it is viewed by customers, suppliers, and the general public. A positive company image can be a significant factor in supplier selection decisions as managers may prefer to associate their organization with reputable and reliable suppliers. A strong company image can contribute to building trust, credibility, and perceived quality, which are important considerations when choosing suppliers for raw materials.",
    "year": "2023"
  },
  {
    "number": "354",
    "text": "Which of the following factors would not be considered by a cement manufacturing firm in the choice of transportation mode for its goods?",
    "options": {
      "A": "Availability of the mode",
      "B": "Government policies",
      "C": "Quantity of the product",
      "D": "Cost of the mode"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68785?exam_type=waec&type=obj&page=71",
    "correct_answer": "C",
    "explanation": "The quantity of the product would not typically be considered by a cement manufacturing firm in the choice of transportation mode for its goods. The quantity of the product being transported is not a determining factor in selecting the mode of transportation. Instead, factors such as the cost of the mode, availability of the mode, and government policies (such as regulations or subsidies) regarding transportation modes would be more relevant considerations for the cement manufacturing firm. The firm would evaluate the cost-effectiveness of different transportation modes, the availability and reliability of those modes in meeting their shipping requirements, and any relevant government policies or regulations that may impact their choice of transportation.",
    "year": "2023"
  },
  {
    "number": "355",
    "text": "A product that is brought frequently on impulse at lower price is",
    "options": {
      "A": "convenience goods",
      "B": "speciality goods",
      "C": "unsought goods",
      "D": "industrial goods"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68787?exam_type=waec&type=obj&page=71",
    "correct_answer": "A",
    "explanation": "Convenience goods are those that the customer purchases frequently, immediately, and with minimum effort. Soaps and newspapers are considered convenience goods.",
    "year": "2023"
  },
  {
    "number": "356",
    "text": "A source of financing option available to a provision store owner is",
    "options": {
      "A": "issue of debentures",
      "B": "leasing",
      "C": "sale of shares",
      "D": "personal savings"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68789?exam_type=waec&type=obj&page=72",
    "correct_answer": "D",
    "explanation": "The source of financing options available to a provision store owner include:Personal Savings: The owner can use their personal savings to invest in or expand their provision store. This option allows them to have full control over the business without taking on any external debt or diluting ownership.Bank Loans: The provision store owner can approach a bank or financial institution to secure a loan. They can use the loan funds to meet various business needs such as purchasing inventory, expanding the store, or covering operating expenses. The terms and conditions of the loan, including interest rates and repayment terms, will depend on the store owner's creditworthiness and the policies of the lending institution.Trade Credit: The store owner can negotiate favorable credit terms with suppliers. This means that they can purchase inventory on credit and pay for it at a later date, which helps improve cash flow and working capital. Negotiating longer payment terms can provide temporary financing for the store's operations.Leasing: The provision store owner can consider leasing equipment, such as refrigerators, shelving units, or point-of-sale systems, instead of purchasing them outright. Leasing allows the owner to conserve their capital and make regular lease payments over a specified period. It can be a more cost-effective option in terms of upfront expenses.Crowdfunding: The owner can explore crowdfunding platforms where individuals contribute small amounts of money to support a business idea or venture. Crowdfunding can be an effective way to raise funds and generate interest in the provision store. However, it requires a compelling pitch and marketing effort to attract potential backers.",
    "year": "2023"
  },
  {
    "number": "357",
    "text": "Use the following information to answer this question\n\nMuyi sets up a poultry business at the outskirts of Oshogbo upon retirement from the civil service.\n\nMuyi is regarded as",
    "options": {
      "A": "a broker",
      "B": "a retailer",
      "C": "an entrepreneur",
      "D": "an agent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68791?exam_type=waec&type=obj&page=72",
    "correct_answer": "C",
    "explanation": "Based on the information provided, Muyi, who sets up a poultry business upon retirement from the civil service, can be considered an entrepreneur. An entrepreneur is an individual who takes the initiative to start and operate a new business venture, assuming the associated risks and rewards. Muyi's decision to start a poultry business demonstrates his entrepreneurial spirit and willingness to invest his time and resources in a new venture.",
    "year": "2023"
  },
  {
    "number": "358",
    "text": "Use the following information to answer this question\n\nMuyi sets up a poultry business at the outskirts of Oshogbo upon retirement from the civil service.\n\nWhich of the following factors would have influenced the choice of the location of the poultry business?",
    "options": {
      "A": "Nearness to the market",
      "B": "Nearness to financial institution",
      "C": "Government policy",
      "D": "Accessibility to good roads"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68793?exam_type=waec&type=obj&page=72",
    "correct_answer": "D",
    "explanation": "Accessibility to good roads: Muyi would want the poultry business to be located in an area with good road infrastructure. This would facilitate the transportation of poultry products to the market and ensure efficient delivery and distribution. Good roads would also make it easier for customers, suppliers, and employees to access the business.",
    "year": "2023"
  },
  {
    "number": "359",
    "text": "Sales promotion is important because it enhables a business to",
    "options": {
      "A": "create competition between different products",
      "B": "fix prices for its products and services",
      "C": "locate customers in different areas",
      "D": "stimulate demand for its products"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68794?exam_type=waec&type=obj&page=72",
    "correct_answer": "D",
    "explanation": "Sales promotion is important because it enables a business to stimulate demand for its products. Sales promotion activities are designed to attract customers, increase sales, and create interest in a company's products or services. By offering incentives, discounts, special deals, or other promotional activities, businesses can encourage customers to make purchases, try new products, or become repeat buyers. Sales promotion helps create a sense of urgency or excitement around a product, which can lead to increased customer interest and demand. Ultimately, sales promotion helps businesses generate sales, boost revenue, and build customer loyalty.",
    "year": "2023"
  },
  {
    "number": "360",
    "text": "The set of variables a confectionery company uses to execute its marketing strategy is marketing",
    "options": {
      "A": "mix",
      "B": "plan",
      "C": "policy",
      "D": "tactics"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/marketing/68795?exam_type=waec&type=obj&page=72",
    "correct_answer": "A",
    "explanation": "Marketing mix is a collection of controllable factors that can be used to influence the bahaviour of customers or consumers. The elements are: price, place, promotion or product.",
    "year": "2023"
  }
]