[
  {
    "number": "49",
    "text": "Using the diagram above as a guide, carry out the following instructions.\n\nPlace the meter rule provided on the knife edge and adjust the position until it balances horizontally.\nRead and record the balance point, G. Keep the knife edge at this point throughout the experiment.\nSuspend a mass Q= 50.0g at a point P 30cm from the 0cm end of the rule.\nOn the other side of G, suspend the mass M =30g. Adjust its position until the rule settles down horizontally as shown in the diagram above.\nRead and record the position R of M.\nRecord the distance, d, between G and R. Also read and record the distance, a, between P and G.\n Repeat the procedure for four other values of M = 40, 50, 60, and 70 with Q kept in the same position. Evaluate d\\(^{-1}\\) in each case. Tabulate your readings.\nPlot a graph of M on the vertical axis against d\\(^{-1}\\) on the horizontal axis.\nDetermine the slope,s, of the graph.\nEvaluate k = \\(\\frac{s}{Q}\\)\nState two precautions taken to ensure accurate results.\n\n(b)i. Explain the moment of a force about a point\nii. State the conditions necessary for a body to be in equilibrium when acted upon by a number of parallel end forces",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60079?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "50",
    "text": "Determine and record the approximate focal length f\\(_{o}\\) of the concave mirror provided.\nArrange the ray box, the mirror, and the screen as shown in the diagram above.\nAdjust the ray box to a distance b = 20.0cm from the mirror.\nAdjust the position of the screen until a sharp image of the cross wire of the ray box is formed on it.\nMeasure and record the distance, a, of the screen from the mirror. Evaluate \\(\\frac{a}{a}\\) =1.\nRepeat the procedure for four other values of b = 25.0, 30.0, 35.0, and 40.0cm. Tabulate your readings.\nPlot a graph of l on the vertical axis against a on the horizontal axis.\nDetermine the slope,.s, of the graph. Evaluate S\\(^{-1}\\).\nState two precautions taken to ensure accurate results.\n\n(b)i. An object is placed at a distance of 10cm in front of a concave mirror of focal length of 15cm. Determine the characteristics of the image formed.\nii. Briefly describe how you obtained f\\(_{o}\\) in (a)i) above.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60080?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "51",
    "text": "Measure and record the emf, V\\(_{o}\\) of the cell provided.\nConnect a circuit as shown in the diagram above.\nWith the key, K closed vary the rheostat, Rh to obtain a current 1 = 0.20A. Read and record the corresponding value of the potential difference, V on the voltmeter.\nEvaluate 1\\(^{-1}\\) and V\\(^{-1}\\).\nRepeat the procedure for four other values of l = 0.25, 0.30, 0.35 and 0.40 A. Tabulate your readings.\nPlot a graph V\\(^{-1}\\) on the vertical axis against 1\\(^{-1}\\) on the horizontal axis.\nDetermine the slope, s, of the graph\nEvaluate s\\(^{-1}\\).\nState two precautions taken to ensure accurate results.\n\n (b)i. Explain Ohmic conductor:\nii. Explain resistivity of the material of a wire.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60081?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  }
]