[
  {
    "number": "1",
    "text": "(a) State two uses each of specimens A (HOE) and B(PICK AXE)\n(b) Name four crops that require the use of specimen D (BUDDING KNIFE) during propagation. \n(c) Name three other tools that could serve the same purpose as specimen E (BURDIZZO). \n(d) Mention four ways of maintaining specimen A (HOE)  on the farm.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59701?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "2",
    "text": "(a) What is the aim of the experimental set-up F?\n(b) List three materials that could be used in carrying out the experiment in the set-up F.\n(c) Outline three steps invołved in carrying out the experiment.\n(d) Name four soil components observed in the experimental set-up.\n(e) Draw and label the experimental set-up.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59702?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "3",
    "text": "(a)(i) Name the toxic substance found in specimen G (FRESH CASSAVA TUBER).\n(ii) Suggest four ways of removing the toxic substance named in (a)(i).\n(b) State two uses each of specimens I (ONION BULBS) and J (PEPPER FRUITS).\n(c) List four pests of specimen I.\n(d) Name two groups of crops to which specimens I and J belong based on their uses.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59703?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "4",
    "text": "(a) Give three reasons for stocking K (TILAPIA) and L (CATFISH) together in a pond.\n(b) List four fishing gears used for harvesting specimens K and L in a pond.\n(c) Name four products that could be made from specimen M(MILK).\n(d) State four reasons for adding specimen N (LIME)  to the pond in which specimens K and L are stocked.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59704?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  }
]