[
  {
    "number": "2000",
    "text": "Which of the following organisms contains Chlorophyll in its cells?",
    "options": {
      "A": "Caterpillar",
      "B": "Paramecium",
      "C": "Euglena",
      "D": "Grasshopper"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71838?exam_type=waec&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "Some species of Euglena have chlorophyll. Chlorophyll is found in the chloroplasts of Euglena, which are organelles that perform photosynthesis. Euglena are unicellular organisms that can be photosynthetic or heterotrophic. When there is enough sunlight, Euglena use chlorophyll a and b to produce sugars through photosynthesis.",
    "year": "2024"
  },
  {
    "number": "2001",
    "text": "Species are groups of organisms that",
    "options": {
      "A": "are of common origin but cannot interbreed freely",
      "C": "have similar features and can interbreed freely",
      "D": "resemble each other and occupy different niches"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71840?exam_type=waec&type=obj&page=401",
    "correct_answer": "C",
    "explanation": "A specie is a group of organisms that can interbreed and produce fertile offspring. Species are the most basic unit of biological classification.",
    "year": "2024"
  },
  {
    "number": "2002",
    "text": "A plant with short, vertical underground stem is a",
    "options": {
      "A": "bulb",
      "B": "corm",
      "C": "rhizome",
      "D": "tuber"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71863?exam_type=waec&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "A corm is a short, vertical, swollen underground stem of a plant that acts as a storage organ for food, typically starches, allowing the plant to survive through unfavorable conditions like winter or drought; essentially, it's a solid, fleshy bulb-like structure that differs from a true bulb by lacking layered scales and being entirely solid tissue inside; common examples of plants that grow from corms include crocus, gladiolus, and freesia.",
    "year": "2024"
  },
  {
    "number": "2003",
    "text": "The diagram above is an illustration of a reproductive process in an organism. Study it and answer ques tions 4 and 5.\nThe type of reproduction illustrated is",
    "options": {
      "A": "budding",
      "B": "binary fission",
      "C": "grafting",
      "D": "vegetative propagation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71865?exam_type=waec&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "The type of reproduction illustrated is binary fission.Binary fission is a type of asexual reproduction where a cell splits into two identical daughter cells. It's the primary method of reproduction for prokaryotic organisms like bacteria and archaea.",
    "year": "2024"
  },
  {
    "number": "2004",
    "text": "The illustrated organism is capable of reproducing by",
    "options": {
      "A": "sexual means only",
      "B": "asexual means only",
      "C": "vegetative propagation only",
      "D": "sexual and asexual means"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71867?exam_type=waec&type=obj&page=401",
    "correct_answer": "D",
    "explanation": "The illustrated organism is paramecium.Paramecium primarily reproduces asexually through a process called binary fission, where a single cell splits into two identical daughter cells; however, they can also reproduce sexually through a process called conjugation under certain conditions.",
    "year": "2024"
  },
  {
    "number": "2005",
    "text": "Which of the following organisms consists of unicellular cells joined to form a filament?",
    "options": {
      "A": "Amoeba",
      "B": "Spirogyra",
      "C": "Euglena",
      "D": "Chlamydomonas"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71869?exam_type=waec&type=obj&page=401",
    "correct_answer": "B",
    "explanation": "Spirogyra cells join together to form filaments. Spirogyra is a green algae that forms long, unbranched filaments. The filaments are made up of many cylindrical cells that are connected end-to-end. Spirogyra are unicellular organisms thatconnect to form multicellular filaments. To become long filaments, single spirogyra cells link together, end-to-end, forming strands up to several centimeters in length.",
    "year": "2024"
  },
  {
    "number": "2006",
    "text": "The structure in the cell that controls the movement of substances in and out of the cell is the",
    "options": {
      "A": "cytoplasmic membrane",
      "B": "nuclear membrane",
      "C": "protoplasm",
      "D": "endoplasm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71871?exam_type=waec&type=obj&page=402",
    "correct_answer": "A",
    "explanation": "The cell membrane, also known as the plasma membrane, controls the movement of substances in and out of a cell. \"cytoplasmic membrane\" is the same as \"cell membrane\"; they are both terms used to describe the outer boundary of a cell that separates the cell's interior from the external environment, and it's also sometimes called the \"plasma membrane\".\nThe cell membrane is a semipermeable lipid bilayer that surrounds the cell.It separates the inside of the cell from the outside environment.The cell membrane is selectively permeable, meaning it allows some substances to pass through but not others.The cell membrane regulates the transport of materials entering and exiting the cell.",
    "year": "2024"
  },
  {
    "number": "2007",
    "text": "The bursting of a red blood cell placed  in a hypotonic solution is called",
    "options": {
      "A": "crenation",
      "B": "haemolysis",
      "C": "plasmolysis",
      "D": "cytolysis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71873?exam_type=waec&type=obj&page=402",
    "correct_answer": "B",
    "explanation": "The bursting of a red blood cell placed in a hypotonic solution is called haemolysis.\nA hypotonic solution has a lower solute concentration than the cell's contents. When a red blood cell is placed in a hypotonic solution, water moves into the cell.This causes the cell to swell and eventually burst.The process of a cell swelling and bursting is called haemolysis.\nIsotonic: An environment where the flow of water in and out of a cell is equal.Osmosis: The movement of water across a semipermeable membrane. Osmosis is important in maintaining homeostasis, which is the tendency of systems toward a relatively stable dynamic equilibrium.\nCrenation: The process of a red blood cell shrinking in size when placed in a hypertonic solution.",
    "year": "2024"
  },
  {
    "number": "2008",
    "text": "The function of the root hair in plants is to",
    "options": {
      "A": "absorb soil water by the process of osmosis.",
      "B": "excrete water and mineral salts by simple diffusion.",
      "C": "purify the soil for the plant.",
      "D": "translocate manufactured food."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71876?exam_type=waec&type=obj&page=402",
    "correct_answer": "A",
    "explanation": "Root hairs in plants absorb water and nutrients from the soil and anchor the plant in the soil. Root hairs are threadlike cells that grow between soil particles. They increase the surface area of the root, allowing it to absorb more water.",
    "year": "2024"
  },
  {
    "number": "2009",
    "text": "If a germinating seed is attached horizontally to a revolving klinostat, what would be the effect on the seedling after three days? The",
    "options": {
      "A": "plumule will curve vertically upward while the radicle will not show any curvature",
      "B": "radicle will curve towards the ground while the plumule will not show any curvature.",
      "C": "plumule and radicle will not show any curvature.",
      "D": "plumule will curve vertically upwards while the radicle will curve towards the ground"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71878?exam_type=waec&type=obj&page=402",
    "correct_answer": "C",
    "explanation": "If a germinating seed is attached horizontally to a revolving klinostat, the seedling will grow in a random or unpredictable direction, rather than the upward direction towards light (phototropism) or downward direction towards gravity (geotropism). This is because the klinostat constantly rotates, eliminating any consistent gravitational or light direction. As a result, the seedling's growth will not be influenced by these environmental cues, leading to a more disordered growth pattern, making the plumule and the radicle not showing any curvature.",
    "year": "2024"
  },
  {
    "number": "2010",
    "text": "The lumbar vertebra differs from the thoracic vertebra because it possesses a",
    "options": {
      "A": "longer neural spine.",
      "B": "wider neural canal.",
      "C": "thicker centrum.",
      "D": "shorter transverse process."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71880?exam_type=waec&type=obj&page=402",
    "correct_answer": "C",
    "explanation": "The correct answer is C. Thicker centrum.\nLumbar vertebrae have several distinct features that differentiate them from thoracic vertebrae. Some of these features include:\n- Thicker and more robust centrum (vertebral body)\n- Shorter and more sturdy transverse processes\n- No costal facets (since lumbar vertebrae do not articulate with ribs)\n- Larger and more triangular vertebral foramen\nIn contrast, thoracic vertebrae typically have:\n- Longer and thinner transverse processes\n- Costal facets for articulation with ribs\n- Smaller vertebral foramen\nSo, while options A and D are partially correct, the most distinctive feature of lumbar vertebrae is theirthicker centrum.",
    "year": "2024"
  },
  {
    "number": "2011",
    "text": "Which of the following blood vessels carries oxygenated blood into the heart?",
    "options": {
      "A": "Pulmonary artery",
      "B": "Anterior vena cava",
      "C": "Pulmonary vein",
      "D": "Posterior vena cava"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71881?exam_type=waec&type=obj&page=403",
    "correct_answer": "C",
    "explanation": "The pulmonary veins carry oxygenated blood from the lungs to the left atrium of the heart. All veins carries deoxygenated blood except pulmonary vein which carries oxygenated blood to the heart.\nConversely, all arteries carry oxygenated blood except the pulmonary artery that carries deoxygenated blood.",
    "year": "2024"
  },
  {
    "number": "2012",
    "text": "Filtrates in the Bowman's capsule contain vitamins because",
    "options": {
      "A": "they have low molecular weight.",
      "B": "most of them are fat soluble.",
      "C": "they cannot be reabsorbed into the blood.",
      "D": "little amount is required by the blood."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71883?exam_type=waec&type=obj&page=403",
    "correct_answer": "A",
    "explanation": "Filtrates in the Bowman's capsule contain vitamins becausethe filtration process in the kidney allows small moleculeslike vitamins to pass through from the blood into the Bowman's capsule, while larger molecules like proteins are retained in the bloodstream; essentially, the filtrate is composed of blood plasma minus the large proteins, which means it includes most of the small molecules present in the blood, including vitamins.",
    "year": "2024"
  },
  {
    "number": "2013",
    "text": "The structures that contain grey matter and white matter are found in the",
    "options": {
      "A": "reproductive system.",
      "B": "nervous system.",
      "C": "respiratory system.",
      "D": "digestive system."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71884?exam_type=waec&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "The brain and spinal cord contain gray matter and white matter. The two make up the CNS. In the spinal cord, white matter sits external to the gray matter, while it lies deeper to the gray matter of the cerebral cortex, the outer layer of the brain.",
    "year": "2024"
  },
  {
    "number": "2014",
    "text": "The diagram above is an illustration of sense organ in humans. Study it and answer questions 15 and 16. \nThe part that protects the organ is labelled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71887?exam_type=waec&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "The parts labelled are:\nI - IRIS\nII - EYE LASHES\nIII - PUPIL\nIV - SCLERA\nThe sclera, cornea, eyelids, eyelashes, and bony orbit all protect the eye from injury.\nSclera - labelled IV\nThe tough, white, fibrous tissue that surrounds the eyeballHelps maintain the eye's shapeProtects the eye from injuryExtends from the cornea to the optic nerve at the back of the eye\nCornea\nThe clear, curved layer in front of the iris and pupilProtects the front of the eyeHelps focus light on the retina at the back of the eye\nEyelids\nThin flaps of skin and muscle that can cover the eyeReflexively close quickly (blink) to protect the eye from foreign objects, wind, dust, insects, and very bright light\nEyelashes - labelled II\nShort, tough hairs that grow from the edge of the eyelidKeep insects and foreign particles away from the eye",
    "year": "2024"
  },
  {
    "number": "2015",
    "text": "The part labelled III is the",
    "options": {
      "A": "iris.",
      "B": "pupil",
      "C": "sclera",
      "D": "cornea"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71891?exam_type=waec&type=obj&page=403",
    "correct_answer": "B",
    "explanation": "The parts labelled are:\nI - Iris\nII - Eye lashes\nIII - Pupil\nIV - Sclera",
    "year": "2024"
  },
  {
    "number": "2016",
    "text": "The diagram above is an illustration of two plants P and Q. Arrows I, II and III illustrate the transfer of pollen grains among flowers of plants P and  Q. Studly it and answer questions 17 and 18.\n\nThe types of pollination illustrated as I,Il and III, respectively are",
    "options": {
      "A": "cross, self and cross",
      "B": "self, self and cross",
      "C": "self, cross and self",
      "D": "self, cross and cross"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71892?exam_type=waec&type=obj&page=404",
    "correct_answer": "B",
    "explanation": "I - Self pollination\nII - Self pollination\nIII - Cross pollination\nSelf-pollination occurs when pollen grains are transferred from anther to the stigma within the same flower(as seen in I) or plant(as seen in II), while cross-pollination occurs when pollen grains are transferred from the anther of a plant to the stigma of another plant of the same species(as seen in III).",
    "year": "2024"
  },
  {
    "number": "2017",
    "text": "The condition necessary for reproduction to occur between plants P and Q after pollination is that plants P and Q should be",
    "options": {
      "A": "of the same species.",
      "B": "brightly coloured.",
      "C": "well scented",
      "D": "of different species."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71893?exam_type=waec&type=obj&page=404",
    "correct_answer": "A",
    "explanation": "The condition necessary for reproduction to occur between plants P and Q after pollination is that plants P and Q must be of the same species.",
    "year": "2024"
  },
  {
    "number": "2018",
    "text": "The diagram above illustrates a dry dehiscent fruit. Use it to answer questions 19 and 20. \nThe agent of dispersal of the fruit is",
    "options": {
      "A": "animal",
      "B": "explosive mechanism",
      "C": "water",
      "D": "wind"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71894?exam_type=waec&type=obj&page=404",
    "correct_answer": "D",
    "explanation": "The dehiscent fruit is the Tridax. The Tridax procumbens plant's seeds are dispersed by thewindbecause they have a pappus, which is a feathery appendage. The pappus's adhesion power allows the seeds to cling to the hairs of animals or clothing.",
    "year": "2024"
  },
  {
    "number": "2019",
    "text": "The Parachute-like tuft of hairs developed from the",
    "options": {
      "A": "pedicel",
      "B": "petals",
      "C": "receptacle",
      "D": "sepals"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71895?exam_type=waec&type=obj&page=404",
    "correct_answer": "D",
    "explanation": "The parachute-like tuft of hairs found in Tridax develops from the calyx (modified sepals).",
    "year": "2024"
  },
  {
    "number": "2020",
    "text": "Which of the following events does not occur in the light reaction stage of photosynthesis?",
    "options": {
      "A": "Chlorophyll absorbs sunlight",
      "B": "Carbon (IV) oxide combines with hydrogen",
      "C": "Photolysis of water occurs",
      "D": "Hydroxyl ions are produced"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71896?exam_type=waec&type=obj&page=404",
    "correct_answer": "B",
    "explanation": "In the light stage of photosynthesis, the key events include: chlorophyll absorbing light energy, excited electrons being transferred through electron transport chains, water splitting to release oxygen, and the generation of ATP and NADPH molecules using the captured energy from light; all of these processes occur within the thylakoid membranes of chloroplasts. However, Carbon(IV) oxide does not combine with hydrogen in the light stage.",
    "year": "2024"
  },
  {
    "number": "2021",
    "text": "The rate of photosynthesis decreases in a wilted herbaceous plant because the",
    "options": {
      "A": "enzymes in the leaf were denatured",
      "B": "chlorophyll in the leaves was not broken down",
      "C": "amount of light reaching the plant was reduced",
      "D": "amount of carbon dioxide entering the leaf decrease."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71897?exam_type=waec&type=obj&page=405",
    "correct_answer": "D",
    "explanation": "Wilting occurs when a plant loses more water through transpiration than it absorbs from the soil.To prevent further water loss, the stomata on the leaves close. When the stomata are closed,CO\\(_2\\) can't enter the leaf. CO\\(_2\\) is essential for photosynthesis, which produces glucose and oxygen.\nThe rate of photosynthesis decreases in a wilted herbaceous plant because the stomata close, preventing carbon dioxide (CO\\(_2\\)) from entering the leaf.",
    "year": "2024"
  },
  {
    "number": "2022",
    "text": "The element required for chlorophyll formation in plants is",
    "options": {
      "A": "Iron",
      "B": "Calcium",
      "C": "Phosphorus",
      "D": "Sulphur"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71898?exam_type=waec&type=obj&page=405",
    "correct_answer": "A",
    "explanation": "The elements needed for chlorophyll formation in plants are iron, magnesium, and nitrogen.\nExplanation\nIron: Helps synthesize chlorophyll and maintains the structure of chloroplasts, which contain chlorophyllMagnesium: An essential component of chlorophyll, which is a vital pigment for photosynthesisNitrogen: Helps plants produce chlorophyll\nChlorophyll is a green pigment found in the chloroplasts of plants and algae. It's essential for photosynthesis, which is the process by which plants convert light energy, carbon dioxide, and water into sugar and oxygen.",
    "year": "2024"
  },
  {
    "number": "2023",
    "text": "The process of food digestion in mammals would",
    "options": {
      "A": "make energy immediately available to the body",
      "B": "promote growth and repair of tissues",
      "C": "provide sufficient food materials within the body",
      "D": "render food substances soluble and absorbable"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71899?exam_type=waec&type=obj&page=405",
    "correct_answer": "D",
    "explanation": "Digestion in mammals breaks down food into nutrients that the body uses for energy, growth, and repair.\nHow digestion works\nIngestion: Food is taken in.Mastication: Food is chewed and mixed with saliva.Secretion: Digestive juices are released into the digestive tract.Digestion: Food is broken down into smaller molecules.Absorption: Nutrients, water, vitamins, and electrolytes are absorbed into the bloodstream.Evacuation: Waste products are eliminated.",
    "year": "2024"
  },
  {
    "number": "2024",
    "text": "Which of the following food substances would give a negative reaction with Benedict's reagent?",
    "options": {
      "A": "Fructose",
      "B": "Glucose",
      "C": "Galactose",
      "D": "Sucrose"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71900?exam_type=waec&type=obj&page=405",
    "correct_answer": "D",
    "explanation": "Benedict's reagent is used to test for the presence of reducing sugars in a sample, like glucose, by changing colour from blue to green, yellow, orange, or red depending on the concentration of the sugar present; a positive result indicates the presence of a reducing sugar and is shown by a brick-red precipitate forming. Fructose, glucose and galactose are reducing sugar but sucrose is a non-reducing sugar.",
    "year": "2024"
  },
  {
    "number": "2025",
    "text": "Sunlight is the major source of",
    "options": {
      "A": "Vitamin D",
      "B": "vitamin C",
      "C": "vitamin B",
      "D": "vitamin A"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71901?exam_type=waec&type=obj&page=405",
    "correct_answer": "A",
    "explanation": "Sunlight is the primary source of light and heat on Earth. It's also a major source of energy,vitamin D,and contributes to climate and weather patterns.",
    "year": "2024"
  },
  {
    "number": "2026",
    "text": "Discouraging the use of poison to kill fish in a large water body is a way of",
    "options": {
      "A": "impoverishing the people.",
      "B": "conserving the fish species.",
      "C": "allowing the fittest organism to survive",
      "D": "making the fish adapt to their environment"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71902?exam_type=waec&type=obj&page=406",
    "correct_answer": "B",
    "explanation": "Discouraging the use of poison to kill fish in a large water body is a way of conserving the fish species. Poisons can be used in water bodies to control fish populations, but they can also contaminate water and harm aquatic life.",
    "year": "2024"
  },
  {
    "number": "2027",
    "text": "The pathway through which nutrient are replenished and circulated in an ecosystem is called a",
    "options": {
      "A": "cycle",
      "B": "pyramid of energy",
      "C": "pyramid of numbers",
      "D": "Food chain"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71903?exam_type=waec&type=obj&page=406",
    "correct_answer": "A",
    "explanation": "The pathway through which nutrients are replenished and circulated in an ecosystem is called abiogeochemical cycle. Biogeochemical cycles are also known asnutrient cycles.They describe how chemical elements move through the atmosphere, soil, rocks, water, and organisms.",
    "year": "2024"
  },
  {
    "number": "2028",
    "text": "The illustration below is a food chain. Study it and answer questions 29 and 30.\n             Grasses → Grasshoppers → Lizards → Hawks\nWhich of the following statements is not correct about the food chain? The number of",
    "options": {
      "A": "grasses eaten by grasshoppers is greater than the number of grasshoppers.",
      "B": "grasses eaten by grasshoppers is fewer than the number of grasshoppers.",
      "C": "grasshoppers eaten by lizards is greater than the number\nof lizards.",
      "D": "lizards eaten by hawks is greater than the number of hawks."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71904?exam_type=waec&type=obj&page=406",
    "correct_answer": "B",
    "explanation": "In a food chain, energy is transferred from one trophic level to the next, with each level typically having fewer individual than the previous ones.In a food chain, producers have more energy than primary consumers. Producers are the first level in a food chain, and they produce their own food using energy from the sun. Primary consumers are the next level up in the food chain, and they eat the producers.",
    "year": "2024"
  },
  {
    "number": "2029",
    "text": "Grasses → Grasshoppers → Lizards  → Hawks\nIf the individual species of organisms in the food chain are counted and arranged as a pyramid, the result would be a pyramid of",
    "options": {
      "A": "numbers",
      "B": "energy",
      "C": "biomass",
      "D": "biomes"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71905?exam_type=waec&type=obj&page=406",
    "correct_answer": "A",
    "explanation": "A pyramid of numbers is a diagram that shows the number of organisms at each level of a food chain. It's a bar chart with stacked bars, where the width of each bar represents the number of organisms. Pyramids of number show the number of organisms at each stage in a food chain. Pyramids of biomass show the mass of organisms at each stage in a food chain.",
    "year": "2024"
  },
  {
    "number": "2030",
    "text": "Which of the following gases is released during the decomposition of organic matter?",
    "options": {
      "A": "Carbon(II) oxide",
      "B": "Sulphur (IV) oxide",
      "C": "Hydrogen Sulphide",
      "D": "Nitrous oxide"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71906?exam_type=waec&type=obj&page=406",
    "correct_answer": "C",
    "explanation": "The primary gas released during the decomposition of organic matter is carbon dioxide (CO\\(_2\\))\nWhen organic matter decomposes, the primary gases released are carbon dioxide(CO\\(_2\\))  and methane (CH\\(_4\\)), with carbon dioxide being produced in both aerobic (with oxygen) and anaerobic (without oxygen) conditions, while methane is primarily produced in anaerobic environments like landfills.\nOther gases that may be released during decomposition include:\nHydrogen sulfide (H2S):This gas has a strong, rotten egg smell and is produced in anaerobic conditions.Nitrogen gas (N2):Released as a byproduct of the breakdown of organic nitrogen compounds.",
    "year": "2024"
  },
  {
    "number": "2031",
    "text": "The diagrams above are the illustrations of organisms from different habitat. Study them and answer questions 32 and 33.\nThe structures labelled I are for",
    "options": {
      "A": "Camouflage",
      "B": "Chemical offence",
      "C": "Physical defence",
      "D": "Mimicry"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71907?exam_type=waec&type=obj&page=407",
    "correct_answer": "C",
    "explanation": "The shell of snail and the spines of a cactus both serve as physical defenses. The shell of the snail protects it from predators and physical harm in the environment while the spine of the cactus prevents water loss and also prevent the cactus from being eaten by herbivores.",
    "year": "2024"
  },
  {
    "number": "2032",
    "text": "Habitats of the organisms respectively are",
    "options": {
      "A": "river and stream",
      "B": "rainforest and stream",
      "C": "pond and leaf litter",
      "D": "garden and desert"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71908?exam_type=waec&type=obj&page=407",
    "correct_answer": "D",
    "explanation": "Snails live all over the world in soil (or dirt),sand, trees, under rocks or leaves, and in the rivers, lakes, and oceans. Land snails cannot breathe under water so they must come out when too much water enters their habitat to avoid drowning. The habitat of the cactus plant isdry, arid deserts. Most plants would die in the intense heat and sunlight that are present here, but cacti have adaptations that allow them to thrive.",
    "year": "2024"
  },
  {
    "number": "2033",
    "text": "An environmental problem caused by Sulphur (IV) oxide is",
    "options": {
      "A": "acid rain",
      "B": "deforestation",
      "C": "global warming",
      "D": "Erosion"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71909?exam_type=waec&type=obj&page=407",
    "correct_answer": "A",
    "explanation": "Sulphur dioxide SO\\(_2\\) can cause many environmental problems, includingacid rain, smog, and damage to plants. When SO\\(_2\\) combines with water and air, it forms sulfuric acid, which is the main component of acid rain. Acid rain damages plants and trees, and can kill fish and other aquatic specie.",
    "year": "2024"
  },
  {
    "number": "2034",
    "text": "The phenomenon by which a farmland that is left to fallow for several years develops into a forest is called",
    "options": {
      "A": "Succession",
      "B": "afforestation",
      "C": "population",
      "D": "colonization"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71910?exam_type=waec&type=obj&page=407",
    "correct_answer": "A",
    "explanation": "The process by which a fallow farm field develops into a forest is called ecological succession. This is when natural communities replace one another over time. In ecological succession, an abandoned farm field will first become a meadow, then bushes, and eventually a forest. This process can take many years.",
    "year": "2024"
  },
  {
    "number": "2035",
    "text": "A farmer planted many seeds on a small piece of land. The plants that germinated are as shown above.\nWhich of the following effects would not be observed among the population of the plants?",
    "options": {
      "A": "Rise in disease condition",
      "B": "Death",
      "C": "Mutualistic relationship",
      "D": "Competition"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71912?exam_type=waec&type=obj&page=407",
    "correct_answer": "C",
    "explanation": "Overpopulation would definitely leads to rise in disease condition, death and competition among the organisms but there won't be any mutualistic relationship.",
    "year": "2024"
  },
  {
    "number": "2036",
    "text": "The bar chart above shows the data of sources of energy used for cooking in a community. Study it and answer questions 37 and 38.\nThe source of energy that is mostly used in the community is",
    "options": {
      "A": "solar",
      "B": "Kerosene",
      "C": "coal",
      "D": "wind"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71914?exam_type=waec&type=obj&page=408",
    "correct_answer": "B",
    "explanation": "Kerosene has the longest bar, showing the highest number of households.",
    "year": "2024"
  },
  {
    "number": "2037",
    "text": "The two sources of energy that would mostly lead to pollution in the community are",
    "options": {
      "A": "solar and kerosene",
      "B": "coal and wind",
      "C": "kerosene and coal",
      "D": "solar and wind"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71915?exam_type=waec&type=obj&page=408",
    "correct_answer": "C",
    "explanation": "Burning kerosene and coal can cause significant air and water pollution, as well as climate change. Burning kerosene releases carbon dioxide (CO2), particulate matter, nitrogen oxides (NOx), and sulfur oxides (SOx). These emissions contribute to climate change and degrade air quality. Also, burning coal releases harmful air pollutants, including benzene, formaldehyde, and carbon monoxide.",
    "year": "2024"
  },
  {
    "number": "2038",
    "text": "An individual found a strange bird that is tagged as an endangered specie. What should the individual do?",
    "options": {
      "A": "Kill it",
      "B": "Take it to an aquatic environment",
      "C": "Return it to its natural habitat",
      "D": "Sell it at a very high price"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71916?exam_type=waec&type=obj&page=408",
    "correct_answer": "C",
    "explanation": "The individual should return the endangered bird to its natural habitat, which will ensure conservation and in turn restore population ans preserve ecosystem balance, so the specie doesn't go into extinction.",
    "year": "2024"
  },
  {
    "number": "2039",
    "text": "Which of the following traits is not inheritable? Ability to",
    "options": {
      "A": "taste P.T.C",
      "B": "roll the tongue",
      "C": "move the ear",
      "D": "roll the eyeball"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71918?exam_type=waec&type=obj&page=408",
    "correct_answer": "D",
    "explanation": "Simply \"rolling the eyeball\" as a conscious gesture isnot considered an inheritable trait, as it's primarily alearned behaviourand not directly coded in our genes; however, certain involuntary eye movements like \"nystagmus\" can be genetic and manifest as eye rolling in some situations, meaning there could be a hereditary component in specific cases related to eye movement.",
    "year": "2024"
  },
  {
    "number": "2040",
    "text": "Which of the following statements is correct about the ABO blood group system?",
    "options": {
      "A": "Antigens are located on the surface of white blood cells",
      "B": "Antibodies are located in the blood plasma",
      "C": "Antibodies are located on the surface of the red blood cells",
      "D": "Antigens are located in the blood plasma"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71919?exam_type=waec&type=obj&page=408",
    "correct_answer": "B",
    "explanation": "In the ABO blood group system, antibodies are located in the plasma, which is the liquid part of blood.\nThe ABO blood group system is based on the presence of antigens and antibodies in the blood.Antigens areprotein molecules on thesurface of red blood cells.Antibodiesare proteins in theplasmathat recognize foreign substances.",
    "year": "2024"
  },
  {
    "number": "2041",
    "text": "A woman with blood group A gives birth to a child with blood group O. Which of the following blood groups cannot belong to the father?",
    "options": {
      "A": "B",
      "B": "A",
      "C": "AB",
      "D": "O"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71920?exam_type=waec&type=obj&page=409",
    "correct_answer": "C",
    "explanation": "A woman with blood group A and a man with blood group AB can never produce a child with blood group O. Blood group A could either be from AA homozygous or AO heterozygous.",
    "year": "2024"
  },
  {
    "number": "2042",
    "text": "The diagram above is an illustration of genetic cross between two parents. The parental gametes I, II, III and IV gave rise to the offspring below. Study it and answer questions 43 and 44.\nGametes I, II, III and IV, respectively are",
    "options": {
      "A": "T,T,T and t",
      "B": "T, t, t, and t",
      "C": "T, T, t and t",
      "D": "T, t, T and t"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71922?exam_type=waec&type=obj&page=409",
    "correct_answer": "B",
    "explanation": "First try to retrace the offspring back to get the gametes. What we got were T, t, t, and t\n(See diagram above.)",
    "year": "2024"
  },
  {
    "number": "2043",
    "text": "Which of the following statements is correct about the cross?",
    "options": {
      "A": "Both parents are heterozygous",
      "B": "The male is not heterozygous",
      "C": "The female is homozygous",
      "D": "Both parents are homozygous"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71923?exam_type=waec&type=obj&page=409",
    "correct_answer": "C",
    "explanation": "From the diagram, the first organism(most likely to be the male parent) is heterozygous (Tt) while the second parent(most likely to be the female parent) is homozygous (tt).",
    "year": "2024"
  },
  {
    "number": "2044",
    "text": "The physical appearance of an organism is described as its",
    "options": {
      "A": "phenotype",
      "B": "genotype",
      "C": "allele",
      "D": "chromosome"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71924?exam_type=waec&type=obj&page=409",
    "correct_answer": "A",
    "explanation": "The physical appearance of an organism is described as its phenotype. A phenotype refers to the observable characteristics of an organism, including its physical traits, which are determined by its genotype (genetic makeup) and can be influenced by environmental factors.\nGenotype is the genetic makeup of an organism or person, which is determined by their DNA sequence. It can also refer to the alleles, or variant forms of a gene, that an organism has.",
    "year": "2024"
  },
  {
    "number": "2045",
    "text": "Mutation leads to evolution because it",
    "options": {
      "A": "kills all organisms where it has occurred.",
      "B": "gives rise to offspring having same characteristics as the parents",
      "C": "does not confer adaptability to the offspring",
      "D": "gives rise to new individuals that differ from their parents"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71925?exam_type=waec&type=obj&page=409",
    "correct_answer": "D",
    "explanation": "Mutation leads to evolution by introducing genetic variations within a population, which natural selection can then act upon, favouring individuals with advantageous mutations that allow them to survive and reproduce more successfully, thus passing on those beneficial traits to future generations, gradually changing the characteristics of the population over time and leading to evolution; essentially, mutations are the raw material for evolution, providing the diversity needed for natural selection to operate.",
    "year": "2024"
  },
  {
    "number": "2046",
    "text": "The male and female gametes which bear genes for inheritance in plants are located in the",
    "options": {
      "A": "anthers and petals",
      "B": "sepals and petals",
      "C": "stamens and pistils",
      "D": "stamens and petals"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71927?exam_type=waec&type=obj&page=410",
    "correct_answer": "C",
    "explanation": "In flowering plants, male gametes are in the anthers and female gametes are in the ovules.\nMale gametesLocated in pollen grainsProduced in the anthers of the flowerPart of thestamen, the male structure of the flowerFemale gametesLocated in ovulesProduced in the ovary of the flowerPart of thepistil, the female structure of the flower",
    "year": "2024"
  },
  {
    "number": "2047",
    "text": "Which type of breeding is represented by industrial melanism in peppered moths?",
    "options": {
      "A": "Artificial selection",
      "B": "Natural selection",
      "C": "Inbreeding",
      "D": "Outbreeding"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71933?exam_type=waec&type=obj&page=410",
    "correct_answer": "B",
    "explanation": "Industrial melanism in peppered moths is an example of evolution by natural selection. It occurred when the colour of the peppered moth population changed in response to air pollution from coal-burning factories during the Industrial Revolution.\nThe common pale form of the peppered moth was replaced by a previously unknown black form. The dark moths were better able to blend in with the darkened bark of trees, while the pale moths were more visible to predators. The dark form became more common, and in some areas of England, the original pale form was almost lost by the end of the 19th century.",
    "year": "2024"
  },
  {
    "number": "2048",
    "text": "In a test, a student paired some scientists with their famous work as shown below. Use it to answer questions 49 and 50.\n      Scientist                Famous work\nI.  Charles Darwin →  Preservation of some food with heat\nII. Gregor Mendel →  Natural selection\nIII. Jean Baptiste Lamarck → Inheritance of acquired characteristics\nIV. Louis Pasteur → Independent assortment of genes.\nThe Scientists that are not correctly paired with their famous work are",
    "options": {
      "A": "I and II only",
      "B": "II and III only",
      "C": "I, II and IV.",
      "D": "II, III and IV."
    },
    "answer_url": "https://myschool.ng/classroom/biology/71938?exam_type=waec&type=obj&page=410",
    "correct_answer": "C",
    "explanation": "The matching of Charles Darwin →  Preservation of some food with heat, Gregor Mendel →  Natural selection and Louis Pasteur → Independent assortment of genes, were wrong but the only correct matching was Jean Baptiste Lamarck → Inheritance of acquired characteristics",
    "year": "2024"
  },
  {
    "number": "2049",
    "text": "Which of the scientists were involved in the study of evolution?\nScientist                Famous work\nI.  Charles Darwin →  Preservation of some food with heat\nII. Gregor Mendel →  Natural selection\nIII. Jean Baptiste Lamarck → Inheritance of acquired characteristics\nIV. Louis Pasteur → Independent assortment of genes.",
    "options": {
      "A": "I and III",
      "B": "II and III",
      "C": "I, II and IV",
      "D": "II. III and IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/71944?exam_type=waec&type=obj&page=410",
    "correct_answer": "A",
    "explanation": "Scientist                Famous work\nI.Charles Darwin →  Natural selection\nIII.Jean Baptiste Lamarck → Inheritance of acquired characteristics",
    "year": "2024"
  }
]