[
  {
    "number": "91",
    "text": "The government of your country has recently introduced a new means of communication which has had many positive effects on the lives of the majority of the people. Write a letter to your brother who is away from the country, stating how it has affected the lives of your people.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51205?exam_type=waec&type=theory&page=19",
    "correct_answer": "12, Bello Sola Street,Off Aguda Lane,ljullshaga.Lagos. 22 May, 2006.\nDear Sumonu,\nCompliment of the season. I hope you are doing fine. And how's your work, have you been moved to the company's Essex office as you wrote to tell us last month? We are all fine here in Nigeria. it is just that the economic situation in the country is not improving appreciably. Baba will be celebrating his Iwuye soon. we all hope you will come home then.Sumonu, do you know that there has been a major reform in the telecommunications industry since the last time you visited the country. Just recently. the government gave licences to private investors to operate the Global System of Mobile Telecommunications, otherwise called GSM, in the country. With this introduction, communication has been made very easy. People can make and receive calls anywhere and at any time with their mobile phones. This change has brought about positive effects in the lives of the majority of the people. You need to be here to see what I'm talking about.First, the cost of doing business in the country has been drastically reduced. People no longer pay exhorbitant fees to acquire a telephone line as was the case when NITEL was the only telecommunications service provider. As a result, prices of goods have gone down.Secondly, the introduction of GSM services has reduced the crime rate in the country. Unlike before, people can easily call in security operatives, particularly the police. in an emergency situation as they now have access to phones; do you know that carpenters, shoemakers, tailors, now carry about GSM phones. This discourages crimes such as burglary and robbery as the criminals know that they can easily be caught if a victim or his neighbour calls in the police using their mobile phones.The introduction of GSM has also reduced the rate of accidents on our roads, since people travel less. Before the introduction of GSM, people were forced to travel often, when a phone call could have taken care of or prevent such journeys, because they have no access to telephone. But now that GSM is readily available and relatively affordable, people find it easier to conduct their businesses, both private and official, on the phone and travel only when it is absolutely necessary.GSM has also increased the knowledge base of the majority of the people. Most Nigerians are now better informed about local and international events, especially government policies, as news items and information are easily disseminated through the SMS (short message service) services provided, by the GSM operators. Thus, the mobile phone owner can get news items at minimal cost on his phone at any time of the day or night. Also, the introduction of GSM has greatly reduced the financial strain on many families who have relations abroad, as they can easily and speedily get in touch with those relations when they are in need of money. There are so men other. positive effects of the GSM but which I will not be able to enumerate here. Sumonu, I hope you will take advantage of this new technology by sending money to our parents to get their own GSM, so that we can easily and often communicate with you. I am sure with the GSM, even this letter I am writing would have been unnecessary.Please extend my greetings to Bola and Bimbo. they must both be big now. I hope to hear from you soon.Yours sincerely,Gbenga",
    "explanation": "12, Bello Sola Street,Off Aguda Lane,ljullshaga.Lagos. 22 May, 2006.\nDear Sumonu,\nCompliment of the season. I hope you are doing fine. And how's your work, have you been moved to the company's Essex office as you wrote to tell us last month? We are all fine here in Nigeria. it is just that the economic situation in the country is not improving appreciably. Baba will be celebrating his Iwuye soon. we all hope you will come home then.Sumonu, do you know that there has been a major reform in the telecommunications industry since the last time you visited the country. Just recently. the government gave licences to private investors to operate the Global System of Mobile Telecommunications, otherwise called GSM, in the country. With this introduction, communication has been made very easy. People can make and receive calls anywhere and at any time with their mobile phones. This change has brought about positive effects in the lives of the majority of the people. You need to be here to see what I'm talking about.First, the cost of doing business in the country has been drastically reduced. People no longer pay exhorbitant fees to acquire a telephone line as was the case when NITEL was the only telecommunications service provider. As a result, prices of goods have gone down.Secondly, the introduction of GSM services has reduced the crime rate in the country. Unlike before, people can easily call in security operatives, particularly the police. in an emergency situation as they now have access to phones; do you know that carpenters, shoemakers, tailors, now carry about GSM phones. This discourages crimes such as burglary and robbery as the criminals know that they can easily be caught if a victim or his neighbour calls in the police using their mobile phones.The introduction of GSM has also reduced the rate of accidents on our roads, since people travel less. Before the introduction of GSM, people were forced to travel often, when a phone call could have taken care of or prevent such journeys, because they have no access to telephone. But now that GSM is readily available and relatively affordable, people find it easier to conduct their businesses, both private and official, on the phone and travel only when it is absolutely necessary.GSM has also increased the knowledge base of the majority of the people. Most Nigerians are now better informed about local and international events, especially government policies, as news items and information are easily disseminated through the SMS (short message service) services provided, by the GSM operators. Thus, the mobile phone owner can get news items at minimal cost on his phone at any time of the day or night. Also, the introduction of GSM has greatly reduced the financial strain on many families who have relations abroad, as they can easily and speedily get in touch with those relations when they are in need of money. There are so men other. positive effects of the GSM but which I will not be able to enumerate here. Sumonu, I hope you will take advantage of this new technology by sending money to our parents to get their own GSM, so that we can easily and often communicate with you. I am sure with the GSM, even this letter I am writing would have been unnecessary.Please extend my greetings to Bola and Bimbo. they must both be big now. I hope to hear from you soon.Yours sincerely,Gbenga",
    "year": "2006"
  },
  {
    "number": "92",
    "text": "The rising cost of tertiary education in your country has become a serious problem. Write an article for publication in a national newspaper discussing this problem and suggesting measures that could be adopted to deal with it.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51206?exam_type=waec&type=theory&page=19",
    "correct_answer": "HIGH COST OF TERTIARY EDUCATION IN NIGERIAIt is often said that education is the bedrock of an individual's or societal growth and development; An uneducated society is one where ineptitude and mediocrity, their negative effects such as inefficiency. low level of development, corruption, etc. thrive.Little wonder that the most industrialized or developed nations in the world today have very high literacy level among their citizens and such nations devote huge sums of money yearly to the development of education and by extension to the society. This much cannot be said of what obtains in Nigeria, as the government does the direct opposite, where very little or no attention is given to the educational development of the citizenry. Scant attention is given to tertiary education by successive governments in the country and this has impacted negative y on e society, With the cost of tertiary education ever rising due to this neglect, the problems experienced by the society as a result have continued to increase.Eight years ago, it takes, on the average, less than N15,000 to pay one's way through a course of study of four years in a university, and even less in polytechnics or colleges of education. This amount includes tuition and accommodation fees and other faculty and departmental charges. These days, N15,000 cannot even cover the tuition fee for a year of study in any university or polytechnic. Added to this is the high cost of books and other educational materials needed. Students can hardly buy the needed textbooks as a textbook might go for as high as N10,000. Recently, students in some universities protested the astronomical increase in their accommodation fees, yet these increases persisted.To run a master's programme in universities these days, a lot of money is needed. Some master's courses go for as high as N300.000 or more.A major setback of the rising cost of tertiary education in Nigeria is that it increases the illiteracy level in the society. As more and more people find it difficult to pay exorbitant school fees and buy costly books, there has been an increase in the rate of drop outs from these schools. The rising cost of tertiary education in the country has also greatly affected the quality of teaching and learning in these schools. This high cost of financing tertiary education has led to both teachers and learners cutting corners, which has given rise to the pass-at-all-cost syndrome.Another negative effect of this is that it further creates a gulf between the rich and the poor. More and more students from poor homes are having to stop school after their secondary school education while the rich can easily afford to send their children to these schools. This is not good for any society as it creates suspicion and envy among the populace, which will hamper societal growth and development. Unlike in the past, the crime rate among students in institutions of higher learning has reached an alarming level, and this had been linked with the rising cost in tertiary education. Everyday, we hear of cases of undergraduate robbery gangs, prostitution rings and cult groups, all out to make the extra Naira to help them towards their education. I believe that this rise and its attendant negative effects can be checked if government at all levels and stakeholders in the educational sector are sincere enough to address the situation.First, government must check the indiscriminate and arbitrary fee increases in institutions of higher learning. This will help reduce the burden on students and parents. The government must remove schools fees and other charges from tertiary institutions. If that is not possible. government should subsidize such fees to make them affordable. Also, local and state governments should give as many scholarship offers as possible to its brilliant and promising indigenes.The government should also devote enough fund in the yearly budget to the improvement of infrastructure in tertiary institutions. If adequate and well equipped libraries and laboratories are provided in these institutions the financial burden on the students in the area of purchase of books and needed tools will be reduced.In conclusion, it is hoped that necessary steps will be taken by all concerned to stem the tide of the rising cost of tertiary education in Nigeria and its negative effect, because a well trained citizen makes for an improved and better society.\nBello BambaraSS III F",
    "explanation": "HIGH COST OF TERTIARY EDUCATION IN NIGERIAIt is often said that education is the bedrock of an individual's or societal growth and development; An uneducated society is one where ineptitude and mediocrity, their negative effects such as inefficiency. low level of development, corruption, etc. thrive.Little wonder that the most industrialized or developed nations in the world today have very high literacy level among their citizens and such nations devote huge sums of money yearly to the development of education and by extension to the society. This much cannot be said of what obtains in Nigeria, as the government does the direct opposite, where very little or no attention is given to the educational development of the citizenry. Scant attention is given to tertiary education by successive governments in the country and this has impacted negative y on e society, With the cost of tertiary education ever rising due to this neglect, the problems experienced by the society as a result have continued to increase.Eight years ago, it takes, on the average, less than N15,000 to pay one's way through a course of study of four years in a university, and even less in polytechnics or colleges of education. This amount includes tuition and accommodation fees and other faculty and departmental charges. These days, N15,000 cannot even cover the tuition fee for a year of study in any university or polytechnic. Added to this is the high cost of books and other educational materials needed. Students can hardly buy the needed textbooks as a textbook might go for as high as N10,000. Recently, students in some universities protested the astronomical increase in their accommodation fees, yet these increases persisted.To run a master's programme in universities these days, a lot of money is needed. Some master's courses go for as high as N300.000 or more.A major setback of the rising cost of tertiary education in Nigeria is that it increases the illiteracy level in the society. As more and more people find it difficult to pay exorbitant school fees and buy costly books, there has been an increase in the rate of drop outs from these schools. The rising cost of tertiary education in the country has also greatly affected the quality of teaching and learning in these schools. This high cost of financing tertiary education has led to both teachers and learners cutting corners, which has given rise to the pass-at-all-cost syndrome.Another negative effect of this is that it further creates a gulf between the rich and the poor. More and more students from poor homes are having to stop school after their secondary school education while the rich can easily afford to send their children to these schools. This is not good for any society as it creates suspicion and envy among the populace, which will hamper societal growth and development. Unlike in the past, the crime rate among students in institutions of higher learning has reached an alarming level, and this had been linked with the rising cost in tertiary education. Everyday, we hear of cases of undergraduate robbery gangs, prostitution rings and cult groups, all out to make the extra Naira to help them towards their education. I believe that this rise and its attendant negative effects can be checked if government at all levels and stakeholders in the educational sector are sincere enough to address the situation.First, government must check the indiscriminate and arbitrary fee increases in institutions of higher learning. This will help reduce the burden on students and parents. The government must remove schools fees and other charges from tertiary institutions. If that is not possible. government should subsidize such fees to make them affordable. Also, local and state governments should give as many scholarship offers as possible to its brilliant and promising indigenes.The government should also devote enough fund in the yearly budget to the improvement of infrastructure in tertiary institutions. If adequate and well equipped libraries and laboratories are provided in these institutions the financial burden on the students in the area of purchase of books and needed tools will be reduced.In conclusion, it is hoped that necessary steps will be taken by all concerned to stem the tide of the rising cost of tertiary education in Nigeria and its negative effect, because a well trained citizen makes for an improved and better society.\nBello BambaraSS III F",
    "year": "2006"
  },
  {
    "number": "93",
    "text": "Write a letter to the chairman of the P.T.A. of your school suggesting three ways in which parents can work together with the teachers to create a better learning environment in the school.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51207?exam_type=waec&type=theory&page=19",
    "correct_answer": "10, Adeniran Street,\nAguda,\nIkeja, Lagos.\n22 May, 2006.\nThe Chairman,\nP. T.A.\nModel College,\nOgba, Lagos.\nDear Sir,\nHOW TO IMPROVE LEARNING ENVIRONMENT IN MY SCHOOL\nI have watched with increasing dismay the steady decline in the general learning environment in my school. this I attribute to several factors. While enumerating some of these factors, I would like to suggest three key areas where the parent Teachers Association (PTA) can step in to arrest this decline and improve the learning environment in the school.\nOver the past few years, the school has experienced a steady deterioration in its infrastructure. Some classrooms in the school have no ceilings or windows such that the students are at the mercy of the weather When the sun is up and the weather is hot this beats down on the students because there is no ceiling and no fans. Same goes for the rainy periods when students are often drenched from the rain while in their classes due to windowless classrooms. This makes learning very difficult as concentration is very low in such situations.\nThus, I want to suggest that the PTA collaborates with the school authorities to upgrade the school's infrastructure. The dilapidated school buildings should be refurbished. Also, the school library and laboratories need to be upgraded and brought up to date. This will improve the quality of learning and teaching in the school.\nDespite the decaying infrastructure of the school, school fees and other charges have continued to increase. This has led to increasing withdrawals from the school. The school is also no longer attracting the type of quality enrollment as others in its class because of the infrastructure decay and exorbitant school fees and other charges. This can be corrected if the school will review its fees, and this I know could be achieved if the parents work with the teachers in that direction. The PTA can also institute a scholarship scheme to help attract brilliant and serious students to the school. This will no doubt create a better learning environment as there will be a healthy rivalry among students, which will help boost the quality of learning.\nI have also noticed that there is a dearth of qualified and quality teachers. This is due to the fact that teachers in the school are overworked and underpaid, leading to a high rate of turnover for the teaching staff This has affected the learning and education of students. Parents can work with the school authorities to improve the teachers' welfare and general working conditions to attract and retain quality teaching staff.\nAs the saying goes; all work and no play makes Jack a dull boy. This is quite true because in the past, our school used to be among the best in the state in academics as well as in sports. This is no longer the case as over the years sports and sporting facilities have been totally neglected. I want to suggest that parents work with teachers to revive this twin objective of the school academics and sports. The sporting facilities in the school should be refurbished and the moribund inter-house sports revived. The PTA should also purchase a bus for sporting purposes.\nI am sure if these three key areas are looked into the school will be the better for it.\nYours faithfully,\nBambara Bello",
    "explanation": "10, Adeniran Street,\nAguda,\nIkeja, Lagos.\n22 May, 2006.\nThe Chairman,\nP. T.A.\nModel College,\nOgba, Lagos.\nDear Sir,\nHOW TO IMPROVE LEARNING ENVIRONMENT IN MY SCHOOL\nI have watched with increasing dismay the steady decline in the general learning environment in my school. this I attribute to several factors. While enumerating some of these factors, I would like to suggest three key areas where the parent Teachers Association (PTA) can step in to arrest this decline and improve the learning environment in the school.\nOver the past few years, the school has experienced a steady deterioration in its infrastructure. Some classrooms in the school have no ceilings or windows such that the students are at the mercy of the weather When the sun is up and the weather is hot this beats down on the students because there is no ceiling and no fans. Same goes for the rainy periods when students are often drenched from the rain while in their classes due to windowless classrooms. This makes learning very difficult as concentration is very low in such situations.\nThus, I want to suggest that the PTA collaborates with the school authorities to upgrade the school's infrastructure. The dilapidated school buildings should be refurbished. Also, the school library and laboratories need to be upgraded and brought up to date. This will improve the quality of learning and teaching in the school.\nDespite the decaying infrastructure of the school, school fees and other charges have continued to increase. This has led to increasing withdrawals from the school. The school is also no longer attracting the type of quality enrollment as others in its class because of the infrastructure decay and exorbitant school fees and other charges. This can be corrected if the school will review its fees, and this I know could be achieved if the parents work with the teachers in that direction. The PTA can also institute a scholarship scheme to help attract brilliant and serious students to the school. This will no doubt create a better learning environment as there will be a healthy rivalry among students, which will help boost the quality of learning.\nI have also noticed that there is a dearth of qualified and quality teachers. This is due to the fact that teachers in the school are overworked and underpaid, leading to a high rate of turnover for the teaching staff This has affected the learning and education of students. Parents can work with the school authorities to improve the teachers' welfare and general working conditions to attract and retain quality teaching staff.\nAs the saying goes; all work and no play makes Jack a dull boy. This is quite true because in the past, our school used to be among the best in the state in academics as well as in sports. This is no longer the case as over the years sports and sporting facilities have been totally neglected. I want to suggest that parents work with teachers to revive this twin objective of the school academics and sports. The sporting facilities in the school should be refurbished and the moribund inter-house sports revived. The PTA should also purchase a bus for sporting purposes.\nI am sure if these three key areas are looked into the school will be the better for it.\nYours faithfully,\nBambara Bello",
    "year": "2006"
  },
  {
    "number": "94",
    "text": "You have been invited to take part in an inter-school debate, the topic of which is: Schooling in a village is more advantageous than schooling in a city. Write your speech for or against the motion.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51208?exam_type=waec&type=theory&page=19",
    "correct_answer": "SCHOOLING IN A VILLAGE IS MORE ADVANTAGEOUS THAN SCHOOLING IN A CITYGood afternoon Mr. Chairman, Panel of Judges, Time Keeper. co-debater. fellow students, ladies and gentlemen, I am Dupe Omo representing Saint Michael's High School and I am here to support the motion which says schooling in a village is more advantageous than schooling in a city.No doubt, schooling in a village is far better than schooling in a city and I am here to convince you of this. A student who schools in the village is exposed to a conducive learning environment; all round education; is disciplined; more hard working and performs better in exams. He is also exposed to quality teachers who are dedicated and industrious.The first point to support my stand is the conducive learning environment. In the cities, there is usually overcrowding such that factories and business premises exist side by side with schools. Coupled with this is the usually heavy vehicular traffic in cities. These act as distractions to the students as there is constant noise pollution from both factories and vehicles. These noises prevent students from hearing what their teachers are teaching them, thus preventing proper learning. In the village, you do not have such problems and so students are better focused on their lectures.A good quality, all round education includes not only classroom teachings and lectures but also outdoor activities like sports and games. As the saying goes, all work and no play, makes Jack a dull boy. Education or schooling in the city certainly produces dull and unimaginative students as city schools do not have sporting facilities, unlike what you have in the village schools. Because of space constraint, schools in the cities do not have sporting facilities, there is just space for the classrooms and laboratories. Thus, city schools hardly organise or take part in inter-house sports or inter-school sporting events. This is not good for quality education as it might lead to brain fatigue. Village schools, on the other hand have enough space to build sporting complexes that help students to have an all-round development.Discipline, the bedrock of any organisation. especially schools, is often missing in city schools. Students from city schools are often very unruly, they lack discipline. unlike what obtains in village schools. Students in city schools are often perpetual late corners to school and they blame this on the traffic jams experienced in the cities. Their manner of dressing also depicts the foreign influence they are exposed to through television programmes and movies. To make the situation worse is the fact that teachers can hardly discipline these students because of fear of been sacked by school proprietors or harassed by parents, whose modern idea of schooling is that the teachers should merely teach, and nothing more. This is not the case in village schools as the whole community. including the schools, look out for one another. The parents know the teachers and vice versa and an erring student can be punished by the teacher without the school or parents frowning at it because they know the teacher has their interest at heart. Little wonder that today, we have more cult groups in city schools than we have in village schools.Also, schooling in the village is more advantageous than schooling in the city because village schools have more committed and dedicated teachers than the city school teachers, who are often driven by greed to take on other jobs to supplement their salaries.Thus, teachers in city schools often have two or three other jobs apart from their teaching jobs. This is not good for both the teacher and the students; the teacher is often distracted and fatigued and unable to teach properly. which tells on the learning process of the students. This is not the case in village schools.To buttress my argument, most tertiary institutions are established in rural areas, away from the distracting influence of the cities, in recognition of the need for total concentration for a qualitative education. And I want to conclude by saying that setting up schools in villages and rural areas should be encouraged for the reasons above.Mr. Chairman, Panel of Judges, ladies and gentlemen, with these points of mine, I hope I have been able to convince you that schooling in a village is more advantageous than schooling in a city.Thank you.",
    "explanation": "SCHOOLING IN A VILLAGE IS MORE ADVANTAGEOUS THAN SCHOOLING IN A CITYGood afternoon Mr. Chairman, Panel of Judges, Time Keeper. co-debater. fellow students, ladies and gentlemen, I am Dupe Omo representing Saint Michael's High School and I am here to support the motion which says schooling in a village is more advantageous than schooling in a city.No doubt, schooling in a village is far better than schooling in a city and I am here to convince you of this. A student who schools in the village is exposed to a conducive learning environment; all round education; is disciplined; more hard working and performs better in exams. He is also exposed to quality teachers who are dedicated and industrious.The first point to support my stand is the conducive learning environment. In the cities, there is usually overcrowding such that factories and business premises exist side by side with schools. Coupled with this is the usually heavy vehicular traffic in cities. These act as distractions to the students as there is constant noise pollution from both factories and vehicles. These noises prevent students from hearing what their teachers are teaching them, thus preventing proper learning. In the village, you do not have such problems and so students are better focused on their lectures.A good quality, all round education includes not only classroom teachings and lectures but also outdoor activities like sports and games. As the saying goes, all work and no play, makes Jack a dull boy. Education or schooling in the city certainly produces dull and unimaginative students as city schools do not have sporting facilities, unlike what you have in the village schools. Because of space constraint, schools in the cities do not have sporting facilities, there is just space for the classrooms and laboratories. Thus, city schools hardly organise or take part in inter-house sports or inter-school sporting events. This is not good for quality education as it might lead to brain fatigue. Village schools, on the other hand have enough space to build sporting complexes that help students to have an all-round development.Discipline, the bedrock of any organisation. especially schools, is often missing in city schools. Students from city schools are often very unruly, they lack discipline. unlike what obtains in village schools. Students in city schools are often perpetual late corners to school and they blame this on the traffic jams experienced in the cities. Their manner of dressing also depicts the foreign influence they are exposed to through television programmes and movies. To make the situation worse is the fact that teachers can hardly discipline these students because of fear of been sacked by school proprietors or harassed by parents, whose modern idea of schooling is that the teachers should merely teach, and nothing more. This is not the case in village schools as the whole community. including the schools, look out for one another. The parents know the teachers and vice versa and an erring student can be punished by the teacher without the school or parents frowning at it because they know the teacher has their interest at heart. Little wonder that today, we have more cult groups in city schools than we have in village schools.Also, schooling in the village is more advantageous than schooling in the city because village schools have more committed and dedicated teachers than the city school teachers, who are often driven by greed to take on other jobs to supplement their salaries.Thus, teachers in city schools often have two or three other jobs apart from their teaching jobs. This is not good for both the teacher and the students; the teacher is often distracted and fatigued and unable to teach properly. which tells on the learning process of the students. This is not the case in village schools.To buttress my argument, most tertiary institutions are established in rural areas, away from the distracting influence of the cities, in recognition of the need for total concentration for a qualitative education. And I want to conclude by saying that setting up schools in villages and rural areas should be encouraged for the reasons above.Mr. Chairman, Panel of Judges, ladies and gentlemen, with these points of mine, I hope I have been able to convince you that schooling in a village is more advantageous than schooling in a city.Thank you.",
    "year": "2006"
  },
  {
    "number": "95",
    "text": "Write a story to illustrate the saying: As one makes one's bed, so one must lie on it",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51209?exam_type=waec&type=theory&page=19",
    "correct_answer": "AS ONE MAKES ONE'S BED SO ONE MUST LIE ON ITThere lived, a long time ago, two half-brothers named Tolu and Tola. The two were age mates. The two brothers sho the same father, who died when they were both still small. but different mothers. Like all kids, Tolu and Tola were yer, troublesome and they get into trouble easily, but while Tolu's mother. Mama Agba, was very strict and meted out appropriate punishments for Tolu's wrongdoings, Tola got away with most of his pranks because s mother. Marna Kekere, was very protective of him. She wouldn't punish him or allow him to be punished. Mama Kekere always had an explanation to excuse Tola's behaviour.Tolu and Tola attended the same school. While Tolu was well behaved in school, listening attentively to his lessons. doing his class works and home works correctly, Tola is always very playful in class; he is always among the noisemakers and he wouldn't do his home works. And the mother never cared to monitor Tola's school activities, unlike Mama Agba: who monitors Tolu's works.One day in school, Tola's teacher caught him cheating in class; he was copying a friend's assignment. The teacher scored Tola and his friend zero for this and also punished the two boys. When Tola got home that day he lied to his mother that he did his homework properly but that the teacher scored him zero. The mother was so angry that the next day she followed Tola to the school and spoke angrily to the teacher. She wouldn't believe the teacher when he told her her child was caught cheating in the class. It took the intervention of the headmaster to prevent Mama Kekere from physically assaulting Tola's teacher. The headmaster. who was so surprised by Mama Kekere's actions, advised her that such behaviour and action send the wrong signal to the child, as the child might form the notion that he can do anything and get away with it.\"No. my Tola is different, he is always a good boy.\" retorted Mama Kekere. \"Ok madam. replied the Headmaster.\"I just thought you should be more cautious the way you handle your kid. Tola's mother wasn't happy with this, she felt the headmaster was taking sides with his teacher and she angrily left his office, promising to deal with anybody who dared to touch her Tola again. In the secondary school, Tola began to associate with bad boys in school and they were involved in lots of truancy, smoking, drinking, stealing and all such vices. Tola began to miss classes and keep late nights, drinking and smoking with his gang. Mama Agba, who noticed Tola's strange behaviour. one day called Tola's mother and told her about it, but Mama Kekere was not happy with Tolu's mother. claiming that she was jealous of Tola's popularity and liveliness. Mama Agba replied by warning Tola's mother that she would eventually regret her pampering of her son as it was bound to destroy his future and life and eventually that of Mama Kekere.Tola was eventually caught by the police during a burglary operation and was detained in the cell where he escaped. The police immediately arrested his mother and locked her up in a cell until the son was found. Meanwhile, Tolu sat for the SSCE exams and the UME and when the results were released. he passed both and was offered admission in a university. Tola's mother was in the cell when she heard about Tolu's performance and she started to weep because she knew it could have been Tola if only she had been a better mother. It was while crying that she remembered the words of the old woman who once admonished her thus: \"My child, what you are doing concerning your child is bad. Remember. as one makes ones bed so one must He on it.'",
    "explanation": "AS ONE MAKES ONE'S BED SO ONE MUST LIE ON ITThere lived, a long time ago, two half-brothers named Tolu and Tola. The two were age mates. The two brothers sho the same father, who died when they were both still small. but different mothers. Like all kids, Tolu and Tola were yer, troublesome and they get into trouble easily, but while Tolu's mother. Mama Agba, was very strict and meted out appropriate punishments for Tolu's wrongdoings, Tola got away with most of his pranks because s mother. Marna Kekere, was very protective of him. She wouldn't punish him or allow him to be punished. Mama Kekere always had an explanation to excuse Tola's behaviour.Tolu and Tola attended the same school. While Tolu was well behaved in school, listening attentively to his lessons. doing his class works and home works correctly, Tola is always very playful in class; he is always among the noisemakers and he wouldn't do his home works. And the mother never cared to monitor Tola's school activities, unlike Mama Agba: who monitors Tolu's works.One day in school, Tola's teacher caught him cheating in class; he was copying a friend's assignment. The teacher scored Tola and his friend zero for this and also punished the two boys. When Tola got home that day he lied to his mother that he did his homework properly but that the teacher scored him zero. The mother was so angry that the next day she followed Tola to the school and spoke angrily to the teacher. She wouldn't believe the teacher when he told her her child was caught cheating in the class. It took the intervention of the headmaster to prevent Mama Kekere from physically assaulting Tola's teacher. The headmaster. who was so surprised by Mama Kekere's actions, advised her that such behaviour and action send the wrong signal to the child, as the child might form the notion that he can do anything and get away with it.\"No. my Tola is different, he is always a good boy.\" retorted Mama Kekere. \"Ok madam. replied the Headmaster.\"I just thought you should be more cautious the way you handle your kid. Tola's mother wasn't happy with this, she felt the headmaster was taking sides with his teacher and she angrily left his office, promising to deal with anybody who dared to touch her Tola again. In the secondary school, Tola began to associate with bad boys in school and they were involved in lots of truancy, smoking, drinking, stealing and all such vices. Tola began to miss classes and keep late nights, drinking and smoking with his gang. Mama Agba, who noticed Tola's strange behaviour. one day called Tola's mother and told her about it, but Mama Kekere was not happy with Tolu's mother. claiming that she was jealous of Tola's popularity and liveliness. Mama Agba replied by warning Tola's mother that she would eventually regret her pampering of her son as it was bound to destroy his future and life and eventually that of Mama Kekere.Tola was eventually caught by the police during a burglary operation and was detained in the cell where he escaped. The police immediately arrested his mother and locked her up in a cell until the son was found. Meanwhile, Tolu sat for the SSCE exams and the UME and when the results were released. he passed both and was offered admission in a university. Tola's mother was in the cell when she heard about Tolu's performance and she started to weep because she knew it could have been Tola if only she had been a better mother. It was while crying that she remembered the words of the old woman who once admonished her thus: \"My child, what you are doing concerning your child is bad. Remember. as one makes ones bed so one must He on it.'",
    "year": "2006"
  },
  {
    "number": "96",
    "text": "Read the following passage carefully and answer the questions on it.\n      Late one night Mr. Oliver was returning to his school on the outskirts of the hill station of Simla. He had been teaching in this school for many years. A bachelor, he usually strolled into the town in the evening, returning after dark. when he would take a short cut through a pine forest. Whenever there was strong wind, the pine trees made moaning, eerie sounds that kept most people to the main road. But Mr. Oliver was not a nervous or imaginative man.\n      He carried a torch on this particular night and its pale gleam - the batteries were running down moved fitfully Over the narrow forest path. When its flickering light fell on the figure of a boy who was sitting alone on a rock. Mr. Oliver stopped. Boys were not supposed to be out of school after 7 p.m.. and it was now well past nine.\n      \"What are you doing out here, boy?\" asked Mr. Oliver sharply, moving closer so that he could recognize the miscreant. But as he approached the boy, he sensed that something was wrong. The boy speared to be crying. His head hung down, he held his face in his hand and his body shook convulsively. It was a strange soundless weeping, and Mr. Oliver felt quite uneasy.\n      \"Well, what's the matter?\" he asked. his anger giving way to concern. \"What are you crying for'?\" The boy would not answer or look up. His body continued to be rocked with silent sobbing. \"Come on, boy, you shouldn't be out here at this hour. Tell me the trouble. Look up.\" The boy looked up. He took his hands from his face and looked up at his teacher. The light from Mr. Oliver's torch fell on the boy's face, if it could be called a face.\n      He had no eyes, ears, nose or mouth. It was just a round smooth head with a school cap on top of it, and that's where the story should have ended, as indeed it has for several people who have had similar experiences and drop dead of unexplainable heart attack. But for Mr. Oliver. it did not end here.\n      The torch fell from his trembling hand. He turned and scrambled down the path. running blindly through the trees and calling for help. He was still running towards the school building when he saw a lantern swinging in the middle of the path. Mr. Oliver had never before been so pleased to see the night watchman. He stumbled up to the watchman, gasping for breath and speaking incoherently. \"What is it, Sahib?\" asked the watchman \"Has there been an accident? Why are you running?\"\n      \"I saw something - something horrible - a boy weeping in the forest, and he had no face!\" No face, Sahib?\" \"No eyes, nose, mouth, nothing!\" \"Do you mean it was like this, Sahib?\" asked the watchman and raised the lamp to his own face. The watchman had no eyes, no ears, no features at all, not even an eyebrow. The wind blew the light out, and Mr. Oliver had his heart attack ...\n(a) Why did Mr Oliver take the pine forest route to his school?\n(b) What did Mr. Oliver think when he first saw the `boy'?\n(c) What was the first indication to Mr. Oliver that all was not well?\n(d) What did the night watchman turn out to be?\n(e) Mr. Oliver had never before been so pleased to see the night watchman. What is ironical about this sentence in the light of the rest of the story?\n(f) \"Do you mean it was like this, Sahib?\" What does \"this\" refer to?\n(g) \" who have had similar experiences and dropped dead of unexplainable heart attack.\"\n(i) What grammatical name is given to this expression as it is used in the passage? (ii) What is its function?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) miscreant (ii) sensed (iii) concern (iv) rocked (v) scrambled.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51210?exam_type=waec&type=theory&page=20",
    "correct_answer": "(a) He wanted a short cut (back to school).(b) He thought that he had come upon a school boy who had broken a school rule/one of his students. OR He thought that he had come upon a miscreant.(c) The boy appeared to be crying.(d) The night watchman turned out to be a creature/being without a face or a faceless being/creature or a creature similar to/resembling the one which Mr. Oliver encountered in the pine forest.(e) The irony is that it was the night watchman he was pleased to see that brought about his heart attack/disaster.(f) It refers to a face without features/a face without eyes, ears. eyebrows. OR It refers to the watchman's face.(g) (i) Adjectival/Relative clause. (ii) Qualifying/ Modifying (the noun) \"people(h) (i) miscreant - culprit, offender, wrong-doer. delinquent (ii) sensed - felt, thought, perceived (iii) concern - worry. anxiety, uneasiness (iv) rocked - shaken. agitated. convulsed (v) scrambled - stumbled, staggered.",
    "explanation": "(a) He wanted a short cut (back to school).(b) He thought that he had come upon a school boy who had broken a school rule/one of his students. OR He thought that he had come upon a miscreant.(c) The boy appeared to be crying.(d) The night watchman turned out to be a creature/being without a face or a faceless being/creature or a creature similar to/resembling the one which Mr. Oliver encountered in the pine forest.(e) The irony is that it was the night watchman he was pleased to see that brought about his heart attack/disaster.(f) It refers to a face without features/a face without eyes, ears. eyebrows. OR It refers to the watchman's face.(g) (i) Adjectival/Relative clause. (ii) Qualifying/ Modifying (the noun) \"people(h) (i) miscreant - culprit, offender, wrong-doer. delinquent (ii) sensed - felt, thought, perceived (iii) concern - worry. anxiety, uneasiness (iv) rocked - shaken. agitated. convulsed (v) scrambled - stumbled, staggered.",
    "year": "2006"
  },
  {
    "number": "97",
    "text": "Read the following passage carefully and answer the questions on it.\n      Children today are being hurried through childhood, rushed into taking on adult tasks at a very early age. Granted that the effects are not always so dramatic or so tragic, they can be profound and long lasting Parents are understandably eager to see their children succeed. When that eagerness turns into anxiety. parents may overload their children, pushing them too hard too soon. For instance it is becoming increasingly common for parents to enroll young children in after-school activities. Often, special tutoring is added.\n      Of course, it is not wrong to encourage a child's talents or interests. There is a danger of excess when some children seem to have as many pressures as harried adults do. Before their children are born, parents are already enrolling them in preschool, hoping to improve their prospects of success. In some countries, children are assessed for reading and Mathematics skills before they are six years old. Such practices have raised concern about emotional damage. Many parents seem to think it normal. even advisable, to teach their children that winning is everything.\n      Some parents work extremely hard to provide every possible material comfort for the children, believing that they are working to ensure their children's happiness - but they may well be doing the opposite. Often, more than a few children raised this way are involved in drinking, drugs and sullen rebellious behaviour as many fume with resentment because they feel neglected. The children often pay a high price. Although they may have many material luxuries, they lack the most essential ingredients of a good childhood: parental attention and love. Without guidance. discipline and direction they face adult questions too soon, with little or no preparation. They will likely obtain their own answers from peers or TV or movie characters. The results often bring childhood to an abrupt, even tragic end. Without a doubt, rushing children through childhood is a dangerous practice that should be avoided.  \n(a) Why do parents rush their children through childhood?\n(b) Give two examples of how parents rush their children through childhood.\n(c) State two sad effects of bringing up children in extreme luxury.\n(d) Why do children raised in luxury become angry?\n(e) What is ironical about parents' efforts to make their children happy?\n(f) \"the children often pay a high price\". What is the meaning of this expression?\n(g) \"Although they may have many material luxuries ...\"\n(i) What grammatical name is given to this expression as it is used in the passage?\n(ii) What is its function?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) effects (ii) eager (iii) prospects (iv) raised (v) essential (vi) resentment.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51211?exam_type=waec&type=theory&page=20",
    "correct_answer": "(a) Theyare determined to see their children succeed. They would like their children to succeed.(b) (i) They enroll their young children in after-school activities. (ii) Special tutoring is given to children.(c) The children get involved in drinking, drugs and become rebellious.(d) Because they feel neglected/they lack parental attention and or love.(e) The efforts achieve the opposite of what is intended. OR the efforts result in the children's unhappiness.(f) What the children lose is more valuable than what they get from their parents.(g) (i) Adverbial clause (of concession) (ii) Modifying (the verb) \"lack\".(h) (i) effects - results. consequences (i1) eager - anxious, determined, keen (iii) prospects - opportunities, chances (iv) raised - brought up, reared. nurtured, bred (v) essential - important, valuable (vi) resentment - bitterness. annoyance. anger. indignation.",
    "explanation": "(a) Theyare determined to see their children succeed. They would like their children to succeed.(b) (i) They enroll their young children in after-school activities. (ii) Special tutoring is given to children.(c) The children get involved in drinking, drugs and become rebellious.(d) Because they feel neglected/they lack parental attention and or love.(e) The efforts achieve the opposite of what is intended. OR the efforts result in the children's unhappiness.(f) What the children lose is more valuable than what they get from their parents.(g) (i) Adverbial clause (of concession) (ii) Modifying (the verb) \"lack\".(h) (i) effects - results. consequences (i1) eager - anxious, determined, keen (iii) prospects - opportunities, chances (iv) raised - brought up, reared. nurtured, bred (v) essential - important, valuable (vi) resentment - bitterness. annoyance. anger. indignation.",
    "year": "2006"
  },
  {
    "number": "98",
    "text": "Read the following passage carefully and answer the questions on it.\n      Although world agencies have made numerous efforts to stop malnutrition, achievements have fallen short of hope For example, in 1996 the United Nations set the goal of reducing by half the number of the world's undernourished some 400 million people - by the year 2015. Commendably, some progress has been made. But the report of the Food and Agricultural Organization of the United Nation for 2001 acknowledges that unfortunately there has been a slowdown in the projection, and that the number of undernourished people has actually increased considerably in the majority of developing countries.\n      Malnutrition is usually triggered by a combination of two factors, namely: an insufficient intake of proteins, calories vitamins, and minerals, and frequent infections. Such illness as diarrhoea, measles, malaria, and respiratory disease tax the body heavily and cause loss of nutrients. They reduce appetite and food intake, thus contributing to malnutrition. The undernourished child is in turn more susceptible to infections. Thus a vicious circle is formed that increases the mortally rates for protein-energy malnutrition. Children are at greater risk of suffering malnutrition because they are in a period of rapid growth that increases the demand for calories and proteins. For similar reasons, pregnant and nursing women are vulnerable to malnutrition.\n      Malnutrition has far-reaching effects. First, it wreaks havoc on the body, particularly that of a child. Every organ and system - including the heart, kidneys, stomach, intestines, lungs, and brain - may be affected. Various studies have shown that poor growth in a child is closely associated with impaired mental development and poor scholastic and intellectual performance. Secondly. for children who survive malnutrition, the aftermath can linger on into adulthood. Recent research relates undernourishment in infancy to a tendency towards such chronic illnesses in adulthood as heart disease, diabetes, and high blood pressure.\n      How can children be best protected from malnutrition? it is essential to improve the diet of the mother. Pregnant and nursing women need to consume more calories and proteins. Proteins in particular help in the production of the mother's milk. So when there is little food, preference should be given to women of childbearing age and to little children. Secondly, in almost all cases, the best possible food for a baby is its mother's milk. This is especially so during the first days after birth because mother's milk contains antibodies that protect the baby from infection. During the first four months or so, breast milk provides all the nutrients that the baby needs in order to grow and develop properly. But breastfeeding should be continued for as long as necessary, which could be up to two years. And after the baby is weaned, the greatest possible variety of foods in different combinations should be introduced to provide nutrients that protect the baby. The mother should focus on providing the child with good-quality food. neither forcing the child to eat after it is full nor withholding food from the child when it appears to want more.\n(a) In one sentence summarize the causes of malnutrition\n(b) In two sentences, one for each. summarize the two major effects of malnutrition.\n(c) In three sentences, one for each summarize the three preventive measures against malnutrition recommended in the passage",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51212?exam_type=waec&type=theory&page=20",
    "correct_answer": "(a) Malnutrition is caused by infections and a deficiency in the intake of nutrients or an insufficient in-take of nutrients.(b) (i) Malnutrition causes damage to the body. (ii) Malnutrition gives rise to chronic diseases in adulthood/later life.(c) (i) Pregnant and nursing women/women of childbearing age/and children should 'feed well.(ii) The baby/child should be breast fed.(iii) The baby/child should be given (enough) good-quality food (after it has been weaned).",
    "explanation": "(a) Malnutrition is caused by infections and a deficiency in the intake of nutrients or an insufficient in-take of nutrients.(b) (i) Malnutrition causes damage to the body. (ii) Malnutrition gives rise to chronic diseases in adulthood/later life.(c) (i) Pregnant and nursing women/women of childbearing age/and children should 'feed well.(ii) The baby/child should be breast fed.(iii) The baby/child should be given (enough) good-quality food (after it has been weaned).",
    "year": "2006"
  }
]