[
  {
    "number": "75",
    "text": "(a) You are provided a retort stand, a spring balance, masses, a beaker containing water, another beaker containing a liquid labelled, L, and other necessary apparatus.\n(i) Suspend the mass, m = 20 g on the spring balance and measure the weight in air, W\\(_A\\) in Newton.\n(ii) Immerse the suspended mass completely in water and measure weight in water, W\\(_W\\) in Newton. Evaluate U\\(_1\\) = W\\(_A\\) - W\\(_W\\).\n(iii) Immerse the suspended mass completely in the liquid L of the same volume with water and measure the weight in liquid W\\(_L\\). Evaluate U\\(_2\\) = W\\(_A\\) - W\\(_L\\).\n(iv) Repeat the procedure for m = 40g, 60g, 80g, and 100g respectively. In each case, evaluate \\(W_A\\), W\\(_W\\), U\\(_1\\), W\\(_L\\), U\\(_2\\).\n(v) Tabulate the readings.\n(vi) Plot a graph of U\\(_1\\) on the vertical axis and U\\(_2\\) on the horizontal axis starting both axes from the origin (0, 0).\n(vii) Determine the slope s of the graph\n(viii) Evaluate K = \\(\\frac{1}{\\text{s}}\\)\n(ix) State two precautions taken to ensure accurate results.\nb(i) State the Archimedes' principle,\n(ii) State two differences between density and relative density",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/72107?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  },
  {
    "number": "76",
    "text": "(a) You are provided with two resistance wires labelled: A and B, standard resistor, R\\(_x\\) = 1 \\(\\Omega\\), metre bridge, cell of emf,E, Rheostat  R\\(_h\\), galvanometer and apparatus as shown.\nUse the circuit diagram above as a guide to perform the experiment.\n(i) Connect  R\\(_x\\) in the left-hand gap of the metre bridge, a length L = 100 cm of the wire in the right-hand gap and the other apparatus shown.\n(ii) Determine and record the balance point P on the metre bridge wire NQ\n(iii) Measure and record L\\(_x\\) = NP and L\\(_y\\) = PQ\n(iv) Evaluate R\\(_1\\) = \\(\\frac{L_y}{L_x}R_x\\)\n(v) Repeat the procedure for four other values of L = 90cm, 80cm, 70cm, and 60cm. In each case, determine and record the balance point, P and evaluate R\\(_1\\)\n(vi) Repeat the experiment with the second wire B. Obtain the balance point P and evaluate R\\(_2\\) in each case\n(vii) Tabulate the readings\n(viii) Plot a graph of R\\(_2\\) on the vertical axis and R\\(_1\\) on the horizontal axis\n(ix) Determine the slope, s, of the graph\n(x) Evaluate K = \\(\\sqrt{s}\\)\n(xi) State two precautions taken to ensure accurate results.\nb(i) State two advantages of potentiometer over voltmeter for measuring potential difference\n(ii) Define internal resistance of a cell.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/72108?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  },
  {
    "number": "77",
    "text": "ALTERNATIVE B\n(a) You are provided with a variable DC power supply E, a key, an ammeter, a voltmeter and other necessary materials\n(i) Set up a circuit as shown in the diagram above with E = 3.0V\n(ii) Close the key.\n(iii) Record the voltmeter reading, V\n(iv) Read the corresponding ammeter reading, I\n(v) Evaluate V\\(^{-1}\\) and I\\(^{-1}\\)\n(vi) Repeat the procedure for the four other values of E = 4.5V, 6.0V, 7.5V and 9.0V.\n(vii) Tabulate your readings.\n(viii) Plot a graph with I\\(^{-1}\\) on the vertical axis and V\\(^{-1}\\) on the horizontal axis starting with both axes from the origin. (0, 0)\n(ix) Determine the slope, s of the graph.\n(x) Also, determine the intercept, c on the vertical axis\n(xi) What does the slope, s represent?\n(xii) State two precautions taken to ensure accurate results.\n(b) State two methods by which an electric current can be produced\n(i) State Ohm's law.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/72109?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  },
  {
    "number": "78",
    "text": "(a) You are provided with two metre rules, two retort stands, a mass, m = 100g, thread, and other necessary apparatus\n(i) Place one of the metre rules on a knife edge and determine the centre of gravity, C\n(ii) Measure and record the mass, M\\(_R\\) of the metre rule\n(iii) Attach the mass = 100g firmly to the metre rule AB at C using paper tape\n(iv) Suspend the metre rule by two parallel threads of length, h = 40cm each at 10 cm and 90cm mark. Ensure that the graduated face of the metre rule is facing upwards.\n(v) Set the metre rule into small angular oscillation about the vertical axis through the centre of gravity.\n(vi) Determine the time, t for 20 complete oscillations. Evaluate the period T and T\\(^2\\).\n(vii) Read and record the value of d in metres.\n(viii) Keeping d, constant, repeat the procedure for four other values of h = 50, 60, 70, and 80 cm. In each case, determine t and evaluate T and T\\(^2\\).\n(ix) Tabulate the readings \n(x) Plot a graph of T\\(^2\\) on the vertical axis and h on the horizontal.\n(xi) Determine the slope, s of the graph\n(xii) Evaluate K = \\(\\frac{\\text{S}}{\\text{Q}}\\) where Q = \\(\\frac{2}{25d^2}\\)\n(xiii) State two precautions taken to ensure accurate results\nb(i) Define couple as it relates to oscillatory motion\n(ii) Give two practical applications of a couple in everyday life.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/72110?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  }
]