[
  {
    "number": "69",
    "text": "Study Specimens A and B carefully and use them to answer question 1 (a) to 1 (e).\n(a) Classify Specimen p no its division and class.\n(b) (i) State the types of leaf arrangements in specimens A and B.\n(ii) Name the leaf shape of specimens A and B.\n(c)(i) State the type of leaf margin in specimen A. (ii) State the types of venation found in the leaves of specimens A and B.\n(d)(i) List three observable similarities found in specimen A and E. (ii) In a tabular form, state four observable differences between specimens A and B.\n(e) Make a drawing 8-10 cm long of the leaf of specimen A and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60298?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "70",
    "text": "Study Specimen G and H carefully them to answer question 2 (a) to 2(c).\n(a) (i) Name the phylum of specimens G and H.\n(ii) State two reasons for the answer given in 2 (a)(i).\n(b) Name the structures on specimen G and H that are used for defense.\n(c)(i) State two habitat of each of specimen G and H. (i) State two ways in which each of specimen G and H are of economic importance.\nStudy specimen M, N and P carefully and use them to answer question 2 (d) and 2 (e).\n(d) (i) Name the class of organisms to which each of the specimen M, N and P are associated. (ii) State one function common to the specimen named in 2 (d)(i).\n(iii) In a tabular form, State four observable difference between specimen M and P.\n(e) Explain three features of biological importance in Specimen M.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60299?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  },
  {
    "number": "71",
    "text": "Observe Specimen Q, under a microscope and specimen R Carefully, Use them to answer questions 3 (a) to 3 (e).\n(a)(i) State the phylum to which each of specimen Q and R belong. (ii) State one reason each for the answers stated in 3 (a) (i).\n(iii) What is the symmetry of specimen Q and R?\n(b)(i) State two observable feature each of specimen Q and R. (ii) State one function each of the features mention in 3 (b) (i).\n(c) (i) Name the sex of specimen R. (ii) Give one reason for the answer given in 3 (C) (i).\n(d) In tabular form, state four observable differences between specimen Q and R,\n(e) Make a drawing 10 cm-12 cm long of the lateral view of specimen Rand label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60300?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "No official explanation is available for this question at this time. Please check contributions posted by others below. If you can provide an explanation to help other student learn, please",
    "year": "2015"
  },
  {
    "number": "72",
    "text": "Study specimens T, V and W carefully and use them to answer questions 4(a) to 4(d)\n(a) Classify Specimen T,V and W according to the following criteria: (i) Agricultural classification: (ii) Life cycle.\n(b) State two ways in which specimen W is important to human nutrition.\n(c) With a scalpel or knife, make a cross Section of specimen T.\n(ii) What type of placentation is observed in the cut section of specimen T? Name one example of a fruit with similar placentation as observed in the cut section of specimen T.\nMake a drawing 10 cm - 12 cm long of the transverse section and label fully.\n(d) Make a transverse section of Specimen V and state: (i) Three Observable differences;\n(ii) Three observable similarities; between the transverse section of specimen T and V.\nStudy specimen Xi and Xii and use them to answer question 4 (e) (i) to 4 (e) (ii)\n(e) Carefully remove the bark of specimen Xi to expose the naked part.\n(i) State two observable differences between Specimen Xi and Xii.\n(ii) If Xi and Xii are planted, what difference will be noticed after a month? State one reason for the answer in 4 (e)(ii)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60301?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2015"
  }
]