[
  {
    "number": "22",
    "text": "You are provided with a uniform metre rule of mass, M indicated on its reverse side, a knife-edge, a graduated measuring cylinder of known mass, M\\(_{1}\\) marked on it and other necessary apparatus.\n\nRead and record with values of M and m\\(_{1}\\). \nBalance the metre rule horizontally on the knife edge. Read and record the balance point as G.\nTie a loop of thread around the neck of the measuring cylinder.\nFill the cylinder with the sand provided to the 2cm\\(^{3}\\) mark. Record the volume, V, of the sand.\nHang the cylinder at the 2 cm mark of the metre rule and adjust the position of the knife edge until the rule balances horizontally.\nRead and record the new balance position K.\nDetermine the value of e and f.\nDetermine the mass, m\\(_{2}\\), of the sand in the measuring cylinder. Hint: m\\(_{2}\\) = (\\(\\frac{\\text {M x f}}{e}\\)) - m\\(_{1}\\).\nRepeat the procedure by filling the measuring cylinder to the mark V = 4,6,8 and 10 cm\\(^{3}\\). In each case, ensure that the measuring cylinder is kept constant at the 2 cm mark on the metre rule.\nTabulate your readings.\nPlot a graph with m\\(_{2}\\) on the vertical axis and V on the horizontal axis.\nDetermine the slope, s, of the graph.\nState two precautions taken to ensure accurate results.\n\n(b)i. Determine the mass of 7.5 cm\\(^{3}\\) of the sand using your graph.\nii. A gold coin of mass 102.0 g has a uniform cross-sectional area of 10.0 cm\\(^{2}\\). Calculate its thickness. [Density of gold=19.3 g cm\\(^{-3}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59982?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "23",
    "text": "Using the diagram above as a guide, carry out the following instructions:\n\nFix a plain sheet of paper on the Celotex board.\nPlace the rectangular glass prism on the paper and trace its outline, ABCD. Remove the prism.\nDraw a normal NMP to meet AB and DC at M and P respectively such that |AM|=DP=2.0cm.\nTrace the ray PQ with two pins, P\\(_{1}\\) and P\\(_{2}\\) at P and Q respectively such that angle MPQ = i =50º \nReplace the prism on its outline. Trace the emergent ray with two other pins P\\(_{3}\\) and P\\(_{4}\\) such that they lie in a straight line with P\\(_{2}\\) and the image of P\\(_{1}\\) viewed through the glass prism.\nMeasure and record \\(\\theta\\), the angle between the emergent ray and face AB of the glass prism.\nEvaluate cos \\(\\theta\\) and sin i.\nRepeat the procedure for four other values of i = 10°, 15°,20° and25°.\nTabulate your readings.\nPlot a graph with cos \\(\\theta\\) on the vertical axis and sin i on the horizontal axis.\nDetermine the slope, s, of the graph\nState two precautions taken to ensure accurate results. Attach your traces to your answer booklet \n\n(b)i. State the laws of refraction of light\nii. Explain what is meant by the statement the refractive index of a material is 1.65",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59986?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "24",
    "text": "You are provided with a constantan wire, a2 \\(\\Omega\\)standard resistor, an accumulator E, an ammeter A, a key K, and other necessary apparatus.\n\nMeasure and record the emf of the accumulator provided\nConnect a circuit as shown in the diagram above.\nClose the key, read and record the ammeter reading l\\(_{o}\\) when the crocodile clip is not in contact with the Constantan wire.\nOpen the key with the clip making contact with the wire, when d=90cm, close the key. Read and record the ammeter reading l.\nEvaluate d\\(^{_1}\\)\nRepeat the procedure for four other values of d=80, 70, 60, and 50 cm\nIn each case, read and record the ammeter reading and evaluatre d\\(^{_1}\\).\nTabulate your readings.\nPlot a graph with I on the vertical axis and d\\(^{_1}\\) on the horizontal aXIS.\nDetermine the slope, S of the graph and its intercept, c, on the vertical axis.\nEvaluate k = \\(\\frac{c}{s}\\)\nUsing your graph, determine the current I when d=55cm.\nState two precautions taken to obtain accurate results.\n\n(b)i. Explain what is meant by the potential difference between two points in an electric circuit.\nii.  State two factors on which the resistance of a wire depends.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59996?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  }
]