[
  {
    "number": "101",
    "text": "Your friend in another school has requested some information about your school to enable him decide on moving over to your school. Write a letter to him discussing at least three areas in which your school excels.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51265?exam_type=waec&type=theory&page=21",
    "correct_answer": "Airforce Base Secondary School,\nP.M.B. 2364\nLagos.\n12 May. 2005.\nDear Maurice,\nI am indeed very sorry for failing to reply your last letter on time, in which you requested for some information about my school, so as to enable you decide on moving over to my school. I've been extremely busy because of my recent appointment as the senior prefect.\nWell, I am happy that you requested for information about my school and I'll give you at least three areas in which my school excels. Firstly, my school is recognized nationwide as one of the best schools in Nigeria because of its academic excellence. The students in my school are well-taught in such a way that they are prepared for the challenges they might face educationally and socially in future. The teachers, who are qualified in their different areas of studies, ensure that we understand what they are teaching us. This has been helping us to perform brilliantly in our examinations. Our teachers ensure that they carry out their duties effectively and efficiently because they know that they play a very crucial role in our lives. This is the secret behind our brilliant performances in various external examinations.\nSecondly, my school ensures that we have good etiquette and morals. The students exhibit good morals both within and outside the school. In fact, you cannot be a student of the school and display bad behaviour and morals. Just last year. my school appointed three teachers who are specialists in civics and moral education. Their job is to teach students good manners so that they can be disciplined men and women in future. The school does not tolerate bad behaviour and indiscipline of any kind and it ensures that students obey all the rules and regulations of the school. The school is doing this because it realises we are the future leaders of this great country who will lead Nigeria to greatness.\nThirdly. my school has well-equipped facilities which make learning interesting to its students. It provides all the necessary academic facilities for the academic growth and development of the students. It has a big library that is well-stocked with relevant books and teaching aids which are used in teaching. The library is air-conditioned and students are allowed to read in the library and to borrow books or educational journals, but students are always discouraged from writing notes on them. Our laboratories for science students are well-equipped with all necessary apparatus and chemicals; they are second to none in the state Sporting facilities like football field, basketball and tennis courts are avail-able.\nDear Maurice as your best friend. I want the best for you I want you to mover over to my school because it will make learning easier for you How are you? I hope that you are fine Convey my greetings to Peter and David. I hope they are making progress too In their studies.\nYours sincerely,\nlmeh.",
    "explanation": "Airforce Base Secondary School,\nP.M.B. 2364\nLagos.\n12 May. 2005.\nDear Maurice,\nI am indeed very sorry for failing to reply your last letter on time, in which you requested for some information about my school, so as to enable you decide on moving over to my school. I've been extremely busy because of my recent appointment as the senior prefect.\nWell, I am happy that you requested for information about my school and I'll give you at least three areas in which my school excels. Firstly, my school is recognized nationwide as one of the best schools in Nigeria because of its academic excellence. The students in my school are well-taught in such a way that they are prepared for the challenges they might face educationally and socially in future. The teachers, who are qualified in their different areas of studies, ensure that we understand what they are teaching us. This has been helping us to perform brilliantly in our examinations. Our teachers ensure that they carry out their duties effectively and efficiently because they know that they play a very crucial role in our lives. This is the secret behind our brilliant performances in various external examinations.\nSecondly, my school ensures that we have good etiquette and morals. The students exhibit good morals both within and outside the school. In fact, you cannot be a student of the school and display bad behaviour and morals. Just last year. my school appointed three teachers who are specialists in civics and moral education. Their job is to teach students good manners so that they can be disciplined men and women in future. The school does not tolerate bad behaviour and indiscipline of any kind and it ensures that students obey all the rules and regulations of the school. The school is doing this because it realises we are the future leaders of this great country who will lead Nigeria to greatness.\nThirdly. my school has well-equipped facilities which make learning interesting to its students. It provides all the necessary academic facilities for the academic growth and development of the students. It has a big library that is well-stocked with relevant books and teaching aids which are used in teaching. The library is air-conditioned and students are allowed to read in the library and to borrow books or educational journals, but students are always discouraged from writing notes on them. Our laboratories for science students are well-equipped with all necessary apparatus and chemicals; they are second to none in the state Sporting facilities like football field, basketball and tennis courts are avail-able.\nDear Maurice as your best friend. I want the best for you I want you to mover over to my school because it will make learning easier for you How are you? I hope that you are fine Convey my greetings to Peter and David. I hope they are making progress too In their studies.\nYours sincerely,\nlmeh.",
    "year": "2005"
  },
  {
    "number": "102",
    "text": "Write an article for publication in your school magazine, discussing the reasons children in your area drop out of school and suggesting ways of minimizing this negative trend.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51266?exam_type=waec&type=theory&page=21",
    "correct_answer": "INCREASE IN THE NUMBER OF SCHOOL DROP-OUTS IN MY AREA\nThere has been a great increase in the number of school drop-outs in my area recently. This has resultant effects on the society at large and my area in particular The number of street urchins (area boys and girls) as they are commonly referred to is increasing by the day. with devastating consequences. The alarming rate of burglary, stealing, prostitution and even robbery in the area is an indication that the government has to do something drastic about the menace.\nChildren do not just drop out of school. There are some obvious reasons why they drop out of school so rapidly. First there is a great poverty among the people of my area Parents are so poor that they are unable to send their children to school. In most cases, they have too many of them It is as a result of poverty that many children are made to hawk goods on the streets Children hawking on the streets often make these children to abandon their education because they are exposed to money making ventures early in life.\nSecondly, many parents in my area shirk in discharging their parental duties. They do not care for these child e menial jobs around 'en they are exposed to money making ventures early in life. and in most cases, these children have to fend for themselves and in the course of doing these menial jobs around they are enticed to the extent that they drop out of school. Most parent in my area do not impart proper moral upbringing the their children.\nFurthermore, children are not motivated because of the increase in unemployment among the educated in our society. As a result of this, they do not see the need to o to school when they know that they might end up being, unemployed. The large proportion of unemployment in the country has a negative effect on these ignorant children of school age to the extent that they get fascinated by the various crimes in our society, which they consider as a means of getting money.\nWe should look for a means of minimizing negative trend. The government should do something urgent ab unemployment in our society. If parents are employed, they will be able to send their children to school without these children having to hawk before they can go to school.\nThe government should promulgate a law which forbids parents from having more children than they can cater for. There should also be a law which will ban children from hawking on our streets, during school hours.\nLastly, education should be made compulsory and affordable in the country. This will make it easier for parents to send their children to school\nGbolahan Latilo",
    "explanation": "INCREASE IN THE NUMBER OF SCHOOL DROP-OUTS IN MY AREA\nThere has been a great increase in the number of school drop-outs in my area recently. This has resultant effects on the society at large and my area in particular The number of street urchins (area boys and girls) as they are commonly referred to is increasing by the day. with devastating consequences. The alarming rate of burglary, stealing, prostitution and even robbery in the area is an indication that the government has to do something drastic about the menace.\nChildren do not just drop out of school. There are some obvious reasons why they drop out of school so rapidly. First there is a great poverty among the people of my area Parents are so poor that they are unable to send their children to school. In most cases, they have too many of them It is as a result of poverty that many children are made to hawk goods on the streets Children hawking on the streets often make these children to abandon their education because they are exposed to money making ventures early in life.\nSecondly, many parents in my area shirk in discharging their parental duties. They do not care for these child e menial jobs around 'en they are exposed to money making ventures early in life. and in most cases, these children have to fend for themselves and in the course of doing these menial jobs around they are enticed to the extent that they drop out of school. Most parent in my area do not impart proper moral upbringing the their children.\nFurthermore, children are not motivated because of the increase in unemployment among the educated in our society. As a result of this, they do not see the need to o to school when they know that they might end up being, unemployed. The large proportion of unemployment in the country has a negative effect on these ignorant children of school age to the extent that they get fascinated by the various crimes in our society, which they consider as a means of getting money.\nWe should look for a means of minimizing negative trend. The government should do something urgent ab unemployment in our society. If parents are employed, they will be able to send their children to school without these children having to hawk before they can go to school.\nThe government should promulgate a law which forbids parents from having more children than they can cater for. There should also be a law which will ban children from hawking on our streets, during school hours.\nLastly, education should be made compulsory and affordable in the country. This will make it easier for parents to send their children to school\nGbolahan Latilo",
    "year": "2005"
  },
  {
    "number": "103",
    "text": "There has been a continuous discussion on the evils of unemployment. Write a letter to the Commissioner for Labour highlighting at least three of these evils and ways of addressing them.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51268?exam_type=waec&type=theory&page=21",
    "correct_answer": "Ikeja Senior High School,\nG.R.A. Ikeja,\n22nd May. 2005\nThe Commissioner,\nMinistry of Labour and Productivity,\nAlausa.\nDear Sir.\nEVILS OF UNEMPLOYMENT IN THE STATE\nRecently, you will notice that there has been a lot of discussions in the media on the evils of unemployment in the country. The effect of unemployment in the country has started to affect Lagos State negatively. This is not surprising because the state is cosmopolitan in nature with several people entering the state on daily basis.\nI would like to highlight at least three of these evils and later suggest ways of tackling them. Increase in crime wave j is the first evil of unemployment in the state. Many people resorted to crime when they could not get job though they j came to the state with the aim of securing one. Several people living in rural areas believe that there are jobs in Lagos, so they enter the state with this erroneous belief at the back of their minds. However, they turn to crime when they could not secure employment. This has been the reason the rate of violent crimes is so alarming in the state. Armed robbery and other violent crimes are committed in the broad daylight.\nIn addition to this, many children drop out of schools. These children are exposed to money ventures too early in life. The serious implication of this is that they constitute nuisance and danger to other Lagosians as they grow old. They become urchins (area boys and girls) and terror to passers-by on our streets as while girls eventually become prostitutes littering Lagos streets.\nFurthermore the large spate of violence in and around the state is another evil of unemployment. In some parts of the state recently there are cases of public violence in our motor garages as motor park touts unleash terror and violence on one another. thereby disturbing the public peace Several innocent Lagosians lose their lives and several other not go to their places of work each time these miscreants go on rampage.\nIn order to make the state habitable for people the issue of unemployment must be urgently addressed. As a commissioner for labour, it would be appreciated, if you could use your office to establish small-scale industries where people can be employed. You could also use your influence to convince the government to give loans to the teeming unemployed Nigerians who are living in the state. so that they can be able to practise their trade. I suggests this because many people learn one trade or the other but because there is no money they could not establish themselves in business. The loan given out to the unemployed should attract low interest.\nApart from this your ministry could establish vocational centres where those who want to learn a trade can enroll to learn one trade or the other. This will make them to be self-employed after learning a trade. The ministry should also assist them to establish a business after their training.\nYours faithfully.\nSignature\nNduka Oluchi",
    "explanation": "Ikeja Senior High School,\nG.R.A. Ikeja,\n22nd May. 2005\nThe Commissioner,\nMinistry of Labour and Productivity,\nAlausa.\nDear Sir.\nEVILS OF UNEMPLOYMENT IN THE STATE\nRecently, you will notice that there has been a lot of discussions in the media on the evils of unemployment in the country. The effect of unemployment in the country has started to affect Lagos State negatively. This is not surprising because the state is cosmopolitan in nature with several people entering the state on daily basis.\nI would like to highlight at least three of these evils and later suggest ways of tackling them. Increase in crime wave j is the first evil of unemployment in the state. Many people resorted to crime when they could not get job though they j came to the state with the aim of securing one. Several people living in rural areas believe that there are jobs in Lagos, so they enter the state with this erroneous belief at the back of their minds. However, they turn to crime when they could not secure employment. This has been the reason the rate of violent crimes is so alarming in the state. Armed robbery and other violent crimes are committed in the broad daylight.\nIn addition to this, many children drop out of schools. These children are exposed to money ventures too early in life. The serious implication of this is that they constitute nuisance and danger to other Lagosians as they grow old. They become urchins (area boys and girls) and terror to passers-by on our streets as while girls eventually become prostitutes littering Lagos streets.\nFurthermore the large spate of violence in and around the state is another evil of unemployment. In some parts of the state recently there are cases of public violence in our motor garages as motor park touts unleash terror and violence on one another. thereby disturbing the public peace Several innocent Lagosians lose their lives and several other not go to their places of work each time these miscreants go on rampage.\nIn order to make the state habitable for people the issue of unemployment must be urgently addressed. As a commissioner for labour, it would be appreciated, if you could use your office to establish small-scale industries where people can be employed. You could also use your influence to convince the government to give loans to the teeming unemployed Nigerians who are living in the state. so that they can be able to practise their trade. I suggests this because many people learn one trade or the other but because there is no money they could not establish themselves in business. The loan given out to the unemployed should attract low interest.\nApart from this your ministry could establish vocational centres where those who want to learn a trade can enroll to learn one trade or the other. This will make them to be self-employed after learning a trade. The ministry should also assist them to establish a business after their training.\nYours faithfully.\nSignature\nNduka Oluchi",
    "year": "2005"
  },
  {
    "number": "104",
    "text": "You are one of the speakers in a debate on the topic: Women should not be in paid employment while they are still bearing children. Write your contribution for or against the proposition.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51269?exam_type=waec&type=theory&page=21",
    "correct_answer": "WOMEN SHOULD BE IN PAID EMPLOYMENT WHILE THEY ARE STILL BEARING CHILDREN\nGood day, Mr. Chairman. Panel of Judges, Ladies and Gentlemen l am standing before you to vehemently oppose the motion which states that women should not be in paid employment while they are still bearing children. I strongly believe that women should rather be allowed to work and earn income while they are still bearing children with the following points.\nFirst and foremost, the economy of the country is bad This makes living and existence too expensive to the extent that men could not provide all the needs of the family. Women should be allowed to work and earn income so as to augment the income of their husbands. It is only men with diabolical intentions that will not allow their wives to work when they are still bearing children It is just a calculated attempt to reduce their wives to child-bearing machines alone. On the other hand, if women of child bearing age are allowed to be gainfully employed, they will be able to contribute economically to the development of the family, after all it is obvious that the income coming from men can not meet all the needs of the family.\nMr. Chairman, I want to ask a question: Why do we train our girls or send them to schools when they will not be able to work when they are bearing children? If women are not allowed to be in paid employment while they are still bearing children, we are obviously killing their initiatives, making mess of the educational training their parents gave to them em while they were young and infringing on their fundamental human rights. Then they should have just been left untrained either in school or in one vocation or the other so that they can become good gossips and busy bodies. Women too have the rights to pursue a career just like men; anything short of this is mere male chauvinism.\nI heard my opponent saying that the place of the women is in the kitchen. I want to disagree totally with him. When our women are restricted to the kitchen when they are able-bodied. I wonder how useful would they be when they are not. Women too have responsibilities to their families and children. They can only fulfil these responsibilities when they i are in paid employment, Being in paid employment makes them strong and agile as they will have to wake up early in the morning to take care of their husbands and children, even when they are pregnant. They will be able to exercise their brains and nerves which would have been dull and inactive if they were idle.\nIn conclusion, it is high time our society realized that women are now better equipped to face the challenges of paid employment and they will want to be adventurous like men. They should be in paid employment while they are still bearing children. I hope with these points, I've been able to convince you that women should be in paid employment while they are still bearing children.\nThanks you.",
    "explanation": "WOMEN SHOULD BE IN PAID EMPLOYMENT WHILE THEY ARE STILL BEARING CHILDREN\nGood day, Mr. Chairman. Panel of Judges, Ladies and Gentlemen l am standing before you to vehemently oppose the motion which states that women should not be in paid employment while they are still bearing children. I strongly believe that women should rather be allowed to work and earn income while they are still bearing children with the following points.\nFirst and foremost, the economy of the country is bad This makes living and existence too expensive to the extent that men could not provide all the needs of the family. Women should be allowed to work and earn income so as to augment the income of their husbands. It is only men with diabolical intentions that will not allow their wives to work when they are still bearing children It is just a calculated attempt to reduce their wives to child-bearing machines alone. On the other hand, if women of child bearing age are allowed to be gainfully employed, they will be able to contribute economically to the development of the family, after all it is obvious that the income coming from men can not meet all the needs of the family.\nMr. Chairman, I want to ask a question: Why do we train our girls or send them to schools when they will not be able to work when they are bearing children? If women are not allowed to be in paid employment while they are still bearing children, we are obviously killing their initiatives, making mess of the educational training their parents gave to them em while they were young and infringing on their fundamental human rights. Then they should have just been left untrained either in school or in one vocation or the other so that they can become good gossips and busy bodies. Women too have the rights to pursue a career just like men; anything short of this is mere male chauvinism.\nI heard my opponent saying that the place of the women is in the kitchen. I want to disagree totally with him. When our women are restricted to the kitchen when they are able-bodied. I wonder how useful would they be when they are not. Women too have responsibilities to their families and children. They can only fulfil these responsibilities when they i are in paid employment, Being in paid employment makes them strong and agile as they will have to wake up early in the morning to take care of their husbands and children, even when they are pregnant. They will be able to exercise their brains and nerves which would have been dull and inactive if they were idle.\nIn conclusion, it is high time our society realized that women are now better equipped to face the challenges of paid employment and they will want to be adventurous like men. They should be in paid employment while they are still bearing children. I hope with these points, I've been able to convince you that women should be in paid employment while they are still bearing children.\nThanks you.",
    "year": "2005"
  },
  {
    "number": "105",
    "text": "Write a story ending with the words: I wish I had listened to my father.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51271?exam_type=waec&type=theory&page=21",
    "correct_answer": "I WISH I HAD LISTENED TO MY FATHER\nI am in confusion and misery right now as I write this story. Will my father ever find a place in his heart to forgive me?i said this because I have offended my father so greatly that it will take a lot of effort to get his forgiveness.\nI am twenty five years old. I took a decision some years ago and now I live to regret it. I will live to curse the day I met Kingsley, the man who ruined my life. I come from a very good Christian family. a God-fearing one. I am the only child and daughter of my parents. Though we were not very wealthy. we were comfortable and morally upright.\nI had brought shame and disgrace to them with my actions that I now regret. If only I could turn back the hands of the clock, I would do things differently. I had just left secondary school at a tender age of seventeen and my parents were proud of me. They wanted me to go to a higher institution of learning and thereafter, live a good life. This was the dream my father had for me since I was a kid and now, he was ready to make it a reality.\nWhen I was about entering the university, my father would always advise me to be a good girl. It was around this time I lost my mother. It was so painful but I had to live with the reality of life. My Dad saw that he did everything he could to make me realize and actualize my mother's wish that I should get married in the church. This was what I had in mind until I met Kingsley. I was still in the university one fateful morning when I met Kingsley.\nI was waiting for a taxi on this day when a car stopped beside me and I bent to see if the driver of the vehicle was someone I knew. To my surprise, I saw a very handsome young man smiling at me. His smile was so captivating that I fell in love with him immediately. Then he said \"Hello\" to me and I was lost in the beauty of his deep voice. My knees became weak and 1 would have fallen if the car was not beside me to lean on He told me his name was Kingsley and he was ready to give me a ride to wherever I was going. I didn't even object. I just got into the car and he started driving. That same day, I ended up in bed with him. I fell head over heels in love with him. For me there was no looking back. I totally forgot all the advice my father gave me and my dreams of becoming a successful woman in life.\nMy father soon noticed that I had changed as I acted absent-mindedly at home. To cut the story short, I soon found out that I was pregnant and Kingsley was responsible. I was shocked by the way Kingsley behaved when I told him this. He called me \"a lying bitch and that I should look for the father of the \"bastard\" I was carrying. He also told me that he was married to a woman who was living in the United States of America with three kids. After that, he slammed the door on me.\nI could not face my father now and presently l am squatting with a friend of mine and I am eight month pregnant expecting to put to bed very soon. Anytime I think of the advice my father gave me and all his care and love, I regret my actions which brought shame and disgrace to him. I wish I had listened to him.",
    "explanation": "I WISH I HAD LISTENED TO MY FATHER\nI am in confusion and misery right now as I write this story. Will my father ever find a place in his heart to forgive me?i said this because I have offended my father so greatly that it will take a lot of effort to get his forgiveness.\nI am twenty five years old. I took a decision some years ago and now I live to regret it. I will live to curse the day I met Kingsley, the man who ruined my life. I come from a very good Christian family. a God-fearing one. I am the only child and daughter of my parents. Though we were not very wealthy. we were comfortable and morally upright.\nI had brought shame and disgrace to them with my actions that I now regret. If only I could turn back the hands of the clock, I would do things differently. I had just left secondary school at a tender age of seventeen and my parents were proud of me. They wanted me to go to a higher institution of learning and thereafter, live a good life. This was the dream my father had for me since I was a kid and now, he was ready to make it a reality.\nWhen I was about entering the university, my father would always advise me to be a good girl. It was around this time I lost my mother. It was so painful but I had to live with the reality of life. My Dad saw that he did everything he could to make me realize and actualize my mother's wish that I should get married in the church. This was what I had in mind until I met Kingsley. I was still in the university one fateful morning when I met Kingsley.\nI was waiting for a taxi on this day when a car stopped beside me and I bent to see if the driver of the vehicle was someone I knew. To my surprise, I saw a very handsome young man smiling at me. His smile was so captivating that I fell in love with him immediately. Then he said \"Hello\" to me and I was lost in the beauty of his deep voice. My knees became weak and 1 would have fallen if the car was not beside me to lean on He told me his name was Kingsley and he was ready to give me a ride to wherever I was going. I didn't even object. I just got into the car and he started driving. That same day, I ended up in bed with him. I fell head over heels in love with him. For me there was no looking back. I totally forgot all the advice my father gave me and my dreams of becoming a successful woman in life.\nMy father soon noticed that I had changed as I acted absent-mindedly at home. To cut the story short, I soon found out that I was pregnant and Kingsley was responsible. I was shocked by the way Kingsley behaved when I told him this. He called me \"a lying bitch and that I should look for the father of the \"bastard\" I was carrying. He also told me that he was married to a woman who was living in the United States of America with three kids. After that, he slammed the door on me.\nI could not face my father now and presently l am squatting with a friend of mine and I am eight month pregnant expecting to put to bed very soon. Anytime I think of the advice my father gave me and all his care and love, I regret my actions which brought shame and disgrace to him. I wish I had listened to him.",
    "year": "2005"
  },
  {
    "number": "106",
    "text": "Read the following passage carefully and answer the question on it.\n      The chalkboard is by far the commonest teaching aid used at virtually.all levels of education from the nursery to the university. It is the most enduring teaching aid and perhaps will be the most difficult to replace. In the advanced-countries of the world, it is being threatened by the overhead protector. However, the overhead projector requires constant supply of electricity which is one reason we cannot rely on it yet. The chalkboard used to be black, which why the name \"blackboard\" stuck for ages; but today, there are boards of various colours: blue, green, even white.\n      Now, most chalkboards are made of wood nailed to the wall, instead of the concrete board made of cement and f ine sand that was more common. some are also made of metal. The chalkboard has the advantages of low cost, availability and ease of maintenance, usually involving mere cleaning and occasional retouching of the surface with the renovator. However, if the board is metal, the felt marker should be protected against drying by replacing the cap When it is not in use. The major drawback in the use of the chalkboard is that the information on it can only be temporary. if there is only one board for the class, it is usually impossible to leave the information there for more than a few hours, since other teachers would want to use it.\n      It is not easy to draw complex diagrams showing minute details, such as part's of the body and contours, unless one is a good artist. Where one has succeeded with laborious  illustrations, using different colours, it could be painful when the board has to be cleaned by the next teacher. However, there are nowadays various innovations, including foldable boards made of plywood, which allow teachers more room to leave their materials for longer periods.\n      Finally, it is a great disadvantage that during the course of teaching, more time is spent writing on the board than when one is using the overhead projector. So, in all, more time is needed for any lesson when one uses the board rather than the overhead projector.\n(a) Why does the writer use the word chalkboard rather than blackboard most of the time?\n(b) Mention two different types of chalkboard that have been in use.\n(c) Mention two disadvantages of the chalkboard.\n(d) Why should the cap of the felt pen be re placed when the pen is not in use?\n(e) The major drawback in the use of the chalkboard  (i) What grammatical name is given to the expression as it is used in the passage? (ii) What is its function?\n(f) ...it is being threatened by the overhead projector... (i) What figure of speech is used in this expression? (ii) What does it mean? (g) For each of the following words, find another word or phrase which means the same and which can replace it as it used in the passage: (i) virtually (ii) constant (iii) various (iv) temporary (v) laborious (vi) room",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51272?exam_type=waec&type=theory&page=22",
    "correct_answer": ".(a)The reason is that there are boards of different (other) colours I not all boards are black.\n(b) There are boards made of concrete, of wood (plywood) and of metal\n(c) The disadvantages are that: (i) Information on it is usually temporary (ii) a lot of time is spent on using it.\n(d) The cap has to be replaced to prevent the pen from drying up.\n(e)(i) Noun phrase (ii) Subject of (the verb) \"is\"\n(f) (i) This is a metaphor (ii) It means that the overhead projector may soon replace the chalkboard or take its place.\n(g)(i) Virtually- almost, practically. nearly. (ii) Constant — regular, steady, consistent, continuous, stable. uninterrupted. (iii) Various - different, differing assorted, diverse. (iv) temporary for a while, for a short time. for a brief period (v) Laborious • difficult, tedious. tiresome, arduous, tasking (vi) Room — space, opportunity. time.",
    "explanation": ".(a)The reason is that there are boards of different (other) colours I not all boards are black.\n(b) There are boards made of concrete, of wood (plywood) and of metal\n(c) The disadvantages are that: (i) Information on it is usually temporary (ii) a lot of time is spent on using it.\n(d) The cap has to be replaced to prevent the pen from drying up.\n(e)(i) Noun phrase (ii) Subject of (the verb) \"is\"\n(f) (i) This is a metaphor (ii) It means that the overhead projector may soon replace the chalkboard or take its place.\n(g)(i) Virtually- almost, practically. nearly. (ii) Constant — regular, steady, consistent, continuous, stable. uninterrupted. (iii) Various - different, differing assorted, diverse. (iv) temporary for a while, for a short time. for a brief period (v) Laborious • difficult, tedious. tiresome, arduous, tasking (vi) Room — space, opportunity. time.",
    "year": "2005"
  },
  {
    "number": "107",
    "text": "Read the following passage carefully and answer the questions on it.\n      Dele groaned and got out of bed. There was no clock on the mantle-piece and the room was still dark, but he knew that he was already late for work, probably by up to an hour. He was a commercial bus driver and had to get started as early as 5.00 a.m. and go almost non-stop until about 9.00 p.m. to be able to make the daily returns that the bus owner demanded.\n      On the previous day, he had attended an all-night party - a late uncle's burial ceremony - where he had drunk himself almost senseless before crawling home on his face and hurried off to work, but not before carefully fastening on his upper left arm the amulet he had always worn for protection against accident. A similar amulet hung concealed under the steering column of his bus. On his way, still feeling groggy,  he caught his left toe against a stump and had some misgiving.  It was a bad sign, and he was supposed to go back home and then set out again. But there was no time for that now, so he hurried on. At the bus station,  Dele quickly loaded his bus and sped off without any of the necessary checks on the vehicle. He had to make up for lost time. It was the rush hour, so the bus was overloaded as it often was, with many passengers hanging on to the doors. The tyres were threadbare, the brakes were faulty and the road was wet, but, still feeling a little sleepy, Dele sped on. Many passengers protested about his reckless  driving, but he would not listen. After all, didn't he have protection against accident?  \n      As the vehicle took the last turn before its destination, Dele saw a broken-down truck blocking his side of the road. Under normal circumstances, he could have brought the bus safely to a halt, but the circumstances were far from normal. The careening bus hit the parked vehicle, swerved wildly across the road and plunged into a ditch. Dele's surprise before he sank into oblivion was the failure of his supposed protective amulets.\n(a) Why did Dele wake up late?\n(b) ...he caught his left tow against a stump and had some misgiving. What does this tell us about Dele?\n(c) Give two reasons why Dele drove recklessly.\n(d) Why was Dele unable to stop his faulty vehicle?\n(e) What was Dele's condition after the accident?\n(f) After all; didn't he have protection against accident? What literary device is used in this expression?\n(g) ...wildly across the road... (i) What is the grammatical name given to the expression as it is used in the passage? (ii) What is its function? (h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) probably (ii) returns (iii) groggy (iv) misgiving (v) threadbare (vi) reckless.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51273?exam_type=waec&type=theory&page=22",
    "correct_answer": "(a) He went to bed late. (the previous night)\n(b) He was superstitious\n(c)(i) He was trying to make up for lost time (ii) He believed that his amulets offered him protection against accidents.\n(d)(i) He was speeding / was driving recklessly (ii) He was (still) sleepy\n(e) He was unconscious.\n(f) Rhetorical question.\n(g)(i) Adverbial phrase (of manner) (ii) Modifies (the verb) \"swerved\"\n(h)(i) Probably - perhaps, maybe, possibly (ii) returns— amount of money, income, revenue. (iii) groggy — dizzy, weak, sleepy, tired, drowsy (iv) misgiving — doubt, premonition, foreboding; fears, apprehension (v) threadbare — worn-out, bald, old, worn. (vi) reckless dangerous, careless, rough, irresponsible, bad.",
    "explanation": "(a) He went to bed late. (the previous night)\n(b) He was superstitious\n(c)(i) He was trying to make up for lost time (ii) He believed that his amulets offered him protection against accidents.\n(d)(i) He was speeding / was driving recklessly (ii) He was (still) sleepy\n(e) He was unconscious.\n(f) Rhetorical question.\n(g)(i) Adverbial phrase (of manner) (ii) Modifies (the verb) \"swerved\"\n(h)(i) Probably - perhaps, maybe, possibly (ii) returns— amount of money, income, revenue. (iii) groggy — dizzy, weak, sleepy, tired, drowsy (iv) misgiving — doubt, premonition, foreboding; fears, apprehension (v) threadbare — worn-out, bald, old, worn. (vi) reckless dangerous, careless, rough, irresponsible, bad.",
    "year": "2005"
  },
  {
    "number": "108",
    "text": "Read the following passage carefully and answer the question on it. .\n      You cannot expect to go through life without meeting problems. Difficulties, perplexities and frustrations are an inevitable part of human experience. Accepting this idea of the inevitability of problems will help you to approach them in a robust frame of mind rather than thinking that you are a victim specially singled out by a malignant fate.\n      When confronted with a problem, the first thing to do is to gather i all relevant data to get acquainted with all the facts of the case. Then write down exactly what the problem is, stating it simply in black and white. This gives you something definite with which to come to terms. The problem is, assessed and you will now have something concrete to deal with.\n      Next, give serious thought to the problem, making sure that such thought does not degenerate into worry as worry accomplishes nothing. Aim at clear, dispassionate thought, viewing the problem as if it were friend's and not your own. Look at it from all angles and from the view point. of all concerned. You court disaster if you are entirely selfish in your outlook. The single important purpose of all this is to discover all possible solutions to the problem.\n      Having examined the problem broadly and impartially, carefully examine all the possible solutions or courses of action. the knowledge that you have done this will keep you from useless regrets later, when you can remind yourself that all possible courses of action were examined and you chose what appeared to be the best. Next, eliminate all proposed solutions which are seen on further thought to be impracticable.\n      You will now find that your list has been whittled down to two or three possibilities. At this stage it is often a good plan to get out into the open air. go for a walk or a ride, preferably somewhere with wide horizons. There out in the open, review the problem afresh. You will find it appears much less formidable. Ask yourself how the difficulty will appear in ten years time, or even one! This fresh review enable you to make a final choice as you turn to the remaining solutions and. before you return home, decide which you are going to adopt. As you go to sleep that night, let your last thoughts be upon your decision. If, in the morning, you still feel it is the best one to take, go ahead.\n      If you have a friend you think is capable of giving sound advice, consult him. Do this before your final decision, so that you will have the benefit of his views before you decide. Talking things over with another is always a great help. It enables you to isolate the problem and to decide which are the important factors. Even if the friend offers no advice, a sympathetic word will help you, you will see them in a clearer light. Some will appear impossible even while you speak. Alternatively, one will appear most attractive.\n      In dealing with problems, remember the time factor. Although some problems solve themselves in time, and delaying tactics are therefore the best form of action for them, most other problems generally get more complicated the longer they are left. You should therefore get to grips with problems immediately they occur.\n      All told, reasonable foresight and imagination can prevent many problems ever arising. Tact, thoughtfulness and responsible conduct can also keep life largely problem-free.\n(a)In six sentences. one for each, summarise the steps to be taken when faced with a problem and state why each step is necessary.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51274?exam_type=waec&type=theory&page=22",
    "correct_answer": "(1) Finding out all the facts defines the problem and makes the problem definite.(2) Thinking seriously overt k problem reveals all the likely solutions.(3) Examining all the solutions carefully helps in choosing the best and helps to eliminate impracticable ones.(4) Looking at the problem afresh enables one to make a final choice.(5) Consulting a friend clarifies the problem.(6) Dealing with the problem promptly avoids further complications",
    "explanation": "(1) Finding out all the facts defines the problem and makes the problem definite.(2) Thinking seriously overt k problem reveals all the likely solutions.(3) Examining all the solutions carefully helps in choosing the best and helps to eliminate impracticable ones.(4) Looking at the problem afresh enables one to make a final choice.(5) Consulting a friend clarifies the problem.(6) Dealing with the problem promptly avoids further complications",
    "year": "2005"
  }
]