[
  {
    "number": "69",
    "text": "(a) (i) Describe the physical properties of each of Specimens B (SAND), C (CLAY), and D (LOAM)\n(ii) To about 10ml each of the specimens B, C and D, add about 5ml of specimen O and using the hand, mix well. Describe the physical properties of each specimen? \n(b) Which of the specimens B, C, and D should be considered of greater value to farmers? Give two reasons for your answers\n(c) State three ways of improving each of the other two specimens not mentioned in (b) above",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59954?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "70",
    "text": "(a) State three functions and two methods of maintaining each of specimens F (HOE), H (RAKE), and K (PLIERS).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59955?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "71",
    "text": "(a) Identify specimens L, N, and Q\nSpecimen L;                Specimen N;                Specimen Q; \n           \n(b) State three agricultural uses of each specimen N and Q\n(c) List two crops each which require each of the specimens L, N and Q in large quantities for good yields\n(d) State three methods of applying specimen L on a farm",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59956?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "72",
    "text": "(a) State the main nutrient obtainable from each of the Specimen G (BONE), and P ( DRIED ANIMAL BLOOD) and two main nutrients obtainable from Specimen T (FISH)\n(b) State three functions for each of the two main nutrients obtainable from specimen T\n(c) Name one feed ingredient that can be prepared from each of specimens G, P, and T. \n(d) Give two disadvantages of using the ingredient prepared from specimen P in compounding livestock feed.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59957?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  }
]