[
  {
    "number": "97",
    "text": "SECTION A\nStudy specimens B, D and E and answer questions 1(a) to 1(f).\n(a) Name the phylum and class of the organism that possesses specimen D.\n     Phylum:\n     Class:\n(b)  State three observable features of Specimen B.\nc(i)  Give three functions of specimen B to the organism from which it was obtained\n  (ii)  State one function each of specimens D and E to the organism from which they were obtained.\n        D:\n        E:\n(iii)  Mention one adaptation each of specimens D and E to the function stated in 1c(ii)\n       D:\n       E:\nd(i)  Use the office pin provided to prick the dark green structure attached to specimen B. Touch the fluid oozing from the structure with each of the red and blue litmus\n       papers at intervals. Record the observations and inferences on the table below:    \n\n\n\nTest\nObservation\nInferences\n\n\nRed litmus paper + fluid\n \n \n\n\nBlue litmus paper + fluid\n \n \n\n\n\n(ii) Give three functions of the fluid tested in 1d(i) to the organism that possesses it.\ne(i) Name the biological system in the body of vertebrates that specimens D and E belongs to.\n  (ii) Which of specimens B, D or E is absent in humans?\nf(i) Name the mode of feeding of the organism that possesses specimen E.\n(ii) Name one type of food that the organism that possesses specimen D consumes.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/71968?exam_type=waec&type=practical&page=20",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  },
  {
    "number": "98",
    "text": "Study specimens F, H and K and answer questions 2(a) to 2(d).\n(a) State four functions of specimen H to the plant from which it was obtained.\nb(i) State one function each of specimen F and K to the plants from which they were obtained.\n     F:\n     K:\n  (ii) Give one reason for the answers in 2b(i)\n    F:\n    K:\n (iii) What part of the plant is modified for the function stated in 2b(i)?\n    F:\n    K:\n c(i) State four observable differences between specimens F and K.\n\n\n\n         F\n        K\n\n\n \n \n\n\n \n \n\n\n \n \n\n\n \n \n\n\n\n(ii) State one similarity between specimens F and K.\n(d) Make a drawing; 6 cm to 8 cm long of the specimen H and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/71980?exam_type=waec&type=practical&page=20",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  },
  {
    "number": "99",
    "text": "SECTION B\nAnswer all the questions in this section\nStudy specimens L, M, P, and Q and answer questions 3(a) to 3(d).\n(a) Name the region of the human body where each of specimens L and Q are located.\n    L:\n    Q:\nb(i) State four observable differences between specimens L and Q.\n\n\n\n          L\n        Q\n\n\n \n \n\n\n \n \n\n\n \n \n\n\n \n \n\n\n\n(ii) State four observable similarities between specimens L and Q.\nc(i) Name two bones each that articulate with specimens M and P.\n (ii) Name one vertebra each that is located and after each of specimens L and Q in the vertebral column.\n               Before                               After\n L: .................................           ....................................\n Q: ................................           .....................................\n(d) Complete the table below by using tick (✔) to indicate presence and cross (X) to indicate absence of the following features in each of specimens L, M, P and Q.\n\n\n\nSpecimen\n                  Features\n\n\n \nNeural canal\nRounded head\nNeural spine\nLong shaft\n\n\nL\n \n \n \n \n\n\nM\n          X\n \n \n \n\n\nP\n \n \n \n \n\n\nQ\n \n \n            ✔",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/71986?exam_type=waec&type=practical&page=20",
    "correct_answer": null,
    "explanation": "",
    "year": "2024"
  }
]