[
  {
    "number": "654",
    "text": "Amoeba obtains its oxygen requirements",
    "options": {
      "A": "from oxidising food substances",
      "B": "from air trapped in vacuoles",
      "C": "through diffusion of air into its body",
      "D": "through an air cavity in the ectoplasm"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19621?exam_type=waec&type=obj&page=131",
    "correct_answer": "C",
    "explanation": "Amoeba obtain oxygen from the water around them through a process called diffusion.Oxygen gas dissolved in the water passes through the amoeba's plasma membrane and into its body. The amoeba uses the oxygen for respiration and to break down food into simpler molecules. Carbon dioxide produced by the amoeba is excreted back into the surrounding environment through diffusion, and because amoeba are small, the oxygen spreads quickly throughout their bodies.",
    "year": "2000"
  },
  {
    "number": "655",
    "text": "Which of the following best describes a colony of volvox?",
    "options": {
      "A": "Asexually reproduced cells held together in a mass, but independent of each other",
      "B": "Sexually reproduced cells held together in a mass, and dependent on each other",
      "C": "Single free-living acellular units irrespective of their parental origin",
      "D": "Several units of cells, held together by cytoplasmic strands and dependent on each other"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19622?exam_type=waec&type=obj&page=131",
    "correct_answer": "A",
    "explanation": "Living cells exist in a variety of forms, including Singly or free-living, filamentous and Colonial.\nA Volvox colony is made up of thousands of small biflagellate somatic cells arranged in a peripheral layer and embedded in a transparent extracellular matrix (ECM). Volvox can reproduce asexually by forming daughter colonies that are identical to the parent colony. These daughter colonies form inside the parent colony and eventually burst out, killing the parent colony. Consequently, asexually reproduced cells held together in a mass, but independent of each other, explains a colony of Volvox.",
    "year": "2000"
  },
  {
    "number": "656",
    "text": "The hydra has two body layers of cells called",
    "options": {
      "A": "ectodermis and enteron",
      "B": "ectoderm and endoderm",
      "C": "endodermis and dermis",
      "D": "epidermis and dermis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19623?exam_type=waec&type=obj&page=132",
    "correct_answer": "B",
    "explanation": "The two body layers of a hydra are the endoderm and ectoderm\nEndoderm: The inner layer of Hydra's body wallEctoderm: The outer layer of Hydra's body wall",
    "year": "2000"
  },
  {
    "number": "657",
    "text": "All the following organelles have membranes except",
    "options": {
      "A": "nucleus",
      "B": "vacuole",
      "C": "cell membrane",
      "D": "cell wall"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19624?exam_type=waec&type=obj&page=132",
    "correct_answer": "D",
    "explanation": "Cell wallA non-membrane-bound organelle found in plant, fungi, and some bacteria cells. The cell wall is made of carbohydrates and proteins, and its main function is to protect the cell and provide structure and support.Cell membranePresent in all cells, the cell membrane is made of lipids, proteins, and carbohydrates. It's the outermost layer of the cell in animals, and encloses other organelles within. The cell membrane is flexible, metabolically active, and selectively permeable. The cell wall is a non-membrane-bound organelle, while the cell membrane is present in all cells. Therefore, Cell wall has no membrane. OptionD.",
    "year": "2000"
  },
  {
    "number": "658",
    "text": "Which of these has the most complex level of organization?",
    "options": {
      "A": "Euglena",
      "B": "Hydra",
      "C": "Heart",
      "D": "Virus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19625?exam_type=waec&type=obj&page=132",
    "correct_answer": "C",
    "explanation": "The levels of organization in the human body, from basic to complex are: Cell, Tissue, Organ, System, Organism.\nCellsThe most basic unit of life and the smallest unit that can reproduce.TissuesA group of similar cells that work together to perform a specific function. The heart's cardiac muscle is a tissue.OrgansA structure made up of different tissues that perform specific bodily functions. The heart is an organ.Organ systemsA higher level of organization that consists of functionally related organs. The heart is part of the circulatory system, which also includes blood vessels.As a result, the heart is part of a complex system of organization in the body.",
    "year": "2000"
  },
  {
    "number": "659",
    "text": "The unit contained in a cell structure responsible for changes in form and shape of organisms is called",
    "options": {
      "A": "mitochondria",
      "B": "gene",
      "C": "ribosome",
      "D": "lysosome"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19626?exam_type=waec&type=obj&page=132",
    "correct_answer": "B",
    "explanation": "Genes are responsible for the physical characteristics of organisms, including their form and shape.\nDeoxyribonucleic acid (DNA) is a biological molecule that contains the instructions for an organism's development, growth, reproduction, and functioning. DNA is present in almost every cell in the body.",
    "year": "2000"
  },
  {
    "number": "660",
    "text": "The plant cell mostly stores food as",
    "options": {
      "A": "glycogen",
      "B": "auxins",
      "C": "homtones",
      "D": "starch"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19627?exam_type=waec&type=obj&page=132",
    "correct_answer": "D",
    "explanation": "Plant cells store food primarily as starch, a white, granular organic chemical. Plants produce starch in their green leaves from excess glucose created during photosynthesis. When needed, plants can break down starch into glucose units for energy.\nOn the other hand,animal cells store food as glycogen, a polysaccharide of glucose. The hormone insulin converts excess glucose in the blood into glycogen, which is then stored in the muscles and liver. When the body needs extra energy during exercise, glycogen is broken down into glucose.",
    "year": "2000"
  },
  {
    "number": "661",
    "text": "The presence of a large member of mitochondria in a cell indicates that",
    "options": {
      "A": "it has little cytoplasmic content",
      "B": "the cell is very active",
      "C": "the cell is dormant",
      "D": "the respiration is poor"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19628?exam_type=waec&type=obj&page=133",
    "correct_answer": "B",
    "explanation": "Mitochondria are organelles that produce energy through oxidative phosphorylation, regulate metabolic activity, and promote cell growth and multiplication.A large number of mitochondria in a cell indicates that the cell has a high energy demand. Some different cells have different amounts of mitochondria becausethey need more energy. So for example, the muscle has a lot of mitochondria, the liver does too, the kidney as well, and to a certain extent, the brain, which lives off of the energy those mitochondria produce.\nA large number of mitochondria in a cell indicates that the cell is active because it has a high demand for energy",
    "year": "2000"
  },
  {
    "number": "662",
    "text": "Which of the following statements is incorrect about diffusion?",
    "options": {
      "A": "It involves degradation of soluble  particles in solvents",
      "B": "it occurs mainly in gaseous and liquid media",
      "C": "No membrane is needed to effect the movement of molecules",
      "D": "Molecules move from region of lower concentration to that of higher concentration."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19629?exam_type=waec&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "Diffusion is the movement of particles from an area of higher concentration to an area of lower concentration.",
    "year": "2000"
  },
  {
    "number": "663",
    "text": "In which of the following organisms is ammonia excreted as a waste product?",
    "options": {
      "A": "Man",
      "B": "Bird",
      "C": "Amoeba",
      "D": "Spirogyra"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19630?exam_type=waec&type=obj&page=133",
    "correct_answer": "C",
    "explanation": "Ammonia is a waste product excreted by aquatic animals, as well as some other organisms, including Amoeba.\nAmoeba's main waste products are ammonia and carbon dioxide. It excretes waste through diffusion, which is the movement of molecules from a higher concentration to a lower concentration.Other organisms excrete nitrogenous wastes in different forms, including:Birds and lizards: Excrete nitrogenous wastes as uric acidHumans: Excrete ureaReptiles and many terrestrial invertebrates: Produce uric acid",
    "year": "2000"
  },
  {
    "number": "664",
    "text": "The following are the functions of supporting tissues in plant except",
    "options": {
      "A": "rigidity",
      "B": "flexibility",
      "C": "strengthening",
      "D": "secretory"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19631?exam_type=waec&type=obj&page=133",
    "correct_answer": "D",
    "explanation": "Supporting tissues in plants have several functions, including:\nStructuralsupport: Supporting tissues provide the framework and support the structure of the plant, holding up leaves, flowers, and buds.Transportation: Supporting tissues transport water, nutrients, and assimilates throughout the plant.Protection: The strength of supporting tissues protects the plant from enemies. For example, the hard shell of many seeds prevents animals from chewing them to pieces or puncturing them.Flexibility: Supporting tissues give the plant flexibility and resilience, allowing it to bend without breaking.",
    "year": "2000"
  },
  {
    "number": "665",
    "text": "Which of the following organisms has the largest surface area-to-volume ratio?",
    "options": {
      "A": "Man",
      "B": "Earthworm",
      "C": "Amoeba",
      "D": "Grasshopper"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19632?exam_type=waec&type=obj&page=133",
    "correct_answer": "C",
    "explanation": "Amoebahas the largest surface area-to-volume ratio among the organisms listed in the options. This is because amoeba is a unicellular organisms with a relatively large surface area compared to their volume.\nAs the size of an organism increases, its volume increases faster than its surface area. This means thatthe surface area to volume ratio decreases as the organism gets larger.",
    "year": "2000"
  },
  {
    "number": "666",
    "text": "Which of the following plant parts does not perform supportive function?",
    "options": {
      "A": "Parenchyma, xylem and . collenchyma",
      "B": "Epidermis, sclerenchyma and xylem",
      "C": "Parenchyma, collenchyma and sclerenchyma",
      "D": "Sclerenchyma, xylem and collenchyma"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19633?exam_type=waec&type=obj&page=134",
    "correct_answer": "B",
    "explanation": "The supporting tissues in plants are collenchyma, sclerenchyma, and vascular tissues (xylem and phloem).\nParenchyma is one of the three main types of ground tissue in plants, along with collenchyma and sclerenchyma. Collenchyma is a living support tissue with irregular walls, while sclerenchyma is a dead support tissue with thick walls.",
    "year": "2000"
  },
  {
    "number": "667",
    "text": "The following are useful effect of micro-organisms except",
    "options": {
      "A": "production of vaccines",
      "B": "curing of tobacco",
      "C": "tanning of leather",
      "D": "decay of meat"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19634?exam_type=waec&type=obj&page=134",
    "correct_answer": "D",
    "explanation": "Decay in meat is not a useful effect of microorganisms. Microorganisms can cause meat to spoil, which can lead to food waste and food borne infections. Spoilage can cause meat to change color, produce off-flavors, and develop mucus and exudates.",
    "year": "2000"
  },
  {
    "number": "668",
    "text": "Which of the following structures is not present in the vascular bundles of a dicot stem?",
    "options": {
      "A": "Xylem",
      "B": "Phloem",
      "C": "lntra-fascicular cambium",
      "D": "Inter-fascicular cambium"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19635?exam_type=waec&type=obj&page=134",
    "correct_answer": "C",
    "explanation": "In each of vascular bundles in the dicot stem, xylem and phloem are on the same radius with xylem situated towards the pith and phloem situated towards the pericycle and a strip of cambium separates the two. This strip of cambium that separates the phloem and xylem is called interfascicular cambium. Therefore the only structure not present in the vascular bundle of a dicot stem is intrafascicular cambium. The correct answer is option C.",
    "year": "2000"
  },
  {
    "number": "669",
    "text": "When a mammal respires anaerobically for a long time",
    "options": {
      "A": "pyruvic acid is convened into acetyl COA",
      "B": "more energy is released from fats  in the body",
      "C": "lactic acid accumulates in the muscles",
      "D": "the Krebs cycle is fully completed."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19636?exam_type=waec&type=obj&page=134",
    "correct_answer": "C",
    "explanation": "When a mammal respires anaerobically for a long time, lactic acid builds up in the muscles, leading to fatigue and cramps.\nLactic acid build-up: Anaerobic respiration produces lactic acid as a waste product when glucose is broken down. This lactic acid accumulates in the muscles.Muscle fatigue: A buildup of lactic acid causes muscle fatigue.pH drop: If too much lactic acid builds up, the pH falls, which can affect enzyme function and lead to fatigue and cramps. The correct answer is option C",
    "year": "2000"
  },
  {
    "number": "670",
    "text": "Which of the labelled structures in the diagram are involved with the entry\nof carbondioxide for photosynthesis?",
    "options": {
      "A": "I, II and III only",
      "B": "I, II, III and VI",
      "C": "I, II, V and VI",
      "D": "I, II, III, and IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19637?exam_type=waec&type=obj&page=134",
    "correct_answer": "B",
    "explanation": "During photosynthesis, carbon dioxide diffuses through the stomata into the mesophyll layer of the leaf, where the majority of photosynthesis takes place. At the same time, oxygen produced during photosynthesis diffuses out of the leaf through the stomata. This movement of gases in opposite directions is called gas exchange.\nGuard cells control the size of the stomata to prevent the leaf from losing too much water in hot, dry, or windy conditions. In many plants, stomata are open during the day and closed at night.\nThe labelled structures where C02 will enter for photosynthesis to take place are I, II, III and VI\n(See the attached diagram above)",
    "year": "2000"
  },
  {
    "number": "671",
    "text": "Which of the labelled structures in the diagram will shrink when plasmolysis\noccurs?",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19638?exam_type=waec&type=obj&page=135",
    "correct_answer": "A",
    "explanation": "Plasmolysis is a process that occurs when a plant cell loses water and shrinks due to being in a hypertonic solution, which is a solution with a high concentration of solutes like salt. The cell membrane detaches from the cell wall, and the protoplasm shrinks away.\nThe cytoplasm and plasma membrane of a plant cell shrink during plasmolysis, not the stomata. Option A",
    "year": "2000"
  },
  {
    "number": "672",
    "text": "The condition shown in the above diagram is due to",
    "options": {
      "A": "conversion of starch to sugar",
      "B": "conversion of sugar to starch",
      "C": "excess water in structure labelled I",
      "D": "presence of carbondioxide in the structure labelled I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19639?exam_type=waec&type=obj&page=135",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "673",
    "text": "Which of the following solutions will induce the condition shown in the diagram?",
    "options": {
      "A": "Hypertonic solution",
      "B": "Hypotonic solution",
      "C": "isotonic solution",
      "D": "Distilled water."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19640?exam_type=waec&type=obj&page=135",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "674",
    "text": "Which of the following conditions will cause a decrease in body temperature?",
    "options": {
      "A": "increased metabolism",
      "B": "Shivering",
      "C": "Vasoconstriction of capillaries of the skin",
      "D": "Relaxation of the erector muscles"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19641?exam_type=waec&type=obj&page=135",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "675",
    "text": "The organs constantly in touch with the liver are",
    "options": {
      "A": "pancreas, colon and caecum",
      "B": "duodenum and stomach",
      "C": "illeum, stomach and colon",
      "D": "stomach and gall bladder"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19642?exam_type=waec&type=obj&page=135",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "676",
    "text": "Which of the following is responsible for the increased heart beat of a boy who saw a python? increased\nproduction of",
    "options": {
      "A": "adrenalin",
      "B": "insulin",
      "C": "pituitrin",
      "D": "thyroxin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19643?exam_type=waec&type=obj&page=136",
    "correct_answer": "A",
    "explanation": "Adrenaline is the hormone associated with fear and anxiety. it prepares the body for emergency and also increases heartbeat and respiration.",
    "year": "2000"
  },
  {
    "number": "677",
    "text": "The nerves that arise from the brain are known as",
    "options": {
      "A": "spinal nerves",
      "B": "sacral nerves",
      "C": "cranial nerves",
      "D": "optic nerves"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19644?exam_type=waec&type=obj&page=136",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "678",
    "text": "The neurone that relay the message of effector organs are called",
    "options": {
      "A": "efferent neurones",
      "B": "intermediate neurones",
      "C": "afferent neurones",
      "D": "spinal nerves"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19645?exam_type=waec&type=obj&page=136",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "679",
    "text": "Each neurone consists of the following structures' except",
    "options": {
      "A": "cell body",
      "B": "dendrites",
      "C": "axon",
      "D": "white matter"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19646?exam_type=waec&type=obj&page=136",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "680",
    "text": "The simplest form of nervous pathway which links receptors with effectors is known as the",
    "options": {
      "A": "relay neuron",
      "B": "reflex arc",
      "C": "motor nerves",
      "D": "sensory nerves"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19647?exam_type=waec&type=obj&page=136",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "681",
    "text": "Which of the following parts of the eye is sensitive to light?",
    "options": {
      "A": "Retina",
      "B": "Cornea",
      "C": "Choroid layer",
      "D": "Optic nerves"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19648?exam_type=waec&type=obj&page=137",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "682",
    "text": "What happens to an ovule of a flower, after fertilization? It",
    "options": {
      "A": "becomes a fruit",
      "B": "withers away",
      "C": "becomes a seed",
      "D": "forms the cotyledons"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19649?exam_type=waec&type=obj&page=137",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "683",
    "text": "Which of the following is not a dry indehiscent fruit?",
    "options": {
      "A": "Legume",
      "B": "Cypsela",
      "C": "Samara",
      "D": "Caryopsis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19650?exam_type=waec&type=obj&page=137",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "684",
    "text": "Which of the following groups consists of only micro-nutrients?",
    "options": {
      "A": "Molybdenum, sulphur and copper",
      "B": "Boron, Zinc and Calcium",
      "C": "Manganese, molybdenum and zinc",
      "D": "Magnesium, phosphorus and manganese."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19651?exam_type=waec&type=obj&page=137",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "685",
    "text": "The first stable product of photosynthesis is",
    "options": {
      "A": "starch",
      "B": "glucose",
      "C": "oxygen",
      "D": "water"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19652?exam_type=waec&type=obj&page=137",
    "correct_answer": "B",
    "explanation": "The first stable product of photosynthesis is actually Glucose, C\\(_6\\)H\\(_{12}\\)O\\(_6\\), which is a type of sugar but glucose is the more specific and accurate answer.",
    "year": "2000"
  },
  {
    "number": "686",
    "text": "Which of the following statements about nitrogen is not correct? Nitrogen is needed for",
    "options": {
      "A": "protein synthesis",
      "B": "activating certain enzymes",
      "C": "the synthesis of chlorophyll",
      "D": "healthy vegetative growth of plants"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19653?exam_type=waec&type=obj&page=138",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "687",
    "text": "A very poor growth in plants and discolouration of leaves signifies the deficiency of",
    "options": {
      "A": "calcium",
      "B": "magnesium",
      "C": "potassium",
      "D": "manganese"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19654?exam_type=waec&type=obj&page=138",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "688",
    "text": "Vitamin C which is water soluble is",
    "options": {
      "A": "cabalamine",
      "B": "pyridoxine",
      "C": "ascorbic acid",
      "D": "riboflavine"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19655?exam_type=waec&type=obj&page=138",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "689",
    "text": "Vitamin C deficiency results in",
    "options": {
      "A": "ricket",
      "B": "beri-beri",
      "C": "scurvy",
      "D": "pellagra"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19656?exam_type=waec&type=obj&page=138",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "690",
    "text": "Members of the vitamin B complex are",
    "options": {
      "A": "water-soluble",
      "B": "fat-soluble",
      "C": "water insoluble",
      "D": "generally insoluble"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19657?exam_type=waec&type=obj&page=138",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "691",
    "text": "Which of the following statements about phosphorous is not correct?",
    "options": {
      "A": "Helps to regulate the acid-base balance of the body",
      "B": "Regulates the metabolism of proteins, fats and carbohydrates",
      "C": "Required in many chemical reactions occurring in the body",
      "D": "Phosphorous is a major constituent of bones and teeth"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19658?exam_type=waec&type=obj&page=139",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "692",
    "text": "Vitamin E is concerned with",
    "options": {
      "A": "bone formation",
      "B": "reproduction",
      "C": "normal growth",
      "D": "formation of red blood cells."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19659?exam_type=waec&type=obj&page=139",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "693",
    "text": "A balanced meal for an adult person may consist of",
    "options": {
      "A": "two pieces of chicken, four balls of bean cake, two eggs and two cups of tea with milk",
      "B": "four slices of bread, one bowl of pap, two oranges and two bananas",
      "C": "four slices of yam and stew, two pieces of beef, one cup of tea with milk and two oranges",
      "D": "a plate of beans, two pieces of meat, two eggs, one cup of tea with milk and two oranges"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19660?exam_type=waec&type=obj&page=139",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "694",
    "text": "Which of the following food substances turns bright red when warmed with suddan III solution?",
    "options": {
      "A": "Starch",
      "B": "Reducing sugar",
      "C": "Protein",
      "D": "Fat"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19661?exam_type=waec&type=obj&page=139",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "695",
    "text": "Mammals require a relatively high amount of carbohydrates because",
    "options": {
      "A": "they maintain the weight of the body",
      "B": "they are required for growth",
      "C": "they initiate enzyme production",
      "D": "they yield energy for activities."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19662?exam_type=waec&type=obj&page=139",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "696",
    "text": "All the available places on earth which support life constitute the",
    "options": {
      "A": "lithosphere",
      "B": "atmosphere",
      "C": "biosphere",
      "D": "hydrosphere"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19663?exam_type=waec&type=obj&page=140",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "697",
    "text": "The abiotic factor which determines the depth to which light penetrates in a pond is",
    "options": {
      "A": "current",
      "B": "turbidity",
      "C": "wind",
      "D": "salinity"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19664?exam_type=waec&type=obj&page=140",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "698",
    "text": "Which of the following organisms is a producer?",
    "options": {
      "A": "Spirogyra",
      "B": "Mucor",
      "C": "Rhizopus",
      "D": "Yeast"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19665?exam_type=waec&type=obj&page=140",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "699",
    "text": "Which of the following groups consists of heterotrophs?",
    "options": {
      "A": "Mucor, chlamydomonas and Euglena",
      "B": "Spirogyra, Mucor and Mushroom",
      "C": "Man, Mucor and Mushroom",
      "D": "Man, Maize and Cowpea"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19666?exam_type=waec&type=obj&page=140",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "700",
    "text": "Which of the following organisms will not bring about decomposition?",
    "options": {
      "A": "Earthworm",
      "B": "Bactenum",
      "C": "Mould",
      "D": "Spirogyra"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19667?exam_type=waec&type=obj&page=140",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "701",
    "text": "Which of the following is not released during decay of living matter?",
    "options": {
      "A": "Ammonia",
      "B": "Oxygen",
      "C": "Carbon dioxide",
      "D": "Heat energy"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19668?exam_type=waec&type=obj&page=141",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "702",
    "text": "In commensalism",
    "options": {
      "A": "one of the organisms gains and the other loses",
      "B": "both organisms benefit from the association",
      "C": "one of the organisms gains while the other neither gains nor loses",
      "D": "one of the organisms produces extra cellular Digestive juices."
    },
    "answer_url": "https://myschool.ng/classroom/biology/19669?exam_type=waec&type=obj&page=141",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "703",
    "text": "Parasitism can best be defined as an association between two organisms in which",
    "options": {
      "A": "both organisms benefit",
      "B": "one organism gains and the other neither gains nor loses",
      "C": "both organisms suffer some disadvantages",
      "D": "one organism gains and the other loses"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19670?exam_type=waec&type=obj&page=141",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "704",
    "text": "Which of the following best describes the adaptation of the earthworm to its habitat?",
    "options": {
      "A": "Living in burrow during the day to prevent desiccation",
      "B": "Burrowing into soft soil to store food",
      "C": "Possession of segmented body to reduce movement",
      "D": "Possession of a few bristles for defence"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19671?exam_type=waec&type=obj&page=141",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "705",
    "text": "Trypanosomiasis is associated with",
    "options": {
      "A": "cockcroach",
      "B": "mosquito",
      "C": "housefly",
      "D": "tsetse fly"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19672?exam_type=waec&type=obj&page=141",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "706",
    "text": "The major reason why foods should be properly covered is that",
    "options": {
      "A": "micro-organisms in air would contaminate the food",
      "B": "hot foods cool off easily when properly covered",
      "C": "the taste of the food is maintained when covered",
      "D": "all water easily evaporates from uncovered food"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19673?exam_type=waec&type=obj&page=142",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "707",
    "text": "Which of the following is not a means of conserving natural resources?",
    "options": {
      "A": "Establishment of national parks",
      "B": "Selective logging",
      "C": "Building of dams",
      "D": "Bush burning"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19674?exam_type=waec&type=obj&page=142",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "708",
    "text": "Which of the following resources is non-renewable?",
    "options": {
      "A": "Forest",
      "B": "Wildlife",
      "C": "Mineral deposits",
      "D": "Water"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19675?exam_type=waec&type=obj&page=142",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "709",
    "text": "Character which falls to express itself in the first filial generation but emerges in the second is",
    "options": {
      "A": "heterozygote",
      "B": "homozygote",
      "C": "dominant",
      "D": "recessive"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19676?exam_type=waec&type=obj&page=142",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "710",
    "text": "The concept of use and disuse of parts was postulated by",
    "options": {
      "A": "Darwin",
      "B": "Larmarck",
      "C": "Miller",
      "D": "Wallace"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19677?exam_type=waec&type=obj&page=142",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "711",
    "text": "Which of the following represents Mendel’s second law of inheritance? The factors for two pairs of contrasting\ncharacters are",
    "options": {
      "A": "dependent on each other",
      "B": "on homologous chromosomes",
      "C": "allelomorphic",
      "D": "inherited independently of each other"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19678?exam_type=waec&type=obj&page=143",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "712",
    "text": "Which of the following terms is not associated with fingerprint and classification?",
    "options": {
      "A": "Whorl",
      "B": "Contour",
      "C": "Arch",
      "D": "Loop"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19679?exam_type=waec&type=obj&page=143",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2000"
  },
  {
    "number": "713",
    "text": "During blood transfusion, agglutination could be prevented if a patient having blood group O is given blood\nfrom group",
    "options": {
      "A": "AB",
      "B": "A",
      "C": "O",
      "D": "B"
    },
    "answer_url": "https://myschool.ng/classroom/biology/19680?exam_type=waec&type=obj&page=143",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2000"
  }
]