[
  {
    "number": "139",
    "text": "A nagging problem in your family has so far defied all solutions. Write a letter to an uncle of yours stating what the problem is and giving reasons why he should intervene.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51544?exam_type=waec&type=theory&page=28",
    "correct_answer": "32, Lawson Street,Aguda, Ogba,Lagos.20th May, 2000.Dear Uncle Tunde,\nIt has been a turbulent time before I summoned enough courage to write you this letter. In fact, it has been very hectic at home since our mummy came back from her journey to London. Things are not really what they used to be. It is going from bad to worse and I think that I should bring the situation to your notice before it goes beyond redemption.\nAs you are aware mummy travelled to London in January and she came back last month to meet the home in a mess. None of us were at home when the ugly incident that soured the relationship between daddy and mummy happened. We, the children, were away in our boarding school and only came back to be told that our daddy was having a secret love affair with Julie, our housemaid. A neighbour of ours first let the cat out of the bag and soon after, it became a rumour spreading widely in our neighbourhood. It was a great shock to us and we kept quiet waiting for mummy to come back.\nThings came to a head when mummy came back three weeks later. On her arrival, she tried to embrace Daddy but, she was restrained by Wale, my junior brother who felt very bad about the incident. I then decided to call Mummy aside to tell her all that had happened. She burst into tears and walked out of the sitting room. Meanwhile, to our great amazement, our maid came out of the room with her protruded belly carrying a four-month pregnancy. My mother fell at that point and fainted. Our neighbours ran in and helped her to the hospital. She spent two weeks in the hospital before she was discharged.\nWe were all in a state of dilemma and we marvelled at the unravelled mystery. What makes the matter worse is that Daddy insists that he is going to marry Julie as his second wife and this does not go down well with us. Uncle, since then, mummy's blood pressure has risen and she has had to visit the hospital several times thereafter. Mummy has, therefore, decided to pack out of the house next month.\nThis is why I decided to write this letter to you for your intervention in this matter. As you are mummy's brother, I want you to help talk to her. I learnt that you studied Guidance and Counselling at the university and I know that you would be able to bring the family together again. Moreover, you did such a reconciliation two years ago between Mr. and Mrs. Bankole and it was very successful. I would be grateful if you can perform the same feat now. I know that mummy, and even daddy, will listen to you. I strongly believe that if you intervene in this matter quickly, Daddy and Mummy will be reconciled and they will be at peace with each other once again.\nHow are Aunty Funmi and your children? Extend my greetings to every member of your family.\nYours sincerely,Olakunle.",
    "explanation": "32, Lawson Street,Aguda, Ogba,Lagos.20th May, 2000.Dear Uncle Tunde,\nIt has been a turbulent time before I summoned enough courage to write you this letter. In fact, it has been very hectic at home since our mummy came back from her journey to London. Things are not really what they used to be. It is going from bad to worse and I think that I should bring the situation to your notice before it goes beyond redemption.\nAs you are aware mummy travelled to London in January and she came back last month to meet the home in a mess. None of us were at home when the ugly incident that soured the relationship between daddy and mummy happened. We, the children, were away in our boarding school and only came back to be told that our daddy was having a secret love affair with Julie, our housemaid. A neighbour of ours first let the cat out of the bag and soon after, it became a rumour spreading widely in our neighbourhood. It was a great shock to us and we kept quiet waiting for mummy to come back.\nThings came to a head when mummy came back three weeks later. On her arrival, she tried to embrace Daddy but, she was restrained by Wale, my junior brother who felt very bad about the incident. I then decided to call Mummy aside to tell her all that had happened. She burst into tears and walked out of the sitting room. Meanwhile, to our great amazement, our maid came out of the room with her protruded belly carrying a four-month pregnancy. My mother fell at that point and fainted. Our neighbours ran in and helped her to the hospital. She spent two weeks in the hospital before she was discharged.\nWe were all in a state of dilemma and we marvelled at the unravelled mystery. What makes the matter worse is that Daddy insists that he is going to marry Julie as his second wife and this does not go down well with us. Uncle, since then, mummy's blood pressure has risen and she has had to visit the hospital several times thereafter. Mummy has, therefore, decided to pack out of the house next month.\nThis is why I decided to write this letter to you for your intervention in this matter. As you are mummy's brother, I want you to help talk to her. I learnt that you studied Guidance and Counselling at the university and I know that you would be able to bring the family together again. Moreover, you did such a reconciliation two years ago between Mr. and Mrs. Bankole and it was very successful. I would be grateful if you can perform the same feat now. I know that mummy, and even daddy, will listen to you. I strongly believe that if you intervene in this matter quickly, Daddy and Mummy will be reconciled and they will be at peace with each other once again.\nHow are Aunty Funmi and your children? Extend my greetings to every member of your family.\nYours sincerely,Olakunle.",
    "year": "2000"
  },
  {
    "number": "140",
    "text": "Write an article for publication in your school magazine on the topic: \"Why I should like to be... \" Choose an occupation or career and give at least three reasons why it appeals to you.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51545?exam_type=waec&type=theory&page=28",
    "correct_answer": "WHY I SHOULD LIKE TO BE A MEDICAL DOCTORWhen I finish school, I should like to study medicine in the university. I have nursed this ambition right from childhood. I can remember when I was ill and was taken to a hospital when I was twelve years old. I was fascinated by the activities and hospitality of the doctor who took care of me on my sick bed. He so much endeared himself to me that, there and then, I decided to study medicine when I grew up.\nMedicine, as a profession, commands great respect anywhere in the world. Medical doctors are respected for being hospitable and kind. They are kind to their patients and tend to them like seedlings, which must not be allowed to die. A medical doctor cannot afford to be unkind or cruel to his patient or to allow his patient to suffer. He must be genial, good-natured, hospitable and must have a good disposition towards his patient.\nFurthermore, medicine is a business of saving lives. This makes the profession to be regarded as the most noble profession in the world. If there were no doctors, many lives would be lost on a daily basis. Doctors are professionals with adequate knowledge of all parts of the human body and one cannot but be proud of belonging to such a profession. Doctors serve and contribute to humanity more than any other professional.\nIn addition to this, the medical profession is one of the most lucrative professions in the world. It gives practitioners the opportunity to work for the government in the government hospital and at the same time engage in private practice. Therefore, it gives the practitioners the privilege to establish their own hospitals and clinics thereby making it possible for them to make a lot of money.\nMoreover, the medical profession allows one to meet a lot of people. It makes one influential and popular because, as a medical doctor, many people want to be associated with you. A patient whom you have treated in the hospital will always remember how you helped him, and his family will forever be grateful to you. All these make a medical practitioner popular and influential in society. Many people want to respect him and his opinion on any matter in society.\nLastly, a medical practitioner with a stethoscope hanging on his neck is always a good sight to behold. This has also greatly endeared me to the profession, and I dream of hanging the profession's identifying instrument on my neck in the near future. Medical doctors are always very neat, and they look resplendent in their white overall coats. This makes them respectable and the profession dignified.\nOf course, I know what it takes to become a medical doctor and I am ready to do all it takes to belong to the medical profession.Adenlolu Olajide,SS 2B.",
    "explanation": "WHY I SHOULD LIKE TO BE A MEDICAL DOCTORWhen I finish school, I should like to study medicine in the university. I have nursed this ambition right from childhood. I can remember when I was ill and was taken to a hospital when I was twelve years old. I was fascinated by the activities and hospitality of the doctor who took care of me on my sick bed. He so much endeared himself to me that, there and then, I decided to study medicine when I grew up.\nMedicine, as a profession, commands great respect anywhere in the world. Medical doctors are respected for being hospitable and kind. They are kind to their patients and tend to them like seedlings, which must not be allowed to die. A medical doctor cannot afford to be unkind or cruel to his patient or to allow his patient to suffer. He must be genial, good-natured, hospitable and must have a good disposition towards his patient.\nFurthermore, medicine is a business of saving lives. This makes the profession to be regarded as the most noble profession in the world. If there were no doctors, many lives would be lost on a daily basis. Doctors are professionals with adequate knowledge of all parts of the human body and one cannot but be proud of belonging to such a profession. Doctors serve and contribute to humanity more than any other professional.\nIn addition to this, the medical profession is one of the most lucrative professions in the world. It gives practitioners the opportunity to work for the government in the government hospital and at the same time engage in private practice. Therefore, it gives the practitioners the privilege to establish their own hospitals and clinics thereby making it possible for them to make a lot of money.\nMoreover, the medical profession allows one to meet a lot of people. It makes one influential and popular because, as a medical doctor, many people want to be associated with you. A patient whom you have treated in the hospital will always remember how you helped him, and his family will forever be grateful to you. All these make a medical practitioner popular and influential in society. Many people want to respect him and his opinion on any matter in society.\nLastly, a medical practitioner with a stethoscope hanging on his neck is always a good sight to behold. This has also greatly endeared me to the profession, and I dream of hanging the profession's identifying instrument on my neck in the near future. Medical doctors are always very neat, and they look resplendent in their white overall coats. This makes them respectable and the profession dignified.\nOf course, I know what it takes to become a medical doctor and I am ready to do all it takes to belong to the medical profession.Adenlolu Olajide,SS 2B.",
    "year": "2000"
  },
  {
    "number": "141",
    "text": "Write a letter to the Director of the Environmental Protection Agency in your country complaining about the environmental pollution of your area and requesting that urgent action be taken to improve the situation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51547?exam_type=waec&type=theory&page=29",
    "correct_answer": "26 Oluremi Adesina StreetIkeja, Lagos.19th June, 2000\nThe Director,Environmental Protect Agency18 Creek RoadYaba, Lagos.\nDear Sir,ENVIRONMENTAL POLLUTION OF MY AREAI am writing to formally bring to your attention the environmental pollution in my area which has made life unbearable for the people of the place. Our environment is highly polluted to the extent that breathing has become difficult. The air we breathe in and out is heavily polluted and the community stands the risk of an epidemic outbreak.\nRefuse is dumped indiscriminately by the roadside and human faeces and toxic waste are emptied into the nearby stream. As a result of this, the stream which was flowing before is now stagnant, thus becoming a breeding place for mosquitoes. What further complicates the whole situation is that some illiterate women go to this stream to fetch water they use for cooking and other domestic chores. Some even drink the water from this stream. This has constituted a health hazard in the area as an epidemic can break out from this unhealthy condition and before we know it, many lives will be lost.\nThe textile and iron-smelting companies in our area have further worsened the situation as their furnace emit dark smoke into the air every day. Every working day, our environment is highly polluted with smoke which makes it difficult for us to breathe. We only have respite at week-ends when these companies are not working. The toxic water from the textile factory is another source of environmental pollution. Though the toxic water flows into the nearby canal, it leaves behind a greenish stain on the side of the gutter and I know it must be emitting some poisonous gases into the air. We are prone to a lot of health hazards, to say the least, and we want the government to come to our aid. This is very necessary in order to avert an outbreak of epidemic in the area.\nRecently, there were cases of some residents of the area who were taken to the hospital and they were diagnosed with kidney problems. This is not unconnected with the impure air they breathed in. We would appreciate it if you could use your good offices to put in place a new and modern means of disposing of toxic waste in our area. The waste disposal board has to consider our area as a high-risk area and treat it as such with utmost urgency.\nI would be grateful if you could pay a visit to our community to assess the situation and take urgent action to improve this unwholesome situation.Yours faithfully,(Signature)Olukunle Ebun.",
    "explanation": "26 Oluremi Adesina StreetIkeja, Lagos.19th June, 2000\nThe Director,Environmental Protect Agency18 Creek RoadYaba, Lagos.\nDear Sir,ENVIRONMENTAL POLLUTION OF MY AREAI am writing to formally bring to your attention the environmental pollution in my area which has made life unbearable for the people of the place. Our environment is highly polluted to the extent that breathing has become difficult. The air we breathe in and out is heavily polluted and the community stands the risk of an epidemic outbreak.\nRefuse is dumped indiscriminately by the roadside and human faeces and toxic waste are emptied into the nearby stream. As a result of this, the stream which was flowing before is now stagnant, thus becoming a breeding place for mosquitoes. What further complicates the whole situation is that some illiterate women go to this stream to fetch water they use for cooking and other domestic chores. Some even drink the water from this stream. This has constituted a health hazard in the area as an epidemic can break out from this unhealthy condition and before we know it, many lives will be lost.\nThe textile and iron-smelting companies in our area have further worsened the situation as their furnace emit dark smoke into the air every day. Every working day, our environment is highly polluted with smoke which makes it difficult for us to breathe. We only have respite at week-ends when these companies are not working. The toxic water from the textile factory is another source of environmental pollution. Though the toxic water flows into the nearby canal, it leaves behind a greenish stain on the side of the gutter and I know it must be emitting some poisonous gases into the air. We are prone to a lot of health hazards, to say the least, and we want the government to come to our aid. This is very necessary in order to avert an outbreak of epidemic in the area.\nRecently, there were cases of some residents of the area who were taken to the hospital and they were diagnosed with kidney problems. This is not unconnected with the impure air they breathed in. We would appreciate it if you could use your good offices to put in place a new and modern means of disposing of toxic waste in our area. The waste disposal board has to consider our area as a high-risk area and treat it as such with utmost urgency.\nI would be grateful if you could pay a visit to our community to assess the situation and take urgent action to improve this unwholesome situation.Yours faithfully,(Signature)Olukunle Ebun.",
    "year": "2000"
  },
  {
    "number": "142",
    "text": "Write a story ending with the word: \"Indeed, it was a blessing in disguise\".",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51548?exam_type=waec&type=theory&page=29",
    "correct_answer": "I REMAIN GRATEFUL TO GODIn life, one may be confronted with an adverse situation that makes one depressed and disillusioned with life. Such a situation or case may be a blessing in disguise after all. What happened to me a few years ago has taught me a lesson that I should not be down-cast as a result of any adverse situation again.\nIt happened that I was deeply in love with a young man called John. I loved him so much that I could lay down my life for him. I trusted him so much that decided to marry him though it was against my parents' wishes. We courted for seven years and I always thought that I was made for John and he was made for me. The young man was handsome, intelligent and above all, loving and caring.\nI was in my final year at the University of Lagos and I was looking forward to becoming a wife and a mother when John came to tell me that he was on transfer to Port-Harcourt. We had a wonderful time together during the Christmas festivities preceding the year that he was to leave for Port-Harcourt. When he had settled down in Port-Harcourt, I visited him regularly for a year and the plan for our wedding after my national service was concluded. During my national service period, we used to communicate through letters for some time during which I noticed that something was wrong. Later, he stopped writing to me and after my national service, I decided to visit him in Port-Harcourt.\nWhen I got to where John was residing in Port-Harcourt, I was told that he had packed out of the house. However, I was directed to where he was living and I had a foreboding that something was going to happen. There John introduced me to a girl who was staying with him and said that the girl was pregnant for him. I wept bitterly and wondered how John could be so callous as to do that to me. I left his house in shame. I was highly disappointed but, determined to continue with life.\nSix months later, I met Bade, another handsome young man who later became my husband. He saved me from the emotional trauma which I went through as a result of John's unfaithfulness. About a year after my marriage, I heard that John had an accident when he was trying to escape through the border. It was then that I knew that he was on a drug smuggling mission to England when the accident occurred.\nJohn's wife died on the spot and he suffered terrible injuries that led to the amputation of his two legs. The police were waiting for him to recuperate in the hospital so that his trial could begin. I was grateful to God that He worked out John's exit from my life before the incident happened.\nOf course, what John did to me was painful. It took me some time before I got over it but I am grateful to God that I am alive and happily married with no stains on my record. His betrayal might have been difficult for me to bear, but it was indeed a blessing in disguise.",
    "explanation": "I REMAIN GRATEFUL TO GODIn life, one may be confronted with an adverse situation that makes one depressed and disillusioned with life. Such a situation or case may be a blessing in disguise after all. What happened to me a few years ago has taught me a lesson that I should not be down-cast as a result of any adverse situation again.\nIt happened that I was deeply in love with a young man called John. I loved him so much that I could lay down my life for him. I trusted him so much that decided to marry him though it was against my parents' wishes. We courted for seven years and I always thought that I was made for John and he was made for me. The young man was handsome, intelligent and above all, loving and caring.\nI was in my final year at the University of Lagos and I was looking forward to becoming a wife and a mother when John came to tell me that he was on transfer to Port-Harcourt. We had a wonderful time together during the Christmas festivities preceding the year that he was to leave for Port-Harcourt. When he had settled down in Port-Harcourt, I visited him regularly for a year and the plan for our wedding after my national service was concluded. During my national service period, we used to communicate through letters for some time during which I noticed that something was wrong. Later, he stopped writing to me and after my national service, I decided to visit him in Port-Harcourt.\nWhen I got to where John was residing in Port-Harcourt, I was told that he had packed out of the house. However, I was directed to where he was living and I had a foreboding that something was going to happen. There John introduced me to a girl who was staying with him and said that the girl was pregnant for him. I wept bitterly and wondered how John could be so callous as to do that to me. I left his house in shame. I was highly disappointed but, determined to continue with life.\nSix months later, I met Bade, another handsome young man who later became my husband. He saved me from the emotional trauma which I went through as a result of John's unfaithfulness. About a year after my marriage, I heard that John had an accident when he was trying to escape through the border. It was then that I knew that he was on a drug smuggling mission to England when the accident occurred.\nJohn's wife died on the spot and he suffered terrible injuries that led to the amputation of his two legs. The police were waiting for him to recuperate in the hospital so that his trial could begin. I was grateful to God that He worked out John's exit from my life before the incident happened.\nOf course, what John did to me was painful. It took me some time before I got over it but I am grateful to God that I am alive and happily married with no stains on my record. His betrayal might have been difficult for me to bear, but it was indeed a blessing in disguise.",
    "year": "2000"
  },
  {
    "number": "143",
    "text": "You are a speaker in an inter-school debate on the topic: \"It is better to attend a school near your home than one outside your neighborhood\". Write your speech for or against the proposition.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51550?exam_type=waec&type=theory&page=29",
    "correct_answer": "A SPEECH AGAINST THE PROPOSITION:  \"IT IS BETTER TO ATTEND A SCHOOL NEAR YOUR HOME THAN ONE OUTSIDE YOUR NEIGHBOURHOOD.\"\nGood day, Mr Chairman panel of Judges co-debators ladies and gentlemen and my most attentive audience. My name is Temilola Adekanbi a student of Okeira Grammar School, Okeira. I am here to oppose the motion which states: \"It is better to attend a school near your home than one outside your neighbourhood\".\nI believe strongly that it is better to attend a school outside one's neighbourhood. First, attending a neighbourhood school will limit the outlook and the perception of a person as a student. A student needs to go outside his neighbourhood so that he can be widely accepted and recognised. It makes a student to be more cosmopolitan in outlook, comportment and behaviour. There is a tendency for a student who attends a neighbourhood school to be parochial in outlook and thinking. As a student, one must not be restricted or limited to one's environment alone because there is a lot to learn outside one's immediate neighbourhood.\nI am sure that my opponent would want to argue that a student who attends a school outside his neighbourhood would be tired and fagged out before getting to school every day. However, attending a school outside one's neighbourhood makes one more time-conscious and more organised than a student who attends a school in the neighbourhood. A student who knows that he has to go to school outside his neighbourhood would organise his schedule effectively to be in his class at the appropriate time. Of course, chairman, ladies and gentlemen, you would all agree with me that such a student would be more effective, diligent and able to manage his or her time more effectively than the other who settles for a school nearer home. Such a student would not allow people to waste his time and he would face his studies with all seriousness because he is aware of the efforts he puts in before he gets to school.\nFurthermore, a student who attends a school outside his neighbourhood is unlikely to engage himself in trivial and irrelevant matters. He has his timetable which he keeps. He would not be bothered by irrelevant and trivial issues which would have bothered him should he attend a school near his home. He could not be on useless errands like his counterparts who are attending schools in the neighbourhood. He is immune to humdrum and mundane matters of the home and all his energy is channelled towards profitable ventures.\nMr. Chairman sir, ladies and gentlemen, I would like to thank you for giving me the time to make my points clear. Panel of Judges and my audience, I hope that I have been able to convince you that it is better to attend a school outside one's neighbourhood than to attend a school in one's neighbourhood. Thank you.",
    "explanation": "A SPEECH AGAINST THE PROPOSITION:  \"IT IS BETTER TO ATTEND A SCHOOL NEAR YOUR HOME THAN ONE OUTSIDE YOUR NEIGHBOURHOOD.\"\nGood day, Mr Chairman panel of Judges co-debators ladies and gentlemen and my most attentive audience. My name is Temilola Adekanbi a student of Okeira Grammar School, Okeira. I am here to oppose the motion which states: \"It is better to attend a school near your home than one outside your neighbourhood\".\nI believe strongly that it is better to attend a school outside one's neighbourhood. First, attending a neighbourhood school will limit the outlook and the perception of a person as a student. A student needs to go outside his neighbourhood so that he can be widely accepted and recognised. It makes a student to be more cosmopolitan in outlook, comportment and behaviour. There is a tendency for a student who attends a neighbourhood school to be parochial in outlook and thinking. As a student, one must not be restricted or limited to one's environment alone because there is a lot to learn outside one's immediate neighbourhood.\nI am sure that my opponent would want to argue that a student who attends a school outside his neighbourhood would be tired and fagged out before getting to school every day. However, attending a school outside one's neighbourhood makes one more time-conscious and more organised than a student who attends a school in the neighbourhood. A student who knows that he has to go to school outside his neighbourhood would organise his schedule effectively to be in his class at the appropriate time. Of course, chairman, ladies and gentlemen, you would all agree with me that such a student would be more effective, diligent and able to manage his or her time more effectively than the other who settles for a school nearer home. Such a student would not allow people to waste his time and he would face his studies with all seriousness because he is aware of the efforts he puts in before he gets to school.\nFurthermore, a student who attends a school outside his neighbourhood is unlikely to engage himself in trivial and irrelevant matters. He has his timetable which he keeps. He would not be bothered by irrelevant and trivial issues which would have bothered him should he attend a school near his home. He could not be on useless errands like his counterparts who are attending schools in the neighbourhood. He is immune to humdrum and mundane matters of the home and all his energy is channelled towards profitable ventures.\nMr. Chairman sir, ladies and gentlemen, I would like to thank you for giving me the time to make my points clear. Panel of Judges and my audience, I hope that I have been able to convince you that it is better to attend a school outside one's neighbourhood than to attend a school in one's neighbourhood. Thank you.",
    "year": "2000"
  },
  {
    "number": "144",
    "text": "(a) Why did Joe consult the psychologist?\n(b) What did Joe think he would achieve by following the psychologist's advice?\n(c) What is ironical about Joe's answer to the psychologist's question towards the end of the passage'\n(d) From this episode, what do you think had really been wrong with Joe's marriage?\n(e) \"... it was a tremendous idea'. ((i) What grammatical name is given to this expression as it is used in the passage?\n(ii) What is its function in the sentence?\n(f) \"I'd never leave my wife in a million years\" What figure of speech is contained in the sentence above?\n(g) Why do you think the psychologist wore a knowing smile?\n(h) For each of the following words. find another word or phrase which means the same and which can replace it as used in the passage. (i) attractive. (ii) upset; (iii) solution (iv) wonderful; (v) apparent; (vi) allotted.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51553?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) Joe consults the psychologist to find out the best way to make his wife as unhappy as possible.(b) He thinks that he will make the divorce painful to her.(c) What is ironical about Joe's answer is that Joe, who no longer wanted to live with his wife now wants to live with her forever.(d) What has been wrong with Joe's marriage is that he had not been endearing himself to his wife.(e)(i) Noun clause (ii) Object of the verb \"Thought\"(f) Exaggeration / Hyperbole or Overstatement.(g) The psychologist wore a knowing smile because he knew that his advice would produce the result he had anticipated and he was not surprised.(h)(i) Attractive - beautiful, appealing, lovely, good-looking, captivating, charming.(ii) Upset - agitated, troubled, worried, perturbed, ravishing. (iii) Solution - answer, remedy.(iv) Wonderful -remarkable, extraordinary, unusual, surprising, marvellous.(v) Apparent - evident, obvious, known, clear.(vi) Allotted - fixed, specified, prescribed, slated, given, agreed, appointed.",
    "explanation": "(a) Joe consults the psychologist to find out the best way to make his wife as unhappy as possible.(b) He thinks that he will make the divorce painful to her.(c) What is ironical about Joe's answer is that Joe, who no longer wanted to live with his wife now wants to live with her forever.(d) What has been wrong with Joe's marriage is that he had not been endearing himself to his wife.(e)(i) Noun clause (ii) Object of the verb \"Thought\"(f) Exaggeration / Hyperbole or Overstatement.(g) The psychologist wore a knowing smile because he knew that his advice would produce the result he had anticipated and he was not surprised.(h)(i) Attractive - beautiful, appealing, lovely, good-looking, captivating, charming.(ii) Upset - agitated, troubled, worried, perturbed, ravishing. (iii) Solution - answer, remedy.(iv) Wonderful -remarkable, extraordinary, unusual, surprising, marvellous.(v) Apparent - evident, obvious, known, clear.(vi) Allotted - fixed, specified, prescribed, slated, given, agreed, appointed.",
    "year": "2000"
  },
  {
    "number": "145",
    "text": "(a) What did the surgeons seek from the patient?\n(b) In what two ways was the man prepared for the operation.\n \n(c) What do the man's words to his eldest son suggest about his state of mind?\n(d) (i) What message did the man intend to convey to his wife by putting her hand in his son's.\n(ii) What was his wife's reaction?\n(e) \"Before I could say anything else.... '\n(i) What grammatical name is given to this expression as it is used in the passage?\n(ii) What is its function in the sentence).\n(f) ....the inevitable quiet end\".\n(i) What figure of speech is used in the expression above?\n(ii) What does it mean?\n(g) How do you know that the patient survived the operation?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage. (I) combated; (ii) entreaties; (iii) eventually; (iv) steeled; (v) steer; (vi) gesture.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51556?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) The surgeons seek from the patient his consent or permission to perform a surgical operation on him.(b) The two major ways the man prepared for the operation are:(I) He was prepared physically, (ii) He was prepared mentally, psychologically and spiritually.(c) The man's words suggest that he was prepared for the worst or any eventuality.(d) (I) The message he intended to convey to his wife is that she has a son to depend upon.(ii) She burst into tears. (e) (i) Adverbial clause of (time)(ii) It modifies the verb \"were flung open\".(f)(i) Euphemism (ii) Death.(g) I know that the patient survived the operation because he lives to write about it.(h)(i) combated - treated, fought, battled, tackled(ii) entreaties treatment(s), attempts, efforts, applications.(iii) eventually, consequently, finally.(iv) steeled strengthened, braced, fortified, toughened.(v) steer-guide, direct, pilot.(iv) gesture - action, behavior, step, measure.",
    "explanation": "(a) The surgeons seek from the patient his consent or permission to perform a surgical operation on him.(b) The two major ways the man prepared for the operation are:(I) He was prepared physically, (ii) He was prepared mentally, psychologically and spiritually.(c) The man's words suggest that he was prepared for the worst or any eventuality.(d) (I) The message he intended to convey to his wife is that she has a son to depend upon.(ii) She burst into tears. (e) (i) Adverbial clause of (time)(ii) It modifies the verb \"were flung open\".(f)(i) Euphemism (ii) Death.(g) I know that the patient survived the operation because he lives to write about it.(h)(i) combated - treated, fought, battled, tackled(ii) entreaties treatment(s), attempts, efforts, applications.(iii) eventually, consequently, finally.(iv) steeled strengthened, braced, fortified, toughened.(v) steer-guide, direct, pilot.(iv) gesture - action, behavior, step, measure.",
    "year": "2000"
  },
  {
    "number": "146",
    "text": "(a) In one sentence state the intention of the writer\n(b) In five sentences, one for each summarize the five steps for making a good speech and the reason for each step.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/51557?exam_type=waec&type=theory&page=30",
    "correct_answer": "(a) The writer's intention is to show that anybody can master the art of speech-making. Or The writer's intention is to teach how to be a good public speaker.\nThe writer's intention is to give guideline for effective speech-making.(b) (i) The first step is to get sufficient information so that one may speak confidently.(ii) The speaker should not rush into making a speech so that he may overcome anxiety.(iii) The speaker should introduce humour into the speech so as to ease tension.(iv) The speaker should look at the friendly faces occasionally, in order to feel at ease.(v) The speaker should write out and rehearse his speech so that he may become very familiar with it.",
    "explanation": "(a) The writer's intention is to show that anybody can master the art of speech-making. Or The writer's intention is to teach how to be a good public speaker.\nThe writer's intention is to give guideline for effective speech-making.(b) (i) The first step is to get sufficient information so that one may speak confidently.(ii) The speaker should not rush into making a speech so that he may overcome anxiety.(iii) The speaker should introduce humour into the speech so as to ease tension.(iv) The speaker should look at the friendly faces occasionally, in order to feel at ease.(v) The speaker should write out and rehearse his speech so that he may become very familiar with it.",
    "year": "2000"
  }
]