[
  {
    "number": "9",
    "text": "(a)(i) Name the farm animal which produces specimen A (Honey).\n(ii) Mention two other products which could be obtained from the farm animal named in 1(a)(i).\n(iii) State four uses of specimen A.\n(b)(i) Outline the steps involved in the preparation of bone meal from specimen B (Bone) for livestock feed.\n(ii) State two precautions which should be taken during the preparation of bone meal.\n(iii) Mention two minerals which could be obtained from specimen B.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59743?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "10",
    "text": "(a)(i) Name two farm animals from which specimen C (Fresh meat) could be obtained.\n(ii) Mention four ways in which specimen C could be preserved.\n(b)(i) Mention three farm animals from which the raw form of specimen D (Powdered Milk) could be obtained.\n(ii) Mention three products which could be obtained from specimen D.\n(c) State two uses of specimen D in animal production \n(d) Name the process used for making the raw form of specimen D fot for human consumption.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59752?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "11",
    "text": "(a)(i) Name one major nutrient which could be obtained from each of specimen F(Maize bran), G(Groundnut cake) and H (Cowpea husk)\nF __________________________________ G ____________________________________ H __________________________________\n(ii) Name three pasts that could attack specimen F in the store \n(iii) State three effects of exposing specimen G for several days in a store.\n(b)(i) Mention three farm animals that could feed on specimen H\n(ii) Name two containers that could be used to store specimen H.\n(iii) Give one reason why specimen H is suitable as feed for farm animals.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59753?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  },
  {
    "number": "12",
    "text": "(a) State three factors which could affect the hatchability of specimen J (Egg).\n(b)(i) Mention four operations that should be carried out on the first day of production of specimen K (Chick)\n(ii) Name three diseases for which specimen K requires vaccination before it is six weeks old.\n(c)(i) Name the type of housing unit used for rearing specimen K on arrival at the farm .\n(ii) Mention four rquipment which are required in the housing unit named in 4(c)(i).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59758?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2020"
  }
]