[
  {
    "number": "83",
    "text": "Highlight the contributions of ‘ Ali b.Abi Talib to Islam.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56603?exam_type=waec&type=theory&page=17",
    "correct_answer": "Muhammad designated Ali as one of the scribes who would write down the text of the Quran, which had been revealed to Muhammad during the previous two decades. As Islam began to spread throughout Arabia, Ali helped establish the new Islamic order. He was instructed to write down theTreaty of Hudaybiyyah, the peace treaty between Muhammad and the Quraysh, in 628. Ali was so trustworthy that Muhammad asked him to carry the messages and declare the orders. In 630, Ali recited to a large gathering of pilgrims in Meccaa portion of the Quranthat declared Muhammad and the Islamic community no longer bound by agreements made earlier with Arabpolytheists. During theConquest of Meccain 630, Muhammad asked Ali to guarantee that the conquest would be bloodless. He ordered Ali to break all the idols worshiped by theBanu Aus,Banu Khazraj,Tayy, and those in the Kaaba to purify it after its defilement by the polytheism ofold times. Ali was sent toYemenone year later to spread the teachings of Islam. He was also known for settling several disputes and putting down the uprisings of various tribes.",
    "explanation": "Muhammad designated Ali as one of the scribes who would write down the text of the Quran, which had been revealed to Muhammad during the previous two decades. As Islam began to spread throughout Arabia, Ali helped establish the new Islamic order. He was instructed to write down theTreaty of Hudaybiyyah, the peace treaty between Muhammad and the Quraysh, in 628. Ali was so trustworthy that Muhammad asked him to carry the messages and declare the orders. In 630, Ali recited to a large gathering of pilgrims in Meccaa portion of the Quranthat declared Muhammad and the Islamic community no longer bound by agreements made earlier with Arabpolytheists. During theConquest of Meccain 630, Muhammad asked Ali to guarantee that the conquest would be bloodless. He ordered Ali to break all the idols worshiped by theBanu Aus,Banu Khazraj,Tayy, and those in the Kaaba to purify it after its defilement by the polytheism ofold times. Ali was sent toYemenone year later to spread the teachings of Islam. He was also known for settling several disputes and putting down the uprisings of various tribes.",
    "year": "2008"
  },
  {
    "number": "84",
    "text": "Explain the role of 'Amr b: 'As and Abu Musa I-Ashcari at the Arbitration of Adriih.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56613?exam_type=waec&type=theory&page=17",
    "correct_answer": "It was decided that the Syrians and the residents of Kufa should nominate an arbitrator each to decide between Ali and Muawiya. The Syrians choice fell on Amr bin al-A'as who was the rational soul and spokesman of Muawiya. Ali wanted one of his sincere followers likeMalik Ashtaror Abdullah bin Abbas to be appointed as an arbitrator for the people of Kufa, but the men of his own army strongly demurred, alleging that men like these two were, indeed, responsible for the war and, therefore, ineligible for that office of trust. They nominated Abu Musa al-Ashari as their arbitrator. Ali found it expedient to agree to this choice in order to ward off bloody dissensions in his army. According to \"Asadul Ghaba\" (3rd vol., p. 246), Ali had, therefore, taken care to personally explain to the arbitrators, \"You are arbiters on condition that you decide according to the Book of God, and if you are not so inclined you should not deem yourselves to be arbiters.\"\nWhen the arbitrators assembled at Daumet-ul-Jandal, which lay midway between Kufa and Syria and had for that reason been selected as the place for the announcement of the decision, a series of daily meeting was arranged for them to discuss the matters in hand. When the time arrived for taking a decision about the caliphate, Amr bin al-A'as deluded Abu Musa al-Ashari into entertaining the opinion that they should deprive both Ali and Muawiya of the caliphate, and give to the Muslims the right to elect the caliph. Abu Musa al-Ashari also decided to act accordingly. As the time for announcing the verdict approached, the people belonging to both parties assembled. Amr bin al-A'as requested Abu Musa to take the lead in announcing the decision he favoured. Abu Musa al-Ashari agreed to open the proceedings, and said, \"We have devised a solution after a good deal of thought and it may put an end to all contention and separatist tendencies. It is this. Both of us remove Ali as well as Muawiya from the caliphate. The Muslims are given the right to elect a new caliph in their places as they think best.\" As soon as he sat down after giving his award, Amr bin al-A'as sprang to his feet and addressing the gather said, \"You have heard Abu Musa who represents Ali. He has deposed Ali from the caliphate. As the representative of Muawiya, I agree with him in the deposition of Ali, but I install Muawiya as the caliph.\" Here, an disorderly scene ensured in which Abu Musa al-Ashari cursed Amr bin al-A'as. The Syrians hailed the trick played by Amr bin al-A'as as a great diplomatic triumph. It should be noted that the above judgement, the arbitrators did not quote any authority of the Koran or Sunnah to justify deposing Ali.",
    "explanation": "It was decided that the Syrians and the residents of Kufa should nominate an arbitrator each to decide between Ali and Muawiya. The Syrians choice fell on Amr bin al-A'as who was the rational soul and spokesman of Muawiya. Ali wanted one of his sincere followers likeMalik Ashtaror Abdullah bin Abbas to be appointed as an arbitrator for the people of Kufa, but the men of his own army strongly demurred, alleging that men like these two were, indeed, responsible for the war and, therefore, ineligible for that office of trust. They nominated Abu Musa al-Ashari as their arbitrator. Ali found it expedient to agree to this choice in order to ward off bloody dissensions in his army. According to \"Asadul Ghaba\" (3rd vol., p. 246), Ali had, therefore, taken care to personally explain to the arbitrators, \"You are arbiters on condition that you decide according to the Book of God, and if you are not so inclined you should not deem yourselves to be arbiters.\"\nWhen the arbitrators assembled at Daumet-ul-Jandal, which lay midway between Kufa and Syria and had for that reason been selected as the place for the announcement of the decision, a series of daily meeting was arranged for them to discuss the matters in hand. When the time arrived for taking a decision about the caliphate, Amr bin al-A'as deluded Abu Musa al-Ashari into entertaining the opinion that they should deprive both Ali and Muawiya of the caliphate, and give to the Muslims the right to elect the caliph. Abu Musa al-Ashari also decided to act accordingly. As the time for announcing the verdict approached, the people belonging to both parties assembled. Amr bin al-A'as requested Abu Musa to take the lead in announcing the decision he favoured. Abu Musa al-Ashari agreed to open the proceedings, and said, \"We have devised a solution after a good deal of thought and it may put an end to all contention and separatist tendencies. It is this. Both of us remove Ali as well as Muawiya from the caliphate. The Muslims are given the right to elect a new caliph in their places as they think best.\" As soon as he sat down after giving his award, Amr bin al-A'as sprang to his feet and addressing the gather said, \"You have heard Abu Musa who represents Ali. He has deposed Ali from the caliphate. As the representative of Muawiya, I agree with him in the deposition of Ali, but I install Muawiya as the caliph.\" Here, an disorderly scene ensured in which Abu Musa al-Ashari cursed Amr bin al-A'as. The Syrians hailed the trick played by Amr bin al-A'as as a great diplomatic triumph. It should be noted that the above judgement, the arbitrators did not quote any authority of the Koran or Sunnah to justify deposing Ali.",
    "year": "2008"
  },
  {
    "number": "85",
    "text": "Explain the modes of revelation as stated in the Qur’an.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56614?exam_type=waec&type=theory&page=17",
    "correct_answer": "The Holy Qur'ān itself testifies that it was not revealed in a single instance and that it came down piecemeal.\nوَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا\nThe rejecters ask, \"Why is the Qur'ān not revealed to him in a single instance?\" We have revealed it this way so that We fortify your heart through it. We have recited it to you gradually. (25:32)\nParts of the Holy Qur'ān were revealed considering the circumstances of its addressees. Therefore, when some of the directives were relaxed in some aspect or some others were complemented by new revelations, the new addition was put next to the original command. Sometimes these later revelations were placed at the end of the discussions they complemented. Since the shifts in the discourse have been marked by the rukū' division, people find it difficult to understand the interrelation of such complementary passages with the preceding discussions. We can study this interrelation between the two by the help of the following facts.\nGod Himself has explained that such verses are explanatory verses, revealed in accordance with His promise to the Prophet (sws) that He would explain whatever called for an explanation and would arrange it in a set order where He says:\nفَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ\nWhen We have recited it to you follow that recitation of Ours and then We shall Ourself explain it. (75:8-9)\nThe complementary verses have been expressed in a different style. They do not follow the pattern of the verses that follow and precede them. This also serves as an indication to the fact that they are explanatory verses.\nSome of the explanatory verses betray by their style that they respond to an implicit question. Many such verses clearly indicate that they are pointing out some matter undercurrent in the discourse.\nIt needs to be appreciated that some sūrahs have been put on the tongue of the Prophet (sws) and some on the tongue of the Gabriel and many more on the tongue of the Almighty himself, following the style of the earlier revelations. The Holy Qur'ān has clearly explained this fact:\nوَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاء حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاء\nIt is not possible for any mortal man that God should speak to him (face to face) except (that he does so) by revelation, or from behind a veil, or though a messenger sent and authorized by Him to make known His will. (42:51)\nAt another place God Almighty says:\nقُلْ مَن كَانَ عَدُوًّا لِّجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَى قَلْبِكَ بِإِذْنِ اللّهِ\nSay, \"Whoever is an enemy to Gabriel (must know) that he [Gabriel] has revealed it to your heart by God's command.\" (2:97)\nYet another place the same has been put thus:\nإِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ ذِي قُوَّةٍ عِندَ ذِي الْعَرْشِ مَكِينٍ مُطَاعٍ ثَمَّ أَمِينٍ وَمَا صَاحِبُكُم بِمَجْنُونٍ وَلَقَدْ رَآهُ بِالْأُفُقِ الْمُبِينِ وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ\nThis is a word of a gracious and mighty messenger, held in honor by the Lord of the Throne, obeyed in heavens, faithful to his trust. No, your compatriot is not mad. He saw him on the clear horizon. He does not grudge the secrets of the unseen; nor is it the utterance of an accursed devil. (81:19-25)\nStill at another place the Almighty says:\nإِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ وَمَا هُوَ بِقَوْلِ شَاعِرٍ قَلِيلًا مَا تُؤْمِنُونَ وَلَا بِقَوْلِ كَاهِنٍ قَلِيلًا مَا تَذَكَّرُونَتَنزِيلٌ مِّن رَّبِّ الْعَالَمِينَ\nThis is indeed the utterance of a noble messenger. It is no poet's speech: you seldom believe! It is no soothsayer's divinations: how little you reflect! It is a revelation from the Lord of the universe. (69:40-3)\nThis issue has been extensively discussed in my book 'Asālīb al-Qur'ān (Styles of the Qur'ān).\nThe above discussion, it is hoped, has made it clear that the Holy Qur'ān contains verses which have been incorporated later as required explanations or as complements to some earlier discussions. Many verses have been put in the mouth of Gabriel. Many others issue from the Prophet (sws). A major portion however is the direct speech of God. In order to understand the Holy Qur'ān and interpret it you have to make out which verse issues from whom and who it is addressing. Without successfully identifying the addressors and the addressees you will not be able to understand the coherence in the text. This can be explained through an example. In an allegorical story many characters are made to talk according to their role in the plot. If someone assumes that all these things have been told by a single character he will certainly fail to make out any connection between the parts of the whole story.\nThis example I have offered only in order to explain my point fully. The word of God, indeed, does not suffer from such limitations. His word is exalted and does not stand in need for such examples and analogies.",
    "explanation": "The Holy Qur'ān itself testifies that it was not revealed in a single instance and that it came down piecemeal.\nوَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا\nThe rejecters ask, \"Why is the Qur'ān not revealed to him in a single instance?\" We have revealed it this way so that We fortify your heart through it. We have recited it to you gradually. (25:32)\nParts of the Holy Qur'ān were revealed considering the circumstances of its addressees. Therefore, when some of the directives were relaxed in some aspect or some others were complemented by new revelations, the new addition was put next to the original command. Sometimes these later revelations were placed at the end of the discussions they complemented. Since the shifts in the discourse have been marked by the rukū' division, people find it difficult to understand the interrelation of such complementary passages with the preceding discussions. We can study this interrelation between the two by the help of the following facts.\nGod Himself has explained that such verses are explanatory verses, revealed in accordance with His promise to the Prophet (sws) that He would explain whatever called for an explanation and would arrange it in a set order where He says:\nفَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ\nWhen We have recited it to you follow that recitation of Ours and then We shall Ourself explain it. (75:8-9)\nThe complementary verses have been expressed in a different style. They do not follow the pattern of the verses that follow and precede them. This also serves as an indication to the fact that they are explanatory verses.\nSome of the explanatory verses betray by their style that they respond to an implicit question. Many such verses clearly indicate that they are pointing out some matter undercurrent in the discourse.\nIt needs to be appreciated that some sūrahs have been put on the tongue of the Prophet (sws) and some on the tongue of the Gabriel and many more on the tongue of the Almighty himself, following the style of the earlier revelations. The Holy Qur'ān has clearly explained this fact:\nوَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاء حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاء\nIt is not possible for any mortal man that God should speak to him (face to face) except (that he does so) by revelation, or from behind a veil, or though a messenger sent and authorized by Him to make known His will. (42:51)\nAt another place God Almighty says:\nقُلْ مَن كَانَ عَدُوًّا لِّجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَى قَلْبِكَ بِإِذْنِ اللّهِ\nSay, \"Whoever is an enemy to Gabriel (must know) that he [Gabriel] has revealed it to your heart by God's command.\" (2:97)\nYet another place the same has been put thus:\nإِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ ذِي قُوَّةٍ عِندَ ذِي الْعَرْشِ مَكِينٍ مُطَاعٍ ثَمَّ أَمِينٍ وَمَا صَاحِبُكُم بِمَجْنُونٍ وَلَقَدْ رَآهُ بِالْأُفُقِ الْمُبِينِ وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَجِيمٍ\nThis is a word of a gracious and mighty messenger, held in honor by the Lord of the Throne, obeyed in heavens, faithful to his trust. No, your compatriot is not mad. He saw him on the clear horizon. He does not grudge the secrets of the unseen; nor is it the utterance of an accursed devil. (81:19-25)\nStill at another place the Almighty says:\nإِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ وَمَا هُوَ بِقَوْلِ شَاعِرٍ قَلِيلًا مَا تُؤْمِنُونَ وَلَا بِقَوْلِ كَاهِنٍ قَلِيلًا مَا تَذَكَّرُونَتَنزِيلٌ مِّن رَّبِّ الْعَالَمِينَ\nThis is indeed the utterance of a noble messenger. It is no poet's speech: you seldom believe! It is no soothsayer's divinations: how little you reflect! It is a revelation from the Lord of the universe. (69:40-3)\nThis issue has been extensively discussed in my book 'Asālīb al-Qur'ān (Styles of the Qur'ān).\nThe above discussion, it is hoped, has made it clear that the Holy Qur'ān contains verses which have been incorporated later as required explanations or as complements to some earlier discussions. Many verses have been put in the mouth of Gabriel. Many others issue from the Prophet (sws). A major portion however is the direct speech of God. In order to understand the Holy Qur'ān and interpret it you have to make out which verse issues from whom and who it is addressing. Without successfully identifying the addressors and the addressees you will not be able to understand the coherence in the text. This can be explained through an example. In an allegorical story many characters are made to talk according to their role in the plot. If someone assumes that all these things have been told by a single character he will certainly fail to make out any connection between the parts of the whole story.\nThis example I have offered only in order to explain my point fully. The word of God, indeed, does not suffer from such limitations. His word is exalted and does not stand in need for such examples and analogies.",
    "year": "2008"
  },
  {
    "number": "86",
    "text": "Write Suratun-Nasr preferably in Arabic or by transliteration, translate it and explain its lessons.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56615?exam_type=waec&type=theory&page=18",
    "correct_answer": "1-When comes the Help of Allah, and Victory,2- And thou dost see the people enter Allah.s Religion in crowds,3- Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\n1. When comes the Help of Allah, and Victory,\nThe victory in this verse refers to the conquest of Mecca. There can be no victory without Allah’s Help.\nVictory comes only by the Help of Allah. Verily! Allah is Mighty, Wise.\nIn Surah al-Imran, Allah says:\nIf Allah is your Helper none can overcome you, and if He withdraws His Help from you, who is there who can help you after Him? In Allah let believers put their trust.\nPrior to the conquest of Mecca, Allah gave Muslims the good news of this great victory in Surah al-Fatah, at the occasion of the Treaty of Hudaybiyyah (an agreement that took place between Prophet Muhammad (PBUH) and the Quraysh of Mecca although most of the clauses of the treaty were against Muslims).\nVerily We have granted you a manifest Victory.\nAllah guaranteed this victory to Muslims after a long period of trials and patience.\nThis verse also indicates that Allah has completed the mission of His Messenger by making him successful in conveying the message.\nNarrated Ibn Abbas (RA):\nUmar (RA) asked the people regarding Allah’s Statement: “When comes the Help of Allah (to you O Muhammad against your enemies) and the conquest of Mecca?” They replied, “It indicates the future conquest of towns and palaces (by Muslims).” Umar said, “What do you say about it, O Ibn Abbas?” I replied, “(This Surah) indicates the termination of the life of Muhammad. Through it he was informed of the nearness of his death.”\n2. And you see the people enter Allah’s Religion in crowds,\nTruly, the conquest of Mecca opened a new chapter in the history of Islam. Earlier, many of the Arab tribes resisted joining with the Prophet Muhammad (PBUH). They wanted to see who would emerge victorious between him and the Quraysh. They reasoned that if the Quraysh were victorious, then Prophet Muhammad (PBUH) was not really a prophet! But if he was victorious, they reasoned, then he must really be a Messenger of Allah. [6]\nNarrated Hz Amr bin Salama (RA):\nAnd the Arabs (other than Quraysh) delayed their acceptance of Islam till the Conquest (of Mecca). They used to say. “Leave him (i.e. Muhammad) and his people Quraysh: if he overpowers them, then he is a true Prophet.” So, when Mecca was conquered, then every tribe rushed to embrace Islam.\n3. Celebrate the praises of your Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\nAllah is the One who gives victories, so thanks should be given to Him. This is why in this verse Allah tells us to celebrate His praises, and offer thanks to Him.",
    "explanation": "1-When comes the Help of Allah, and Victory,2- And thou dost see the people enter Allah.s Religion in crowds,3- Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\n1. When comes the Help of Allah, and Victory,\nThe victory in this verse refers to the conquest of Mecca. There can be no victory without Allah’s Help.\nVictory comes only by the Help of Allah. Verily! Allah is Mighty, Wise.\nIn Surah al-Imran, Allah says:\nIf Allah is your Helper none can overcome you, and if He withdraws His Help from you, who is there who can help you after Him? In Allah let believers put their trust.\nPrior to the conquest of Mecca, Allah gave Muslims the good news of this great victory in Surah al-Fatah, at the occasion of the Treaty of Hudaybiyyah (an agreement that took place between Prophet Muhammad (PBUH) and the Quraysh of Mecca although most of the clauses of the treaty were against Muslims).\nVerily We have granted you a manifest Victory.\nAllah guaranteed this victory to Muslims after a long period of trials and patience.\nThis verse also indicates that Allah has completed the mission of His Messenger by making him successful in conveying the message.\nNarrated Ibn Abbas (RA):\nUmar (RA) asked the people regarding Allah’s Statement: “When comes the Help of Allah (to you O Muhammad against your enemies) and the conquest of Mecca?” They replied, “It indicates the future conquest of towns and palaces (by Muslims).” Umar said, “What do you say about it, O Ibn Abbas?” I replied, “(This Surah) indicates the termination of the life of Muhammad. Through it he was informed of the nearness of his death.”\n2. And you see the people enter Allah’s Religion in crowds,\nTruly, the conquest of Mecca opened a new chapter in the history of Islam. Earlier, many of the Arab tribes resisted joining with the Prophet Muhammad (PBUH). They wanted to see who would emerge victorious between him and the Quraysh. They reasoned that if the Quraysh were victorious, then Prophet Muhammad (PBUH) was not really a prophet! But if he was victorious, they reasoned, then he must really be a Messenger of Allah. [6]\nNarrated Hz Amr bin Salama (RA):\nAnd the Arabs (other than Quraysh) delayed their acceptance of Islam till the Conquest (of Mecca). They used to say. “Leave him (i.e. Muhammad) and his people Quraysh: if he overpowers them, then he is a true Prophet.” So, when Mecca was conquered, then every tribe rushed to embrace Islam.\n3. Celebrate the praises of your Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).\nAllah is the One who gives victories, so thanks should be given to Him. This is why in this verse Allah tells us to celebrate His praises, and offer thanks to Him.",
    "year": "2008"
  },
  {
    "number": "87",
    "text": "What are the contributions ofImarn Muslim to the science of Hadith.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56616?exam_type=waec&type=theory&page=18",
    "correct_answer": "Imam Muslim was gifted with great intelligence and a sharp memory. First of all, he studied Arabic literature and other sciences taught in his times. Later on he developed a keen interest in the study of hadith. He began by learning hadith from the great scholars, including Imam Bukhari, who were at that time in Nishapur. This town, situated in a central place enjoyed great prestige at that time. Afterwards, he undertook long journeys to collect traditions from other scholars of repute. He went to most of the important centres of learning in Persia, Mesopotamia, Syria and Egypt, where he attended the lectures of most of the important traditionists of his time, including Ishaq ibn Rahwayh and Imam Ahmad ibn Hambal.\nAfter finishing his studies, he came back to Nishapur and devoted his life to the service of hadith. He died in 261/874 on account of having consumed too many dates. One day he was so engrossed in investigating a particular hadith, that he just did not notice that he had eaten all the dates in the container one by one. Consequently, he took ill and died in 874.\nImam Muslim was of an excellent character—honest, truthful and peace-loving. He wrote many books and treatises on hadith, and other related subjects. The most important of his works is hisSahih. Some scholars have regarded it as the best work on the subject. Imam Muslim examined 300,000 traditions before the completion of this book. Out of his large collection he included only 4000 traditions. One great feature of his book is that he selected only those traditions which were free of all defects and were unanimously accepted by the great hadith scholars.\nImam Muslim strictly observed the principles of the science of hadith. He was even stricter than Imam Bukhari in pointing out the differences between the accounts of various narrators, their character and other details. He shows greater ability in the arrangement of traditions.\nMoreover, he wrote a long introduction to his book explaining the principles followed by him as regards the choice of the material for his book.\nThanks to the utmost care having been taken in its completion, theSahihof Imam Muslim has been acknowledged as one of the most authentic collections of traditions after that ofSahihal Bukhari. So far as the beauty of its arrangement is concerned, it is held superior toSahihal Bukhari. Although some scholars, including Imam Nasai, held theSahihof Al Muslim superior to that of al Bukhari, the majority of the scholars have held the latter superior, the main reason being that when Imam Bukhari started working, he had no example before him for such a project. His contribution is very great by the virtue of fact that he managed to save all the authentic traditions by collecting them so painstakingly. On the contrary, Imam Muslim hadSahihal-Bukhari as an example. He had every opportunity to learn from both its salient features as well as its defects. Imam Muslim himself recognized the superiority of his predecessor.\nTheSahihof Imam Muslim is regarded as next to Al-Bukhari in accuracy and authenticity. Any tradition which is accepted by both Al-Bukhari and Muslim has been termed as ‘agreed upon’. And these ‘agreed upon’ traditions are considered to be the most reliable.\nImam Muslim has added to his work an introduction to the science of tradition. His work consists of 52 chapters dealing with the common subjects of hadith, such as the five pillars of Islam, marriage, the laws of heredity, war, sacrifice, manners and customs, etc. The book closes with a short chapter on the tafsir (exegesis) of the Quran. The longest chapter, the opening chapter of Sahih Muslim is on Iman.",
    "explanation": "Imam Muslim was gifted with great intelligence and a sharp memory. First of all, he studied Arabic literature and other sciences taught in his times. Later on he developed a keen interest in the study of hadith. He began by learning hadith from the great scholars, including Imam Bukhari, who were at that time in Nishapur. This town, situated in a central place enjoyed great prestige at that time. Afterwards, he undertook long journeys to collect traditions from other scholars of repute. He went to most of the important centres of learning in Persia, Mesopotamia, Syria and Egypt, where he attended the lectures of most of the important traditionists of his time, including Ishaq ibn Rahwayh and Imam Ahmad ibn Hambal.\nAfter finishing his studies, he came back to Nishapur and devoted his life to the service of hadith. He died in 261/874 on account of having consumed too many dates. One day he was so engrossed in investigating a particular hadith, that he just did not notice that he had eaten all the dates in the container one by one. Consequently, he took ill and died in 874.\nImam Muslim was of an excellent character—honest, truthful and peace-loving. He wrote many books and treatises on hadith, and other related subjects. The most important of his works is hisSahih. Some scholars have regarded it as the best work on the subject. Imam Muslim examined 300,000 traditions before the completion of this book. Out of his large collection he included only 4000 traditions. One great feature of his book is that he selected only those traditions which were free of all defects and were unanimously accepted by the great hadith scholars.\nImam Muslim strictly observed the principles of the science of hadith. He was even stricter than Imam Bukhari in pointing out the differences between the accounts of various narrators, their character and other details. He shows greater ability in the arrangement of traditions.\nMoreover, he wrote a long introduction to his book explaining the principles followed by him as regards the choice of the material for his book.\nThanks to the utmost care having been taken in its completion, theSahihof Imam Muslim has been acknowledged as one of the most authentic collections of traditions after that ofSahihal Bukhari. So far as the beauty of its arrangement is concerned, it is held superior toSahihal Bukhari. Although some scholars, including Imam Nasai, held theSahihof Al Muslim superior to that of al Bukhari, the majority of the scholars have held the latter superior, the main reason being that when Imam Bukhari started working, he had no example before him for such a project. His contribution is very great by the virtue of fact that he managed to save all the authentic traditions by collecting them so painstakingly. On the contrary, Imam Muslim hadSahihal-Bukhari as an example. He had every opportunity to learn from both its salient features as well as its defects. Imam Muslim himself recognized the superiority of his predecessor.\nTheSahihof Imam Muslim is regarded as next to Al-Bukhari in accuracy and authenticity. Any tradition which is accepted by both Al-Bukhari and Muslim has been termed as ‘agreed upon’. And these ‘agreed upon’ traditions are considered to be the most reliable.\nImam Muslim has added to his work an introduction to the science of tradition. His work consists of 52 chapters dealing with the common subjects of hadith, such as the five pillars of Islam, marriage, the laws of heredity, war, sacrifice, manners and customs, etc. The book closes with a short chapter on the tafsir (exegesis) of the Quran. The longest chapter, the opening chapter of Sahih Muslim is on Iman.",
    "year": "2008"
  },
  {
    "number": "88",
    "text": "(a) Give the definition of Hajj (b) Highlight five of its lessons.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56617?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a) The Hajj is an annual Islamic pilgrimage to Mecca, Saudi Arabia, the holiest city for Muslims. Hajj is a mandatory religious duty for Muslims that must be carried out at least once in their lifetime by .\n(b)1.We are all equal as humans\n2. Allah (swt) is All Forgiving\n3. With hardship comes ease\n4. We are stronger than Shaytan\n5. Allah (swt) will test us, but He is always with us",
    "explanation": "(a) The Hajj is an annual Islamic pilgrimage to Mecca, Saudi Arabia, the holiest city for Muslims. Hajj is a mandatory religious duty for Muslims that must be carried out at least once in their lifetime by .\n(b)1.We are all equal as humans\n2. Allah (swt) is All Forgiving\n3. With hardship comes ease\n4. We are stronger than Shaytan\n5. Allah (swt) will test us, but He is always with us",
    "year": "2008"
  },
  {
    "number": "89",
    "text": "Define Ghuslu Dukhulu l-Islam and explain how it is performed.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56618?exam_type=waec&type=theory&page=18",
    "correct_answer": "Ghuslis an Arabic term to the full-body ritual purification mandatory before the performance of various rituals and prayers, for any adult Muslim after having ejaculation or completion of the menstrual cycle. However, wudu or just sleep, without either, are acceptable prior toperforming ghusl.\nUpon completion of menstruation, the female is required to take a ritual bath to begin praying her five daily prayers. This bath is fairly simple, but there are a few obligatory acts that need to be met to be considered ritually pure. Below, we have included a step by step of the process.\nStep 1: Intention (Niyyah)\nThe intention to make ghusl is NOT obligatory, just recommended (sunnah). In other words, if you forget to make the intention before beginning, it does not mean that your ghusl does not count.\nStep 2: The Three Requirements of Ghusl\nThere are three requirements that are obligatory (fard) to meet in ghusl. They are:\nPassing water through the mouth (gargling)Passing water through the nostrilsPassing water over the entire body, including your hair\nIt is important to note if even one hair is left dry, your ghusl is incomplete. Use sufficient water, without being wasteful, but also without being frugal.\nStep 3: The Five Recommended Acts of Ghusl\nThere are five recommended acts (sunnah) of ghusl. Your ghusl is still valid if you do not actively do these, but they are recommended.\nWashing hands up to the wristsWashing the private parts and the parts over which uncleanliness is foundIntentionMaking wudu (ablution) before washing the bodyPassing water over the whole body three times.",
    "explanation": "Ghuslis an Arabic term to the full-body ritual purification mandatory before the performance of various rituals and prayers, for any adult Muslim after having ejaculation or completion of the menstrual cycle. However, wudu or just sleep, without either, are acceptable prior toperforming ghusl.\nUpon completion of menstruation, the female is required to take a ritual bath to begin praying her five daily prayers. This bath is fairly simple, but there are a few obligatory acts that need to be met to be considered ritually pure. Below, we have included a step by step of the process.\nStep 1: Intention (Niyyah)\nThe intention to make ghusl is NOT obligatory, just recommended (sunnah). In other words, if you forget to make the intention before beginning, it does not mean that your ghusl does not count.\nStep 2: The Three Requirements of Ghusl\nThere are three requirements that are obligatory (fard) to meet in ghusl. They are:\nPassing water through the mouth (gargling)Passing water through the nostrilsPassing water over the entire body, including your hair\nIt is important to note if even one hair is left dry, your ghusl is incomplete. Use sufficient water, without being wasteful, but also without being frugal.\nStep 3: The Five Recommended Acts of Ghusl\nThere are five recommended acts (sunnah) of ghusl. Your ghusl is still valid if you do not actively do these, but they are recommended.\nWashing hands up to the wristsWashing the private parts and the parts over which uncleanliness is foundIntentionMaking wudu (ablution) before washing the bodyPassing water over the whole body three times.",
    "year": "2008"
  }
]