[
  {
    "number": "52",
    "text": "You are provided with a metre rule, a knife edge, two pieces of thread and two masses m\\(_{1}\\) and m\\(_{2}\\)\n\nRecord the values of m\\(_{1}\\) and m\\(_{2}\\).\nBalance the metre rule horizontally on the knife edge and record the balance point G.\nWith the knife edge at the 60 cm mark of the metre rule, suspend m\\(_{1}\\) at the 20 cm mark and m\\(_{2}\\) at a suitable mark such that the rule balances horizontally as illustrated in the diagram above.\nRecord the positions Y of m\\(_{1}\\) and Q of m\\(_{2}\\). \nEvaluate 1= P - Y and d = Q - P\nRepeat the procedure for four other positions of m, at 18, 16, 14 and 12 cm marks.\nIn each case, evaluate and record l and d.\nTabulate your readings.\nPlot a graph of l on the vertical axis against d on the horizontal axis.\nDetermine the slope of the graph.\nState two precautions taken to ensure accurate results.\n\n(b}i. With the aid of a diagram, indicate the forces acting on the metre rule in the experimental set-up above.\nii. Define moment of a force about a point and state its S.1. unit.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60082?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "53",
    "text": "Using the diagram above as a guide, carry out the following instructions:\n\nFix. the drawing paper provided on the drawing board\nPlace the mirror vertically with its longer side resting on the drawing paper. Trace the outline AB of the mirror. Remove the mirror.\nDraw a normal PQ to meet the outline at the middle Q.\nDraw a straight line through A to meet the outline of the mirror at the right angle.\nTrace the incident ray, Q with pins P\\(_{1}\\) and P\\(_{2}\\) so that it meets the perpendicular line through A at C such that CA=X= 1.0m.\nReplace the mirror on its outline. Locate the images of P\\(_{1}\\)P\\(_{2}\\) through the mirror using two other pins P\\(_{3}\\) and P\\(_{4}\\) so that P\\(_{3}\\) and P\\(_{4}\\) and the images of P\\(_{1}\\) and P\\(_{2}\\) are in a straight line.\nRemove the mirror and pins P\\(_{3}\\) and P\\(_{4}\\).\n\tDraw a straight line through the pin points to meet AB at Q and CA produced at D.\nMeasure and record angle ACQ as è\\(_{1}\\), and angle ADCQ as è\\(_{2}\\). Also, record the value of x. Evaluate è = (è\\(_{1}\\) + è\\(_{2}\\)), x\\(^{-1}\\) and tan è.\nRepeat the procedure for four other values of x = 2.0, 3.0, 4.0 and 5.0cm. Tabulate your readings.\nPlot a graph of tan è on the vertical axis against x on the horizontal axis.\nDetermine the slope, s, of the graph. Evaluate k = 2s\nState two precautions taken to ensure accurate results. Attach your traces to your answer booklet.\n\n(b)i. Distinguish between regular and diffused reflections.\nii. An object is situated 25cm in front of a plane mirror. Determine the distance of the image from the object. What is the size of the image relative to the object?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60083?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  },
  {
    "number": "54",
    "text": "You are provided with a potentiometer x y; a jockey, J; a standard resistor, R, and other necessary apparatus.\n\nConnect a circuit as shown in the diagram above.\nClose the key. Read and record the current 10 when J is not in contact with XY.\nLet J make contact with XY at C, such that XC = l= 25 cm. Close the key. Read and record the current l.\nEvaluate I\\(^{-1}\\).\nRepeat the procedure for four other values of I = 40, 55, 70, and 85 cm. Tabulate your readings.\nPlot a graph of l on the vertical axis against I\\(^{-1}\\) on the horizontal axis.\nFrom your graph, deduce the value of I when l\\(^{-1}\\) = 0. Evaluate \\(\\frac{|O}{1}\\)\nState two precautions taken to ensure accurate results.\n\n(b)i) Explain what is meant by the potential difference between two points in an electric circuit.\nii. A piece of resistance wire of diameter 0.2m and resistance 7\\(\\Omega\\) has a resistivity of 8.8 x 10\\(^{-7}\\) \\(\\Omega\\)m. Calculate the length of the wire. [\\(\\pi\\) = \\(\\frac{22}{7}\\)].",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60107?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2003"
  }
]