[
  {
    "number": "693",
    "text": "The rule of law refers to the principle of",
    "options": {
      "A": "legality and impartiality",
      "B": "the supreme power of rulers",
      "C": "the immunity of judges from legal actions",
      "D": "the orderly execution of government policies"
    },
    "answer_url": "https://myschool.ng/classroom/government/18867?exam_type=waec&type=obj&page=139",
    "correct_answer": "A",
    "explanation": "The rule of law is a principle that ensures all individuals and institutions, including the government, are subject to and accountable under the law. It is the idea that laws should be applied fairly and impartially, without bias or favouritism.",
    "year": "2000"
  },
  {
    "number": "694",
    "text": "Freedom of speech is a fundamental human right enjoyed by citizens but it may be limited if",
    "options": {
      "A": "loyalty is not shown to the ruling party",
      "B": "it exposes the wrong-doings of the government",
      "C": "it endangers the security of the state",
      "D": "it is used to cause embarrassment to the judiciary"
    },
    "answer_url": "https://myschool.ng/classroom/government/18868?exam_type=waec&type=obj&page=139",
    "correct_answer": "C",
    "explanation": "Freedom of speech can be restricted when it threatens national security, such as inciting violence, terrorism or causing panic. This is a widely accepted limitation in many democratic systems.",
    "year": "2000"
  },
  {
    "number": "695",
    "text": "Which of the following is an obligation of a citizen?",
    "options": {
      "A": "Attending political rallies",
      "B": "Taking part is independence day celebrations",
      "C": "Contesting elections",
      "D": "Paying respect to the national flag"
    },
    "answer_url": "https://myschool.ng/classroom/government/18869?exam_type=waec&type=obj&page=139",
    "correct_answer": "D",
    "explanation": "This is considered an obligation as it reflects a citizen’s duty to show respect for the country and its symbols, such as the national flag. It is a form of patriotism and national duty. Other options do not represent obligations because they are not things that the citizens have to partake in.",
    "year": "2000"
  },
  {
    "number": "696",
    "text": "The extent to which the citizens regard the institutions, officials and activities of government as right and acceptable is known as",
    "options": {
      "A": "power",
      "B": "legitimacy",
      "C": "influence",
      "D": "authority"
    },
    "answer_url": "https://myschool.ng/classroom/government/18876?exam_type=waec&type=obj&page=140",
    "correct_answer": "B",
    "explanation": "Legitimacyis the extent to which citizens accept the institutions, officials and activities of government as rightful, just and appropriate. It is based on the belief that the government has the right to rule and make decisions.",
    "year": "2000"
  },
  {
    "number": "697",
    "text": "Diplomatic immunity is a limitation to",
    "options": {
      "A": "the theory of separation of powers",
      "B": "principles of checks and balances",
      "C": "parliamentary supremacy",
      "D": "the rule of law"
    },
    "answer_url": "https://myschool.ng/classroom/government/18877?exam_type=waec&type=obj&page=140",
    "correct_answer": "D",
    "explanation": "Diplomatic immunity can be seen as a limitation to the rule of law because it grants certain legal protections to diplomats and foreign representatives that may exempt them from being subject to the same laws as the citizens of the host country. In some cases, diplomatic immunity may prevent legal action against diplomats who break local laws, which can be seen as an exception to the principle that all individuals are equal before the law.",
    "year": "2000"
  },
  {
    "number": "698",
    "text": "In which of the following party system are all shades of opinions and interests adequately represented?",
    "options": {
      "A": "Zero-party",
      "B": "One-party",
      "C": "Two-party",
      "D": "Multi-party"
    },
    "answer_url": "https://myschool.ng/classroom/government/18878?exam_type=waec&type=obj&page=140",
    "correct_answer": "D",
    "explanation": "A multi-party system features multiple political parties, each representing different segments of society, ideologies or interests. This system allows for a broader range of opinions and interests to be represented in the political process. This makes it the best option for ensuring that all views are adequately heard and considered.",
    "year": "2000"
  },
  {
    "number": "699",
    "text": "Federal state is always expensive to run because",
    "options": {
      "A": "every parliamentarian wanted to become rich",
      "B": "government departments are duplicated",
      "C": "judges are highly paid from the consolidated fund",
      "D": "maintenance of the arm involves high expenditure"
    },
    "answer_url": "https://myschool.ng/classroom/government/18879?exam_type=waec&type=obj&page=140",
    "correct_answer": "B",
    "explanation": "In afederal system, both central and regional (state or provincial) governments exist, which means that some functions or services are duplicated at both levels. For example, each state may have its own ministries of health, education and transport, while the federal government may also have similar departments. This duplication of administrative functions and resources leads to higher costs.",
    "year": "2000"
  },
  {
    "number": "700",
    "text": "Veto power in a presidential system lies with the",
    "options": {
      "A": "Attorney-General",
      "B": "Chief of Army Staff",
      "C": "Executive President",
      "D": "Prime Minister"
    },
    "answer_url": "https://myschool.ng/classroom/government/18880?exam_type=waec&type=obj&page=140",
    "correct_answer": "C",
    "explanation": "In a presidential system, thePresidenthas veto power, which means they can reject bills passed by the legislature. The president can send the bill back to the legislature with reasons for the veto, although the legislature may override the veto in some cases, depending on the country's constitution.",
    "year": "2000"
  },
  {
    "number": "701",
    "text": "Which of the following is the lowest class of people in the hierarchy of feudal system?",
    "options": {
      "A": "Nobles",
      "B": "Serfs",
      "C": "Lords",
      "D": "Manor"
    },
    "answer_url": "https://myschool.ng/classroom/government/18881?exam_type=waec&type=obj&page=141",
    "correct_answer": "B",
    "explanation": "Serfs were the lowest class in the feudal system. They were peasants who worked the land for the lords in exchange for protection but had very limited rights or freedoms.",
    "year": "2000"
  },
  {
    "number": "702",
    "text": "Mussolini's fascism and Hitler's nazism are good examples of",
    "options": {
      "A": "anarchy",
      "B": "feudalism",
      "C": "Totalitarianism",
      "D": "oligarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/18882?exam_type=waec&type=obj&page=141",
    "correct_answer": "C",
    "explanation": "Both Mussolini's fascism and Hitler's nazism are classic examples of totalitarian regimes, where the government seeks to control all aspects of public and private life, including the economy, education and personal freedoms. These regimes were characterized by dictatorial leadership, extreme nationalism and suppression of political opposition.",
    "year": "2000"
  },
  {
    "number": "703",
    "text": "Which of the following is the supreme in a federal system?",
    "options": {
      "A": "Judiciary",
      "B": "Legislature",
      "C": "Constitution",
      "D": "Exective"
    },
    "answer_url": "https://myschool.ng/classroom/government/18883?exam_type=waec&type=obj&page=141",
    "correct_answer": "C",
    "explanation": "In a federal system, the Constitution is the supreme law of the land. It defines the powers and relationships between the central government and the states or provinces. All laws and actions must conform to the Constitution.",
    "year": "2000"
  },
  {
    "number": "704",
    "text": "An order directing a detainee to be brought before the court is called",
    "options": {
      "A": "habeas corpus",
      "B": "an appearance",
      "C": "an injunction",
      "D": "a referendum"
    },
    "answer_url": "https://myschool.ng/classroom/government/18884?exam_type=waec&type=obj&page=141",
    "correct_answer": "A",
    "explanation": "Habeas Corpus is a legal order requiring that a detainee be brought before a court to determine whether their detention is lawful. It ensures protection against illegal imprisonment.",
    "year": "2000"
  },
  {
    "number": "705",
    "text": "Which of the following is a feature of an elite party?",
    "options": {
      "A": "Members are recruited from the working class",
      "B": "The leadership is composed of aristocrats and wealthy merchants",
      "C": "it usually consists of existing associations, clubs and trade unions",
      "D": "its leadership has certain techniques which attract supporters"
    },
    "answer_url": "https://myschool.ng/classroom/government/18887?exam_type=waec&type=obj&page=141",
    "correct_answer": "B",
    "explanation": "The leadership of an elite party is composed of aristocrats and wealthy merchants. Elite parties often have a leadership that comes from the wealthier, more powerful segments of society, such as aristocrats, wealthy merchants or other influential figures.",
    "year": "2000"
  },
  {
    "number": "706",
    "text": "An undesirable feature of capitalism is",
    "options": {
      "A": "exploitation",
      "B": "market economy",
      "C": "profit motive",
      "D": "free competition"
    },
    "answer_url": "https://myschool.ng/classroom/government/18888?exam_type=waec&type=obj&page=142",
    "correct_answer": "A",
    "explanation": "In capitalism, the focus on profit generation often leads to the exploitation of workers. Employers may pay low wages and provide poor working conditions to maximise profits, which can result in social inequality and unfair labour practices.",
    "year": "2000"
  },
  {
    "number": "707",
    "text": "The system of voting on behalf of another person is known as",
    "options": {
      "A": "voting by lot",
      "B": "casting votes",
      "C": "voting by proxy",
      "D": "perference voting"
    },
    "answer_url": "https://myschool.ng/classroom/government/18890?exam_type=waec&type=obj&page=142",
    "correct_answer": "C",
    "explanation": "Voting by proxy is the process where one person votes on behalf of another. In many systems, someone who cannot vote in person can authorise someone else to cast a vote for them, known as a proxy vote.",
    "year": "2000"
  },
  {
    "number": "708",
    "text": "Authoritarianism is least inherent in",
    "options": {
      "A": "feudalism",
      "B": "fascism",
      "C": "democracy",
      "D": "monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/18892?exam_type=waec&type=obj&page=142",
    "correct_answer": "C",
    "explanation": "Democracy, by definition, is based on the principles of political equality, individual rights, and the rule of law. It aims to limit the concentration of power and allows for the participation of citizens in decision-making. Therefore, authoritarianism is least inherent in a democracy.Feudalismis a hierarchical system where power is concentrated in the hands of a few and this can lead to authoritarian rule at the local level.Fascismis inherently authoritarian as it centralises power in a dictatorial leader and emphasises total control over society and the state.Monarchy, especially in absolute forms, can have authoritarian elements, with power vested in a single ruler, although modern constitutional monarchies limit this power.",
    "year": "2000"
  },
  {
    "number": "709",
    "text": "In which of the following systems of government are ceremonial and executive powers usually fused?",
    "options": {
      "A": "Parliamentary",
      "B": "Presidential",
      "C": "Collegial",
      "D": "Confederal"
    },
    "answer_url": "https://myschool.ng/classroom/government/18893?exam_type=waec&type=obj&page=142",
    "correct_answer": "B",
    "explanation": "A Presidential system is a democratic and republican government in which a head of government leads an executive branch that is separate from the legislative branch. This head of government is in most cases also the head of state, which is called thepresident. Ceremonial and executive powers are fused in a presidential system.\nIn a parliamentary system, the head of state is different from the head of government. Example is the UK, thehead of governmentis the Prime Minister while the head of state is Queen. ceremonial and executive powers are separated in a parliamentary system.",
    "year": "2000"
  },
  {
    "number": "710",
    "text": "The programme of a political party is known as its",
    "options": {
      "A": "document",
      "B": "manifesto",
      "C": "propaganda",
      "D": "constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/18895?exam_type=waec&type=obj&page=142",
    "correct_answer": "B",
    "explanation": "Amanifestois a public declaration of the principles and policies of a political party. It contains the party's goals, intentions and the actions it plans to take if elected. It is essentially the program or plan of action for the party.",
    "year": "2000"
  },
  {
    "number": "711",
    "text": "Which of the following is a source of a country's constitution?",
    "options": {
      "A": "Mandamus",
      "B": "Judicial precedents",
      "C": "injunctions",
      "D": "political decisions"
    },
    "answer_url": "https://myschool.ng/classroom/government/18896?exam_type=waec&type=obj&page=143",
    "correct_answer": "B",
    "explanation": "Judicial precedents, also known as case law or stare decisis, are one of the sources of a country's constitution, especially in common law systems like the United Kingdom. Precedents refer to previous court decisions that set examples or principles for future cases.",
    "year": "2000"
  },
  {
    "number": "712",
    "text": "The acquisition of political power through hereditary means is a feature of",
    "options": {
      "A": "communalism",
      "B": "capitalism",
      "C": "oligarchy",
      "D": "monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/18897?exam_type=waec&type=obj&page=143",
    "correct_answer": "D",
    "explanation": "In amonarchy, political power is acquired through hereditary means, where leadership is passed down within a family, from parent to child. Monarchies have rulers such as kings, queens or emperors who hold power based on family lineage. In some monarchies, this system is absolute (absolute monarchy), while in others, it may be ceremonial with the real power residing in elected officials (constitutional monarchy).",
    "year": "2000"
  },
  {
    "number": "713",
    "text": "Which of the following factors limits the expression of public opinion?",
    "options": {
      "A": "The type of government in a state",
      "B": "The establishment of private media organizations",
      "C": "The high literacy rate of the citizens",
      "D": "Religious belife of the citizenry"
    },
    "answer_url": "https://myschool.ng/classroom/government/18898?exam_type=waec&type=obj&page=143",
    "correct_answer": "A",
    "explanation": "The type of government in a state can significantly limit the expression of public opinion. Inauthoritarianordictatorialregimes, for instance, the government may suppress or control the expression of public opinion through censorship, propaganda or limiting freedoms such as freedom of speech and the press. Citizens in such systems may fear retribution if they openly express opinions that contradict the government's policies.",
    "year": "2000"
  },
  {
    "number": "714",
    "text": "If the federal government and the unit government are to preserve their autonomy, the",
    "options": {
      "A": "federal government must be supreme",
      "B": "unit government must be supreme",
      "C": "Judiciaary must be supreme",
      "D": "constitution must be supreme"
    },
    "answer_url": "https://myschool.ng/classroom/government/18899?exam_type=waec&type=obj&page=143",
    "correct_answer": "D",
    "explanation": "In a federal system, both the federal government and the unit governments (state or provincial governments) have their own distinct powers and responsibilities. To preserve their autonomy and prevent one level of government from overpowering the other, theConstitution must be supreme. The Constitution outlines the division of powers between the different levels of government and ensures that each level respects the powers of the other.",
    "year": "2000"
  },
  {
    "number": "715",
    "text": "Which of the following best describes the relationship between the central and the component government in a confederation?",
    "options": {
      "A": "the central governmnet collect revenue for component governments",
      "B": "the central and component governments have equal powers",
      "C": "The central government is weaker than the component governments",
      "D": "The central government legislates for the component"
    },
    "answer_url": "https://myschool.ng/classroom/government/18906?exam_type=waec&type=obj&page=143",
    "correct_answer": "C",
    "explanation": "In a confederation, the central government is intentionally designed to be weaker than the component or constituent governments. The concept of a confederation involves a union of sovereign states or entities where these states retain a significant degree of independence and authority.",
    "year": "2000"
  },
  {
    "number": "716",
    "text": "The administrative head of a public corporation in Nigeria is the",
    "options": {
      "A": "Managing Director",
      "B": "Secretary",
      "C": "Board of Dircetors",
      "D": "Chairman"
    },
    "answer_url": "https://myschool.ng/classroom/government/18910?exam_type=waec&type=obj&page=144",
    "correct_answer": "A",
    "explanation": "In Nigeria, theManaging Director (MD)is the administrative head of a public corporation. The MD is responsible for the day-to-day operations of the corporation and reports to the Board of Directors.",
    "year": "2000"
  },
  {
    "number": "717",
    "text": "The appointment, promotion and discipline of civil servants are the responsibility of the",
    "options": {
      "A": "Civil Service Union",
      "B": "Judicial Service Commission",
      "C": "Civil Service Commision",
      "D": "Electoral Commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/18911?exam_type=waec&type=obj&page=144",
    "correct_answer": "C",
    "explanation": "TheCivil Service Commissionis responsible for the appointment, promotion and discipline of civil servants. This body ensures that the recruitment and management of civil servants are carried out according to established rules and regulations.",
    "year": "2000"
  },
  {
    "number": "718",
    "text": "Redtapism in the civil service refers to",
    "options": {
      "A": "the use of red tapes on legal documents",
      "B": "slowness of action",
      "C": "the co-operation between civil servants and politicians",
      "D": "the politicisation of the civil service"
    },
    "answer_url": "https://myschool.ng/classroom/government/18912?exam_type=waec&type=obj&page=144",
    "correct_answer": "B",
    "explanation": "Redtapismin the civil service refers to excessive bureaucracy, procedures or formalities that lead to delays and inefficiency in decision-making and implementation of policies or services. It often involves unnecessary rules, regulations and paperwork that slow down processes.",
    "year": "2000"
  },
  {
    "number": "719",
    "text": "The grant of the right to vote is called",
    "options": {
      "A": "enfranchisement",
      "B": "disqualification",
      "C": "prohibition",
      "D": "participation"
    },
    "answer_url": "https://myschool.ng/classroom/government/18913?exam_type=waec&type=obj&page=144",
    "correct_answer": "A",
    "explanation": "Enfranchisementrefers to the granting of the right to vote to individuals or groups. It is the process of giving people the legal right to participate in elections and political processes.",
    "year": "2000"
  },
  {
    "number": "720",
    "text": "The system which allows private individuals and companies to own and control the means of production is known as",
    "options": {
      "A": "socialism",
      "B": "fascism",
      "C": "capitalism",
      "D": "communism"
    },
    "answer_url": "https://myschool.ng/classroom/government/18935?exam_type=waec&type=obj&page=144",
    "correct_answer": "C",
    "explanation": "Capitalism is a political and economic system that allows private individuals and companies to own and control the means of production.",
    "year": "2000"
  },
  {
    "number": "721",
    "text": "Delegated Legislation has the advantage of",
    "options": {
      "A": "enlightening the public about law making procedure",
      "B": "saving parliamentary time",
      "C": "reducing the expenses of the legislature",
      "D": "preventing the executive from becoming too powerful"
    },
    "answer_url": "https://myschool.ng/classroom/government/18936?exam_type=waec&type=obj&page=145",
    "correct_answer": "B",
    "explanation": "Delegated legislationrefers to laws made by an executive authority under powers granted to it by an Act of Parliament. One of the advantages of delegated legislation is that itsaves parliamentary time. This is because detailed rules and regulations, which might otherwise take a lot of time to debate and pass in the legislature, can be created by relevant authorities (like ministers or agencies) without the need for full parliamentary involvement.",
    "year": "2000"
  },
  {
    "number": "722",
    "text": "Which of the following factors may work against a representative system of government?",
    "options": {
      "A": "High literacy of the electorate",
      "B": "The introduction of univerasl adult suffrage",
      "C": "Independent electoral commission",
      "D": "Rigging of elections"
    },
    "answer_url": "https://myschool.ng/classroom/government/18939?exam_type=waec&type=obj&page=145",
    "correct_answer": "D",
    "explanation": "Rigging of electionsundermines the integrity of the electoral process and works against a representative system of government. It results in the election of leaders who may not truly reflect the will of the people. This undermines democracy and the principle of representative governance.",
    "year": "2000"
  },
  {
    "number": "723",
    "text": "The powers allocated to the central government in a federation are contained in the",
    "options": {
      "A": "central legislative list",
      "B": "exclusive legislative list",
      "C": "residual legislative list",
      "D": "concurrent legislative list"
    },
    "answer_url": "https://myschool.ng/classroom/government/18941?exam_type=waec&type=obj&page=145",
    "correct_answer": "B",
    "explanation": "In a federation, theexclusive legislative listcontains the powers and responsibilities allocated solely to the central government. These are matters that only the federal government can legislate on, such as defence, foreign affairs and immigration.\nTheresidual legislative listpertains to matters not explicitly covered by the federal or concurrent lists, and these are usually under the jurisdiction of the local governments. Theconcurrent legislative listcontains areas where both the federal and state governments can legislate.",
    "year": "2000"
  },
  {
    "number": "724",
    "text": "The Nigerian federal legislature is called the",
    "options": {
      "A": "Senate",
      "B": "Congress",
      "C": "National Assembly",
      "D": "House of Representatives"
    },
    "answer_url": "https://myschool.ng/classroom/government/18943?exam_type=waec&type=obj&page=145",
    "correct_answer": "C",
    "explanation": "TheNational Assemblyis Nigeria's federal legislature, consisting of two chambers:\nTheSenate(the upper house)TheHouse of Representatives(the lower house)\nThis bicameral legislature is responsible for making laws and representing the interests of Nigerians at the federal level.",
    "year": "2000"
  },
  {
    "number": "725",
    "text": "Nigeria's first constitution was the",
    "options": {
      "A": "Lyttleton Constitution",
      "B": "Clifford Constitution",
      "C": "Macpherson Constitution",
      "D": "Independence Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/18944?exam_type=waec&type=obj&page=145",
    "correct_answer": "B",
    "explanation": "TheClifford Constitutionof 1922 was Nigeria's first formal constitution. It introduced limited self-governance by establishing a Legislative Council with a mix of elected and appointed members, but it was still under British colonial control. It did not grant full independence or significant self-rule, which came later with theIndependence Constitutionin 1960.",
    "year": "2000"
  },
  {
    "number": "726",
    "text": "The Nigerian Macpherson Constitution of 1951 was significant for",
    "options": {
      "A": "the introduction of electoral college",
      "B": "providing for the office of the Prime Minister",
      "C": "the creation of states",
      "D": "establishing the Supreme Court"
    },
    "answer_url": "https://myschool.ng/classroom/government/18946?exam_type=waec&type=obj&page=146",
    "correct_answer": "A",
    "explanation": "TheMacpherson Constitutionof 1951 was significant because it introduced theelectoral collegesystem for the election of members of the House of Representatives. This system allowed for the election of representatives through an indirect method, where an electoral college of chosen representatives voted for members of the House.\nWhile other important features were introduced by this constitution, such as the establishment of a more representative government structure, it did not create states or establish the office of the Prime Minister, which were later addressed in subsequent constitutions. The establishment of theSupreme Courtwas also not a feature of the Macpherson Constitution.",
    "year": "2000"
  },
  {
    "number": "727",
    "text": "The concept of regionalism in Nigeria was first introduced by the",
    "options": {
      "A": "Independence Constitution",
      "B": "Macpherson Constitution",
      "C": "Richard Constitution",
      "D": "Lyttleton Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/18947?exam_type=waec&type=obj&page=146",
    "correct_answer": "C",
    "explanation": "TheRichards Constitutionof 1946 was the first to introduce the concept of regionalism in Nigeria. It created regions—specifically the Northern, Western and Eastern regions—as part of the administrative structure. This was a significant shift from the earlier, more centralised system. The Richards Constitution sought to accommodate the diverse ethnic and cultural groups within Nigeria by establishing a system that allowed for regional representation and decentralisation of governance.",
    "year": "2000"
  },
  {
    "number": "728",
    "text": "Immediately after the Nigerian civil war, Gowon's regime embarked on",
    "options": {
      "A": "rejuvenation, resettlement and reconstruction",
      "B": "reconciliation, rehabilitation and reconstruction",
      "C": "rebuilding, rejuvenation and rehabilitation",
      "D": "rehabilitation , renaissance and repression"
    },
    "answer_url": "https://myschool.ng/classroom/government/18950?exam_type=waec&type=obj&page=146",
    "correct_answer": "B",
    "explanation": "Immediately after the Nigerian Civil War (1967–1970),General Yakubu Gowon's regimefocused on these three key objectives (the 3Rs):\nReconciliation: To heal the divisions caused by the war and bring together the various ethnic groups, especially between the victorious federal government and the defeated secessionist Biafran side.Rehabilitation: This involved restoring the social, economic and infrastructure systems that had been devastated during the war, particularly in the southeastern region (Biafra) and other parts of the country affected by the conflict.Reconstruction: This aimed to rebuild and revitalise the war-torn economy and physical infrastructure, including roads, schools, and hospitals, and to integrate the affected regions back into the national framework.",
    "year": "2000"
  },
  {
    "number": "729",
    "text": "Which of the following military regimes in Nigeria played a prominent role in the liberation of colonised African States?",
    "options": {
      "A": "Aguiyi Ironsi",
      "B": "Murtala/Obasanjo",
      "C": "Muhammadu Buhari",
      "D": "Ibrahim Babangida"
    },
    "answer_url": "https://myschool.ng/classroom/government/18952?exam_type=waec&type=obj&page=146",
    "correct_answer": "B",
    "explanation": "The military regime ofGeneral Murtala MohammedandGeneral Olusegun Obasanjo(1975-1979) played a prominent role in the liberation of African states during the period of decolonization. This regime was known for its strong stance on supporting the independence movements across Africa, including providing military and financial assistance to liberation movements in Southern Africa (e.g., Zimbabwe, Angola and Namibia) and other parts of the continent.\nUnder their leadership, Nigeria became a vocal advocate for the decolonization of Africa, especially opposing apartheid in South Africa and supporting various freedom movements across the continent.",
    "year": "2000"
  },
  {
    "number": "730",
    "text": "Traditional rulers appointed by the British to implement Indirect Rule in Eastern Nigeria were called",
    "options": {
      "A": "palace chiefs",
      "B": "village chiefs",
      "C": "warrant chiefs",
      "D": "crown chiefs"
    },
    "answer_url": "https://myschool.ng/classroom/government/18954?exam_type=waec&type=obj&page=146",
    "correct_answer": "C",
    "explanation": "Warrant chiefswere appointed by the British colonial government during the implementation ofIndirect Rulein Eastern Nigeria. These individuals were often chosen from among the local population, but they were granted \"warrants\" by the British to carry out administrative duties on behalf of the colonial government. The system allowed the British to rule indirectly through these local leaders, who were expected to enforce colonial policies, collect taxes, and maintain order, often against the traditional authority of existing local rulers.",
    "year": "2000"
  },
  {
    "number": "731",
    "text": "The bill introduced by a member of the legislature is known as",
    "options": {
      "A": "a private member's bill",
      "B": "an executive bill",
      "C": "a state bill",
      "D": "a political party's bill"
    },
    "answer_url": "https://myschool.ng/classroom/government/18956?exam_type=waec&type=obj&page=147",
    "correct_answer": "A",
    "explanation": "Aprivate member's billis a bill introduced by a member of the legislature who is not part of the executive branch. This type of bill allows individual legislators, rather than government ministers or the executive branch, to propose new laws or amendments.",
    "year": "2000"
  },
  {
    "number": "732",
    "text": "In the federation of Nigeria, states are equally represented in the",
    "options": {
      "A": "Senate",
      "B": "House of Representatives",
      "C": "Judiciary",
      "D": "National Population Commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/18958?exam_type=waec&type=obj&page=147",
    "correct_answer": "A",
    "explanation": "In the Nigerian federation, each state is equally represented in theSenate, with three senators per state, regardless of the state's population or size. Additionally, the Federal Capital Territory (FCT) is represented by one senator. This equal representation in the Senate ensures that all states have a balanced voice in legislative matters.",
    "year": "2000"
  },
  {
    "number": "733",
    "text": "In pre-colonial Igboland, administration meetings were presided over by the",
    "options": {
      "A": "Mazi",
      "B": "Ogbuefi",
      "C": "Ozo title holder",
      "D": "Okpara"
    },
    "answer_url": "https://myschool.ng/classroom/government/18960?exam_type=waec&type=obj&page=147",
    "correct_answer": "D",
    "explanation": "In pre-colonial Igboland, theOkpara, or the eldest male in a family or lineage presided over administration meetings. The Igbo society was structured around family lineages and clans and leadership was based on age and seniority. The Okpara held authority within his family and community, making decisions in consultation with elders and other members of the community.",
    "year": "2000"
  },
  {
    "number": "734",
    "text": "Checks and balances was a feature of pre-colonial political administration of the",
    "options": {
      "A": "Hausa",
      "B": "Yoruba",
      "C": "Igbo",
      "D": "Fulani"
    },
    "answer_url": "https://myschool.ng/classroom/government/18961?exam_type=waec&type=obj&page=147",
    "correct_answer": "B",
    "explanation": "In the pre-colonial Yoruba political system, checks and balances were integral to governance. The Oba (king) did not have absolute power; his authority was limited by theOyo Mesi (a council of chiefs) and theOgbonisociety (a religious and judicial group). The Oyo Mesi acted as advisors and had the power to check the Oba's decisions, even having the authority to depose him if necessary. The Ogboni society provided additional oversight, ensuring that laws and decisions aligned with traditional values and spiritual beliefs.",
    "year": "2000"
  },
  {
    "number": "735",
    "text": "Which of the following group had the best egalitarian traditional political system ?",
    "options": {
      "A": "Hausa/ Fulani",
      "B": "Yoruba",
      "C": "Igbo",
      "D": "Edo"
    },
    "answer_url": "https://myschool.ng/classroom/government/18963?exam_type=waec&type=obj&page=147",
    "correct_answer": "C",
    "explanation": "The Igbo people of Nigeria are known for their egalitarian traditional political system, often described as a system based on direct democracy. Unlike the hierarchical and centralised structures of the Hausa/Fulani and Yoruba, the Igbo traditionally operated adecentralised, acephalous (without a head) societywhere power was more evenly distributed across kinship groups, councils of elders, and other community assemblies. Decisions were often made collectively through discussion and consensus rather than by a single ruler or centralised authority.",
    "year": "2000"
  },
  {
    "number": "736",
    "text": "In the pre-colonial Hausa/Fulani system, the appointment of an Emir in the Caliphate was approved by the",
    "options": {
      "A": "Sarduna of Sokoto and Alkali",
      "B": "Galadima and the Waziri",
      "C": "Shehu of Borno and the Galadima",
      "D": "Sultan of Sokoto and Emir of Gwandu"
    },
    "answer_url": "https://myschool.ng/classroom/government/18964?exam_type=waec&type=obj&page=148",
    "correct_answer": "D",
    "explanation": "In the pre-colonial Hausa/Fulani system, theappointment of an Emir in the Sokoto Caliphaterequired the approval of both theSultan of Sokotoand theEmir of Gwandu. These two leaders held significant religious and political authority within the Caliphate.",
    "year": "2000"
  },
  {
    "number": "737",
    "text": "The French political of Assimilation in West Africa was a form of",
    "options": {
      "A": "Indirect Rule",
      "B": "Direct Rule",
      "C": "Democratic Rule",
      "D": "Monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/18966?exam_type=waec&type=obj&page=148",
    "correct_answer": "B",
    "explanation": "The French policy ofAssimilationin West Africa was a form ofDirect Rule. Under this policy, the French aimed to integrate their colonies into France itself, imposing French laws, customs, language and culture directly onto the local population. The goal was to \"assimilate\" the African subjects, encouraging them to adopt French identity, and even granting some the rights of French citizens if they met certain cultural and educational standards.",
    "year": "2000"
  },
  {
    "number": "738",
    "text": "One of the problems facing the Economic Community of West African States (ECOWAS) is that",
    "options": {
      "A": "member states do not attend meetings regularly",
      "B": "members states do not have a common currency",
      "C": "some member states want to contribute larger funds to the community",
      "D": "It is a rival to the Organization of African Unity"
    },
    "answer_url": "https://myschool.ng/classroom/government/18968?exam_type=waec&type=obj&page=148",
    "correct_answer": "B",
    "explanation": "One of the significant challenges facing theEconomic Community of West African States (ECOWAS)is the lack of a common currency. This issue has made trade and economic integration within the region more complicated, as member states must deal with multiple currencies, each with different exchange rates and varying economic stability. Establishing a common currency has been a long-term goal of ECOWAS, but it faces considerable obstacles, including economic disparity and differing fiscal policies among member states.",
    "year": "2000"
  },
  {
    "number": "739",
    "text": "The world organisation which existed before the United Nations Organisation was the",
    "options": {
      "A": "League of Nations",
      "B": "European Economic Community",
      "C": "Organization of African Unity",
      "D": "Commonwealth of Nations"
    },
    "answer_url": "https://myschool.ng/classroom/government/18970?exam_type=waec&type=obj&page=148",
    "correct_answer": "A",
    "explanation": "TheLeague of Nationswas the international organisation established after World War I in 1920 to promote peace and prevent future conflicts. However, it could not prevent the outbreak of World War II, leading to its dissolution. TheUnited Nations Organization (UNO)was subsequently established in 1945 to take over and improve upon the League's objectives with a stronger framework for maintaining international peace and security.",
    "year": "2000"
  },
  {
    "number": "740",
    "text": "Which of the following bodies is the most representative organ of the United Nations Organization (UNO)?",
    "options": {
      "A": "The Economic and Social Council",
      "B": "The Trusteeship Council",
      "C": "The Security Council",
      "D": "The General Assembly"
    },
    "answer_url": "https://myschool.ng/classroom/government/18971?exam_type=waec&type=obj&page=148",
    "correct_answer": "D",
    "explanation": "TheGeneral Assemblyis considered the most representative organ of the United Nations Organisation (UNO) because it includes all 193 member states, each of which has an equal vote. This makes it the main deliberative and policy-making body where all member countries can participate in discussions on international issues and global governance.",
    "year": "2000"
  }
]