[
  {
    "number": "1773",
    "text": "where a number of insurance companies  are liable under one policy, the principle applicable is ?",
    "options": {
      "A": "subrogation",
      "B": "contribution",
      "C": "indemnity",
      "D": "utmost good faith"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48813?exam_type=waec&type=obj&page=355",
    "correct_answer": "B",
    "explanation": "The contribution principle in insurance is a rule that specifies what happens when a person buys insurance from multiple companies to cover the same event, and that event occurs. The contribution principle of insurance states that if a risk is insured by multiple carriers, and one carrier has paid out a claim, that carrier is entitled to collect proportionate coverage from other carriers.",
    "year": "2016"
  },
  {
    "number": "1774",
    "text": "Buying and selling stocks in the stock exchange in anticipation of changes in the share price is?",
    "options": {
      "A": "hedging",
      "B": "projection",
      "C": "forecasting",
      "D": "speculation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48819?exam_type=waec&type=obj&page=355",
    "correct_answer": "D",
    "explanation": "Speculation refers to the act of conducting a financial transaction that has substantial risk of losing value but also holds the expectation of a significant gain or other major value. it is a situation where players in the stock exchange buy or sell securities with the expectation that they mabe a fall or rise in the prices of the said securities in future.",
    "year": "2016"
  },
  {
    "number": "1775",
    "text": "Another name for a dishonoured cheque is?",
    "options": {
      "A": "an order cheque",
      "B": "a bounced cheque",
      "C": "a bearer cheque",
      "D": "an open cheque"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48821?exam_type=waec&type=obj&page=355",
    "correct_answer": "B",
    "explanation": "A bounced cheque is a term used in the banking industry to indicate that a cheque cannot be honored because insufficient funds are available in the account on which the instrument was drawn.",
    "year": "2016"
  },
  {
    "number": "1776",
    "text": "which of the folloing is an example of life insurance",
    "options": {
      "A": "third party policy",
      "B": "comprehensive policy",
      "C": "fidelity guaranteed policy",
      "D": "endowment policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48826?exam_type=waec&type=obj&page=356",
    "correct_answer": "D",
    "explanation": "The endowment policy is a life insurance contract designed to pay a lump sum after a specific term (on its 'maturity') or on death. Typical maturities are ten, fifteen or twenty years up to a certain age limit. Some policies also pay out in the case of critical illness.",
    "year": "2016"
  },
  {
    "number": "1777",
    "text": "The main concern of commerce is?",
    "options": {
      "A": "create wealth",
      "B": "buy and sell goods and services",
      "C": "exchange and distribution of goods and services",
      "D": "satisfy all human wants"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48828?exam_type=waec&type=obj&page=356",
    "correct_answer": "B",
    "explanation": "Commerce is basically involved in the activity of buying and selling of goods and services, especially on a large scale or quantity.",
    "year": "2016"
  },
  {
    "number": "1778",
    "text": "The organized efforts of consumers to protect themselves against the unfair practices of businessmen is?",
    "options": {
      "A": "strike",
      "B": "consumerism",
      "C": "picketing",
      "D": "demonstration"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48832?exam_type=waec&type=obj&page=356",
    "correct_answer": "B",
    "explanation": "Consumerism is a modern movement for the protection of the consumer against useless, inferior, or dangerous products, misleading advertising, unfair pricing, etc. it isthe protection or promotion of the interests of consumers.",
    "year": "2016"
  },
  {
    "number": "1779",
    "text": "which of the following legislations aims primarily at protection of consumers",
    "options": {
      "A": "law of contract",
      "B": "trade description act",
      "C": "company's act",
      "D": "partnership act"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48837?exam_type=waec&type=obj&page=356",
    "correct_answer": "B",
    "explanation": "The trade description act is an act of parlaiment which prevents manufacturers, retailers or service industry providers from misleading consumers as to what they are spending their money on.",
    "year": "2016"
  },
  {
    "number": "1780",
    "text": "in a law of contract, a counter offer operates as?",
    "options": {
      "A": "an acceptance",
      "B": "a consensus",
      "C": "a rejection",
      "D": "a contract"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48840?exam_type=waec&type=obj&page=356",
    "correct_answer": "C",
    "explanation": "counter offer is an offer made in response to a previous offer by the other party during negotiations for a final contract. Making a counter offer automatically rejects the prior offer, and requires an acceptance under the terms of the counter offer or there is no contract.\nA counteroffer is a proposal made as a result of an undesirable offer. A counteroffer revises the initial offer and makes it more desirable for the person making the new offer.",
    "year": "2016"
  },
  {
    "number": "1781",
    "text": "An economy policy which encourages governement ownership of business is called?",
    "options": {
      "A": "privatization",
      "B": "nationalization",
      "C": "indigenization",
      "D": "commercialization"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48843?exam_type=waec&type=obj&page=357",
    "correct_answer": "B",
    "explanation": "Nationalization is the process of transforming private assets into public assets by bringing them under the public ownership of a national government or state. Nationalization usually refers to private assets or assets owned by lower levels of government, such as municipalities, being transferred to the state. The opposites of nationalization are privatization and demutualization.",
    "year": "2016"
  },
  {
    "number": "1782",
    "text": "lack of permanent record for the message reciever is a disadvantage of?",
    "options": {
      "A": "television",
      "B": "direct mail",
      "C": "cataloque",
      "D": "magazine"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48846?exam_type=waec&type=obj&page=357",
    "correct_answer": "A",
    "explanation": "Television doesnt have a permanent record of information, once the message has been conveyed.",
    "year": "2016"
  },
  {
    "number": "1783",
    "text": "which of the following occupations are classified under the extractive industry\n(i) cattle rearing, lumbering and farming\n(ii) mining, quarrying and hunting\n(iii) ship building, road construction and iron bending\n(iv) singing, dancing and tailoring",
    "options": {
      "A": "i and iii only",
      "B": "i, ii and iv",
      "C": "i and ii",
      "D": "ii, iii and iv"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48848?exam_type=waec&type=obj&page=357",
    "correct_answer": "C",
    "explanation": "Any processes that involve the extraction of raw materials from the earth to be used by consumers. The extractiveindustryconsists of any operations that remove metals, mineral and aggregates from the earth. Examples of extractive processes include oil and gas extraction, mining, dredging and quarrying",
    "year": "2016"
  },
  {
    "number": "1784",
    "text": "which of the following allows a drawer of a document to correct any error",
    "options": {
      "A": "C.I.F",
      "B": "I.O.U",
      "C": "W.O",
      "D": "E.O.E"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48851?exam_type=waec&type=obj&page=357",
    "correct_answer": "D",
    "explanation": "E.O.E;is An abbreviation for \"errors and omissions excepted,\" a disclaimer stating that information in a document is not necessarily accurate. E&OE, statements are most common when information changes quickly.\nC.I.F;Cost, Insurance and Freight(CIF) is an expense paid by a seller to cover the costs, insurance, and freight against the possibility of loss or damage to a buyer's order while it is in transit\nC.W.O; cash with order.\nI.O.U;An IOU (abbreviated from the phrase \"I owe you\") is usually an informal document acknowledging debt. An IOU differs from a promissory note in that an IOU is not a negotiable instrument and does not specify repayment terms such as the time of repayment.",
    "year": "2016"
  },
  {
    "number": "1785",
    "text": "The value of current assets is?",
    "options": {
      "A": "N35,000",
      "B": "N32,000",
      "C": "N25,000",
      "D": "N10,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48859?exam_type=waec&type=obj&page=357",
    "correct_answer": "A",
    "explanation": "Current assets are balance sheet assets that can be converted to cash within one year or less. Accounts that are considered current assets include cash and cash equivalents, marketable securities, accounts receivable, inventory, prepaid expenses, and other liquid assets.\ncurrent assets= debtors + stock\n15,000 + 20,000 = 35,000",
    "year": "2016"
  },
  {
    "number": "1786",
    "text": "what is the value of working capital",
    "options": {
      "A": "N47,000",
      "B": "N35,000",
      "C": "25,000",
      "D": "10,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48862?exam_type=waec&type=obj&page=358",
    "correct_answer": "C",
    "explanation": "The networking capital formulais calculated by subtracting the current liabilities from the current assets.\nworking capital= current assets - current liabilities\n35,000 - 10,000 = 25,000",
    "year": "2016"
  },
  {
    "number": "1787",
    "text": "the value of fixed assets",
    "options": {
      "A": "N72,000",
      "B": "N47,000",
      "C": "N35,000",
      "D": "N25,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48865?exam_type=waec&type=obj&page=358",
    "correct_answer": "B",
    "explanation": "A fixed asset is a long-term tangible piece of property that a firm owns and uses in its operations to generate income. In accounting, fixed does not necessarily mean immovable; any asset expected to last, or be in use for, more than one year is considered a fixed asset.\nfixed assets = 32,000 + 15,000 = 47,000",
    "year": "2016"
  },
  {
    "number": "1788",
    "text": "A clean bill of lading is so called because?",
    "options": {
      "A": "it shows record of damaged goods",
      "B": "it is not a stained bill",
      "C": "it is a document of authority",
      "D": "it shows no record of damaged goods"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48883?exam_type=waec&type=obj&page=358",
    "correct_answer": "D",
    "explanation": "A clean bill of lading is one kind of bill of lading, declaring that there was no damage to or loss of goods during shipment.",
    "year": "2016"
  },
  {
    "number": "1789",
    "text": "when an importer has been overcharged for goods supplied, the exporter issues him with a?",
    "options": {
      "A": "debit note",
      "B": "preforma invoice",
      "C": "letter of credit",
      "D": "credit note"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48886?exam_type=waec&type=obj&page=358",
    "correct_answer": "D",
    "explanation": "Acredit noteis a letter sent by the supplier to the customer notifying the customer that he or she has been credited a certain amount due to an error in the original invoice or other reasons. Acredit noteis also known as acredit memo, which is short for \"creditmemorandum.\"",
    "year": "2016"
  },
  {
    "number": "1790",
    "text": "fidelity guarantee insurance is a cover against loss arising from",
    "options": {
      "A": "trade debt",
      "B": "personal accident",
      "C": "dishonest staff",
      "D": "fire disaster"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48888?exam_type=waec&type=obj&page=358",
    "correct_answer": "C",
    "explanation": "Fidelity Guarantee insurance is an insurance policy designed to indemnify the Insured (the employer) for the loss of money or property sustained as a direct result of acts of fraud, theft or dishonesty by an employee in the course of employment.",
    "year": "2016"
  },
  {
    "number": "1791",
    "text": "when a cheque is paid on a bank on which it is drawn, the cheque is",
    "options": {
      "A": "discounted",
      "B": "debited",
      "C": "credited",
      "D": "cleared"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48896?exam_type=waec&type=obj&page=359",
    "correct_answer": "D",
    "explanation": "A cleared cheque is the Movement of acheckfrom the bank in which it was deposited to the bank on which it was drawn, and the movement of its face amount in the opposite direction.\nCheque clearing or bank clearance is the process of moving cash from the bank on which a cheque is drawn to the bank in which it was deposited, usually accompanied by the movement of the cheque to the paying bank, either in the traditional physical paper form or digitally under a cheque truncation system.",
    "year": "2016"
  },
  {
    "number": "1792",
    "text": "The process of buying, selling and distribution of goods and services is",
    "options": {
      "A": "retail trade",
      "B": "commerce",
      "C": "marketing",
      "D": "marketing concept"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48898?exam_type=waec&type=obj&page=359",
    "correct_answer": "B",
    "explanation": "Commerce relates to \"the exchange of goods and services, especially on a large scale\". It includes legal, economic, political, social, cultural and technological systems that operate in a country or in international trade.",
    "year": "2016"
  },
  {
    "number": "1793",
    "text": "Risk bearing in a business organisation is a function of the?",
    "options": {
      "A": "employees",
      "B": "entrepreneur",
      "C": "customer",
      "D": "manager"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48899?exam_type=waec&type=obj&page=359",
    "correct_answer": "B",
    "explanation": "Entrepreneur is a person who sets up a business or businesses, taking on financial risks in the hope of profit.",
    "year": "2016"
  },
  {
    "number": "1794",
    "text": "the worth of a life assurance policy before its maturity date is?",
    "options": {
      "A": "residual value",
      "B": "surrender value",
      "C": "accrued value",
      "D": "assured value"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48911?exam_type=waec&type=obj&page=359",
    "correct_answer": "A",
    "explanation": "Residual value insurancehelps companies manage assetvaluerisk by guaranteeing that a properly maintained asset will have a specifiedvalueat a future date.Residual value insuranceis used to guarantee the value of an asset at a specific date in the future.",
    "year": "2016"
  },
  {
    "number": "1795",
    "text": "one disadvantage of advertising is that it",
    "options": {
      "A": "could be misleading",
      "B": "reduce sales",
      "C": "reduce profit",
      "D": "causes over stocking"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48913?exam_type=waec&type=obj&page=359",
    "correct_answer": "A",
    "explanation": "False advertising is the use of false, misleading, or unproven information to advertise products to consumers. The advertising frequently does not disclose its source. One form of false advertising is to claim that a product has a health benefit or contains vitamins or minerals that it in fact does not.",
    "year": "2016"
  },
  {
    "number": "1796",
    "text": "The business unit that  applies the principle of one man one vote is?",
    "options": {
      "A": "sole proprietorship",
      "B": "partnership",
      "C": "co-operative society",
      "D": "public company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48915?exam_type=waec&type=obj&page=360",
    "correct_answer": "C",
    "explanation": "Thecooperative societieswork with democraticprincipleof 'one man one vote'. All the members get only one voting right irrespective of capital  contributed. theprincipleof “one man one vote.\" members get onlyone votingright irrespective of capital contributed by them. Taking an example ifa personis having 100 shares, does not mean that he is havingachance to caste 100votes, but he will getachance to casteone vote",
    "year": "2016"
  },
  {
    "number": "1797",
    "text": "the water corporation is an example of a?",
    "options": {
      "A": "cooperative",
      "B": "public enterprise",
      "C": "private enterprise",
      "D": "limited company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48917?exam_type=waec&type=obj&page=360",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "1798",
    "text": "A partnership is dissolved due to?",
    "options": {
      "A": "liquidity of the firm",
      "B": "death of the employee",
      "C": "insanity of partner",
      "D": "resignation of an employee"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48920?exam_type=waec&type=obj&page=360",
    "correct_answer": "C",
    "explanation": "Partnership dissolutionrefers to the termination of apartnershipas well as the cessation of its various business activities.Partnershipscandissolvefor various reasons and under many circumstances.\nThe general dissolution of a partnership will usually be instigated as a result one of the following events:\nThe mutual agreement of the partners – which may be an ad hoc agreement, or an agreement enshrined in the partnership agreement (where, for example, it was agreed that the partnership would be dissolved after a particular date, or after a certain event).  Such an agreement may be implied rather than actualBy the serving of a notice by a partner where such an action provided for in partnership agreementThe exercise of a specific power in the partnership agreement – where, for example, the partnership agreement allowed a majority of the partners to seek dissolution.The exercise of a power in the legislationOne of the events provided for in the legislation (e.g., the death or bankruptcy of a partner) subject to contrary agreementFraud, misrepresentation, rescission or illegal activityBy an order of court (following, for example, the mental incapacity or other ill-health  of a partner)Where the business may only be carried on at a loss",
    "year": "2016"
  },
  {
    "number": "1799",
    "text": "A document that contains the relationship between the company and outsiders is?",
    "options": {
      "A": "certificate of incorporation",
      "B": "memorandum of association",
      "C": "article of association",
      "D": "certificate of trading"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48921?exam_type=waec&type=obj&page=360",
    "correct_answer": "B",
    "explanation": "AMemorandum of Association(MOA) is a legal document prepared in the formation and registration process of a limited liability company to define its relationship with shareholders. it shows the company's relationship with outsiders.\nwhile theArticles of Associationis a document which prescribes the rules and bye-laws for the general management of the company and for the attainment of its object as given in the memorandum ofassociationof the company. it shows the way and manner a company deals with its internal affairs",
    "year": "2016"
  },
  {
    "number": "1800",
    "text": "An organisation formed mainly by traders and manufacturers to cater for interest for interest of members is?",
    "options": {
      "A": "trade union",
      "B": "co-operative society",
      "C": "trade association",
      "D": "chamber of commerce"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48924?exam_type=waec&type=obj&page=360",
    "correct_answer": "D",
    "explanation": "AChamber of Commerce doesmore than serve as a marketing vehicle for local businesses. It has an important role in local government affairs as well. They serve as a voice for the local business owners and industries. It is an association of local organisation of businesses who come together to further the interest of their members.",
    "year": "2016"
  },
  {
    "number": "1801",
    "text": "An insurance broker is involved in?",
    "options": {
      "A": "industrial occupation",
      "B": "distributive occupation",
      "C": "commercial occupation",
      "D": "constructive occupation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48928?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "An insurance broker sells, solicits, or negotiates insurance for compensation. Aninsurance brokeris a specialist ininsuranceand risk management.Brokersact on behalf of their clients and provide advice in the interests of their clients.\nCommercial Occupation: This refers to all the people involved in the distribution and exchange of goods produced by the industrial sector. Examples ocommercialworkers are: bankers, transporters, insurers, traders, etc",
    "year": "2016"
  },
  {
    "number": "1802",
    "text": "An agreement that is enforceable in law is?",
    "options": {
      "A": "a contract",
      "B": "an offer",
      "C": "an acceptance",
      "D": "a consideration"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48929?exam_type=waec&type=obj&page=361",
    "correct_answer": "A",
    "explanation": "Acontractis a legally enforceable agreement between two or more parties where each assumes alegalobligation that must be completed.",
    "year": "2016"
  },
  {
    "number": "1803",
    "text": "the size of an enterprise is determined by?",
    "options": {
      "A": "number of customers of the enterprise",
      "B": "length of the time the firm has been in operation",
      "C": "amount of capital invested",
      "D": "type of work done"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48933?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "Measures of Size:\nCapital Invested: The Amount of capital invested is one measure of size that can be used to compare the size of like and unlike firms.Value of the Product:The Number of Wage-earners Employed:Power UsedAmount of Raw Materials ConsumedVolume of OutputProductive Capacity of the Plant",
    "year": "2016"
  },
  {
    "number": "1804",
    "text": "which of the following functions is not performed by trade association?",
    "options": {
      "A": "research and development",
      "B": "standardization of product",
      "C": "credit facilities",
      "D": "technical information"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48936?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "FUNCTIONS\nTrade associationis generally formed to promote and protect the interest of the people engaged in a particulartrade, industry or business.\nTo act as an official channel of communication between the industry and the Government on any matter of commercial or econothic policy affecting the industry.\n\" To enable an industry to act as a unit, whether for co-operation with other interests or industries or for dealing with subjects which concern their section of industry as a whole.\n\"To assist in solving the problem of trade-cycle fluctuations.\n\"To maintain the conditions of trading and to regulate trade practices within the industry.\n\"To collect statistics and promote interchange of information between members.\n\"To promote the technical and general knowledge of those engaged in the industry.\n\"To assist in the improvement of service to the customer.",
    "year": "2016"
  },
  {
    "number": "1805",
    "text": "The fees charged on postal oder by the post office is?",
    "options": {
      "A": "interest",
      "B": "brokerage",
      "C": "poundage",
      "D": "premium"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48942?exam_type=waec&type=obj&page=361",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "1806",
    "text": "the document issued by a warehouse keeper for goods taken into the store is?",
    "options": {
      "A": "mate receipt",
      "B": "bill of sight",
      "C": "ship manifest",
      "D": "dock warrant"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48943?exam_type=waec&type=obj&page=362",
    "correct_answer": "D",
    "explanation": "Adock warrantis an instrument issued by a ware housekeeper, licensed by the state to traders who deposit goods with them. Adock warrantcertifies that the holder is entitled to goods imported and warehoused in thedocks.",
    "year": "2016"
  },
  {
    "number": "1807",
    "text": "which of the following is a verbal means of communication",
    "options": {
      "A": "telex",
      "B": "express mail",
      "C": "business reply service",
      "D": "telephone"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48944?exam_type=waec&type=obj&page=362",
    "correct_answer": "D",
    "explanation": "Verbal communicationis the use of sounds and words to express yourself, especially in contrast to using gestures or mannerisms (non-verbal communication). An example ofverbal communicationis saying “No” when someone asks you to do something you don't want to do. example is when you use the telephone for calling",
    "year": "2016"
  },
  {
    "number": "1808",
    "text": "the production of goods in anticipation for demand is made possible by?",
    "options": {
      "A": "packaging",
      "B": "warehousing",
      "C": "advertising",
      "D": "branding"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48948?exam_type=waec&type=obj&page=362",
    "correct_answer": "B",
    "explanation": "Warehousingis the act of storing goods thatwillbe sold or distributed later. While a small, home-based business might bewarehousingproducts in a spare room, basement, or garage, larger businesses typically own or rent space in a building that is specifically designed for storage.",
    "year": "2016"
  },
  {
    "number": "1809",
    "text": "Regarding the consumer as the king who must be satisfied, the main emphasis is of?",
    "options": {
      "A": "marketing research",
      "B": "marketing concept",
      "C": "consumerism",
      "D": "advertising"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48953?exam_type=waec&type=obj&page=362",
    "correct_answer": "B",
    "explanation": "Marketing concepts are ideas built primarily on satisfying the needs of consumers. In this concept, the consumer is seen as the ''king'' that the organisation must work to satisfy its needs",
    "year": "2016"
  },
  {
    "number": "1810",
    "text": "which of the following is a concept of marketing",
    "options": {
      "A": "branding",
      "B": "planning",
      "C": "organizing",
      "D": "manufacturing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48955?exam_type=waec&type=obj&page=362",
    "correct_answer": "A",
    "explanation": "Brandis a product, service, person, company, or aconceptwhich has characteristics like a name, symbol, etc. to be differentiated from others in themarket.",
    "year": "2016"
  },
  {
    "number": "1811",
    "text": "the component of marketing mix that is put in a consumable form to satisfy the consumer is",
    "options": {
      "A": "product",
      "B": "promotion",
      "C": "price",
      "D": "place"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48958?exam_type=waec&type=obj&page=363",
    "correct_answer": "A",
    "explanation": "In marketing, aproductis an object or system made available for consumer use; it is anything that can be offered to a market to satisfy the desire or need of a consumer.Producthas a vital role in developing thestrategyfor the overallmarketing mixwhich includes place, price and promotion.",
    "year": "2016"
  },
  {
    "number": "1812",
    "text": "goods become the property of the buyer on the transfer of liability and possession without immediate payment under the?",
    "options": {
      "A": "hire purchase agreement",
      "B": "credit sales agreement",
      "C": "auction sales agreement",
      "D": "conditional sales agreement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48959?exam_type=waec&type=obj&page=363",
    "correct_answer": "B",
    "explanation": "Credit sales meansallowances of goods to customers in order to pay in advance. Abby. The name speaks for itself. It is goods given to a customer oncredit, meaning thatyousell the goods and collect cash at a later date per agreement with customer. Under acredit sale agreementyou buy the goods at the cash price. You usually have to pay interest but some suppliers offer interest freecredit. Repayment is made by instalments until you have paid the whole amount.",
    "year": "2016"
  },
  {
    "number": "1813",
    "text": "the value at which one country obtains another country's currency is?",
    "options": {
      "A": "terms of trade",
      "B": "exchange rate",
      "C": "bank rate",
      "D": "terms of payment"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48960?exam_type=waec&type=obj&page=363",
    "correct_answer": "B",
    "explanation": "Anexchange rateis the value of a nation's currency in terms of the currency of another nation or economic zone.",
    "year": "2016"
  },
  {
    "number": "1814",
    "text": "specializing in the sale of one line of goods is the main feature of?",
    "options": {
      "A": "supermarkets",
      "B": "chain stores",
      "C": "mail order firm",
      "D": "mobile shops"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48962?exam_type=waec&type=obj&page=363",
    "correct_answer": "B",
    "explanation": "A chain store is one of a series of shops owned by one firm and selling the same goods.",
    "year": "2016"
  },
  {
    "number": "1815",
    "text": "one objective of the European Union is to?",
    "options": {
      "A": "fight the guilty nations in time of war",
      "B": "eliminate drug addiction among member countries",
      "C": "eliminate all tariffs and quotas among member countries",
      "D": "fight against child abuse in member countries"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48964?exam_type=waec&type=obj&page=363",
    "correct_answer": "C",
    "explanation": "To promote peace, its values and the well-being of its citizens. offer freedom, security and justice without internal borders.sustainabledevelopment based on balancedeconomicgrowth and price stability, a highly competitivemarket economywith fullemploymentandsocialprogress, and environmentalprotection.",
    "year": "2016"
  },
  {
    "number": "1816",
    "text": "which of the following person is a part of a business internal environment",
    "options": {
      "A": "employee",
      "B": "supplier",
      "C": "creditor",
      "D": "customer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48968?exam_type=waec&type=obj&page=364",
    "correct_answer": "A",
    "explanation": "TheInternal Environment. An organization'sinternal environmentis composed of the elements within the organization, including current employees, management, and especiallycorporateculture, which defines employee behavior. Although some elements affect the organization as a whole, others affect only the manager.",
    "year": "2016"
  },
  {
    "number": "1817",
    "text": "a person or firm to whom money is owed is?",
    "options": {
      "A": "banker",
      "B": "guarantor",
      "C": "debtor",
      "D": "creditor"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48972?exam_type=waec&type=obj&page=364",
    "correct_answer": "D",
    "explanation": "A creditor is a party that has a claim on the services of a second party. It is a person or institution to whom money is owed.",
    "year": "2016"
  },
  {
    "number": "1818",
    "text": "A general tax which applies at each point of exchange of goods and service is?",
    "options": {
      "A": "a specific tax",
      "B": "an ad valorem tax",
      "C": "value added tax",
      "D": "direct tax"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48975?exam_type=waec&type=obj&page=364",
    "correct_answer": "C",
    "explanation": "value added tax is a tax on the amount by which the value of an article has been increased at each stage of its production or distribution. Avalue-added tax(VAT) is a consumptiontaxplaced on a product whenevervalueisaddedat each stage of the supply chain, from production to the point of sale.",
    "year": "2016"
  },
  {
    "number": "1819",
    "text": "if a business uses part of its profit to develop the area where it operates, the business is fulfilling its?",
    "options": {
      "A": "economic responsibility",
      "B": "marketing responsibility",
      "C": "social responsibility",
      "D": "managerial responsibility"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48979?exam_type=waec&type=obj&page=364",
    "correct_answer": "C",
    "explanation": "Social responsibility is an ethical framework and suggests that an entity, be it an organization or individual, has an obligation to act for the benefit of society at large. Social responsibility is a duty every individual has to perform so as to maintain a balance between the economy and the ecosystems.",
    "year": "2016"
  },
  {
    "number": "1820",
    "text": "production ends when goods and services?",
    "options": {
      "A": "reach the final user",
      "B": "are used for manufacturing",
      "C": "are packed and labelled",
      "D": "are sold to the middlemen"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48980?exam_type=waec&type=obj&page=364",
    "correct_answer": "A",
    "explanation": "Theproductionprocessisconcerned with transforming a range of inputs/ raw materials into finished or consumable products.those. the raw materials and components thataretransformed intoendproducts are meant to reach the finial consumer. production ends when the production and distribution of finished goods reaches the end user, who is the consumer.",
    "year": "2016"
  },
  {
    "number": "1821",
    "text": "the process of converting a non profit making organisation to a profit making business is?",
    "options": {
      "A": "indigenization",
      "B": "privatization",
      "C": "deregulation",
      "D": "commercialization"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48983?exam_type=waec&type=obj&page=365",
    "correct_answer": "B",
    "explanation": "The transfer of ownership, property or business from the government to the private sector is termedprivatization. The government ceases to be the owner of the entity or business. The process in which a publicly-traded company is taken over by a few people is also calledprivatization.",
    "year": "2016"
  },
  {
    "number": "1822",
    "text": "A distinctive symbol, title or design that readily identifies the company and its products is?",
    "options": {
      "A": "patent right",
      "B": "trade mark",
      "C": "trade name",
      "D": "brand name"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48988?exam_type=waec&type=obj&page=365",
    "correct_answer": "D",
    "explanation": "Abrand nameis aname(usually a proper noun) applied by a manufacturer or organization to a particular product or service. it is used to identifiy/differntiaite a product in the market place.",
    "year": "2016"
  }
]