[
  {
    "number": "59",
    "text": "You have recently moved into a new neighbourhood with your parents. Write a letter to your sister who is studying overseas giving, at least, three reasons for disliking the new place.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50847?exam_type=waec&type=theory&page=12",
    "correct_answer": "Omole Senior High School,Omole Phase 1.Omole, Ikeja.29th June, 2010\nDear Sheila,How are you and your studies? I hope that you are fine. The family has moved into a new neighbourhood. We moved a month after your departure to the United States of America. At first, I was happy that we were about to leave our former neighbourhood for a new one but, on getting there. I found out that I couldn't like the new neighbourhood. In fact, I dislike our new neighbourhood for some reasons.Firstly, the area is too boring for my liking. Residents of the neighbourhood are not lively. All they do is go out, come back and lock themselves in their flats. Unlike our former neighbourhood which was lively with children around to play with, our new area is boring to the extent that the streets are mostly desolate and deserted. The area has turned me to a prisoner. I no longer go out to visit friends because I don't have friends here. The fact is that there are no friendly people around. They just mind their business.Secondly, the area lacks necessary social amenities that can make life enjoyable. The area lacks electricity as well as good roads and other vital infrastructure. Apart from the fact that we always have stuffy and hot nights especially during dry season which force us to open our windows for mosquitoes, it is difficult for me to read my books at night. My only alternative is to purchase a lamp that is battery-powered.Apart from this, the neighbourhood is well known for armed robbery attacks. We have had up to ten armed robbery attacks in less than three weeks of our arrival. There is no peace and everybody in the neighbourhood is always scared and troubled because no one knows when the next attack will be. It has even got to a stage when armed robbers are no longer afraid of operating in the day time. For instance, there was an incident that occurred in our neighbourhood recently. One afternoon, a family was driving into our area at about six o' clock in the evening. About eight huge and fierce looking men stopped the car. The family was ready to leave everything for them but the robbers still went on to forcefully rob the family.As I earlier said. the place is a jungle and not fit for man to live. Unfortunately. I live there. I hope I do not turn into ' an animal one day. Please extend my greetings to your roommatesYours sincerely.Tosin.",
    "explanation": "Omole Senior High School,Omole Phase 1.Omole, Ikeja.29th June, 2010\nDear Sheila,How are you and your studies? I hope that you are fine. The family has moved into a new neighbourhood. We moved a month after your departure to the United States of America. At first, I was happy that we were about to leave our former neighbourhood for a new one but, on getting there. I found out that I couldn't like the new neighbourhood. In fact, I dislike our new neighbourhood for some reasons.Firstly, the area is too boring for my liking. Residents of the neighbourhood are not lively. All they do is go out, come back and lock themselves in their flats. Unlike our former neighbourhood which was lively with children around to play with, our new area is boring to the extent that the streets are mostly desolate and deserted. The area has turned me to a prisoner. I no longer go out to visit friends because I don't have friends here. The fact is that there are no friendly people around. They just mind their business.Secondly, the area lacks necessary social amenities that can make life enjoyable. The area lacks electricity as well as good roads and other vital infrastructure. Apart from the fact that we always have stuffy and hot nights especially during dry season which force us to open our windows for mosquitoes, it is difficult for me to read my books at night. My only alternative is to purchase a lamp that is battery-powered.Apart from this, the neighbourhood is well known for armed robbery attacks. We have had up to ten armed robbery attacks in less than three weeks of our arrival. There is no peace and everybody in the neighbourhood is always scared and troubled because no one knows when the next attack will be. It has even got to a stage when armed robbers are no longer afraid of operating in the day time. For instance, there was an incident that occurred in our neighbourhood recently. One afternoon, a family was driving into our area at about six o' clock in the evening. About eight huge and fierce looking men stopped the car. The family was ready to leave everything for them but the robbers still went on to forcefully rob the family.As I earlier said. the place is a jungle and not fit for man to live. Unfortunately. I live there. I hope I do not turn into ' an animal one day. Please extend my greetings to your roommatesYours sincerely.Tosin.",
    "year": "2010"
  },
  {
    "number": "60",
    "text": "Write an article for publication in a national newspaper on the topic: Vocational Training is the answer to unemployment among the youths.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50858?exam_type=waec&type=theory&page=12",
    "correct_answer": "VOCATIONAL TRAINING: A SOLUTION TO UNEMPLOYMENT AMONG YOUTHS.\nUndoubtedly unemployment is one of the banes of our country. Unemployment is particularly common among the youths despite the fact that most of them are graduates of one higher institution or the other. It is assumed that most of the youths are unemployable. Though they are educated. unfortunately, they are educated to be job seekers only and not job creators or employers. What this means is that they are not trained to make use of their hands hence they graduate from higher institutions to become suitable for white collar jobs only. Consequently, most of them become frustrated after searching for white collar jobs for several years without success.\nThis situation can be reversed if vocational training can be encouraged in and out of our educational institutions. Vocational training is the training received on a particular trade or occupation. For example, girls can be trained to become hair dressers. photographers and so on while our boys can be trained to be barbers, dry cleaners and fashion designers. Training in different vocations is the only panacea to unemployment as any youth who has undergone such training won't have to look for somebody to employ him. He will want to establish himself in the business with the assistance he can get from the government and his parents.\nBesides, a youth who is self-employed, due to the vocational training he has received, will train and employ other youths. Through this, the rate of unemployment in our society will be reduced. As a result of this, there will be less pressure on government as government will be able to divert its attention to provision of infrastructure that will facilitate creation of obs. Vocational training, in this way, will make it possible for most of our youths to be producers of goods and services which when purchased will make life comfortable for them.\nFurthermore, through vocational training for our youths, many products like soap, detergent, pomade, air freshener and even hand set can be produced. This will make the country to become producers of goods which when improved upon can be exported to other countries of the world to earn foreign exchange for our country.\nIt is in the light of this that it is a matter of urgency for government to set up vocational centres in all the states in the country. This will enable the youths to come to these vocational centres to learn one trade or the other. Moreover, vocational training should be introduced in schools. This will give the youths the opportunity to learn one vocation or the other which they can fall back on when they are unable to get white collar jobs after graduation.\nVocational training is an efficient method of reducing unemployment through empowering youths economically by training them to use their hands to create job opportunities for themselves. If they are trained in one trade or occupation, they will establish small scale industries which will make them to be self-employed.\nDominic Adams.\nSS 3A 1.",
    "explanation": "VOCATIONAL TRAINING: A SOLUTION TO UNEMPLOYMENT AMONG YOUTHS.\nUndoubtedly unemployment is one of the banes of our country. Unemployment is particularly common among the youths despite the fact that most of them are graduates of one higher institution or the other. It is assumed that most of the youths are unemployable. Though they are educated. unfortunately, they are educated to be job seekers only and not job creators or employers. What this means is that they are not trained to make use of their hands hence they graduate from higher institutions to become suitable for white collar jobs only. Consequently, most of them become frustrated after searching for white collar jobs for several years without success.\nThis situation can be reversed if vocational training can be encouraged in and out of our educational institutions. Vocational training is the training received on a particular trade or occupation. For example, girls can be trained to become hair dressers. photographers and so on while our boys can be trained to be barbers, dry cleaners and fashion designers. Training in different vocations is the only panacea to unemployment as any youth who has undergone such training won't have to look for somebody to employ him. He will want to establish himself in the business with the assistance he can get from the government and his parents.\nBesides, a youth who is self-employed, due to the vocational training he has received, will train and employ other youths. Through this, the rate of unemployment in our society will be reduced. As a result of this, there will be less pressure on government as government will be able to divert its attention to provision of infrastructure that will facilitate creation of obs. Vocational training, in this way, will make it possible for most of our youths to be producers of goods and services which when purchased will make life comfortable for them.\nFurthermore, through vocational training for our youths, many products like soap, detergent, pomade, air freshener and even hand set can be produced. This will make the country to become producers of goods which when improved upon can be exported to other countries of the world to earn foreign exchange for our country.\nIt is in the light of this that it is a matter of urgency for government to set up vocational centres in all the states in the country. This will enable the youths to come to these vocational centres to learn one trade or the other. Moreover, vocational training should be introduced in schools. This will give the youths the opportunity to learn one vocation or the other which they can fall back on when they are unable to get white collar jobs after graduation.\nVocational training is an efficient method of reducing unemployment through empowering youths economically by training them to use their hands to create job opportunities for themselves. If they are trained in one trade or occupation, they will establish small scale industries which will make them to be self-employed.\nDominic Adams.\nSS 3A 1.",
    "year": "2010"
  },
  {
    "number": "61",
    "text": "Your country's public transport system is not functioning properly. Write a letter to the Minister of Transport, highlighting the causes and suggesting at least two measures to remedy the situation.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50860?exam_type=waec&type=theory&page=13",
    "correct_answer": "Omole Senior Grammar School,\nOmole Phase 1.\nOmole, Ikeja.\n29th June, 2010.\nThe Minister,\nMinistry of Transportation,\nGarki, Abuja.\nDear Sir,\nProblems of Public Transport System\nI appreciate the good work you have been doing since your appointment as the Minister of Transport in the country. It is commendable. However, there is still much to be done as the country's public transport system is yet to function properly. There is no doubt that the public transport system is still facing some challenges which do not make it to function properly as expected by many Nigerians.\nA problem of the public transport system which has been a major concern for Nigerians for a long time is the deadly situation of our major highways and roads. Due to the bad situation of the roads many people are not encouraged to travel on these roads as few who make use of the roads complain bitterly about the alarming rate of accidents and armed robbery attacks on these roads. Sir. several lives are lost on our roads as a result of the poor situation of these major roads.\nA very big problem of the public transport system is the over-concentration of people on roads as a means of transport, thereby neglecting other transport systems like rail and seaways. The railway system is non-existing as the railway lines are in bad condition across the country. In the past, railway system was a major form of transporting goods and people across the country. It was safe and cheap and people preferred to travel by train then. These days, the railway system has been neglected which makes the road system to be over-burdened and overused. These roads are being overused to the detriment of other systems of transportation railway system. earlier mentioned and water transportation. You do not even pay attention to the water transportation let alone developing it.\nAnother problem of public transport system is that the government appointed contractors who are awarded the contract to construct roads in the country either do the job perfunctorily or make away with the money without doing anything. Those who do something do not complete the roads.\nSir, in order to remedy the poor situation of our public transport system bad roads should be repaired without any delay while new ones should be constructed. As the roads are being rehabilitated the railway system should be rejuvenated with the rail lines repaired and new and modern trains purchased. The water transport system should also be revitalized with the purchase of speed boats, ferries and other means of transportation on water provided. If all these could be done, there will be less concentration of people on our roads and this will lead to decongestion on roads. I would be grateful if you could make use of these measures suggested Thank you\nYours faithfully.\nBassey Ekpenyong.",
    "explanation": "Omole Senior Grammar School,\nOmole Phase 1.\nOmole, Ikeja.\n29th June, 2010.\nThe Minister,\nMinistry of Transportation,\nGarki, Abuja.\nDear Sir,\nProblems of Public Transport System\nI appreciate the good work you have been doing since your appointment as the Minister of Transport in the country. It is commendable. However, there is still much to be done as the country's public transport system is yet to function properly. There is no doubt that the public transport system is still facing some challenges which do not make it to function properly as expected by many Nigerians.\nA problem of the public transport system which has been a major concern for Nigerians for a long time is the deadly situation of our major highways and roads. Due to the bad situation of the roads many people are not encouraged to travel on these roads as few who make use of the roads complain bitterly about the alarming rate of accidents and armed robbery attacks on these roads. Sir. several lives are lost on our roads as a result of the poor situation of these major roads.\nA very big problem of the public transport system is the over-concentration of people on roads as a means of transport, thereby neglecting other transport systems like rail and seaways. The railway system is non-existing as the railway lines are in bad condition across the country. In the past, railway system was a major form of transporting goods and people across the country. It was safe and cheap and people preferred to travel by train then. These days, the railway system has been neglected which makes the road system to be over-burdened and overused. These roads are being overused to the detriment of other systems of transportation railway system. earlier mentioned and water transportation. You do not even pay attention to the water transportation let alone developing it.\nAnother problem of public transport system is that the government appointed contractors who are awarded the contract to construct roads in the country either do the job perfunctorily or make away with the money without doing anything. Those who do something do not complete the roads.\nSir, in order to remedy the poor situation of our public transport system bad roads should be repaired without any delay while new ones should be constructed. As the roads are being rehabilitated the railway system should be rejuvenated with the rail lines repaired and new and modern trains purchased. The water transport system should also be revitalized with the purchase of speed boats, ferries and other means of transportation on water provided. If all these could be done, there will be less concentration of people on our roads and this will lead to decongestion on roads. I would be grateful if you could make use of these measures suggested Thank you\nYours faithfully.\nBassey Ekpenyong.",
    "year": "2010"
  },
  {
    "number": "62",
    "text": "You are the Chief Speaker in a debate on the topic: The youths of today are more interested in the pursuit of pleasure than in academic work. Write your speech for or against the topic.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50862?exam_type=waec&type=theory&page=13",
    "correct_answer": "Chairman, Panel of Judges. Ladies and Gentlemen, I am here to speak against the motion that states that the youths of today are more interested in the pursuit of pleasure than in academic work. It is not true that the youths of today are interested in pleasure than academic work. I will like to say that everyone likes pleasure one way or the other and so are the youths, but I put it to you that in spite of this fact, the youths take their academic work seriously than they take pleasure.\nFirst and foremost, I want to say categorically that in schools, both in secondary schools and higher institutions, the youths think about their academics before they think about pleasure. Everyone wants to pass his examinations and make his family proud. Nobody wants to fail and be put to shame or be asked to withdraw. This makes the youths to work hard on their academic work than pleasure.\nI will also like us to look at the number of people who write the Joint Admissions and Matriculation Board Examination every year for placement in our universities. Last year, about one million candidates, who are mostly youths, sat for the examination. I now ask you my audience, if the youths of today do not take academic works seriously, why would so many people write JAMB examination even when some of these youths had written it about six to seven times and insist on writing it. It is because they want to gain admission into the university and further their education.\nThe youths of today will by dint of hard work go to school to get good degrees. Where then is the pursuit of pleasure that is being alleged? Without seriousness at school, the youths do know that they can't achieve success. Therefore, they take their academic work seriously as there will be time for pleasure later. The youths of today also desire to be recognized and reckoned with in the society. They know that they can not become prominent Nigerians in future unless they work very hard in their studies. Therefore they want to work hard on their academic work so as to get good grade at school in order not to depend on their parents or anybody in future and be able to take care of their families without difficulty. They know that this can't be achieved without hard work.\nToday, many companies will not employ anybody who does not pass with distinction in his academics. Therefore, those who do not pass their examinations won't be employed. This means that all the years they spend in school have been wasted. The youths of today are aware of this crucial point which makes them to work hard on their academic work. They do not pursue pleasure as my opponent will want us to believe.\nI hope that with these few points of mine. I have been able to convince you that the youths of today are interested in their academic work more than in the pursuit of pleasure.",
    "explanation": "Chairman, Panel of Judges. Ladies and Gentlemen, I am here to speak against the motion that states that the youths of today are more interested in the pursuit of pleasure than in academic work. It is not true that the youths of today are interested in pleasure than academic work. I will like to say that everyone likes pleasure one way or the other and so are the youths, but I put it to you that in spite of this fact, the youths take their academic work seriously than they take pleasure.\nFirst and foremost, I want to say categorically that in schools, both in secondary schools and higher institutions, the youths think about their academics before they think about pleasure. Everyone wants to pass his examinations and make his family proud. Nobody wants to fail and be put to shame or be asked to withdraw. This makes the youths to work hard on their academic work than pleasure.\nI will also like us to look at the number of people who write the Joint Admissions and Matriculation Board Examination every year for placement in our universities. Last year, about one million candidates, who are mostly youths, sat for the examination. I now ask you my audience, if the youths of today do not take academic works seriously, why would so many people write JAMB examination even when some of these youths had written it about six to seven times and insist on writing it. It is because they want to gain admission into the university and further their education.\nThe youths of today will by dint of hard work go to school to get good degrees. Where then is the pursuit of pleasure that is being alleged? Without seriousness at school, the youths do know that they can't achieve success. Therefore, they take their academic work seriously as there will be time for pleasure later. The youths of today also desire to be recognized and reckoned with in the society. They know that they can not become prominent Nigerians in future unless they work very hard in their studies. Therefore they want to work hard on their academic work so as to get good grade at school in order not to depend on their parents or anybody in future and be able to take care of their families without difficulty. They know that this can't be achieved without hard work.\nToday, many companies will not employ anybody who does not pass with distinction in his academics. Therefore, those who do not pass their examinations won't be employed. This means that all the years they spend in school have been wasted. The youths of today are aware of this crucial point which makes them to work hard on their academic work. They do not pursue pleasure as my opponent will want us to believe.\nI hope that with these few points of mine. I have been able to convince you that the youths of today are interested in their academic work more than in the pursuit of pleasure.",
    "year": "2010"
  },
  {
    "number": "63",
    "text": "Write a story to illustrate the saying: A good name is better than riches.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50863?exam_type=waec&type=theory&page=13",
    "correct_answer": "Indeed, a good name is better than riches. Once upon a time, in the city of Lagos lived a man whose name was Mr. Akpan Effiong. He had a wife and three children. Mr. Akpan Effiong was an accountant who worked in a firm known as Emirate Investment and Holdings Limited. He had two colleagues who worked with him as accountants and their names were Mr. Akinwande and Mr. Nwokocha. They all worked in the same office but Mr. Akinwande and Nwokocha were fraudulent. They doctored the company's accounts at will and stole company's money through dubious means. They tried to introduce their fraudulent deal to Mr. Effiong but he refused to join them in defrauding the company because he had always wished to live a clean life. free of dubious activities as his parents had admonished him that a good name is always better than riches. They tried every means possible to convince Mr. Effiong to join them in their devilish acts but he refused. When they were not successful in convincing Mr. Effiong to join them. Mr. Akinwande and Mr. Nwokocha continued to defraud the company and at times converted company properties to their private uses. They opened several accounts bought land and houses in choice areas of the city of Lagos.\nMr. Effiong knew all these things but he determined that he would not contradict what his parents told him. At a particular period of time there was a project which the firm was commissioned to execute. The project was worth about twenty million U S dollars Akinwande and Nwokocha saw it as a wonderful opportunity to make more money and they seized it. They devised a plan to trick Mr. Effiong to sign a forged cheque so as to collect a large sum from the project fund. When they realized that this might be difficult, they resorted to forging Mr. Effiong's signature. When the firm found out that they had been duped they invited the Economic and Financial Crimes Commission to investigate into the fraud in the company It was found out that the forged cheque had Mr. Effiong's signature. Mr. Effiong was disgraced and arrested. The firm fired him. froze his accounts and impounded his cars as well as seized his house. He was forced out of his house to go and rent an apartment. His name was smeared as all newspapers had a coverage of the crime he had allegedly committed.\nMr. Akinwande and Nwokocha having fulfilled their mission, they were very happy and they continued in their dubious acts They were promoted to the posts of Head Accountant and Assistant Head Accountant respectively. They enjoyed their new status had the best of everything and didn't bother to know what was happening to Mr. Effiong's family.\nAfter a short while their evil acts caught up with them as their plan to swindle the firm of another big sum of money failed. The skeleton in their cupboards were exposed and it was found out that they had been the ones duping the company all along Through their confessions when they were tortured by the EFCC, Mr. Effiong was exonerated. He was restored to his former office and shortly after. he was promoted. His name became a synonym for honesty and he also won the Silverbird Man-of-the-Year award for his honesty. He forgave Mr. Akinwande and Nwokocha and even gave them money for the upkeep of their families. Thus indeed, a good name is better than riches.",
    "explanation": "Indeed, a good name is better than riches. Once upon a time, in the city of Lagos lived a man whose name was Mr. Akpan Effiong. He had a wife and three children. Mr. Akpan Effiong was an accountant who worked in a firm known as Emirate Investment and Holdings Limited. He had two colleagues who worked with him as accountants and their names were Mr. Akinwande and Mr. Nwokocha. They all worked in the same office but Mr. Akinwande and Nwokocha were fraudulent. They doctored the company's accounts at will and stole company's money through dubious means. They tried to introduce their fraudulent deal to Mr. Effiong but he refused to join them in defrauding the company because he had always wished to live a clean life. free of dubious activities as his parents had admonished him that a good name is always better than riches. They tried every means possible to convince Mr. Effiong to join them in their devilish acts but he refused. When they were not successful in convincing Mr. Effiong to join them. Mr. Akinwande and Mr. Nwokocha continued to defraud the company and at times converted company properties to their private uses. They opened several accounts bought land and houses in choice areas of the city of Lagos.\nMr. Effiong knew all these things but he determined that he would not contradict what his parents told him. At a particular period of time there was a project which the firm was commissioned to execute. The project was worth about twenty million U S dollars Akinwande and Nwokocha saw it as a wonderful opportunity to make more money and they seized it. They devised a plan to trick Mr. Effiong to sign a forged cheque so as to collect a large sum from the project fund. When they realized that this might be difficult, they resorted to forging Mr. Effiong's signature. When the firm found out that they had been duped they invited the Economic and Financial Crimes Commission to investigate into the fraud in the company It was found out that the forged cheque had Mr. Effiong's signature. Mr. Effiong was disgraced and arrested. The firm fired him. froze his accounts and impounded his cars as well as seized his house. He was forced out of his house to go and rent an apartment. His name was smeared as all newspapers had a coverage of the crime he had allegedly committed.\nMr. Akinwande and Nwokocha having fulfilled their mission, they were very happy and they continued in their dubious acts They were promoted to the posts of Head Accountant and Assistant Head Accountant respectively. They enjoyed their new status had the best of everything and didn't bother to know what was happening to Mr. Effiong's family.\nAfter a short while their evil acts caught up with them as their plan to swindle the firm of another big sum of money failed. The skeleton in their cupboards were exposed and it was found out that they had been the ones duping the company all along Through their confessions when they were tortured by the EFCC, Mr. Effiong was exonerated. He was restored to his former office and shortly after. he was promoted. His name became a synonym for honesty and he also won the Silverbird Man-of-the-Year award for his honesty. He forgave Mr. Akinwande and Nwokocha and even gave them money for the upkeep of their families. Thus indeed, a good name is better than riches.",
    "year": "2010"
  },
  {
    "number": "64",
    "text": "Read the following passage carefully and answer the questions on it.\n \n      It was a little past 10 a.m. but the medium-sized hall that served as a prayer house was already brimming with people from different parts of the metropolis, who had come to seek cure or answers to their problems. The majority of this lot were those with seemingly intractable mental health conditions. The superintendent of the prayer house in question was often spoken of in whispers as possessing uncanny spiritual powers to exorcise evil spirits. it was also believed that he had answers to numerous illnesses that defied orthodox medication. Wednesday of each week was set aside for these healing sessions. \n      On this particular Wednesday, noisy supplications to the Most High and ceaseless invocation of His name to free those supposedly held captive by alleged evil spirits had reached fever pitch. Suddenly, a middle-aged man broke loose from the crowd and ran as fast as his wobbly legs could permit. Some male workers from the prayer house gave him a hot chase. \nAt first, bemused by-standers rained curses on the fleeing man, wondering why a man in his right senses would in broad daylight rob a house of God. They obviously mistook the man for a robber fleeing from the scene of his crime. But he was not. Minutes later, he was caught and chained hands and feet, despite his struggle against his captors who intermittently lashed him with horse-whip. As he was being violently dragged along the street, the man ceaselessly muttered incomprehensible words that sounded like the muttering of a colony of baboons. Then, a clear picture of the situation dawned on the on-lookers. The man, after all, was not a thief and had stolen nothing; rather, his ability to think and reason properly had taken flight of him. Simply put, he was mentally deranged. \n      The above incident is a common occurrence in many parts of the country. It aptly underscores the devastating mental health conditions plaguing a sizeable number of people in recent times. It also points to the unspeakable and inhuman treatment which people with such health disorders suffer at the hands of self-styled spiritualists. This is the usual lot of mental patients whose family members refuse to take advantage of orthodox treatment. \n(a) What brought the people to the prayer house?\n(b) State the functions of the superintendent of the prayer house. \n(c) What was wrong with the on-lookers' assessment of the run-away man? \n(d) Mention two instances of inhuman treatment in the passage. \n(e) What is the writer's attitude towards the treatment of lunatics at prayer house? \n(f)\"... like the muttering of a colony of baboons.\" What figure of speech is contained in this expression? \n(g) \"... Whose family member refuse to take advantage of orthodox treatment.\" (I) What grammatical name is given to this expression as it is used in the passage? (ii) What is its function? \n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage. \n(i) intractable ; (ii) supplications; (iii) wobbly; (iv) bemused; (v) intermittently (vi) deranged.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50881?exam_type=waec&type=theory&page=13",
    "correct_answer": "(a) To seek cure and or answers to their problems\n(b) (i) To exercise evil spirits (ii) To cure illnesses that defied\northodox treatment\n(c) The on-lookers mistook him for a thief.\n(d) (i) Chaining the lunatic. (ii) Lashing the lunatic with horse whip. (iii) Dragging the lunatic along the street.\n(e) He disapproves of it/He condemns it/He detests it.\n(f) Simile\n(g) (i) Adjectival/Relative clause (ii) It qualifies (the noun) \"patients\"\n( h ) (i ) Intractable — incurable, unmanageable, uncontrollable, complex, complicated. (ii) Supplications ---prayers, petitions, entreaties, pleas. (iii) Wobbly — weak, unsteady, shaky, trembling, shaking. (iv) bemused — confused, baffled, amazed, bewildered, perplexed, puzzled. (v) intermittently — at intervals, now and again, from time to time. (vi) deranged — disturbed, troubled, unbalanced, sick.",
    "explanation": "(a) To seek cure and or answers to their problems\n(b) (i) To exercise evil spirits (ii) To cure illnesses that defied\northodox treatment\n(c) The on-lookers mistook him for a thief.\n(d) (i) Chaining the lunatic. (ii) Lashing the lunatic with horse whip. (iii) Dragging the lunatic along the street.\n(e) He disapproves of it/He condemns it/He detests it.\n(f) Simile\n(g) (i) Adjectival/Relative clause (ii) It qualifies (the noun) \"patients\"\n( h ) (i ) Intractable — incurable, unmanageable, uncontrollable, complex, complicated. (ii) Supplications ---prayers, petitions, entreaties, pleas. (iii) Wobbly — weak, unsteady, shaky, trembling, shaking. (iv) bemused — confused, baffled, amazed, bewildered, perplexed, puzzled. (v) intermittently — at intervals, now and again, from time to time. (vi) deranged — disturbed, troubled, unbalanced, sick.",
    "year": "2010"
  },
  {
    "number": "65",
    "text": "Read the following passage carefully and answer the questions on it.\n      Miss Williamson announced in class one day that she wanted one of us to live with her to help her with her domestic work after school. There was a rush to volunteer which took her completely by surprise. When she recovered and had quietened our excited shouting, there was a moment during which none of us dared breathe, as she scanned the eager faces. What made her choose me i had never found out, but i had noticed before that she was partial to me. \"All right Karimu,\" she said. \"You can come, but first run along and get your father's consent\"\n      My parents were only too glad to have one mouth fewer to feed and my brothers and sisters to see the back of one who inevitably, had begun to assume an air of superiority in talking to them. Miss Williamson's bungalow was a stone's throw from school. That very evening saw me installed on a mat in a corner of her back veranda. I was unable to sleep, excited at the thought of the good fortune that had come my  way. To be within earshot of Miss Williamson's English all day, to have access to her books, to nurse the possibility, overwhelming even in thought, of going with her frequently of Rofunkti - all these visions kept my eyes wide open and my brain racing until very late that night. With my \"lapa\" pulled right over my head and happy beyond all description in my heart, I smiled myself to sleep.\n      I learnt a very great deal in Miss Williamson's bungalow. Apart from improving my English, I learnt about the world outside and began to sense that were barriers much higher and much less easily gauged than those of mere language and colour, between my own people and those from whom she sprang. The smiling teacher in the daytime often became the brooding restless, ill-tempered spinster in the evening. Her bungalow was shared by another lady, a doctor, also a Scot, who traveled to and fro between the villages on a bicycle. I noticed that when not at their work or talking about it, these women showed no signs of being happy. As I grew up with them, i found myself wondering what had made them leave their country and come to live among a people whose ways were totally different from theirs.\n \n(a) Why was Miss Williamson completely surprised?\n(b) Why was Karimu's family happy to see him go to stay at the bungalow?\n(C) State the overwhelming thought that kept Karimu awake.\n(d) What did Karimu find difficult to understand about the two ladies?\n(e) Mention the identical trait in these two ladies behaviour.  \n(f) \"What made her choose me. .\"\n(i) What grammatical name is given to this expression as it is used in the passage? ;\n(ii) What is its function?\n(g) \"I smiled myself to sleep.\"What is the meaning of this expression?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) scanned; (ii) inevitably; (iii) nurse; (iv) vision; (v)gauged; (vi) brooding.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50882?exam_type=waec&type=theory&page=13",
    "correct_answer": "(a) Because many pupils were eager/volunteered to stay with her.\n(b) i) His parents would be saved the problem of feeding him. (ii) His brothers and sisters did not like his ways /attitude towards them.\n(c) The thought of accompanying Miss Williamson to Rofunkti\n(d) (He could not understand ) why they left their own country to live among a people whose ways were different from theirs.\n(e) Thes h owe cir when they were not at work or talking about their work.\n(f) (i) Noun Clause. (ii) Object of the verb have never found out (g) I smiled until I fell asleep/slept off. Or it means that the writer smiled until he slept. (h) 0) scanned — searched, examined, studied, scrutinized. (ii) inevitably — undoubtedly, certainly, naturally, surely. (iii) nurse — nurture, cherish, anticipate. (iv) visions — fancies, dreams, thoughts, hopes, imaginations, prospects (v) gauged — determined, measured, estimated, assessed. (vi) brooding depressed, unhappy, sad, melancholic, despondent, downcast,",
    "explanation": "(a) Because many pupils were eager/volunteered to stay with her.\n(b) i) His parents would be saved the problem of feeding him. (ii) His brothers and sisters did not like his ways /attitude towards them.\n(c) The thought of accompanying Miss Williamson to Rofunkti\n(d) (He could not understand ) why they left their own country to live among a people whose ways were different from theirs.\n(e) Thes h owe cir when they were not at work or talking about their work.\n(f) (i) Noun Clause. (ii) Object of the verb have never found out (g) I smiled until I fell asleep/slept off. Or it means that the writer smiled until he slept. (h) 0) scanned — searched, examined, studied, scrutinized. (ii) inevitably — undoubtedly, certainly, naturally, surely. (iii) nurse — nurture, cherish, anticipate. (iv) visions — fancies, dreams, thoughts, hopes, imaginations, prospects (v) gauged — determined, measured, estimated, assessed. (vi) brooding depressed, unhappy, sad, melancholic, despondent, downcast,",
    "year": "2010"
  },
  {
    "number": "66",
    "text": "Read the following passage carefully and answer the questions on it.\n      No one can deny the fact that anyone who wants to be successful in learning the English language needs a good English dictionary. Such a dictionary should be a source of information about the language — information that is not generally available in grammar books It should not only contain a list words and their meanings, but also a lot of information that can help a leaner to speak and write good English.\n      In order to use a word correctly, the reader needs to know how to link it with other words in a sentence. He should also know the structures that often precede or follow it, and whether it is formal or informal. This will help him to choose what word is appropriate for a particular context. The dictionary is therefore, an invaluable aid to reading as well as writing skills.\n      If the meaning of a particular word in a passage impedes the overall comprehension of the main ideas presented in it, then a dictionary should be used. Most teachers must have observed a widespread tendency among their students to attack a new passage by reading it word by word, stopping to reach for a dictionary whenever they come across a word they do not know. This is a wrong approach;  the dictionary should be used only as a last resort. The main objective of reading a passage is not to define  specific words but to understand the ideas and concepts of the passage. the frequent use of a dictionary tends to focus the reader's attention on words when he should be concentrating on understanding the main ideas of the passage. Efficient reading implies obtaining the greatest amount of information from the passage in the shortest time possible. The frequent use of a dictionary takes too much time — time that can better be employed in getting an overall understanding of the passage.\n      Instead of turning to the last resort, the reader should continue reading. Very often, the meaning of an unfamiliar ford can be guessed from the context in which it is used. The passage may give a definition, cite examples or describe )e circumstances surrounding the use of such a word well enough for him to know what it means. After reading the 'hole passage, the reader may realize that he has understood the important ideas presented without knowing the leaning of every word. If, after reading the entire passage, the reader is still unable to guess the meaning of a word from the context, then he should study the structure of the word The word may be a compound word which, when broken into its component parts, can be easily understood.\n      If after exhausting these approaches. the reader still does not understand the meaning of a word, and if this word is vital to the comprehension of the whole passage, then and only then, should he refer to a dictionary,\n(a) In one sentence state the purpose of a good dictionary\n(b) In two sentences, one for each, state the two disadvantages of constantly referring to a dictionary when reading a passage.\n(c) In three sentences, one for each, summarize the three steps that a reader should take before referring to a dictionary.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50885?exam_type=waec&type=theory&page=14",
    "correct_answer": "(a) A good dictionary gives information about the language.\n(b) It distracts the reader's attention from following the main ideas of the passage.\n(ii) t wastes time or slows down the reading speed.\n(c) He should guess the meaning of the unfamiliar word.\n(ii) Ho should read the whole passage.\n(iii)He should study the structure of the word.",
    "explanation": "(a) A good dictionary gives information about the language.\n(b) It distracts the reader's attention from following the main ideas of the passage.\n(ii) t wastes time or slows down the reading speed.\n(c) He should guess the meaning of the unfamiliar word.\n(ii) Ho should read the whole passage.\n(iii)He should study the structure of the word.",
    "year": "2010"
  }
]