[
  {
    "number": "65",
    "text": "Observe the experimental set-ups A and B in which 120ml of water was made to drain through each of the different soils contained in the funnels.\nUse the experimental set-ups to answer Questions (a) - (d).\n(a) State the volume of water collected in each of the measuring cylinders in setups A and B.\n(b) Calculate the volume of water retained in each of the set-ups A and B.\n(c) Calculate the percentage of:\n(i) water which percolated through each of the soils in set-ups A and B\n(ii) water retained in each of the soils in set-ups A and B.\n(d) Which one of the soils in set-ups A and B will be better for crop production? Give three reasons for your answer.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59944?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "66",
    "text": "(a)Name specimens C, D, F, G and M\nSpecimen C;     Specimen D;         Specimen F;       Specimen G;      Specimen M;\n                \n(b) Name the fishing equipment that can be improvised by assembling specimens C,D,F,G and M.\n(c) State four advantages of using the equipment named in (b) above.\n(d) Explain how the equipment named in (b) is used.\n(e) List five other pieces of equipment that can perform a similar function as the one named in (b).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59946?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "67",
    "text": "(a) Give the botanical name of each of specimens I (Common wireweed) J (coatbuttons), K (Giant star grass), and L (cogongrass)\n(b) Describe Specimen K\n(c) Describe the process of preparing silage from specimen K\n(d) Mention two methods for the effective control of specimen L on a farm.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59947?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  },
  {
    "number": "68",
    "text": "(a) ldentify specimens N, O and Q.\nSpecimen N;             Specimen O;                Specimen Q;\n                \n(b) Name one host of each of specimens N, O and Q.\n(c) Name four economic importance of each of specimens N and Q.\n(d) State four control measures for specimen O.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59948?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2004"
  }
]