[
  {
    "number": "46",
    "text": "(a) State what would be observed when:\n(i) Chlorine is passed through a freshly prepared solution of FeCl\\(_2\\).\n(ii) SO\\(_2\\) is bubbled into a solution of FeCl\\(_3\\);\n(iii) A few drops of water Is added to sodium hydroxide pellets in a test tube;\n(iv) Dilute H\\(_2\\)SO\\(_4\\) is added to CaCO\\(_{3(s)}\\)\n \n(b) Three test tubes contain solutions of SO\\(_3^{2-}\\), CO\\(^{2-}_3\\) and SO\\(_4^{2-}\\) respectively. Describe one chemical method that you would use to identify the solution containing SO\\(_4^{2-}\\) \n \n(c)(i) Draw and label a diagram to illustrate the separation of a mixture of petrol and water\n(ii) Which of the following will dissolve faster? 10g of NaOH pellets in 100 cm\\(^3\\) of water; 10g of NaOH powder in 50 cm\\(^3\\) of water. Give the reason for your answer.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60063?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2005"
  },
  {
    "number": "47",
    "text": "Credit will be given for strict adherence to instructions, for observations precisely recorded, and for accurate inferences. All tests, observations, and inferences must be clearly entered in your answer book, in ink, at the time they are made.\nC Is an inorganic salt. D is an organic compound. Carry out the following exercises on C and D. Record your observations and identify any gases evolved. State the conclusion you draw from the result of each test.\n(a) (i) Put C in a test tube and add about 10 cm\\(^3\\) of distilled water. Stir well.\n(ii) Divide the resulting solution into two portions. To the first portion add sodium hydroxide solution in drops and then in excess.\n(iii) To the second portion add dilute trioxonitrate (V) acid. Then add silver trioxonitrate (V) solution followed by aqueous ammonia in excess. tube and odd about 2- 5 cm\\(^3\\) of 'Xn'.\n(ii) Identify the functional group present in D.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60064?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2005"
  },
  {
    "number": "48",
    "text": "All your burette readings (initial and final), as well as the size of your pipette, must be recorded but no account of experimental procedure is required. All calculations must be done in your answer book.\nA is a solution of H\\(_2\\)SO\\(_4\\) containing 4.9 gdm-3, B is a solution containing X g dm\\(^{-3}\\) of Na\\(_2\\)CO\\(_3\\).\n(a) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portions of B using methyl orange as an indicator. Record the volume of your pipette. Tabulate your burette readings and calculate the average volume of A used. The equation for the reaction involved in the titration is; H\\(_2\\)SO\\(_{4(aq)}\\) + Na\\(_2\\)CO\\(_{3(aq)}\\) \\(\\to\\) Na\\(_{2}\\)SO\\(_{4(aq)}\\) + H\\(_2\\)O\\(_{(l)}\\) + CO\\(_{2(g)}\\)\n(b) From your results and information provided above, calculate the:\n(i) Concentration of A In mol dm\\(^{-3}\\)\n(ii) concentration of B in mol dm\\(^{-3}\\)\n(iii) mass of salt formed when 500 cm\\(^3\\) of B is Completely neutralized by A.\n(v) volume of carbon (IV) oxide liberated in (b) (ii) above at s.t.p. [O = 16, Na = 23, S = 32, 1 mole or a gas occupies 22.4 dm\\(^3\\) at s.t.p.]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60066?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2005"
  }
]