[
  {
    "number": "1228",
    "text": "Economic problem arise in all society because?",
    "options": {
      "A": "resources are mismanaged by leaders",
      "B": "there is no proper planning",
      "C": "resources are not in adequate supply",
      "D": "the services of economist are not employed"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49109?exam_type=waec&type=obj&page=246",
    "correct_answer": "C",
    "explanation": "Goods and services that satisfy human wants are produced with the help of resources such as land, labour, capital and enterprise. These resources are scarce while wants are unlimited. Due to scarcity of these resources, aneconomycannot produce all that goods and services as required by its citizens.",
    "year": "2018"
  },
  {
    "number": "1229",
    "text": "which of the following is not emphasized in a production possibility curve",
    "options": {
      "A": "scarcity of resources",
      "B": "economic development",
      "C": "inefficiency in the use of resources",
      "D": "unemployment of labour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49110?exam_type=waec&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "In short,production possibility curveis acurvewhich shows all possible combinations of two goods that can be produced by making full use of given resources and technology in an economy.\nAproduction possibility curvemeasures the maximum output of two goods using a fixed amount of input. The input is any combination of the four factors ofproduction. ... Each point on thecurveshows how much of each good will be produced when resources shift from making more of one good and less of the other.",
    "year": "2018"
  },
  {
    "number": "1230",
    "text": "the organisation of productive factors is the reponsibility of the?",
    "options": {
      "A": "management",
      "B": "entrepreneur",
      "C": "production manager",
      "D": "labour union"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49118?exam_type=waec&type=obj&page=246",
    "correct_answer": "B",
    "explanation": "entrepreneur is  a person who sets up a business or businesses, taking on financial risks in the hope of profit. “one who organizes, manages, and assumes the risks of a business or enterprise and manages the various production factors",
    "year": "2018"
  },
  {
    "number": "1231",
    "text": "producers operating in a free market economy are more efficient as a resulf of?",
    "options": {
      "A": "the existence of competition",
      "B": "the very few number of participants",
      "C": "the commitment of the shareholders",
      "D": "government regulation of their activities"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49120?exam_type=waec&type=obj&page=247",
    "correct_answer": "A",
    "explanation": "Competition leadstoefficiencybecause businesses that have fewercostsare more competitive and make moremoney. Innovation is encouraged because it provides a competitive edge and increases the chance for wealth.",
    "year": "2018"
  },
  {
    "number": "1232",
    "text": "a downward sloping demand curve means that?",
    "options": {
      "A": "total revenue declines as price is lowered",
      "B": "demand falls as output rises",
      "C": "demand falls as output falls",
      "D": "price must be lowered to sell more"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49125?exam_type=waec&type=obj&page=247",
    "correct_answer": "B",
    "explanation": "Downward sloping demand curvemeans a rational consumer willdemandmore of a commodity when its price falls. Some of the reasons for.the phenomenon would be: Income Effect : When price of a commodity falls, consumer's real income rises that is he can now purchase more of the commodity with the same income.\nCauses of Downward Sloping of Demand Curve\nLaw of diminishing the marginal utilitySubstitution effectIncome effectNew buyersOld buyers1. Law of diminishing the marginal utilityThe law of diminishing marginal utility states that with each increasing quantity of the commodity, its marginal utility declines.For example, when a person is very hungry the first chapatti that he eats will give him the most satisfaction. As he will consume more chapattis, his level of satisfaction will diminish.Thus, when the quantity of goods is more, the marginal utility of the commodity is less. Thus, the consumer is not willing to pay more price for the commodity and its demand will decline.Also, when the price of the commodity is low, its demand increases.Hence, the demand curve slopes downwards from left to right.",
    "year": "2018"
  },
  {
    "number": "1233",
    "text": "if the price of commodity X rises and consumers shift to commodity Y, then commodity X and Y are?",
    "options": {
      "A": "substitutes",
      "B": "complements",
      "C": "inferior goods",
      "D": "bought goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49126?exam_type=waec&type=obj&page=247",
    "correct_answer": "A",
    "explanation": "Substitute goodsorsubstitutesare at least two products that could be used for the same purpose by the same consumers. If the price of one of the products rises or falls, then demand for thesubstitute goodsorsubstitutegood (if there is just one other) is likely to increase or decline.Substitute goodsorsubstitutesare at least two products that could be used for the same purpose by the same consumers. If the price of one of the products rises or falls, then demand for thesubstitute goodsorsubstitutegood (if there is just one other) is likely to increase or decline.",
    "year": "2018"
  },
  {
    "number": "1234",
    "text": "goods whose demand vary directly with money income are called?",
    "options": {
      "A": "inferior goods",
      "B": "complementary goods",
      "C": "substitutes",
      "D": "normal goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49128?exam_type=waec&type=obj&page=247",
    "correct_answer": "D",
    "explanation": "Normal goodsare a type ofgoodswhose demand shows a direct relationship with a consumer's income. Anormal goodis one whose demand increases when people's incomes or the economy rise.",
    "year": "2018"
  },
  {
    "number": "1235",
    "text": "an exceptional demand curve can result from?",
    "options": {
      "A": "increase in prices of raw materials",
      "B": "increase in the size of the population",
      "C": "expectation of future price increase",
      "D": "change in taste of the consumer"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49130?exam_type=waec&type=obj&page=247",
    "correct_answer": "C",
    "explanation": "A normaldemand curve(which when graphed goes down and to the right) shows that when prices go up, the amount of a good that is demanded goes down. Examples are when the price of gas goes up, people buy less of it and do less driving. ...An exceptional demand curveis one wherein the opposite occurs. it is ademand curverising upwards showing that people buy more when the prices go up. the following are the reasons for an exceptional demand curve;\nInferior goods/ Giffen goods\nGoods having prestige value\nPrice expectation\nFear of shortage\nChange in income\nChange in fashion\nBasic necessities of life",
    "year": "2018"
  },
  {
    "number": "1236",
    "text": "palm oil and palm kernel are in?",
    "options": {
      "A": "joint supply",
      "B": "competitive demand",
      "C": "competitive supply",
      "D": "complementary demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49132?exam_type=waec&type=obj&page=248",
    "correct_answer": "A",
    "explanation": "Joint supplyis an economic term referring to a product or process that can yield two or more outputs. Common examples occur within the livestock industry: cows can be utilized for milk, beef and hide; sheep can be utilized for meat, milk products, wool and sheepskin",
    "year": "2018"
  },
  {
    "number": "1237",
    "text": "which of the following is true about supply of land?",
    "options": {
      "A": "its higher in the urban than rural areas",
      "B": "varies with time",
      "C": "rises with demand",
      "D": "is fixed"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49133?exam_type=waec&type=obj&page=248",
    "correct_answer": "D",
    "explanation": "Fixed supply: The totallandarea of earth (in the sense of the surface area available to men) is fixed. First, supply oflandis fixed or inelastic from society's point of view.",
    "year": "2018"
  },
  {
    "number": "1238",
    "text": "the backward bending supply curve of labour indicates?",
    "options": {
      "A": "an abnormal supply situation",
      "B": "the law of supply",
      "C": "that labour supply and wage are directly related",
      "D": "that the elasticity of supply is uniform"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49134?exam_type=waec&type=obj&page=248",
    "correct_answer": "C",
    "explanation": "The reason is that therearetwo effects related to determiningsupply. The substitution effect states that a higher wage makes work more attractive than leisure. ... The income effect states that a higher wagemeans workers canachieve a target income by working fewer hours.\nBackward bending supply curveis the normal case for most workers. Most economists agree that a worker'ssupply curveforlaborslopes upward at lower wages andbends backwardat higher wages.",
    "year": "2018"
  },
  {
    "number": "1239",
    "text": "A supply curve parallel to the X- axis indicates?",
    "options": {
      "A": "fairly elastic supply",
      "B": "infinitely elastic supply",
      "C": "fairly inelastic supply",
      "D": "perfectly inelastic"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49135?exam_type=waec&type=obj&page=248",
    "correct_answer": "B",
    "explanation": "infinitely elastic supply, by definition, means that any decrease in the product price would immediately cause thesupplyto shift to zero",
    "year": "2018"
  },
  {
    "number": "1240",
    "text": "if the marginal utility of a commodity is equal to its price then",
    "options": {
      "A": "the consumer is in equilibrium",
      "B": "more of the commodity can be consumed",
      "C": "total utility is also equal to its price",
      "D": "the market is not in equilibrium"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49136?exam_type=waec&type=obj&page=248",
    "correct_answer": "C",
    "explanation": "The price aconsumer is willing to pay foragood depends onhis marginal utility, the marginal utility declines with each additional unit of consumption, according tothelaw of diminishingmarginal utility. Therefore,the priceis equal to the marginal utility",
    "year": "2018"
  },
  {
    "number": "1241",
    "text": "A price floor is usually fixed",
    "options": {
      "A": "at the equilibrium and causes shortage",
      "B": "above the equilibrium and causes shortage",
      "C": "below the equilibrium and causes shortage",
      "D": "above the equilibrium and causes surplus"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49137?exam_type=waec&type=obj&page=249",
    "correct_answer": "D",
    "explanation": "Aprice flooris a government- or group-imposed price control or limit on how low a price can be charged for a product, good, commodity, or service.\nA price floor is the lowest legal price a commodity can be sold at. Price floors are used by the government to prevent prices from being too low. The most common price floor is the minimum wage--the minimum price that can be payed for labor.\nFor a price floor to be effective, it must be set above the equilibrium price.",
    "year": "2018"
  },
  {
    "number": "1242",
    "text": "A market is in equilibrium when?",
    "options": {
      "A": "there is no government intervention",
      "B": "the demand is the same as the supply",
      "C": "buyers and sellers are free to sell more goods",
      "D": "there is no free entry and exit"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49138?exam_type=waec&type=obj&page=249",
    "correct_answer": "B",
    "explanation": "Market equilibriumis amarketstate where the supply in themarketis equal to the demand in themarket. Theequilibriumprice is the price of a good or service when the supply of it is equal to the demand for it in themarket.",
    "year": "2018"
  },
  {
    "number": "1243",
    "text": "A firm average cost decreases in the longrun because?",
    "options": {
      "A": "increasing returns to scale",
      "B": "diminishing average returns",
      "C": "decreasing marginal returns",
      "D": "decreasing average fixed cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49139?exam_type=waec&type=obj&page=249",
    "correct_answer": "A",
    "explanation": "In the long run, all the factors of production are variable and the cost is accumulated as a result of changes in the various levels of production. Average cost decreases in the longrun due to increasing economies of scale. This refers to the situation where, as the quantity of output goes up, the cost per unit reduces.",
    "year": "2018"
  },
  {
    "number": "1244",
    "text": "The larger a firm, the lower its cost of production\n\nThis statement explains the?",
    "options": {
      "A": "law of diminishing marginal returns",
      "B": "concept of economies of scale",
      "C": "law of comparative cost advantage",
      "D": "theory of division of labour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49140?exam_type=waec&type=obj&page=249",
    "correct_answer": "B",
    "explanation": "Economies of Scale refer to the cost advantage enjoyed by a firm when it increases its level of output. An increase in the level of output indicates the growth and expansion of a firm. This happens when costs are spread over a larger number of goods.",
    "year": "2018"
  },
  {
    "number": "1245",
    "text": "in the the longrun, a firm must shut down if its average revenue is?",
    "options": {
      "A": "greater than average cost",
      "B": "less than average variable cost",
      "C": "equal to the minimum average cost",
      "D": "equal to the average cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49141?exam_type=waec&type=obj&page=249",
    "correct_answer": "B",
    "explanation": "A firm will choose to implement ashutdownof production when the revenue received from the sale of the goods or services produced cannot even cover the variable costs of production. In that situation, the firm will experience a higher loss when it produces, compared to not producing at all.\nTechnically, shutdown occurs if average revenue is below average variable costat the profit-maximizing positive level of output.",
    "year": "2018"
  },
  {
    "number": "1246",
    "text": "public limited liability companies are democratic in nature because?",
    "options": {
      "A": "government appointees are members of the board",
      "B": "they are run by elected public officers",
      "C": "electoral principles are adopted in the day-to-day management",
      "D": "shareholders elect the board of directors"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49142?exam_type=waec&type=obj&page=250",
    "correct_answer": "D",
    "explanation": "The directors could not dictate the decisions in thecompanyas the rights in decision making process also vest in the hands of shareholders.  Thusdemocracyis maintained well.",
    "year": "2018"
  },
  {
    "number": "1247",
    "text": "in the event of bankruptcy owners of joint-stock companies lose?",
    "options": {
      "A": "their private properties",
      "B": "both company and private properties",
      "C": "only the capital invested",
      "D": "only their dividends"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49143?exam_type=waec&type=obj&page=250",
    "correct_answer": "C",
    "explanation": "joint stock company is a company whose stock is owned jointly by the shareholders.\nIn the event that a joint stock company declaresbankruptcy, the company's shareholders may be entitled to a portion of the liquidated assets, depending on which shares they hold and how much liquid assets are left over.baUponnkruptc, a fiyrm will be required to sell all of its assets and pay off all debts.",
    "year": "2018"
  },
  {
    "number": "1248",
    "text": "wholesalers play an important role in the distribution of goods and services because they?",
    "options": {
      "A": "are located very close to consumers",
      "B": "finance both producers and retailers",
      "C": "pass information on from retailers to consumers",
      "D": "sell in small units to consumers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49144?exam_type=waec&type=obj&page=250",
    "correct_answer": "B",
    "explanation": "Wholesalerseither take title to the goods they purchase, or they own the goods they purchase. If there is a significant change in the value of the products between the time of the purchase from theproducerand the sale to theretailer, thewholesalerwill absorb that profit or loss.",
    "year": "2018"
  },
  {
    "number": "1249",
    "text": "if workers at the school canteen sell during the holidays, this is an example of?",
    "options": {
      "A": "structural unemployment",
      "B": "frictional unemployment",
      "C": "seasonal unemployment",
      "D": "residual unemployment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49145?exam_type=waec&type=obj&page=250",
    "correct_answer": "C",
    "explanation": "Seasonal unemploymentoccurs when people areunemployedat certain times of the year, because they work in industries where they are not needed all year round. Examples of industries where demand, production and employment areseasonalinclude tourism and leisure, farming, construction and retailing.",
    "year": "2018"
  },
  {
    "number": "1250",
    "text": "positive checks as envisaged by Thamos Malthus can be prevented if",
    "options": {
      "A": "date rate is reduced",
      "B": "marriage is abolished",
      "C": "more hospitals are built",
      "D": "more restraint is adopted"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49146?exam_type=waec&type=obj&page=250",
    "correct_answer": "D",
    "explanation": "Positive checksare those, accordingto Thomas Malthus, that increase the death rate. These include disease, war, disaster, and finally when otherchecksdon't reduce the population, famine.Malthusfelt that the fear of famine or the development of famine was also a major impetustoreduce the birth rate.",
    "year": "2018"
  },
  {
    "number": "1251",
    "text": "which of the following factors is not a reason for farmer's unstable incomes",
    "options": {
      "A": "dependence on too many crops",
      "B": "poor storage facilities",
      "C": "adverse weather condition",
      "D": "recession in the world economy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49147?exam_type=waec&type=obj&page=251",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1252",
    "text": "local firms can help in reducing unemployment in a country when?",
    "options": {
      "A": "land acquisition becomes centralized",
      "B": "imports of substitutes are reduced",
      "C": "waste in the firm is eliminated",
      "D": "subsidies to firms are decreased"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49151?exam_type=waec&type=obj&page=251",
    "correct_answer": "B",
    "explanation": "Import substitutionis a trade and economic policy which advocates replacing foreignimportswith domestic production, it is based on the premise that a country should attempt to reduce its foreign dependency through the local production of industrialized products.",
    "year": "2018"
  },
  {
    "number": "1253",
    "text": "an industry is described as a group of firms",
    "options": {
      "A": "that provides jobs for many people",
      "B": "which uses advance technology in production",
      "C": "which produces similar products",
      "D": "that provides jobs for few people"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49155?exam_type=waec&type=obj&page=251",
    "correct_answer": "C",
    "explanation": "Anindustryis a group of manufacturers or businesses that produce a particular kind of goods or services.",
    "year": "2018"
  },
  {
    "number": "1254",
    "text": "The largest component of national income in developing countries consist of?",
    "options": {
      "A": "profits",
      "B": "profit and rent",
      "C": "rent",
      "D": "wages and salaries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49156?exam_type=waec&type=obj&page=251",
    "correct_answer": "D",
    "explanation": "Thelargest component of national incomeis: compensation of employees. (wages and salaries).National incomemeasures: the market value or cost of the resources used in the production of thenationaloutput.",
    "year": "2018"
  },
  {
    "number": "1255",
    "text": "A baker bought flour and other ingredients for $250.00, spent $52.00 on distribution, sold the bread for $320.00. the value added by the baker is?",
    "options": {
      "A": "$302.00",
      "B": "$52.00",
      "C": "$18.00",
      "D": "$622.00"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49163?exam_type=waec&type=obj&page=251",
    "correct_answer": "C",
    "explanation": "floor = $250\ndistribution cost = $52\n250 + 52 = 302\nselling price $320 - $302 =  $18",
    "year": "2018"
  },
  {
    "number": "1256",
    "text": "in a country with large population of full-time housewives, national income",
    "options": {
      "A": "will be composed of goods produced by women",
      "B": "figures will be grossly over-stated",
      "C": "statistics will be difficult to calculate",
      "D": "figures will be grossly under-stated"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49169?exam_type=waec&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "National income of a countrycan be defined as the total market value of all final goods and services produced in the economy in a year.\ntheincomeof ahousewifeis not counted in theNational Incomeor the GrossNationalProduct of the country. This will make the national income under stated",
    "year": "2018"
  },
  {
    "number": "1257",
    "text": "demand pull inflation is likely to be caused by?",
    "options": {
      "A": "an increase in the cost of factors inputs",
      "B": "increase in the income tax rate",
      "C": "increase in bank lending rates",
      "D": "increasingly large budget deficit"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49174?exam_type=waec&type=obj&page=252",
    "correct_answer": "A",
    "explanation": "There are five causes for demand-pull inflation:\nA growing economy: When consumers feel confident, they will spend more, take on more debt by borrowing more. This leads to a steady increase in demand, which means higher prices.Asset inflation: a sudden rise in exports, which translates to an undervaluation of the involved currenciesGovernment spending: When the government opens up its pocketbooks, it drives up prices. Military spending prices may go up when the government starts to buy more military equipment.Inflationexpectations: forecasts and expectations of inflation, where companies increase their prices to go with the flow of the expected riseMore money in the system: demand-pull inflation is produced by an excess in monetary growth or an expansion of the money supply. Too much money in an economic system with too few goods makes prices increase.",
    "year": "2018"
  },
  {
    "number": "1258",
    "text": "Holding money to take care of contigencies is?",
    "options": {
      "A": "a speculative motive",
      "B": "a transaction motive",
      "C": "a precautionary motive",
      "D": "an expansionary motive"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49176?exam_type=waec&type=obj&page=252",
    "correct_answer": "C",
    "explanation": "Precautionary Motive. A desire to hold cash in order to be able to deal effectively with unexpected events that require cash outlay.",
    "year": "2018"
  },
  {
    "number": "1259",
    "text": "if a housewife has meat and tomatoes, she must find someone who wants meat and has tomatoes to give. this concept is described as?",
    "options": {
      "A": "opportunity cost",
      "B": "scale of preference",
      "C": "complementary demand",
      "D": "double of coincidence of wants"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49177?exam_type=waec&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "This occurs when two people have goods they are both happy to swap in exchange. i.e. a perfect barter exchange. a requirement that must be met before a trade can be made. It specifies that a trader must find another trader who is willing to trade what the first trader wants and at the same time wants what the first trader has.",
    "year": "2018"
  },
  {
    "number": "1260",
    "text": "the stock exchange is an example of the?",
    "options": {
      "A": "labour market",
      "B": "money market",
      "C": "commodity market",
      "D": "capital market"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49179?exam_type=waec&type=obj&page=252",
    "correct_answer": "D",
    "explanation": "Acapital marketis a financialmarketin which long-term debt (over a year) or equity-backed securities are bought and sold.Capital marketschannel the wealth of savers to those who can put it to long-term productive use, such as companies or governments making long-term investments.",
    "year": "2018"
  },
  {
    "number": "1261",
    "text": "what happens when the central bank increases bank rate in an economy",
    "options": {
      "A": "borrowing is discouraged",
      "B": "customers increase their borrowing",
      "C": "banks can increase their lending",
      "D": "money supply increases"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49182?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "When the central bank increases the bank rate , the banks and individuals are discouraged from borrowing money because of increase in interest rates. this is used as a monetary policy tool to reduce circulation of money in the economy.  people would rather invest their monies to be paid high interest rates than borrow from banks and pay the bank interest",
    "year": "2018"
  },
  {
    "number": "1262",
    "text": "income is redistributed when the rich are progressively taxed and?",
    "options": {
      "A": "more private schools are established",
      "B": "subsidy is provided on petroleum products",
      "C": "more public goods are provided",
      "D": "farmers are given guaranteed prices"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49186?exam_type=waec&type=obj&page=253",
    "correct_answer": "C",
    "explanation": "Income Redistributionis an economic practice which is aimed at leveling the distribution of wealth orincomein a society through a direct or indirect transfer ofincomefrom the rich to the poor. Economists or Governments adopt economic policies and strategies like progressive taxation to implement this phenomenon. the tax is used to build public infrastructure",
    "year": "2018"
  },
  {
    "number": "1263",
    "text": "in order to increase revenue, government should tax commodities for which demand is?",
    "options": {
      "A": "perfectly price inelastic",
      "B": "price inelastic",
      "C": "price elastic",
      "D": "unitary elastic"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49193?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "An economic situation in which thepriceof a product will have no effect on the supply. In aperfectly inelasticsituation regardless of the amount of a product on the market, thepriceof the product remains the same.",
    "year": "2018"
  },
  {
    "number": "1264",
    "text": "which of the following activities will not lead to economic growth?",
    "options": {
      "A": "massive importation of capital goods",
      "B": "intensive capital formation locally",
      "C": "use of modern technology",
      "D": "massive importation of consumer goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49196?exam_type=waec&type=obj&page=253",
    "correct_answer": "D",
    "explanation": "Activities that lead to  economic growth\nNatural Resources. The discovery of more natural resources like oil, or mineral deposits may boosteconomic growthas this shifts or increases the country's Production Possibility Curve.Physical Capital or Infrastructure.Population or Labor.Human Capital.Technology.Law",
    "year": "2018"
  },
  {
    "number": "1265",
    "text": "the poorer the country, the larger the percentage of labour force engaged in?",
    "options": {
      "A": "Agricultural",
      "B": "mining",
      "C": "trading",
      "D": "manufacturing"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49198?exam_type=waec&type=obj&page=253",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1266",
    "text": "which of the following measure can be adopted to stabilize the external value of the local currency?",
    "options": {
      "A": "reduce the volume of export",
      "B": "increase the demand for imports",
      "C": "increase domestic money supply",
      "D": "reduce the demand for imports"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49200?exam_type=waec&type=obj&page=254",
    "correct_answer": "D",
    "explanation": "A rise in imports has a negative effect on the balance of trade, that is, it will tend to increase the trade deficit or reduce the trade surplus.",
    "year": "2018"
  },
  {
    "number": "1267",
    "text": "which of the following is not a measure for reducing balance of payments deficits?",
    "options": {
      "A": "export drive",
      "B": "reducing tarriffs",
      "C": "adding to export goods",
      "D": "increasing local production"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49202?exam_type=waec&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "Tariffs are duties (taxes) imposed on imports. When tariffs are imposed, the prices of imports would increase to the extent of tariff. The increased prices will reduced the demand for imported goods and at the same time induce domestic producers to produce more of import substitutes. Non-essential imports can be drastically reduced by imposing a very high rate of tariff. Therefor, reducing tariffs will further increase balance of payment deficits.",
    "year": "2018"
  },
  {
    "number": "1268",
    "text": "Nations engage in international trade because of difference in?",
    "options": {
      "A": "absolute cost",
      "B": "comparative cost",
      "C": "fixed cost",
      "D": "variable cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49207?exam_type=waec&type=obj&page=254",
    "correct_answer": "B",
    "explanation": "The principle ofcomparative coststates that;international trade takes place between two countries when the ratios ofcomparative costof producing goods differ, and each country would specialise in producing that commodity in which it has acomparative advantage.\nComparative cost advantageis when a country produces a good or service for a lower opportunitycostthan other countries.",
    "year": "2018"
  },
  {
    "number": "1269",
    "text": "one advantage of international trade is that",
    "options": {
      "A": "prices of goods become stable",
      "B": "countries become self-sufficient",
      "C": "goods consumed are produced at a very high cost",
      "D": "it makes possible the consumption of variety of goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49210?exam_type=waec&type=obj&page=254",
    "correct_answer": "D",
    "explanation": "International Trade promotes economic growth,efficiency, technological progress, and what ultimately matters the most, consumer welfare. By lowering prices andincreasing product variety available to consumers,trade especially benefits middle- andlower-income households.",
    "year": "2018"
  },
  {
    "number": "1270",
    "text": "which of the following forms of economic integration is a member nation free to impose duty against",
    "options": {
      "A": "custom union",
      "B": "free trade area",
      "C": "common market",
      "D": "economic community"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49212?exam_type=waec&type=obj&page=254",
    "correct_answer": "D",
    "explanation": "Aneconomic communitycan be understood as anyeconomicand/or political alliance which is specifically designed to foster trade and cooperation among its member countries. It's underlying purpose is to reduce trade barriers and increase cooperation among its members.",
    "year": "2018"
  },
  {
    "number": "1271",
    "text": "The International bank for reconstruction and development (IBRD) performs the following functions except?",
    "options": {
      "A": "granting long-term loans",
      "B": "assisting with technical expertise",
      "C": "reducing tariff among members",
      "D": "developing human resource"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49215?exam_type=waec&type=obj&page=255",
    "correct_answer": "C",
    "explanation": "TheThe International bank for reconstruction and development (IBRD), now known as The World Bank provides low-interest loans, interest-free credit, and grants. It focuses on improving education, health, and infrastructure. It also uses funds to modernize a country's financial sector, agriculture, and natural resources management.",
    "year": "2018"
  },
  {
    "number": "1272",
    "text": "An electrical engineer who is teaching physics in a secondary school is said to be",
    "options": {
      "A": "under-employed",
      "B": "unemployed",
      "C": "fully employed",
      "D": "technically unemployed"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49220?exam_type=waec&type=obj&page=255",
    "correct_answer": "A",
    "explanation": "under-employed is : the condition in which people in a labor force areemployedat less than full-time or regular jobs or at jobs inadequate with respect to their training or economic needs. In one usage,underemploymentdescribes the employment of workers with high skill levels and post-secondary education who are working in relatively low-skilled, low-wage jobs. Forexample, someone with a college degree may be tending bar, or working as a factory assembly line worker.\n(of a person) not having enough paid work or not doing work that makes full use of their skills and abilities.",
    "year": "2018"
  },
  {
    "number": "1273",
    "text": "one benefit a country can derive from the extraction of crude oil is increase in?",
    "options": {
      "A": "population",
      "B": "employment",
      "C": "money",
      "D": "demand for imports"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49221?exam_type=waec&type=obj&page=255",
    "correct_answer": "B",
    "explanation": "the extraction of crude oil in a country will lead to a correspondent increase in the manpower / labour required.",
    "year": "2018"
  },
  {
    "number": "1274",
    "text": "which of the following cannot be classified as a natural resource",
    "options": {
      "A": "iron rod",
      "B": "wild life",
      "C": "solar energy",
      "D": "gold"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49222?exam_type=waec&type=obj&page=255",
    "correct_answer": "C",
    "explanation": "Anatural resourceis what people can use which comes from thenaturalenvironment. Examples ofnatural resourcesare air, water, wood, oil, wind energy,naturalgas, iron, and coal.\nsolar energy is man made which has the sun as its basic source of energy",
    "year": "2018"
  },
  {
    "number": "1275",
    "text": "the total fixed cost is?",
    "options": {
      "A": "$7.00",
      "B": "$30.00",
      "C": "$20.00",
      "D": "$135.00"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49225?exam_type=waec&type=obj&page=255",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1276",
    "text": "at output level 5, the total variable cost is?",
    "options": {
      "A": "$5.00",
      "B": "$20,00",
      "C": "$55.00",
      "D": "$35.00"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49226?exam_type=waec&type=obj&page=256",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2018"
  }
]