[
  {
    "number": "22",
    "text": "(a)i) How would an aqueous solution of iron (II) tetraoxosulphate (VI) be converted into an aqueous solution of magnesium tetraoxosulphate (VI)?\n(ii) Write a balanced equation for the reaction in (a)(i) above\n \n(b)(i) Why are some compounds recrystallized after preparation?\n(ii) Outline the steps in recrystallization\n \n(C)(i) Name two gases that can cause color changes in an acidified solution of potassium heptaoxodichromate (VI)\n(ii) State the color change expected in (c)i) above",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60001?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "23",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely recorded, and for accurate inferences. AIl tests. observations and inferences must be clearly entered in your answer book, in ink, at the time they are made.\nC is a double salt. Carry out the following exercises on C. Record your observations and identify any gas(es) evolved. State the conclusion drawn from the result of each test.\na) Put all of C into a test tube. Add about 5cm\\(^3\\) of distilled water, stir and test with litmus paper. Divide the Solution into two portions\n(b) To the first portion, add sodium hydroxide solution in drops and then in excess. Heat the resulting mixture and keep it for minutes.\n(c) To the second portion, add few drops of Bacl\\(_{2(aq)}\\) followed by excess dilute hydrochloric acid",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60003?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  },
  {
    "number": "24",
    "text": "Burette readings (initials and final) must be given to two decimal places. Volume of pipette used must also be recorded but no account experimental procedure is required. Al calculations must be done in your answer book. A solution containing 0.05moldm\\(^3\\) H\\(_2\\)SO\\(_4\\). B is a solution containing 1.4g per 250cm\\(^3\\) .XOH  \n(a) Put A into the burette and titrate it against 20.0cm\\(^3\\) or 25.0cm\\(^3\\) portions of B using methyl orange indicator. Repeat the titration to obtain consistent titres. Tabulate your results and calculate the average volume of A used. The equation for the reaction involved in the titration is; H\\(_2\\)SO\\(_{4(aq)}\\) + 2XOH\\(_{(aq)}\\) \\(\\to\\) X\\(_2\\)SO\\(_{4(aq)}\\) + 2H\\(_2\\)O\\(_{(l)}\\)\n(b) From your results and the information provided above, calculate the;\n(i) concentration of B in moldm\\(^{-3}\\)\n(ii) molar mass XOH\n(iii) relative atomic mass of X. [H = 1.00; O = 16.0 S =32.0]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60005?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2013"
  }
]