[
  {
    "number": "19",
    "text": "Consider the following experimental set-up.\n\n \n(i) Identify by name: P; Q; R; S and T.\n(ii) State the method of collection of gas, S.\n(iii) What is the function of R in the experimental set-up?\n(iv) Write the balanced equation of the reaction for the preparation of gas S.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/59998?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "20",
    "text": "Credit will be given for strict adherence to the instructions, for observations, precisely recorded, and for accurate inferences. All tests, observations, and inferences must be clearly entered in your answer book, in ink, at the time they are made.\nC contains two cations and two anions. Perform the following exercises on C. Record your observations and identify any gas (es) evolved. State the conclusion you draw from the result of each test.\n(a) Dissolve all of C in about 10 cm\\(^3\\) of distilled water. Stir the resulting solution thoroughly.\n(i) To about 2 cm\\(^3\\) of the solution, add few drops of AgNO\\(_3\\) solution, followed by HNO\\(_{3(aq)}\\). To the mixture, add excess NH\\(_{3(aq)}\\)\n(ii) To another 2 cm\\(^3\\) portion of the solution, add dil. HCl followed by BaCl\\(_2\\) solution.\n(iii) To another 2 cm\\(^3\\) portion of the solution, add NaOH\\(_{3(aq)}\\) dropwise and then in excess. Warm the mixture.\n(iv) To another 2 cm\\(^3\\)  portion of the solution, add NH\\(_{3(aq)}\\) dropwise and then in excess.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/59999?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "21",
    "text": "Burette readings (initial and final) must be given to two decimal places. Volume of pipette used must also be recorded but no account of experimental procedure is required. All calculations must be done in your answer book.\nA is a solution of hydrochloric acid. B is a solution containing 2.45g of anhydrous sodium trioxocarbonate (IV) in 250g of solution.\n(a) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portion of B using methyl orange as an indicator. Repeat the exercise to obtain consistent titres. Tabulate your burette reading and calculate the average volume of A used. The equation for the reaction involved in the titration is Na\\(_2\\)CO\\(_{3(aq)}\\) + 2HCI\\(_{(aq)}\\) + H\\(_2\\)O\\(_{(l)}\\)\n (b) From your results and the information provided, calculate the:\n(i) concentration of B in moldm\\(^{-3}\\) \n(ii) concentration of A in moldm\\(^{-3}\\)\n(iii) concentration of A in gdm\\(^{-3}\\)\n(iv) volume of the gas evolved in the reaction at s.t.p.\n[H = 1.00; C: 12.0; O = 16.0; Na = 23.0; Na = 23.0; Cl = 35.5; Molar Volume = 22.4 dm\\(^3\\)mol\\(^{-3}\\)]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60000?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  }
]