[
  {
    "number": "326",
    "text": "AMMA DARKO: Faceless\n1. Comment on Fofo's visit to Maa Tsuru.\n2. To what extent are men portrayed as oppressors of women in the novel?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59350?exam_type=waec&type=theory&page=66",
    "correct_answer": "1. (i) Relation to the theme: The visit reflects the trauma of street life, which is a major theme in the novel. This theme shows the helplessness of the street children at the mercy of the forces of neglect and street oppression.\n(ii) Character identification:(a) Fofo is a street child and has recently escaped being raped by Poison. (b) She is Maa Tsuru's daughter (c) Maa Tsuru is the mother of Fofo Baby T and other children (d) She has been abused by men. (e) She is 'cursed'.\n(iii) Purpose of the visit: (a) Fofo wants to inform her mother of Poison's attempted rape of her. (b) Fofo wants to know why she is being targeted\n(iv) The encounter: (a) Maa Tsuru informs Fofo that Kpakpo has abandoned the family. (b) She informed Fofo that Maami Broni has visited her. (c) Fofo learns that Baby T is dead. (d) Fofo blames her mother for Bat death. (e) She also blames her own predicament on her mother. (f) Maa Tsuru breaks down while trying to put up a defence.\n(v) The visit delineates characters: (a) Fofo is revealed as a vulnerable girl who is punished unjustly. (b)Maa Tsuru is revealed as a defenseless victim.\n(vi) The visit advances the plot: (a) Baby T's death is revealed. (b) Maami Broni's contribution to Baby T's death is revealed. (c) Kpakpo's abandoning Maa Tsuru and the children advance the plot.\n(vii) Mother and daughter relationship: (a) Maa Tsuru feels guilty about being unable to protect Fofo and the rest of the family. (b) The daughter blames the mother for her predicament. (c) Fofo loathes her mother.\n(2) (1) Relation to theme: The treatment of women by men in a patriarchal society in the novel underscores the theme of gender/social inequality. Men's responsibility to and treatment of women are brought into sharp focus.\n(2) Character identification: The following are the male and female characters in the novel: (a) Males: (i) Kwe Kpakpo (husbands of Maa Tsuru). (ii) Onko (relative and neighbour of Maa Tsuru) and the juju man. (iii) Adade (husband of Kabria). (iv) Sylv Po (broadcaster). (v) Poison and Macho (street lords). (b) Females: (i) Maa T'suru (ii) Kabria (iii) Mami Broni (iv) Baby T (v) Fofo (vi) Odarley\n(3) Kwei and Kpakpo: (i) They contribute to Maa Tsuru's destitution. (ii) Kwei abandons Maa Tsuru after having several children with her; he is also violent. (ii) Kpakpo preys on Maa Tsuru, sells Baby T into prostitution after sexually abusing her and intercepts the pay packet her (Baby T\"s) enslavement. (iv) Both are clearly oppressors and contribute negatively to the predicament of the women\n(4)Onko and the juju man. (i) Onko rapes Baby T, leading to her being sold into prostitution. (ii) At the request of the jujuman Onko seeks Baby T's pubic hair. (iii) This eventually leads to Onko's murder of Baby T.\n(5) Adade and Sylv Po: (i) Adade is indifferent to Kabria's struggles to survive while Sylv Po assists her in her work (ii) Adade is lazy and expects Kabria to do everything for him. (iii) Adade's attitude to Kabria regarding the refurbishing of Creamy is negative.\n(6) Poison and Macho: (i) They are street lords who prey on girls like Baby T and Fofo. (ii) The two impact negatively on the girls and on Maa Tsuru. (ii) Mami Broni is terrified of Poison. (iv) Macho drives off Fofo from nature's call and takes all her earnings for the week.",
    "explanation": "1. (i) Relation to the theme: The visit reflects the trauma of street life, which is a major theme in the novel. This theme shows the helplessness of the street children at the mercy of the forces of neglect and street oppression.\n(ii) Character identification:(a) Fofo is a street child and has recently escaped being raped by Poison. (b) She is Maa Tsuru's daughter (c) Maa Tsuru is the mother of Fofo Baby T and other children (d) She has been abused by men. (e) She is 'cursed'.\n(iii) Purpose of the visit: (a) Fofo wants to inform her mother of Poison's attempted rape of her. (b) Fofo wants to know why she is being targeted\n(iv) The encounter: (a) Maa Tsuru informs Fofo that Kpakpo has abandoned the family. (b) She informed Fofo that Maami Broni has visited her. (c) Fofo learns that Baby T is dead. (d) Fofo blames her mother for Bat death. (e) She also blames her own predicament on her mother. (f) Maa Tsuru breaks down while trying to put up a defence.\n(v) The visit delineates characters: (a) Fofo is revealed as a vulnerable girl who is punished unjustly. (b)Maa Tsuru is revealed as a defenseless victim.\n(vi) The visit advances the plot: (a) Baby T's death is revealed. (b) Maami Broni's contribution to Baby T's death is revealed. (c) Kpakpo's abandoning Maa Tsuru and the children advance the plot.\n(vii) Mother and daughter relationship: (a) Maa Tsuru feels guilty about being unable to protect Fofo and the rest of the family. (b) The daughter blames the mother for her predicament. (c) Fofo loathes her mother.\n(2) (1) Relation to theme: The treatment of women by men in a patriarchal society in the novel underscores the theme of gender/social inequality. Men's responsibility to and treatment of women are brought into sharp focus.\n(2) Character identification: The following are the male and female characters in the novel: (a) Males: (i) Kwe Kpakpo (husbands of Maa Tsuru). (ii) Onko (relative and neighbour of Maa Tsuru) and the juju man. (iii) Adade (husband of Kabria). (iv) Sylv Po (broadcaster). (v) Poison and Macho (street lords). (b) Females: (i) Maa T'suru (ii) Kabria (iii) Mami Broni (iv) Baby T (v) Fofo (vi) Odarley\n(3) Kwei and Kpakpo: (i) They contribute to Maa Tsuru's destitution. (ii) Kwei abandons Maa Tsuru after having several children with her; he is also violent. (ii) Kpakpo preys on Maa Tsuru, sells Baby T into prostitution after sexually abusing her and intercepts the pay packet her (Baby T\"s) enslavement. (iv) Both are clearly oppressors and contribute negatively to the predicament of the women\n(4)Onko and the juju man. (i) Onko rapes Baby T, leading to her being sold into prostitution. (ii) At the request of the jujuman Onko seeks Baby T's pubic hair. (iii) This eventually leads to Onko's murder of Baby T.\n(5) Adade and Sylv Po: (i) Adade is indifferent to Kabria's struggles to survive while Sylv Po assists her in her work (ii) Adade is lazy and expects Kabria to do everything for him. (iii) Adade's attitude to Kabria regarding the refurbishing of Creamy is negative.\n(6) Poison and Macho: (i) They are street lords who prey on girls like Baby T and Fofo. (ii) The two impact negatively on the girls and on Maa Tsuru. (ii) Mami Broni is terrified of Poison. (iv) Macho drives off Fofo from nature's call and takes all her earnings for the week.",
    "year": "2020"
  },
  {
    "number": "327",
    "text": "BAYO ADEBOWALE: Lonely Days\n3. How does Alani reject his ancestry in the novel?\n4. Examine the advice of the three windows to Yaremi in the novel",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59351?exam_type=waec&type=theory&page=66",
    "correct_answer": "Question 3.\n(1)Relation to theme: Cultural conformity is a major theme in the novel. Yaremi's refusal to conform underlies her woes. Alani is bent on cutting himself off from his roots and clinging to the city way of life.\n(2) Character identification: Alani is the only son of Ajumobi and Yaremi. He lives in and adores the city. He has recently visited his mother in the village.\n(3) Change in his physical appearance and dressing. (i) He has become almost lost to the city.(ii) His skin is burnt and bleached and the hair dyed curly and dangled. (iii) He has on a shining necklace and a pair of springy intimidating high-heel shoes... (iv) Uncle Deyo is disgusted and calls him a freak'.\n(4) Attitude towards his mother: () He is aloof: he gives his mother some money and a few items from town. (ii) He promises her mother more money from time to time. (iii) He does not appreciate his mother's situation. (iv) He ignores her plight and her fight against the village elders.\n(5) Attitude towards father's legacy: (i) He cares little about his father's legacy - he exhibits a carefree attitude towards the legacy left behind by Ajumobi- the farmland 'could be sublet... (ii)He is clearly not returning to the village to tend 'your father's farm'.\n(6) His ultimate intentions: (i) He will remain in the city, only occasionally (ii) His skin is burnt and bleached and the hair returning to give mother money. (i) He intends to relocate his mother'. (iii) Once his mother relocated. Alani is likely to stop coming to Kufi. (iv) Alani is transplanted in the city - the centre of action was the city'. (v) He is thus lost to the village because of the attraction of city life.\nQuestion 4\n(1) Relation to theme: One major theme in the novel is marriage and continuity. Yaremi is expected to conform to the norm and remarry after Ajumobi has passed on. Radeke, are all senior widows.\n(2) Character identification: (i) The three widows, Dedewe, Fayoyin and (ii) They have remarried ten years before and seem to be enjoying their present situation. (iii) Their visit a night before is to show solidarity. and comradeship with Yaremi and to counsel her to \"pick your own cap.\n(3) Expectations of the society: (i) A widow needs to remarry. (ii) A woman needs a man: 'No woman's life is complete without a man'. (iii) It is a sign of humility, meekness and submission to be under a man. (iv)This is the purpose of picking a cap\n(4) Reconciliation with society: (i)widows should develop an open mind and forgive the ignorant ones who humiliate us when they remarry. (ii) They pardon those who cut their hair. (iii) They reconcile with those who force them to confess \"sins we did not commit. (iv) The widows reconcile with those who force them to chant widow's song of lamentation.\n(5) Cap-picking for a new husband: (i) Cap-picking is designed for widows to select new husbands. (ii) The former widows are satisfied with the new outcome and ' now we are savouring the aroma of a newfound happiness\"., (iii) The three widows urge Yaremi to pick a cap courageously.\n(6) Yaremi's attitude to the advice:(i) Yaremi rejects the advice. (ii) She denounces the cap-picking. (iii) Consequently, the wrath of elders is invoked on her. (ív) As the advice given to Yaremi by the three widows merely reinforces the traditional view, Yaremí's rejection points the way to a rethink of culture that is more static than dynamíc",
    "explanation": "Question 3.\n(1)Relation to theme: Cultural conformity is a major theme in the novel. Yaremi's refusal to conform underlies her woes. Alani is bent on cutting himself off from his roots and clinging to the city way of life.\n(2) Character identification: Alani is the only son of Ajumobi and Yaremi. He lives in and adores the city. He has recently visited his mother in the village.\n(3) Change in his physical appearance and dressing. (i) He has become almost lost to the city.(ii) His skin is burnt and bleached and the hair dyed curly and dangled. (iii) He has on a shining necklace and a pair of springy intimidating high-heel shoes... (iv) Uncle Deyo is disgusted and calls him a freak'.\n(4) Attitude towards his mother: () He is aloof: he gives his mother some money and a few items from town. (ii) He promises her mother more money from time to time. (iii) He does not appreciate his mother's situation. (iv) He ignores her plight and her fight against the village elders.\n(5) Attitude towards father's legacy: (i) He cares little about his father's legacy - he exhibits a carefree attitude towards the legacy left behind by Ajumobi- the farmland 'could be sublet... (ii)He is clearly not returning to the village to tend 'your father's farm'.\n(6) His ultimate intentions: (i) He will remain in the city, only occasionally (ii) His skin is burnt and bleached and the hair returning to give mother money. (i) He intends to relocate his mother'. (iii) Once his mother relocated. Alani is likely to stop coming to Kufi. (iv) Alani is transplanted in the city - the centre of action was the city'. (v) He is thus lost to the village because of the attraction of city life.\nQuestion 4\n(1) Relation to theme: One major theme in the novel is marriage and continuity. Yaremi is expected to conform to the norm and remarry after Ajumobi has passed on. Radeke, are all senior widows.\n(2) Character identification: (i) The three widows, Dedewe, Fayoyin and (ii) They have remarried ten years before and seem to be enjoying their present situation. (iii) Their visit a night before is to show solidarity. and comradeship with Yaremi and to counsel her to \"pick your own cap.\n(3) Expectations of the society: (i) A widow needs to remarry. (ii) A woman needs a man: 'No woman's life is complete without a man'. (iii) It is a sign of humility, meekness and submission to be under a man. (iv)This is the purpose of picking a cap\n(4) Reconciliation with society: (i)widows should develop an open mind and forgive the ignorant ones who humiliate us when they remarry. (ii) They pardon those who cut their hair. (iii) They reconcile with those who force them to confess \"sins we did not commit. (iv) The widows reconcile with those who force them to chant widow's song of lamentation.\n(5) Cap-picking for a new husband: (i) Cap-picking is designed for widows to select new husbands. (ii) The former widows are satisfied with the new outcome and ' now we are savouring the aroma of a newfound happiness\"., (iii) The three widows urge Yaremi to pick a cap courageously.\n(6) Yaremi's attitude to the advice:(i) Yaremi rejects the advice. (ii) She denounces the cap-picking. (iii) Consequently, the wrath of elders is invoked on her. (ív) As the advice given to Yaremi by the three widows merely reinforces the traditional view, Yaremí's rejection points the way to a rethink of culture that is more static than dynamíc",
    "year": "2020"
  },
  {
    "number": "328",
    "text": "SECTION B\nNON-AFRICAN PROSE\n RICHARD WRIGHT: Native Son\n5. Comment on Bigger's last moments with Max.\n6. Examine Bigger's visits to Bessie in the novel",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59352?exam_type=waec&type=theory&page=66",
    "correct_answer": "Question 5\n(1) Relation to the theme: One of the themes explored in the novel is racial discrimination in America and how it affects black. Bigger's reaction to the system lands him in jail and he heads for the electric chair\n(2) Character identification: (i) Bigger is the protagonist. (ii) Max is Bigger's lawyer; he is a member of the Communist Party. (iii) The last meeting between Bigger and Max takes place in Bigger's cell.\n(3) Bigger's crime and his punishment: (I) Bigger has killed Mary Dalton and his girlfriend Bessie. (ii) He is hunted down and tried in a Chicago court. (iii) Max offers to defend Bigger in court in spite of Bigger's initial suspicion of Max and Jan.\n(4) Max's defence and Bigger's death sentence: (i) Max pleads Bigger is not in court to plead innocence.(ii) He appeals to the jury to consider Bigger as a victim of state policy and social discrimination. (iii) Bigger is to die on or before midnight of Friday, March 3rd, in a manner prescribed by the been pretty deep in me to make me kill'.\n(5) The last moments with Max: (i) Bigger uses his last moment to 'accustom his mind to death as much as possible, reflecting on past events and how he has lived. (ii) Bigger yearns and 'longed to talk to Max more than ever even though he is not sure of what to discuss with him. (iii) Max shares insightful experiences about life with him and says.. in the work, I'm doing, I look at the world in a way that shows no whites and no blacks, no civilised and no savages. (iv) Bigger clears his mind about death; he 'didn't want to kill. But what I killed for, I am! It must've been pretty deep in me to make me kill'.\n(6) Significance of the moments: (i) The meeting showcases Bigger's psychological reaction to his impending death. (ii) It concludes the writer's concerns about the black man's identity. (iii) It reveals Bigger as a fulfilled character who accepts his fate happily, bidding Max Good-bye. I am all right, For real I am'.\nQuestion 6:\n(1) Relation to theme: The novel explores the theme of fear in a racially segregated America. It is this fear that triggers Bigger's reaction, culminating in his committing murders and thus advancing the plot.\n(2) Character identification: (i) Bigger full name is Bigger Thomas, the protagonist in the novel. He is driven to violence by fear. His girlfriend is Bessie Mears. (ii) Bessie is Bigger's girlfriend. She works for a white family as a domestic servant. She is depressed.\n(3) Purpose of the visits: (i) To gratify his sexual needs. (ii) To escape from the persistent questioning at the Daltons, lest he gives himself away. Thus, he wants to escape from the feeling of strain that had come over him while talking to Mrs. Dalton.\n(4) His first visit: (i) Bessie's reception of Bigger is cold. She calls him a 'stranger and she shied away from his attempt to kiss her'  (ii) They make love (iii) Bigger hits on the idea of demanding a ransom (iv) They go out for drinks at 'Paris Grill'. (v) They share stories about 'Loeb and Leopold'.\n(5) Second visit: (i) On this occasion, Bigger is apprehensive. (ii) Bigger and Bessie run to a hide-out in 'a black, looming, empty, apartment building'. (iii) Bigger kills Bessie\n(ii) They trigger the sub-plot of the novel. (6) Significance: (i) The visits give added information about Bigger's evasive and violent nature. (ii) They demonstrate how fear affects the black characters. (iii) They trigger the subplot of the novel (iv) They show Bigger's and Bessie's relationship as purely sexual. (v) They reveal Bessie's dependence on liquor as a way to suppress her depression. (vi) They intensify the violence.",
    "explanation": "Question 5\n(1) Relation to the theme: One of the themes explored in the novel is racial discrimination in America and how it affects black. Bigger's reaction to the system lands him in jail and he heads for the electric chair\n(2) Character identification: (i) Bigger is the protagonist. (ii) Max is Bigger's lawyer; he is a member of the Communist Party. (iii) The last meeting between Bigger and Max takes place in Bigger's cell.\n(3) Bigger's crime and his punishment: (I) Bigger has killed Mary Dalton and his girlfriend Bessie. (ii) He is hunted down and tried in a Chicago court. (iii) Max offers to defend Bigger in court in spite of Bigger's initial suspicion of Max and Jan.\n(4) Max's defence and Bigger's death sentence: (i) Max pleads Bigger is not in court to plead innocence.(ii) He appeals to the jury to consider Bigger as a victim of state policy and social discrimination. (iii) Bigger is to die on or before midnight of Friday, March 3rd, in a manner prescribed by the been pretty deep in me to make me kill'.\n(5) The last moments with Max: (i) Bigger uses his last moment to 'accustom his mind to death as much as possible, reflecting on past events and how he has lived. (ii) Bigger yearns and 'longed to talk to Max more than ever even though he is not sure of what to discuss with him. (iii) Max shares insightful experiences about life with him and says.. in the work, I'm doing, I look at the world in a way that shows no whites and no blacks, no civilised and no savages. (iv) Bigger clears his mind about death; he 'didn't want to kill. But what I killed for, I am! It must've been pretty deep in me to make me kill'.\n(6) Significance of the moments: (i) The meeting showcases Bigger's psychological reaction to his impending death. (ii) It concludes the writer's concerns about the black man's identity. (iii) It reveals Bigger as a fulfilled character who accepts his fate happily, bidding Max Good-bye. I am all right, For real I am'.\nQuestion 6:\n(1) Relation to theme: The novel explores the theme of fear in a racially segregated America. It is this fear that triggers Bigger's reaction, culminating in his committing murders and thus advancing the plot.\n(2) Character identification: (i) Bigger full name is Bigger Thomas, the protagonist in the novel. He is driven to violence by fear. His girlfriend is Bessie Mears. (ii) Bessie is Bigger's girlfriend. She works for a white family as a domestic servant. She is depressed.\n(3) Purpose of the visits: (i) To gratify his sexual needs. (ii) To escape from the persistent questioning at the Daltons, lest he gives himself away. Thus, he wants to escape from the feeling of strain that had come over him while talking to Mrs. Dalton.\n(4) His first visit: (i) Bessie's reception of Bigger is cold. She calls him a 'stranger and she shied away from his attempt to kiss her'  (ii) They make love (iii) Bigger hits on the idea of demanding a ransom (iv) They go out for drinks at 'Paris Grill'. (v) They share stories about 'Loeb and Leopold'.\n(5) Second visit: (i) On this occasion, Bigger is apprehensive. (ii) Bigger and Bessie run to a hide-out in 'a black, looming, empty, apartment building'. (iii) Bigger kills Bessie\n(ii) They trigger the sub-plot of the novel. (6) Significance: (i) The visits give added information about Bigger's evasive and violent nature. (ii) They demonstrate how fear affects the black characters. (iii) They trigger the subplot of the novel (iv) They show Bigger's and Bessie's relationship as purely sexual. (v) They reveal Bessie's dependence on liquor as a way to suppress her depression. (vi) They intensify the violence.",
    "year": "2020"
  },
  {
    "number": "329",
    "text": "HORACE WALPOLE: The Castle of Otranto\n7.Assess the relationship between fathers and their children in the novel\n8. Comment on the presence of ghosts and spirits in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59353?exam_type=waec&type=theory&page=66",
    "correct_answer": "Ouestion 7:\n1) Relation to theme: One controlling theme in the novel is the relationship between parents and their offspring. The manner of relating to an offspring triggers various outcomes, thus is very important in the development of the plot.\n2) Character identification: ) Manfred is the father of Conrad and Matilda. (i) Father Jerome is the father of Theodore. (iii) Frederic, Marquis of Vicenza, is the father of Isabella.\n3) Manfred, Conrad and Matilda: (i) Manfred apparently loves Conrad as heir. (ii) His main concern when Conrad dies is to find a replacement prolong his rule. (iii) Manfred is an oppressive and overbearing father to Matilda. (iv) He does have some parental feelings for her; this is shown in his regret after inadvertently killing her. (v) Matilda is useful in Manfred's desire to perpetuate his rule.\n(4) Father Jerome and Theodore: (i) Father Jerome works diligently to save Theodore even (ii) The true bond between father and son is revealed when father Jerome realises their true relationship (iii) Theirs is the only healthy relationship between father and son in the novel\n(5) Frederic and Isabella: (i) Frederic comes to Otranto to rescue his daughter. stages. (ii) He defends her at the initial (iii) He later reveals his true feelings by agreeing with Manfred to swap their daughters in marriage.\n6) Significance: (i) Generally speaking, fathers use their children to achieve their selfish goals. (ii) Only Father Jerome shows real affection for Theodore.\nQuestion 8:\n(1) Relation to theme : Superstition is a major theme in the novel. The presence of the supernatural accounts for several strange occurrences and incidents.\n(2) Character identification: Gigantic leg; the Spectre; mysterious shield: apparitions; spirits – these show the presence of the supernatural in the novel.\n(3) Incidents of their appearances: (i) After Conrad's death (ii) During Manfred's overture with Isabella. (iii) During Manfred's excitement at the  intended 'inter-rnarriages'. (iv) At Frederic's arrival. (V) During Frederic's prayer session at the Chapel. (vi) From the servants' reports. (vii) The confirmation of Theodore as the 'true heir\n(4) Notions of their presence (i) Words of horror such as violent motion', Prediction', haunted', etc. (1) Epithet of resignation such as heaved' (iii) Words of violence such as 'enormous sabre', frighten', 'rattling of armour', etc. (iv) Images of demons such as 'giant', 'Fleshless jaws', 'empty sockets of a skeleton', hermits' cowl', etc. (v) Words of fear such as 'alas!', frighten', 'ravest', 'horror', deep sigh.\n(5) Characters' reaction to the presence of these phenomena: (i) The servants are filled with fear. They contemplate quitting their jobs. Bianca almost 'swooned' and she declares, \"I had rather leave everything behind me than stay another hour under this roof. (ii) Hippolita submits and entreats Manfred, ... Let us submit ourselves to heaven .... (iii) Frederic withdraws his lustful desire for Matilda. (iv) Isabella supplicates: ... hear them all ye angels', (v) Matilda shows indifference and disregards Bianca's observation acknowledging the divine will', 'warning future tyrants thus. . (vii) Theodore reacts with more audacity by retreating into the forest 'reported around the country to be haunted by evil spirits\n(6) Significance: (i) The ghosts and spirits are Used to create suspense. (ii) They are used to provide flashbacks. (iii) They resolve the conflict. After the declaration of Theodore as the 'true heir of AIfonso', all appearances of ghosts and spirits end. (iv) They signal a new beginning in the castle. Alfonso's form speaks of a new heir after it 'appeared in the centre of the ruin'. (v) They help to bring about the fulfilment of the ancient prophecy. (vi) Their presence adds to the gothic setting of the novel.",
    "explanation": "Ouestion 7:\n1) Relation to theme: One controlling theme in the novel is the relationship between parents and their offspring. The manner of relating to an offspring triggers various outcomes, thus is very important in the development of the plot.\n2) Character identification: ) Manfred is the father of Conrad and Matilda. (i) Father Jerome is the father of Theodore. (iii) Frederic, Marquis of Vicenza, is the father of Isabella.\n3) Manfred, Conrad and Matilda: (i) Manfred apparently loves Conrad as heir. (ii) His main concern when Conrad dies is to find a replacement prolong his rule. (iii) Manfred is an oppressive and overbearing father to Matilda. (iv) He does have some parental feelings for her; this is shown in his regret after inadvertently killing her. (v) Matilda is useful in Manfred's desire to perpetuate his rule.\n(4) Father Jerome and Theodore: (i) Father Jerome works diligently to save Theodore even (ii) The true bond between father and son is revealed when father Jerome realises their true relationship (iii) Theirs is the only healthy relationship between father and son in the novel\n(5) Frederic and Isabella: (i) Frederic comes to Otranto to rescue his daughter. stages. (ii) He defends her at the initial (iii) He later reveals his true feelings by agreeing with Manfred to swap their daughters in marriage.\n6) Significance: (i) Generally speaking, fathers use their children to achieve their selfish goals. (ii) Only Father Jerome shows real affection for Theodore.\nQuestion 8:\n(1) Relation to theme : Superstition is a major theme in the novel. The presence of the supernatural accounts for several strange occurrences and incidents.\n(2) Character identification: Gigantic leg; the Spectre; mysterious shield: apparitions; spirits – these show the presence of the supernatural in the novel.\n(3) Incidents of their appearances: (i) After Conrad's death (ii) During Manfred's overture with Isabella. (iii) During Manfred's excitement at the  intended 'inter-rnarriages'. (iv) At Frederic's arrival. (V) During Frederic's prayer session at the Chapel. (vi) From the servants' reports. (vii) The confirmation of Theodore as the 'true heir\n(4) Notions of their presence (i) Words of horror such as violent motion', Prediction', haunted', etc. (1) Epithet of resignation such as heaved' (iii) Words of violence such as 'enormous sabre', frighten', 'rattling of armour', etc. (iv) Images of demons such as 'giant', 'Fleshless jaws', 'empty sockets of a skeleton', hermits' cowl', etc. (v) Words of fear such as 'alas!', frighten', 'ravest', 'horror', deep sigh.\n(5) Characters' reaction to the presence of these phenomena: (i) The servants are filled with fear. They contemplate quitting their jobs. Bianca almost 'swooned' and she declares, \"I had rather leave everything behind me than stay another hour under this roof. (ii) Hippolita submits and entreats Manfred, ... Let us submit ourselves to heaven .... (iii) Frederic withdraws his lustful desire for Matilda. (iv) Isabella supplicates: ... hear them all ye angels', (v) Matilda shows indifference and disregards Bianca's observation acknowledging the divine will', 'warning future tyrants thus. . (vii) Theodore reacts with more audacity by retreating into the forest 'reported around the country to be haunted by evil spirits\n(6) Significance: (i) The ghosts and spirits are Used to create suspense. (ii) They are used to provide flashbacks. (iii) They resolve the conflict. After the declaration of Theodore as the 'true heir of AIfonso', all appearances of ghosts and spirits end. (iv) They signal a new beginning in the castle. Alfonso's form speaks of a new heir after it 'appeared in the centre of the ruin'. (v) They help to bring about the fulfilment of the ancient prophecy. (vi) Their presence adds to the gothic setting of the novel.",
    "year": "2020"
  },
  {
    "number": "330",
    "text": "DELE CHARLEY: The Blood of a Stranger\n1. Compare Kindo and his father in the play.\n2. Examine Wara's encounters with soko in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59355?exam_type=waec&type=theory&page=66",
    "correct_answer": "Question 1\nRelation to theme: (i) Colonial exploitation bringing about divisions ín society and famíly. (ií) Deception and greed.\n(2) Identification of characters (i) Kindo: son of Santigí overlord of Mando land. hcir apparent and chíef warrior (ii) Santigi: King of Mando land, old and uneducated.\n(3) Attitude to culture: Both are protectors of the culture and practices of Mando land. (i) Keeping strangers away from the land. (ii) Keeping society intact and recognising the role played by Maligu and Soko.\n(4) Differences: (i) Santigi ís easily influenced by Maligu and Soko to set aside tradition in quest of self enrichment. (ii) Santigi ruling that (ii) Disagree about the coming of whitehead and his exploitation of the land for tobacco farming.\n(5) Climax:  (i) Kindo being manipulated into killing Parker and Whitehead impaling himself on Kindo's spear. (ii) Santigi ruling that Kindo be exiled according to custom. (iii) Kindo's threat to return. Question\nQuestion 2:\n(1) Relation to theme: () Colonial exploitation bringing about divisions in society and family. (ii) Deception and greed.\n(2) Character ldentification: (i) Wara is Kindo's woman, regarded as a stranger which she is not. (i1) Wara marked out by Soko for the virgin sacrifice to spite Kindo. (ii) Soko is the Priest of the shrine, wielding enormous spiritual power over the people and roped into a conspiracy by Maligu and Whitehead to exploit the mineral resources of the land in the name of tobacco farming\n(3) First encounter: The abduction of Wara. (i) Wara's hands and feet tied and gagged by Maligu and Soko and delivered to Whitehead. (ii) Wara frees herself from Whitehead's attempt to rape her.\n(4) Wara's second encounter with Soko: (I) Wara running away from Whitehead and encountering Soko. (ii) Soko urging Wara to turn away to a neighbouring village to conceal their abortive plan. encounters:\n(5) Significance of the encounters: (i) Wara being used as a pawn. (ii) To spite Kindo and subdue his influence in the land. (iii) Reveals the extent of Whitehead's greed and debauchery. (iv) Exposes Maligu and Soko's deceit.",
    "explanation": "Question 1\nRelation to theme: (i) Colonial exploitation bringing about divisions ín society and famíly. (ií) Deception and greed.\n(2) Identification of characters (i) Kindo: son of Santigí overlord of Mando land. hcir apparent and chíef warrior (ii) Santigi: King of Mando land, old and uneducated.\n(3) Attitude to culture: Both are protectors of the culture and practices of Mando land. (i) Keeping strangers away from the land. (ii) Keeping society intact and recognising the role played by Maligu and Soko.\n(4) Differences: (i) Santigi ís easily influenced by Maligu and Soko to set aside tradition in quest of self enrichment. (ii) Santigi ruling that (ii) Disagree about the coming of whitehead and his exploitation of the land for tobacco farming.\n(5) Climax:  (i) Kindo being manipulated into killing Parker and Whitehead impaling himself on Kindo's spear. (ii) Santigi ruling that Kindo be exiled according to custom. (iii) Kindo's threat to return. Question\nQuestion 2:\n(1) Relation to theme: () Colonial exploitation bringing about divisions in society and family. (ii) Deception and greed.\n(2) Character ldentification: (i) Wara is Kindo's woman, regarded as a stranger which she is not. (i1) Wara marked out by Soko for the virgin sacrifice to spite Kindo. (ii) Soko is the Priest of the shrine, wielding enormous spiritual power over the people and roped into a conspiracy by Maligu and Whitehead to exploit the mineral resources of the land in the name of tobacco farming\n(3) First encounter: The abduction of Wara. (i) Wara's hands and feet tied and gagged by Maligu and Soko and delivered to Whitehead. (ii) Wara frees herself from Whitehead's attempt to rape her.\n(4) Wara's second encounter with Soko: (I) Wara running away from Whitehead and encountering Soko. (ii) Soko urging Wara to turn away to a neighbouring village to conceal their abortive plan. encounters:\n(5) Significance of the encounters: (i) Wara being used as a pawn. (ii) To spite Kindo and subdue his influence in the land. (iii) Reveals the extent of Whitehead's greed and debauchery. (iv) Exposes Maligu and Soko's deceit.",
    "year": "2020"
  },
  {
    "number": "331",
    "text": "FRANK OGODO OGBECHE: Harvest of Corruption\n 3. Examine Ogeyi as a deeply religious person in the play.\n4. Account for the downfall of Chief in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59356?exam_type=waec&type=theory&page=67",
    "correct_answer": "Question 3:\n(1) Relation to theme: (i) Theme of corruption and abuse of power. (ii) The quest for justice in a corrupt society.\n(2) Character identification: (i) Ogeyi Ogar is Aloho's friend from university davs. (ii) A receptionist in ABC Company. (iii) Born-again since university days, clear contrast to Ochuole. (iv) Deeply religious working woman. (v) Usually seen on her bed reading religious literature.\n(3) Circumstances of Ogeyi's life: (i) Lives in Pannya close to a rubbish heap. (ii) Sleeps on a bare bedsitter. (iii) Willing to share room with her unemployed friend, Aloho. (iv) Sharing her religious beliefs with Aloha and reminding her she is a born-again Christian.\n(4) Ogeyi's warning to Aloho against Ochuole: (i) She is alarmed at Aloho' s association with Ochuole. (ii) Warns Aloho strongly against the association Aloho. (iii) Urges Aloho to trust God to provide a good job. (iv) Prays fervently for Aloho\n(5) Ogeyi's caution to Aloho about her new job: (i) Suspicious of the job of protocol officer. (ii) Sceptical about the USA trip. (iii) Urges Aloho to listen to biblical warning and quit the job, \"flee when the temptation comes near you\" and urges Aloho to remember Lot's wife and her fate.\n(6) Ogeyi's denunciation of corruption: (i) After Aloho leaves for the village, Ogeyi goes to the police. (ii) In court, she declares herself \"born-again Christian\". (iii) She assures Okpotu, \"God will handle the matter\". (iv) Secures justice against the perpetrators of Aloho's death.\nQuestion 4:\n(1) Relation to theme: (i) Theme of corruption and abuse of power. (ii) The quest for justice in a corrupt society.\n(2) Character identification: (i) Chief is chief Haladu Ade-Amaka. (ii) Minister of External Relations. (ii) Drug baron. (iv) Physique described absurdly; e.g. stoutly built, has a protruding stomach and walks like a pregnant woman, etc.\n(3) Chief's womanizing, embezzling funds and abuse of office: (i) He is riding high: affluence gained through illegal means. (ii) Notorious for womanizing, (iii) Erabezzles state funds (iv) Abuses his office for monetary gains. (v) Bribes officials of the justice system.\n(4) Aloho's frustrated trip to the USA. (i) First signs of downfall. Aloho's arrest and bribing his way through. (ii) Complicity of Justice Odili. (iii) Failure of customs officer to turn up at the airport. (iv) Aloho's pregnancy.\n(5) His eventual downfall. (i) Ogeyi reports chief to the police. prosecuted. (iv) He is fined and imprisoned. (ii) Chief is arrested in spite of Justice Odili's attempt to subvert justice. (iii) He is successfully",
    "explanation": "Question 3:\n(1) Relation to theme: (i) Theme of corruption and abuse of power. (ii) The quest for justice in a corrupt society.\n(2) Character identification: (i) Ogeyi Ogar is Aloho's friend from university davs. (ii) A receptionist in ABC Company. (iii) Born-again since university days, clear contrast to Ochuole. (iv) Deeply religious working woman. (v) Usually seen on her bed reading religious literature.\n(3) Circumstances of Ogeyi's life: (i) Lives in Pannya close to a rubbish heap. (ii) Sleeps on a bare bedsitter. (iii) Willing to share room with her unemployed friend, Aloho. (iv) Sharing her religious beliefs with Aloha and reminding her she is a born-again Christian.\n(4) Ogeyi's warning to Aloho against Ochuole: (i) She is alarmed at Aloho' s association with Ochuole. (ii) Warns Aloho strongly against the association Aloho. (iii) Urges Aloho to trust God to provide a good job. (iv) Prays fervently for Aloho\n(5) Ogeyi's caution to Aloho about her new job: (i) Suspicious of the job of protocol officer. (ii) Sceptical about the USA trip. (iii) Urges Aloho to listen to biblical warning and quit the job, \"flee when the temptation comes near you\" and urges Aloho to remember Lot's wife and her fate.\n(6) Ogeyi's denunciation of corruption: (i) After Aloho leaves for the village, Ogeyi goes to the police. (ii) In court, she declares herself \"born-again Christian\". (iii) She assures Okpotu, \"God will handle the matter\". (iv) Secures justice against the perpetrators of Aloho's death.\nQuestion 4:\n(1) Relation to theme: (i) Theme of corruption and abuse of power. (ii) The quest for justice in a corrupt society.\n(2) Character identification: (i) Chief is chief Haladu Ade-Amaka. (ii) Minister of External Relations. (ii) Drug baron. (iv) Physique described absurdly; e.g. stoutly built, has a protruding stomach and walks like a pregnant woman, etc.\n(3) Chief's womanizing, embezzling funds and abuse of office: (i) He is riding high: affluence gained through illegal means. (ii) Notorious for womanizing, (iii) Erabezzles state funds (iv) Abuses his office for monetary gains. (v) Bribes officials of the justice system.\n(4) Aloho's frustrated trip to the USA. (i) First signs of downfall. Aloho's arrest and bribing his way through. (ii) Complicity of Justice Odili. (iii) Failure of customs officer to turn up at the airport. (iv) Aloho's pregnancy.\n(5) His eventual downfall. (i) Ogeyi reports chief to the police. prosecuted. (iv) He is fined and imprisoned. (ii) Chief is arrested in spite of Justice Odili's attempt to subvert justice. (iii) He is successfully",
    "year": "2020"
  },
  {
    "number": "332",
    "text": "NON-AFRICAN DRAMA \nLORRAINE HANSBERRY: A Raisin in the Sun\n5. Consider the role of Mrs Johnson in the development of the plot.\n6. Account for Walter's expectations in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59357?exam_type=waec&type=theory&page=67",
    "correct_answer": "Question 5\n(1) Relation to theme: (i)) Racial discrimination and how it affects the lives of African Americans. (ii) Poverty and the aspiration of a young African American family to improve their lot.\n(2) Definition of plot: The unfolding of events and actions in relation to the theme. In this regard, Mrs. Johnson plays a minor but significant role.\n(3) Character identification: Mrs Johnson is an African American woman, a neighbour of the Youngers and sharing an apartment with them in Southside, Chicago (i) Competes with the Youngers for the use of a common bathroom. (ii) Exchange pleasantries with the Youngers.\n(4) The visit: (i) As she visits, she brings along a magazine featuring as banner headline. NEGROES INVADE THE CLYBOURNE PARK' and they have been bombed. (ii) She teases the family for wanting to move on up a little higher' when they should know their place as Negros as she does. (iii) She is full of envy tinged with admiration of the Youngers' upbringing and determination to succeed.\n5) Her relevance to the plot: (i) She provides some humour, especially when she's given pie, then coffee while protesting she has stayed too long. (ii) She appears at the stage where the Youngers are packing to move to Clybourne Park. The news from the newspaper and her own narrative is intended to discourage the Youngers from moving on. (iii) Beneatha concludes about her visit. \".. If there are two things, we as a people, have got to overcome, one is the Klu Klux Klan, the other is Mrs Johnson\".\n(6) Significance (i) Mrs. Johnson's visit raises doubt in the Youngers about moving out to Clybourne Park. (ii) Subsequent events, such as Walter's loss of the rest of the insurance money and Mr. Karl Lindner's appearance to buy the family out of the contract do not help matters. (iii) Mrs. Johnson represents those coloured people who would do nothing to improve their lot and discourage others from doing so. She illustrates the negative side of the African American attempt to break the barriers of social class and race.\nQuestion 6\n(1) Relation to theme: (i) Racial discrimination and how it affects the lives of African Americans (ii) Poverty and the aspiration of a young African American family to improve their lot.\n(2) Definition of plot: ()) Walter is Walter Lee Younger, Mama's son, Ruth's husband, Travis' father and not yet the head of the house. (ii) He is a lean and ambitious young man ready to blame others for his own flaws. (iii) Does not like driving for another person\n(3) His desire to improve his lot and that of his family: (i) Unhappy with the family's depraved condition. (ii) It leads him to drink a lot. (iii) He expects to make a breakthrough with the arrival of the insurance money (iv) He wants the best for Travis but is shocked by the boy's expectation to be a driver.\n(4) Walter's choice of business: () He invests in the liquor business, much to the opposition of his mother and sister. (ii) He is duped by his friend, Willy Harris (ii) He feels disappointed and betrayed. He says of Willy Harris. \"man . trust you ... man I put my Life in your hands man ... that money is made out of my father's flesh\"\n(5) Walter's admiration of success: (i) Regards George Murchison's family as having achieved the success he aspires to. (ii) Disappointed when Beneatha chooses Asagai instead of George. (iii) He reconciles with his family's determination to relocate to Clybourne Park which, to them, signifies success.",
    "explanation": "Question 5\n(1) Relation to theme: (i)) Racial discrimination and how it affects the lives of African Americans. (ii) Poverty and the aspiration of a young African American family to improve their lot.\n(2) Definition of plot: The unfolding of events and actions in relation to the theme. In this regard, Mrs. Johnson plays a minor but significant role.\n(3) Character identification: Mrs Johnson is an African American woman, a neighbour of the Youngers and sharing an apartment with them in Southside, Chicago (i) Competes with the Youngers for the use of a common bathroom. (ii) Exchange pleasantries with the Youngers.\n(4) The visit: (i) As she visits, she brings along a magazine featuring as banner headline. NEGROES INVADE THE CLYBOURNE PARK' and they have been bombed. (ii) She teases the family for wanting to move on up a little higher' when they should know their place as Negros as she does. (iii) She is full of envy tinged with admiration of the Youngers' upbringing and determination to succeed.\n5) Her relevance to the plot: (i) She provides some humour, especially when she's given pie, then coffee while protesting she has stayed too long. (ii) She appears at the stage where the Youngers are packing to move to Clybourne Park. The news from the newspaper and her own narrative is intended to discourage the Youngers from moving on. (iii) Beneatha concludes about her visit. \".. If there are two things, we as a people, have got to overcome, one is the Klu Klux Klan, the other is Mrs Johnson\".\n(6) Significance (i) Mrs. Johnson's visit raises doubt in the Youngers about moving out to Clybourne Park. (ii) Subsequent events, such as Walter's loss of the rest of the insurance money and Mr. Karl Lindner's appearance to buy the family out of the contract do not help matters. (iii) Mrs. Johnson represents those coloured people who would do nothing to improve their lot and discourage others from doing so. She illustrates the negative side of the African American attempt to break the barriers of social class and race.\nQuestion 6\n(1) Relation to theme: (i) Racial discrimination and how it affects the lives of African Americans (ii) Poverty and the aspiration of a young African American family to improve their lot.\n(2) Definition of plot: ()) Walter is Walter Lee Younger, Mama's son, Ruth's husband, Travis' father and not yet the head of the house. (ii) He is a lean and ambitious young man ready to blame others for his own flaws. (iii) Does not like driving for another person\n(3) His desire to improve his lot and that of his family: (i) Unhappy with the family's depraved condition. (ii) It leads him to drink a lot. (iii) He expects to make a breakthrough with the arrival of the insurance money (iv) He wants the best for Travis but is shocked by the boy's expectation to be a driver.\n(4) Walter's choice of business: () He invests in the liquor business, much to the opposition of his mother and sister. (ii) He is duped by his friend, Willy Harris (ii) He feels disappointed and betrayed. He says of Willy Harris. \"man . trust you ... man I put my Life in your hands man ... that money is made out of my father's flesh\"\n(5) Walter's admiration of success: (i) Regards George Murchison's family as having achieved the success he aspires to. (ii) Disappointed when Beneatha chooses Asagai instead of George. (iii) He reconciles with his family's determination to relocate to Clybourne Park which, to them, signifies success.",
    "year": "2020"
  },
  {
    "number": "333",
    "text": "OLIVER GOLDSMITH: She Stoops to Conquer\n7. Assess Marlow and Hastings' first encounter with Mr. Hardcastle.\n8. Comment on Tony's attitude to Mr. and Mrs. Hardcastle.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59358?exam_type=waec&type=theory&page=67",
    "correct_answer": "Question 7\n(1) Relation to theme: The role of parents in the marriage of their children in the Middle/Upper-class society.\n2. Character Identification. (i) Marlow is the son of Sir Charles Marlow, a dear friend of Mr. Hardcastle. He is a bashful young man in the company of ladies of his class. (ii) Hastings is a friend of young Marlow and Constance Neville. (iii) Mr. Hardcastle is a friend of Sir Charles Marlow, husband to Mrs. Hardcastle, father to Kate and step-father to Tony Lumpkin. He is old, jovial and easily deceived. He likes old things, stories and even an ald wife\".\n(3) The first encounter: (1) They arrive at the Hardcastle home, having been misled by Tony Lumpkin to believe it is an inn and Mr. Hardcastle the innkeeper. (ii) The purpose of their visit is for Marlow to woo Kate Hardcastle whom both Mr. Hardcastle and Sir Charles Marlow have recommended.\n(4) The ensuing events: Rude behaviour exhibited by the two young men towards Mr. Hardcastle, e.g.; (i) Their impudent disregard of Mr. Hardcaslte's warm welcome. (ii) Their warding him off their discussions and making fun of him, even as he intrudes with his stories about his war exploits. (iii) Their ignoring his earnest attempts to please them after he has ordered his servants, Diggory and others, to know their place when his guests are at table. (iv) Their determined ordering of Mr. Hardcastle to do their bidding in all manner of things. such as choice of meal or wine.\n(5) The revelation of character (i) Marlow's embarrassment as soon as he discovers his mistakes and deciding to leave immediately. (ii) Kate's ability to find out that Marlow is a suitable partner and pleading with her father to give him a chance.\n(6) Significance of the encounter: (i) Plays out the title of the play \"she stoops to conquer\". (ii) Reveals also the problems of arranged marriages. (iii) Brings out the comic elements in the play.\nQuestion 8:\n(l) Relation to theme: The role of parents in the marriage of their children in the Middle/Upper-class society.\n(2) Character identification: (i) Tony Lumpkin is the son of Mrs. Hardcastle, stepson of Mr. Hardcastle, brother of Kate Hardcastle and cousin of Constance Neville. He is an uneducated man and lover of fun and mischief. (ii) Mrs. Hardcastle is wife to Mr. Hardcastle, mother to Kate and Tony and aunt to Constance Neville. She loves fashion and is discontented with their style of living: she passes off as selfish and greedy.\n(3) Attitude to Mr. and Mrs. Hardcastle: Mr. Hardcastie; (i) He plays pranks on him. (ii) He initiates the deception that misleads Marlow and Hastings to mistake their home as an inn, thereby fomenting the tensions that ensued between Mr. Hardcastle and his visitors. Mrs, Hardcastle: (iii) He sees her as rather spoiling him.  (iv) Exploits her doting on him to get his own way. (v) Understands his mother's greed for Constance's jewel as the reason for getting him married to Constance and rejects that.\n(4) Their reactions to his attitude: (i) Mr. Hardcastle reacts increasingly with sarcasm, \"Nor ever will, I dare answer for him. Ay, vou have taught him finely\" (ii) Mrs. Hardcastle responds with pampering and over-protectįveness, \"where are you going my charmer? come, Mr. Hardcastle, you must allow the boy a little humour\"\n(5) Effects of his attitude on himself: (i) Projects him as rebellious and stubborn.(ii) Projects him as an independent-minded young man. (iii) Projects him as one who is capable of using mischief and deception to help others to achieve their aim, e.g., Kate and Marlow, Constance and Hastings relationships end in marriages.",
    "explanation": "Question 7\n(1) Relation to theme: The role of parents in the marriage of their children in the Middle/Upper-class society.\n2. Character Identification. (i) Marlow is the son of Sir Charles Marlow, a dear friend of Mr. Hardcastle. He is a bashful young man in the company of ladies of his class. (ii) Hastings is a friend of young Marlow and Constance Neville. (iii) Mr. Hardcastle is a friend of Sir Charles Marlow, husband to Mrs. Hardcastle, father to Kate and step-father to Tony Lumpkin. He is old, jovial and easily deceived. He likes old things, stories and even an ald wife\".\n(3) The first encounter: (1) They arrive at the Hardcastle home, having been misled by Tony Lumpkin to believe it is an inn and Mr. Hardcastle the innkeeper. (ii) The purpose of their visit is for Marlow to woo Kate Hardcastle whom both Mr. Hardcastle and Sir Charles Marlow have recommended.\n(4) The ensuing events: Rude behaviour exhibited by the two young men towards Mr. Hardcastle, e.g.; (i) Their impudent disregard of Mr. Hardcaslte's warm welcome. (ii) Their warding him off their discussions and making fun of him, even as he intrudes with his stories about his war exploits. (iii) Their ignoring his earnest attempts to please them after he has ordered his servants, Diggory and others, to know their place when his guests are at table. (iv) Their determined ordering of Mr. Hardcastle to do their bidding in all manner of things. such as choice of meal or wine.\n(5) The revelation of character (i) Marlow's embarrassment as soon as he discovers his mistakes and deciding to leave immediately. (ii) Kate's ability to find out that Marlow is a suitable partner and pleading with her father to give him a chance.\n(6) Significance of the encounter: (i) Plays out the title of the play \"she stoops to conquer\". (ii) Reveals also the problems of arranged marriages. (iii) Brings out the comic elements in the play.\nQuestion 8:\n(l) Relation to theme: The role of parents in the marriage of their children in the Middle/Upper-class society.\n(2) Character identification: (i) Tony Lumpkin is the son of Mrs. Hardcastle, stepson of Mr. Hardcastle, brother of Kate Hardcastle and cousin of Constance Neville. He is an uneducated man and lover of fun and mischief. (ii) Mrs. Hardcastle is wife to Mr. Hardcastle, mother to Kate and Tony and aunt to Constance Neville. She loves fashion and is discontented with their style of living: she passes off as selfish and greedy.\n(3) Attitude to Mr. and Mrs. Hardcastle: Mr. Hardcastie; (i) He plays pranks on him. (ii) He initiates the deception that misleads Marlow and Hastings to mistake their home as an inn, thereby fomenting the tensions that ensued between Mr. Hardcastle and his visitors. Mrs, Hardcastle: (iii) He sees her as rather spoiling him.  (iv) Exploits her doting on him to get his own way. (v) Understands his mother's greed for Constance's jewel as the reason for getting him married to Constance and rejects that.\n(4) Their reactions to his attitude: (i) Mr. Hardcastle reacts increasingly with sarcasm, \"Nor ever will, I dare answer for him. Ay, vou have taught him finely\" (ii) Mrs. Hardcastle responds with pampering and over-protectįveness, \"where are you going my charmer? come, Mr. Hardcastle, you must allow the boy a little humour\"\n(5) Effects of his attitude on himself: (i) Projects him as rebellious and stubborn.(ii) Projects him as an independent-minded young man. (iii) Projects him as one who is capable of using mischief and deception to help others to achieve their aim, e.g., Kate and Marlow, Constance and Hastings relationships end in marriages.",
    "year": "2020"
  },
  {
    "number": "334",
    "text": "AFRICAN POETRY\n9. How does the diction convey the theme of Adeoti's Ambush? \n10. Discuss the theme of accommodation in The Anvi! d the Hammer",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59359?exam_type=waec&type=theory&page=67",
    "correct_answer": "Question 9:\n(1) Relation to theme: (i) Oppression of citizens by the political leadership. (ii) The diction brings out the theme of the suffering of the people under bad leadership.\n(2) Definition of diction (i) The poet's choice of words. (ii) Words or phrases that convey the intentions of the poet. (iii) It covers both the literal and metaphorical implications of what the poet says.\n(3) Reference to the giant whale: (i) The land represents the leadership. (ii) This is a metaphor describing leadership. It connotes something fearful and horrid. (iii) Its activities manifest the ability to Swallow\" the fishermen's hope; e.g. the sinker with hook, line and bait'. (iv) The fishermen's failure to catch fish is conveyed in expressions such as aborting dreams of a good catch'. (v) The Biblical allusion to 'all peter out with petered out desires', connotes the futility and emptiness of the fishermen's endeavours.,\n(4) The reference to the sabre-toothed tiger: (i) This is also a metaphor for oppressive leadership. (ii) Words connoting fear, insecurity and violence abound; e.g. 'sabre-toothed tiger that cries deep in the glade while infants shudder home', the grizzled ones snatch their gut from bayonets of tribulation'. (iii) The impression of the people under curfew is conveyed in the expression 'halting venturous walk at dusk.\n(5) The reference to the image of the giant hawk hovering in the sky. This suggests the curtailment of the people's freedom even by air and words, such as 'hovers' and hoots\" suggest the terror that is imposed on the people.\n(6) The land lying patiently in ambush: The word 'ambush' connotes both surprise and capture and implies that no one has the opportunity to escape, even \"those who point away ... toward the shore of possibilities'\nQuestion 10:\nRelation to theme: (i) The colonial experience and its aftermath in the birth of a new African. (ii) The theme is also about both the psychological and cultural adjustment the Africans makes as a result of colonialism.\n(2) The African dílemma: This is conveyed by the image of the anvil and the hammer connoting the violence of a new birth; e.g. \"the joy of new songs, the trappings ... tender and tenuous'.\n(3) Product of the forging: (i) imperfect African (ii) Trappings of the past. (iii) The African is resilient though 'tenuous', 'woven with the fibre of sisal and washed in the blood of the goat'.\n(4) Prospects of the New African: (1) Education- 'search on the outlaw's hill' for jargons of a new dialectic'. (ii) The African still longs for the old days- 'sew the old days for us, our fathers'.\n(5) The process of accommodation has not been easy. This is conveyed by the following expressions: (i) 'banner of the land' alongside 'new flags and anthems' and \"flimsy glories of paved streets, (ii) the 'splash and moan of the sea', which is still audible.",
    "explanation": "Question 9:\n(1) Relation to theme: (i) Oppression of citizens by the political leadership. (ii) The diction brings out the theme of the suffering of the people under bad leadership.\n(2) Definition of diction (i) The poet's choice of words. (ii) Words or phrases that convey the intentions of the poet. (iii) It covers both the literal and metaphorical implications of what the poet says.\n(3) Reference to the giant whale: (i) The land represents the leadership. (ii) This is a metaphor describing leadership. It connotes something fearful and horrid. (iii) Its activities manifest the ability to Swallow\" the fishermen's hope; e.g. the sinker with hook, line and bait'. (iv) The fishermen's failure to catch fish is conveyed in expressions such as aborting dreams of a good catch'. (v) The Biblical allusion to 'all peter out with petered out desires', connotes the futility and emptiness of the fishermen's endeavours.,\n(4) The reference to the sabre-toothed tiger: (i) This is also a metaphor for oppressive leadership. (ii) Words connoting fear, insecurity and violence abound; e.g. 'sabre-toothed tiger that cries deep in the glade while infants shudder home', the grizzled ones snatch their gut from bayonets of tribulation'. (iii) The impression of the people under curfew is conveyed in the expression 'halting venturous walk at dusk.\n(5) The reference to the image of the giant hawk hovering in the sky. This suggests the curtailment of the people's freedom even by air and words, such as 'hovers' and hoots\" suggest the terror that is imposed on the people.\n(6) The land lying patiently in ambush: The word 'ambush' connotes both surprise and capture and implies that no one has the opportunity to escape, even \"those who point away ... toward the shore of possibilities'\nQuestion 10:\nRelation to theme: (i) The colonial experience and its aftermath in the birth of a new African. (ii) The theme is also about both the psychological and cultural adjustment the Africans makes as a result of colonialism.\n(2) The African dílemma: This is conveyed by the image of the anvil and the hammer connoting the violence of a new birth; e.g. \"the joy of new songs, the trappings ... tender and tenuous'.\n(3) Product of the forging: (i) imperfect African (ii) Trappings of the past. (iii) The African is resilient though 'tenuous', 'woven with the fibre of sisal and washed in the blood of the goat'.\n(4) Prospects of the New African: (1) Education- 'search on the outlaw's hill' for jargons of a new dialectic'. (ii) The African still longs for the old days- 'sew the old days for us, our fathers'.\n(5) The process of accommodation has not been easy. This is conveyed by the following expressions: (i) 'banner of the land' alongside 'new flags and anthems' and \"flimsy glories of paved streets, (ii) the 'splash and moan of the sea', which is still audible.",
    "year": "2020"
  },
  {
    "number": "335",
    "text": "NON-AFRICAN POETRY\n11. Examine God's reasoning in The Pulley.\n12. How does the image of caged bird explain the boy's experiences in The Schgolboyt?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/59360?exam_type=waec&type=theory&page=67",
    "correct_answer": "Question 11\n(1) Relation to theme:    God's love for mankind which ensures that mankind is never separated from Him. (ii) God's creation of man and the benefits He bestowed on man.\n(2) The reasoning for this is laid out in the stanzas: In the first stanza, God performed some activity when he created man:  (i) He downloaded (as a pulley does) his gifts of blessing into a glass). (ii) Then he poured them (all we can) on man by a fiat: \"Let the world's riches, which dispersed lie/contract into a span\".\n(3) The drama of withholding “rest\": The second stanza describes the specific gifts: “beauty\", \"wisdom\" \"honour\" \"pleasure\" and \"strength as they are poured in succession. Then; dramatically, God made a stay \"Rest\"; my jewel' which lay at the bottom of the glass is withheld.\n(4) God's reasoning: The third stanza provides the rationale for the reasoning: If \"rest is included, man will be more worldly, i.e., \"rest in Nature\"; instead of the God of Nature. The result is “both will losers be\".\n(5) The concession and conclusion: The concession, Yet let him keep the rest (remainder) is magnanimous. But it precedes a caveat: *But keep them in repining restlessness' Then a new phenomenon is paradoxically introduced: \"Let him be rich and wearie\". At this stage, the logic of the reasoning is made more manifest: Not sure about man's inherent “goodness\", God ensures that he keeps his link to man by throwing the latter into a state of repining restlessness\". So that “if goodness lead him not, yet weariness/ may tosse him to my breast\".\nQuestion 12:\n(1) Relation to theme: The restrictions imposed by society in general and school in particular on children's growth and development.\n(2) The caged bird and the boy's experience of nature (\"summer morn\");: (i) summer morn is exciting (ii) “birds sing on every tree\" (ii) ... \"The distant huntsman winds his horn\", etc. However, like a caged bird, the boy is excluded from participation in nature's activities by being restricted in school.\n(3) A caged bird and the boy's experience of school. The boy describes his experience of school harrowingly (i) The setting is dreary (ii) Thought of it \"drives all joy away\" (ii) Teachers are old and overly strict \"cruel eye outworn\". (iv) The little ones are In sighing and dismay\". (v) He feels anxious and cannot \"take delight\" in learning. A caged bird must be going through similar experiences.\n(4) Through exclamations, appeals and rhetorical questions the caged bird must be going through similar experiences the boy blames his parents and society looking on as he, like a caged bird, is being denied natural growth and being kept  Sorrowful\n(5) Implications for adulthood (i) Loss of early childhood joy. (ii) Loss of time to acquire survival skills (iii) Loss of emotional and psychological buffer in times of old age, *when the blasts of winter appear\".",
    "explanation": "Question 11\n(1) Relation to theme:    God's love for mankind which ensures that mankind is never separated from Him. (ii) God's creation of man and the benefits He bestowed on man.\n(2) The reasoning for this is laid out in the stanzas: In the first stanza, God performed some activity when he created man:  (i) He downloaded (as a pulley does) his gifts of blessing into a glass). (ii) Then he poured them (all we can) on man by a fiat: \"Let the world's riches, which dispersed lie/contract into a span\".\n(3) The drama of withholding “rest\": The second stanza describes the specific gifts: “beauty\", \"wisdom\" \"honour\" \"pleasure\" and \"strength as they are poured in succession. Then; dramatically, God made a stay \"Rest\"; my jewel' which lay at the bottom of the glass is withheld.\n(4) God's reasoning: The third stanza provides the rationale for the reasoning: If \"rest is included, man will be more worldly, i.e., \"rest in Nature\"; instead of the God of Nature. The result is “both will losers be\".\n(5) The concession and conclusion: The concession, Yet let him keep the rest (remainder) is magnanimous. But it precedes a caveat: *But keep them in repining restlessness' Then a new phenomenon is paradoxically introduced: \"Let him be rich and wearie\". At this stage, the logic of the reasoning is made more manifest: Not sure about man's inherent “goodness\", God ensures that he keeps his link to man by throwing the latter into a state of repining restlessness\". So that “if goodness lead him not, yet weariness/ may tosse him to my breast\".\nQuestion 12:\n(1) Relation to theme: The restrictions imposed by society in general and school in particular on children's growth and development.\n(2) The caged bird and the boy's experience of nature (\"summer morn\");: (i) summer morn is exciting (ii) “birds sing on every tree\" (ii) ... \"The distant huntsman winds his horn\", etc. However, like a caged bird, the boy is excluded from participation in nature's activities by being restricted in school.\n(3) A caged bird and the boy's experience of school. The boy describes his experience of school harrowingly (i) The setting is dreary (ii) Thought of it \"drives all joy away\" (ii) Teachers are old and overly strict \"cruel eye outworn\". (iv) The little ones are In sighing and dismay\". (v) He feels anxious and cannot \"take delight\" in learning. A caged bird must be going through similar experiences.\n(4) Through exclamations, appeals and rhetorical questions the caged bird must be going through similar experiences the boy blames his parents and society looking on as he, like a caged bird, is being denied natural growth and being kept  Sorrowful\n(5) Implications for adulthood (i) Loss of early childhood joy. (ii) Loss of time to acquire survival skills (iii) Loss of emotional and psychological buffer in times of old age, *when the blasts of winter appear\".",
    "year": "2020"
  }
]