[
  {
    "number": "10",
    "text": "You are provided with two retort stands, two-metre rules, pieces of thread, and other necessary apparatus. ( see illustration above)\ni. Set up the apparatus as illustrated above ensuring the strings are permanently 10cm from either end of the rule.\nii. Measure and record the length L = 80 cm of the two strings.\niii. Hold both ends of the rule and displace the rule slightly, then release so that it oscillates about a vertical axis through its centre.\niv. Determine and record the time t for 10 complete oscillations.\nv. Determine the period T of oscillations.\nvi. Evaluate log T and L.\nvii. Repeat the procedure for four other values of L= 70 cm, 60 cm, 50 cm, and 40 cm\nviii. Tabulate your readings.\nix. Plot a graph with log T on the vertical axis and log L on the horizontal axis.\nx. Determine the slope, s, and the intercept, c on the vertical axis.\nxi. State two precautions taken to ensure accurate results. \n(b)i. Define simple harmonic motion.\nii. Determine the value of L corresponding to t= 12 s from the graph in 1.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59906?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "11",
    "text": "You are provided with a beaker, a thermometer, a stirrer Stopwatch/clock, measuring cylinder, table salt, water, and other necessary materials.\ni. You Measure 200cm\\(^{3}\\) of water into the beaker.\nii. Heat the water until it boils steadily for about 2 minutes.\niii. Read and record the boiling point b\\(_{0}\\).\niv.  Add table salt of mass M = 10.0 g to the boiling water and stir continuously until another boiling point b\\(_{1}\\) is attained.\nv. Read and record b\\(_{i}\\).\nvi. Evaluate \\(\\theta_{i}\\) = (b\\(_{i}\\) - b\\(_{0}\\))\nvii. Using the same mixture, repeat the procedure four more times by adding 10.0 g of salt each time to give the cumulative mass M\\(_{i}\\) of salt as 20 g, 30g, 40g, and 50g.\nviii. In each case allow the mixture to boil steadily for at least 2 minutes then read and record the boiling point b. \nix. Tabulate your readings.\nx. Plot a graph with M\\(_{i}\\) on the vertical axis and \\(\\theta_{1}\\) on the horizontal axis.\nxi. Determine the slope, s, of the graph.\nxii. State two precautions taken to ensure accurate results.\n(b) i. Define the boiling point of a liquid.\nii. What effects do impurities have on the boiling point of a liquid?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59919?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "12",
    "text": "You are provided with cells, a potentiometer, an ammeter, a voltmeter, a bulb, a key, a jockey, and other necessary materials.\ni. Measure and record the e.m.f E of the battery.\nii. Set up a circuit as shown in the diagram above.\niii. Close the key K and use the jockey to make a firm.\niii. Contact at J on the potentiometer wire such that PJ = x= 10cm.\niv. Take and record the voltmeter reading V and the () Corresponding ammeter reading.\nv. Evalute log V and log I.\nvi. Repeat the procedure for five other values of x = 20 cm, 30 cm, 40 cm, 50 cm, and 60 cm.\nvii. Tabulate your readings.\nviii. Plot a graph with log I on the vertical axis and log V on the horizontal axis.\nix. Determine the slope s, of the graph.\nx. Determine the intercept, c, on the vertical axis.\nxi. State two precautions taken to ensure accurate results.\n(b)i. How is the brightness of the bulb affected as x increases?\nii. List two electrical devices whose actions do not obey Ohm's law.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59926?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  }
]