[
  {
    "number": "267",
    "text": "Your brother who is in the third year in another school has written to confide in you that he is about to stop schooling and go into business. Write a letter to him advising him against his decision.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59005?exam_type=waec&type=theory&page=54",
    "correct_answer": "3 Bella Crescent, Falana Iyana Ejigbo,                                                                                    Ejigbo, Lagos.\n25th September, 2020.\nDear Johnson,\nGood day Big bro, trust you are good, and everything is fine with you, if so, all glory be to God. I am also fine here, helping out with house chores and keeping mummy's business going. Big bro, i got an information about you dropping out of school, I thought it was a joke not until a friend of yours Confirmed it. Big bro, I actually don't know your reasons for wanting to do this but I must say it is not a good idea. First and foremost, you know the condition of mummy's health and her business, you are the reason she is striving hard through this business, just to help you go through school, making sure you come out strong. Please don t disappoint the family with this decision of yours. Secondly, you are aware of the situation of the economy, you passing out of school with a good grade gives you a good opportunity to get a better job and earning a good amount of money. It also connects you to the right people with the right mindset. Lastly, Big bro, remember you are my role model, what will yoú be expecting from me, if you do this. I actually look up to you, so please don't disappoint me. I believe in you, I know you to be strong, courageous, and that no matter what, you can scale through this. We are all praying for you and we believe God will see you through. Big bro, there are many reasons why you don't have to go on with this decision to stop schooling and go into business but with these points, I believe I can convince you enough not to scale through with it. Please note that if you go ahead with your dropping out of school, you will hurt mummy and make her health deteriorate the more, which might lead to something worse and I am sure you wont want that to happen to her, not after all her sufferings just to see you through school. I earnestly plead with you to rethink this decision of yours. Best wishes big brother. I do hope you heed to my advice even though it is coming from your younger brother. I want to believe that the next time I will get any information about this; it will be a positive one in order to put a smile on my face. I love you big bro, hope to hear from you soon.\nYours sincerely,\nUbong.",
    "explanation": "3 Bella Crescent, Falana Iyana Ejigbo,                                                                                    Ejigbo, Lagos.\n25th September, 2020.\nDear Johnson,\nGood day Big bro, trust you are good, and everything is fine with you, if so, all glory be to God. I am also fine here, helping out with house chores and keeping mummy's business going. Big bro, i got an information about you dropping out of school, I thought it was a joke not until a friend of yours Confirmed it. Big bro, I actually don't know your reasons for wanting to do this but I must say it is not a good idea. First and foremost, you know the condition of mummy's health and her business, you are the reason she is striving hard through this business, just to help you go through school, making sure you come out strong. Please don t disappoint the family with this decision of yours. Secondly, you are aware of the situation of the economy, you passing out of school with a good grade gives you a good opportunity to get a better job and earning a good amount of money. It also connects you to the right people with the right mindset. Lastly, Big bro, remember you are my role model, what will yoú be expecting from me, if you do this. I actually look up to you, so please don't disappoint me. I believe in you, I know you to be strong, courageous, and that no matter what, you can scale through this. We are all praying for you and we believe God will see you through. Big bro, there are many reasons why you don't have to go on with this decision to stop schooling and go into business but with these points, I believe I can convince you enough not to scale through with it. Please note that if you go ahead with your dropping out of school, you will hurt mummy and make her health deteriorate the more, which might lead to something worse and I am sure you wont want that to happen to her, not after all her sufferings just to see you through school. I earnestly plead with you to rethink this decision of yours. Best wishes big brother. I do hope you heed to my advice even though it is coming from your younger brother. I want to believe that the next time I will get any information about this; it will be a positive one in order to put a smile on my face. I love you big bro, hope to hear from you soon.\nYours sincerely,\nUbong.",
    "year": "2020"
  },
  {
    "number": "268",
    "text": "Write an article suitable for publication in a national newspaper on the topic: The importance of Promoting Good Reading Habits in Students.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59007?exam_type=waec&type=theory&page=54",
    "correct_answer": "THE IMPORTANCE OF PROMOTING GOOD READING HABITS IN STUDENTSReading is one of the most fundamental skills a child needs to know and learn to succeed in life. Developing good reading habit is vital to your child's future not just academically but in everyday life. The practice of good reading helps in building the personality of a student which includes; helping the student differentiate between facts and opinion, understand situations and their effects which gives him access to a good stock of vocabulary: Good reading habits make the students confident as well as develop their communication skills which in turn improve their moral and ethical knowledge. Inspirational purpose is another reason why reading habits should be promoted. Teachers and parents might not be able to get all the opportunities to encourage and inspire students, but books can. All that the teachers and parents need to do, is promote reading habits among these students and off they go. There are a lot of encouraging and inspiring books such as the 'gifted hands; think big, and so on which are written by the famous neurosurgeon, Dr. Ben Carson. And when reading such books are promoted among students, even the sky would not be their limit. It is very importance to promote good reading habits in students because reading can also help and prepare them for the broader aspect of life. Also, good reading habits help students score well on both internal and external examinations and this of course brings about excellent grades. Furthermore, reading can also make students know more about themselves and cherish who they are and who they could be in future. Books such as 'temperament and you and why you act the way you do teach about temperament and the strength and weaknesses of these temperaments. These books and various other kinds of books like these, assist students in discovering their strengths and weaknesses and how to manage them. And all these can only be achieved by promoting good reading habits among students. Conclusively, reading habits in students can be promoted by creating reading friendly environments both in schools and at home and engaging students and discussing topics on whatever they have read. To effectively conclude, it iS said \"A good reader becomes an excellent speaker and a good writer as well.",
    "explanation": "THE IMPORTANCE OF PROMOTING GOOD READING HABITS IN STUDENTSReading is one of the most fundamental skills a child needs to know and learn to succeed in life. Developing good reading habit is vital to your child's future not just academically but in everyday life. The practice of good reading helps in building the personality of a student which includes; helping the student differentiate between facts and opinion, understand situations and their effects which gives him access to a good stock of vocabulary: Good reading habits make the students confident as well as develop their communication skills which in turn improve their moral and ethical knowledge. Inspirational purpose is another reason why reading habits should be promoted. Teachers and parents might not be able to get all the opportunities to encourage and inspire students, but books can. All that the teachers and parents need to do, is promote reading habits among these students and off they go. There are a lot of encouraging and inspiring books such as the 'gifted hands; think big, and so on which are written by the famous neurosurgeon, Dr. Ben Carson. And when reading such books are promoted among students, even the sky would not be their limit. It is very importance to promote good reading habits in students because reading can also help and prepare them for the broader aspect of life. Also, good reading habits help students score well on both internal and external examinations and this of course brings about excellent grades. Furthermore, reading can also make students know more about themselves and cherish who they are and who they could be in future. Books such as 'temperament and you and why you act the way you do teach about temperament and the strength and weaknesses of these temperaments. These books and various other kinds of books like these, assist students in discovering their strengths and weaknesses and how to manage them. And all these can only be achieved by promoting good reading habits among students. Conclusively, reading habits in students can be promoted by creating reading friendly environments both in schools and at home and engaging students and discussing topics on whatever they have read. To effectively conclude, it iS said \"A good reader becomes an excellent speaker and a good writer as well.",
    "year": "2020"
  },
  {
    "number": "269",
    "text": "As the Senior Prefect of your school, write a letter to the Principal pointing out at least two practices among students that should be discouraged and two habits that should be promoted among teachers.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59016?exam_type=waec&type=theory&page=54",
    "correct_answer": "Community Senior High School,Tafawa Balewa,P.M.B 1180,25th September, 2020.\nThe Principal,Community Senior High School,Alausa Ikeja,Lagos.\nDear sir,\nOPINION ON SOME PRACTICES AMONG STUDENTS THAT SHOULD BE DISCOURAGED AND HABITS AMONG TEACHERS THAT SHOULD BE PROMOTED.I wish to heartily appreciate you sir, on your selflessness, high manner of responsibility and. humility as the principal of air esteemed school. In addition, I also want to congratulate you on being a great leader and good example to the teachers and students of this school.I want to bring to your notice some practices among students that should be discouraged and habits that should be promoted among the teachers so as to provide a better learning environment.These practices among the students are negative and do not speak well of our school. One of these negative practices is gambling. Students engage in gambling which place them at a risk of being unfocused on their studies. Also, it places them at a risk of losing their feeding allowances because they have to stake bets with the only money on them and thereby when they lose such bets, they are left to go hungry. These gambling activities have more often than not led to outbreaks of arguments and fights among the students. More importantly, this practice does not encourage students to be more responsible but instead be careless and reckless.Therefore, I would like to suggest that this practice of gambling be discouraged and terminated by setting in place rules and regulations that will guide against gambling and also enforce suitable punishments for any student caught in the act.Another negative practice which has been embraced by the students in recent times is examination malpractices. This of course is a dishonest and wrong way to achieve good and excellent grades. Students who engage in this practice are likely not to pay attention in class nor read their books and prepare adequately for examinations because they believe they can smuggle their notebooks, textbooks or any foreign material into the examination hall.This encourages laziness and unseriousness in students and I would like to suggest that more examination rules and regulations be set; for example students should be thoroughly searched before allowed to come into the examination hall and adequate number of examination invigilators be placed in the hails too.Our teachers are very hardworking and also very committed to teaching and this is very commendable. I, on behalf of other students of this prestigious school, hope that these habits are promoted more and more in our teachers. We hope for more teachers who take their time to teach to the understanding of their students and teachers who engage more with their students.In conclusion, I would like to thank you for the time taken to read through this letter and earnestly hope that necessary steps be taken to put an end to negative practices exhibited among the students and the promotion of positive habits among the teachers.\nYours faithfullyMBA, OLUCHI MARY",
    "explanation": "Community Senior High School,Tafawa Balewa,P.M.B 1180,25th September, 2020.\nThe Principal,Community Senior High School,Alausa Ikeja,Lagos.\nDear sir,\nOPINION ON SOME PRACTICES AMONG STUDENTS THAT SHOULD BE DISCOURAGED AND HABITS AMONG TEACHERS THAT SHOULD BE PROMOTED.I wish to heartily appreciate you sir, on your selflessness, high manner of responsibility and. humility as the principal of air esteemed school. In addition, I also want to congratulate you on being a great leader and good example to the teachers and students of this school.I want to bring to your notice some practices among students that should be discouraged and habits that should be promoted among the teachers so as to provide a better learning environment.These practices among the students are negative and do not speak well of our school. One of these negative practices is gambling. Students engage in gambling which place them at a risk of being unfocused on their studies. Also, it places them at a risk of losing their feeding allowances because they have to stake bets with the only money on them and thereby when they lose such bets, they are left to go hungry. These gambling activities have more often than not led to outbreaks of arguments and fights among the students. More importantly, this practice does not encourage students to be more responsible but instead be careless and reckless.Therefore, I would like to suggest that this practice of gambling be discouraged and terminated by setting in place rules and regulations that will guide against gambling and also enforce suitable punishments for any student caught in the act.Another negative practice which has been embraced by the students in recent times is examination malpractices. This of course is a dishonest and wrong way to achieve good and excellent grades. Students who engage in this practice are likely not to pay attention in class nor read their books and prepare adequately for examinations because they believe they can smuggle their notebooks, textbooks or any foreign material into the examination hall.This encourages laziness and unseriousness in students and I would like to suggest that more examination rules and regulations be set; for example students should be thoroughly searched before allowed to come into the examination hall and adequate number of examination invigilators be placed in the hails too.Our teachers are very hardworking and also very committed to teaching and this is very commendable. I, on behalf of other students of this prestigious school, hope that these habits are promoted more and more in our teachers. We hope for more teachers who take their time to teach to the understanding of their students and teachers who engage more with their students.In conclusion, I would like to thank you for the time taken to read through this letter and earnestly hope that necessary steps be taken to put an end to negative practices exhibited among the students and the promotion of positive habits among the teachers.\nYours faithfullyMBA, OLUCHI MARY",
    "year": "2020"
  },
  {
    "number": "270",
    "text": "A new Principal has been posted to your school. Write a speech you will deliver at the welcome party organised for him informing him about some problems faced by students.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59018?exam_type=waec&type=theory&page=54",
    "correct_answer": "THE PROBLEMS FACED BY STUDENTSA warm welcome and hearty good morning to this gathering. I, Badmus Samson Boluwatife, on behalf of the entire administration and student body, wholeheartedly welcome you Ma to Daystar High School. It is an honour to have a Personality like you as our Principal. We are delighted and privileged to have such a wonderful and highly experienced Woman of valour lead us to greater heights. We hope that with your leadership, energy, enthusiasm and passion for education and learning, our school will achieve greater excellence.However, it is paramount to notify you ma, of some major shortcomings and inadequacies in the school which are detrimental to conducive and quality learning. These include but not limited to absence of a standard and well equipped library and computer laboratory, lack of competent teachers, unhygienic toilet facilities and poor waste disposal and management.The current structure and availability of study materials in the school library is a major concern in promoting quality learning. This is also the situation of the school's computer laboratory. There. is need for restructuring and provision of relevant materials and equipment to improve the standard and quality of learning.The school is also in dire need of adequate and competent teachers. Without these hardworking and competent teachers, the school is not complete. The school runs short of necessary subject teachers for government, financial accounting and chemistry. We earnestly ask that you see to the employment of standard, qualified and competent teachers.Furthermore, there is a pressing and urgent need for conducive and hygienic learning environment.The situation of the school toilet facilities require immediate attention. I would like to suggest that new structure should be built and the existing ones should be repaired. Moreover, more waste baskets and waste disposal facilities should be provided all around the school premises so as to provide a clean learning environment and to avoid the students and staff room falling ill. This in turn promotes high level of productivity and progress.I would like to add that students be allowed to engage in extra-curricular activities like sports, school clubs; jet clubs arts club, drama club and so on. These add to the experience and skills of the student other than the day-to-day classroom learning.Conclusively, the aforementioned are the key problems within the school that require immediate and quality solutions, The entire student body look forward to great improvement with your intervention. |We welcome you again to Daystar High School. We wish you a hitch-free journey in leading and piloting the affairs of the school.Congratulations!!Welcome Ma!!!THANK YOU!",
    "explanation": "THE PROBLEMS FACED BY STUDENTSA warm welcome and hearty good morning to this gathering. I, Badmus Samson Boluwatife, on behalf of the entire administration and student body, wholeheartedly welcome you Ma to Daystar High School. It is an honour to have a Personality like you as our Principal. We are delighted and privileged to have such a wonderful and highly experienced Woman of valour lead us to greater heights. We hope that with your leadership, energy, enthusiasm and passion for education and learning, our school will achieve greater excellence.However, it is paramount to notify you ma, of some major shortcomings and inadequacies in the school which are detrimental to conducive and quality learning. These include but not limited to absence of a standard and well equipped library and computer laboratory, lack of competent teachers, unhygienic toilet facilities and poor waste disposal and management.The current structure and availability of study materials in the school library is a major concern in promoting quality learning. This is also the situation of the school's computer laboratory. There. is need for restructuring and provision of relevant materials and equipment to improve the standard and quality of learning.The school is also in dire need of adequate and competent teachers. Without these hardworking and competent teachers, the school is not complete. The school runs short of necessary subject teachers for government, financial accounting and chemistry. We earnestly ask that you see to the employment of standard, qualified and competent teachers.Furthermore, there is a pressing and urgent need for conducive and hygienic learning environment.The situation of the school toilet facilities require immediate attention. I would like to suggest that new structure should be built and the existing ones should be repaired. Moreover, more waste baskets and waste disposal facilities should be provided all around the school premises so as to provide a clean learning environment and to avoid the students and staff room falling ill. This in turn promotes high level of productivity and progress.I would like to add that students be allowed to engage in extra-curricular activities like sports, school clubs; jet clubs arts club, drama club and so on. These add to the experience and skills of the student other than the day-to-day classroom learning.Conclusively, the aforementioned are the key problems within the school that require immediate and quality solutions, The entire student body look forward to great improvement with your intervention. |We welcome you again to Daystar High School. We wish you a hitch-free journey in leading and piloting the affairs of the school.Congratulations!!Welcome Ma!!!THANK YOU!",
    "year": "2020"
  },
  {
    "number": "271",
    "text": "Write a story that ends with the statement: I had never felt so embarrassed in my life.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59020?exam_type=waec&type=theory&page=55",
    "correct_answer": "ARROGANCESomewhere in Lagos, lived a high school student, Ayodeji Richards popularly known as AY. He attended Modes College and he was the labour prefect and also the class captain of his class.The tall, dark and handsome boy was always the talk of the school. Not only was he handsome, he was also intelligent and very active. He was on the football team of the school as well as the debate team and jet club, AY was loved and praised by every teacher in the school; they would always use him as an example and say \"be like AyOdeji Richards he is so intelligent and respectful or \"Ayodeji Richards, the boy with the perfect grades right from J.s.S.I but of course his classmates and peers did not like him for he was so proud and arrogant.Ayodeji Would always go about boasting to those who weren't as intelligent as he was. He did not have so many friends as no one wanted to be his friend even though he had all they wished for but because he had such a pompous attitude and would often demean others, they steered clear of him. His only friends were Emeka Eze, Tunde Ajayi and Qudus Jimoh and they nicknamed themselves \"the bigger boys\".AY and his friends would bully other.students and threaten to beat them up if they ever reported and so he was feared by his fellow classmates and junior students. Nobody could muster up the courage to report him and his friends hence he continued to be an angel in the eyes of his teachers.These bigger boys indulged in negative activities such as gambling, bullying, drinking and wild partying, but with all of these, Ayodeji still kept his excellent grades but the opposite was to be said about Ayi's friends, they were more concerned with keeping their popularity than focusing on their studies.Their final examinations WASSCE were approaching and Avodeji not wanting to have any grade lower than \"A\" started preparing but his friends Emeka, Tunde and Qudus would always laugh and call Ayodeji too serious\". Ayodeji not wanting to lose the respect of these friends as he was the leader of their small gang would stop reading and join his friends in whatever new activities they found to do. Well. Ayodeji would always say to him self, \"l am intelligent and I have always had good grades so a little playing here and there will not bring me down\".The examinations arrived and all was going well until Ayodeji got carried away and decided to attend a party with his friends just a day before his last examination which was geography. He partied all through the night and thus did not get the chance to revise his books before his examination which was to hold by 12.00pm. Ayodeji not wanting to have any grade lower than 'A' decided to sneak into the examination hall with a foreign material where he wrote down answers on. Unfortunately, while he was too distracted copying from the paper, he was caught by the external invigilator. He was made to fill an examination malpractice form and he was brought out on the assembly ground that afternoon and flogged in front of all the students. He lost all respect in the eyes of all his teachers. He was so ashamed; and humiliated. 'Ihad never felt so embarrassed in my life' says Mr. Ayodeji as he coneluded his story.",
    "explanation": "ARROGANCESomewhere in Lagos, lived a high school student, Ayodeji Richards popularly known as AY. He attended Modes College and he was the labour prefect and also the class captain of his class.The tall, dark and handsome boy was always the talk of the school. Not only was he handsome, he was also intelligent and very active. He was on the football team of the school as well as the debate team and jet club, AY was loved and praised by every teacher in the school; they would always use him as an example and say \"be like AyOdeji Richards he is so intelligent and respectful or \"Ayodeji Richards, the boy with the perfect grades right from J.s.S.I but of course his classmates and peers did not like him for he was so proud and arrogant.Ayodeji Would always go about boasting to those who weren't as intelligent as he was. He did not have so many friends as no one wanted to be his friend even though he had all they wished for but because he had such a pompous attitude and would often demean others, they steered clear of him. His only friends were Emeka Eze, Tunde Ajayi and Qudus Jimoh and they nicknamed themselves \"the bigger boys\".AY and his friends would bully other.students and threaten to beat them up if they ever reported and so he was feared by his fellow classmates and junior students. Nobody could muster up the courage to report him and his friends hence he continued to be an angel in the eyes of his teachers.These bigger boys indulged in negative activities such as gambling, bullying, drinking and wild partying, but with all of these, Ayodeji still kept his excellent grades but the opposite was to be said about Ayi's friends, they were more concerned with keeping their popularity than focusing on their studies.Their final examinations WASSCE were approaching and Avodeji not wanting to have any grade lower than \"A\" started preparing but his friends Emeka, Tunde and Qudus would always laugh and call Ayodeji too serious\". Ayodeji not wanting to lose the respect of these friends as he was the leader of their small gang would stop reading and join his friends in whatever new activities they found to do. Well. Ayodeji would always say to him self, \"l am intelligent and I have always had good grades so a little playing here and there will not bring me down\".The examinations arrived and all was going well until Ayodeji got carried away and decided to attend a party with his friends just a day before his last examination which was geography. He partied all through the night and thus did not get the chance to revise his books before his examination which was to hold by 12.00pm. Ayodeji not wanting to have any grade lower than 'A' decided to sneak into the examination hall with a foreign material where he wrote down answers on. Unfortunately, while he was too distracted copying from the paper, he was caught by the external invigilator. He was made to fill an examination malpractice form and he was brought out on the assembly ground that afternoon and flogged in front of all the students. He lost all respect in the eyes of all his teachers. He was so ashamed; and humiliated. 'Ihad never felt so embarrassed in my life' says Mr. Ayodeji as he coneluded his story.",
    "year": "2020"
  },
  {
    "number": "272",
    "text": "(a) Why did the writer's mother never inform her children of her intention to visit them?\n(b) How did Mama while away the hours on the journey?\n(c) State two difficulties Mama faced when she arrived Lagos.\n(d) Why did the taxi driver leave with one of Mama's bags?\n(e) Why do you think that Mama will never forget what she had for dinner?\n(f)... Who was also going to see her son in Lagos... (i) What grammatical name is given to this expression as it is used In the passage? (ii) What is its function?\n(g)... seemed like an eternity... What does this expression mean'?\n(h) What lesson did Mama learn from this trip? (i) For each of the following words, find another word or phrase which means the Same and which can replace it as it is ed in the passage: (i) unimaginable; (ii) heartily; (iii) outrageous; (iv) numerous; (v) frantically; (vi) fraudulent.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59029?exam_type=waec&type=theory&page=55",
    "correct_answer": "(a) She thought she would always meet a member of the family at home. OR She knew she would always be welcome by members of the family.(b) She chatted heartily with a passenger in the bus.(C)(i) Mama did not meet any member of the family at home. (ii) She did not have enough money for the taxi fare. (iii) She could not communicate effectively with the watchman.(d) The taxi driver left with one of mama's bags because she was unable to pay the complete fare.(e) The meal was not one she usually took OR Mama was not used to the meal.(f)(i) Adjectival clause or relative clause (ii) lt qualifies the noun \"passenger\"(g)it means, appeared to be a very long time.(h) She learnt that she should inform her children before visiting. (i) Unimaginable - unbelievable, unthinkable, inconceivable. (ii) Heartily - warmly, happily, excitedly, spiritedly, enthusiastically. (iii) Outrageous -very high, exorbitant, too much, ridiculous, unreasonable, excessive. (ív) Numerous - countless, many, very -countless, many, very much, frequent. (v) Frantically - very hard, earnestly, seriously, desperately, with much effort. (vi) Fraudulent - crooked, dubious, deceitful, dishonest.",
    "explanation": "(a) She thought she would always meet a member of the family at home. OR She knew she would always be welcome by members of the family.(b) She chatted heartily with a passenger in the bus.(C)(i) Mama did not meet any member of the family at home. (ii) She did not have enough money for the taxi fare. (iii) She could not communicate effectively with the watchman.(d) The taxi driver left with one of mama's bags because she was unable to pay the complete fare.(e) The meal was not one she usually took OR Mama was not used to the meal.(f)(i) Adjectival clause or relative clause (ii) lt qualifies the noun \"passenger\"(g)it means, appeared to be a very long time.(h) She learnt that she should inform her children before visiting. (i) Unimaginable - unbelievable, unthinkable, inconceivable. (ii) Heartily - warmly, happily, excitedly, spiritedly, enthusiastically. (iii) Outrageous -very high, exorbitant, too much, ridiculous, unreasonable, excessive. (ív) Numerous - countless, many, very -countless, many, very much, frequent. (v) Frantically - very hard, earnestly, seriously, desperately, with much effort. (vi) Fraudulent - crooked, dubious, deceitful, dishonest.",
    "year": "2020"
  },
  {
    "number": "273",
    "text": "(a) In three sentences, one for each, state three benefits derived from forests.\n(b) In three sentences, one for each, state three measures to control deforestation.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/59034?exam_type=waec&type=theory&page=55",
    "correct_answer": "(a)(i) Forests protect lands against erosion. (ii) Forests provide wood used for building shelters. (iii) Wood got from forests is used in the production of paper. (iv) Forests provide food for man and animals.(b)(i) Laws mandating tree planting must be enacted and enforced. (ii) Everyone must endeavor to go paperless. (iii) Government must create forest reserves and protect them.",
    "explanation": "(a)(i) Forests protect lands against erosion. (ii) Forests provide wood used for building shelters. (iii) Wood got from forests is used in the production of paper. (iv) Forests provide food for man and animals.(b)(i) Laws mandating tree planting must be enacted and enforced. (ii) Everyone must endeavor to go paperless. (iii) Government must create forest reserves and protect them.",
    "year": "2020"
  }
]