[
  {
    "number": "1",
    "text": "Dáhủn ibéerė méta péré nínú ipín yi\n \nA. Láibiri iioba ibílè mi \nB. Ibi lseré kan tí mo lo ní odún tí ó koja\nC. Iwa ibàjé\nD. Èdè Gèési gbayi iu èdè abínibí lo",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72494?exam_type=waec&type=theory",
    "correct_answer": "A. Láibiri iioba ibílè mi(a) ifáàrà - rò àkóso tó bá orí-or mu, b.a. ohun tí láibiri jé.(b) Kókó-orò: (i) Orúkọ lábiri náà (ii) İlú àtí àdúgbò tí láíbiri náà wà (iii) Orúkọ ijoba ibílè àti ipínlè tí ó wà (iv) Apèjíwe bí àyíká rè şe rí (v) Āpėjúwe bí inú rè şe rí (vi) AWon òşişé láíbiri náà (vi) Awon tí ó ń lò ó. (viii) Irú àwọn iwé atiohun ikékoó tí ó wả nínú láíbiri náà, b.a. bíbá igbà mu, bí wón s pò sí, oríşiríşi èka-èkó tí láíbiri kó jọ, abbl. (ix) Bí wón se to oríşiríşi àwọn iwé atiohui ikékòó inú rệ. (x) Āwon òfin tí ó de lilo rè, b.a. iwoléjáde ijókòókàwé, wiwà ní idákéróró, şíşe imótót nínú rè, dídá iwé tí a yá padà lásikò, abbl. (xi) Bí ijoba şe ń se àmójútó láíbiri náà. (xii) İhà ti aşèdánwò kọ sí láíbiri náà, b.a gbígba àwon òşisé, :pípèsè iwé, àga, tábil şíşe àtúnşe tíó yẹ, abbl. (d) İgúnlệ - orò ikádií tí ó bá orí-orò mi b.a. imòràn aşèdánwò fún ilosíwájú láíbi náà.B. Ibi lseré kan tí mo lo ní odún tí ó koja(a) ifáàrà -orò àkóso tó bá orí-orò mu, b. ohun tí ibi işeré ję. (b) Kókó-òro: (1) orúko ibi işeré náà (ii) ilú tí ibif işeré náà wà (ii) îdí tí aşèdánwò fi lo sí ibè (iv) àwon tiwon jo lo sí ibệ (v) ipalèmó tỉ wón se láti lọ sí ibệ, irú oúnje wón sè, aşo tí wón wỳ, abbl. (vi) irúfé okò tiwon wỳ dé ibệ (vii) bí àyíká ibè şe rf (viil) oríşiríşi àwon ohun iseré tí ó wà níbè (bo) ètò gbígba-ni-wolé sí ibè (x) àwon ohun mánigbàgbé tí 6 selè lójó ná (xi) ipa tí asèdánwò kó níbè lójó náà (xi) bí wón se padà silé láti ibi şeré náà(d) Igúnlệ – Ôrò ikádií tí ó bá ori-orġ m b.a. ihà tí aşèdánwò kọ sí irírí rè lójó náa.C. Iwa ibàjé(a)ifaara - Oro akoso ti o bá ori-oro mu, B.a. orlsll wà: rere ati búburú/ètó àti àito (b) Kókó-oro: (i) iwà kòtó ni a tún pè nf wà ibàjé (ii) àpeere orisi wà bàjé tí eniyàn lè hù: mågòmágó sise ninú ldánwo, kikỏ owó ilủ je, siso orò lú di t ara eni, ibánilòpò lónà ảitó, 1lo ipò agbára láti fi yà jeni, ijinigbé, pipani f şètütù olà, owó èyin/gbigbà ribá, olè jjà, ipåniyàn,, ole síse, imélé sişe, iró pipa, òfófó şise, àişe ojúse àbí lórí àwon omo, obùn şise, abbl. (iii) osé tí iwà ibàjé ń se ní àwùio wa: - àisí ifokan-tán-ara-eni mó - pipa iná èri-okàn èniyàn - fifi iyà je aláişè - kíkó ipayà/àibalè-okàn bá àwùjo nípasè àwọn jànhdùkú/omọ asunta, abbl. (iv) ònà àbáyo sí àwon iwà ibàjé náà: kí àwon òbí máa sa ipá wọn láti tojú àwon omo won kí àwon òbí máa bí iwònba omo tí wón è tójú dáadáa kí àwon òbí máa hu iwà rere tó lè jé àwòkóşe fún àwon omo gbígbé oríyin fún àwọn tí ó ń hu iwà rere ní àwùjo didójú ti àwọn tí ó ń hu iwà àitó ní àwůjo. Kí àwon aláşę máa şe ojúşe won fún igbáyégbádùn àwọn ará ilú.(d) Igúnlè - orọ ikádií tí ó bá orí-orò mu, b.a. ilosiwájú tí 6 lè bá àwùjo wa bí a bá gbogun ti iwà ibàjé.D. Èdè Gèési gbayi iu èdè abínibí lo(a) Iráàrà - Orò àkóso tí ó bá orforò mu, b.a. pàtàki èdè ní àwùjo omọniyàn (b) Kókó-òrò: A. Béè ni: Èdè Gèési qbayi iu èdè abínibí l (i) Edè Gèési jé èdè tí opòlopò èniyàn ń mú lò ní àwùjg (ii) BÍ èniyàn bá mgpèdè Gèési í lò dáadáa, ó lè tèțè rí işé gidi şe (iii) dandan ni láti yege nínú idánwò èdè Gèési kí èniyàn tó lè ní ànfààní láti lọ sí ilế- èkó gíga, påápåá ní àwùjo wa (iv) edè Geési jé òkan lára àwọn èdè àgbáyé i èniyàn lè mú lò láti bá àwọn ęlệdè miràn sorò (v) òun ni ó şe itéwógbà jù lọ ní gbogbo ilé- işé ijoba ní àwůjo wa (vi) èdè kárá-kátà kárí ayé ni (vi) gbígbỏ èdè Gèési ń fúnni ní àhfààní láti mọ işèlè tí ó ń lo níàgbáyé. SÙGBÓN (i) àjèji/àjòji lè kó sí páńpé àwon èniyàn ilú kan bí kò bá gbó èdè abínibí àdúgbò náà (ii) kì í şe èdè tí a lè fi şe òdiwòn bí èniyàn se gbón tó(B) Béè kó: Èdè abínibí gbayi ju èdè Gèési lo (i) èdè abínibí wúlò tó béè tí àwon àjèji/àjòji fi ń kó o (ii) èdè abínibí jé opákůtèlè fún àşà àti işe, b.a. iwà omọlúàbi/ rere, iwỌSQ, oúnję jię, èsin, igbàgbó, abbl. (iii) ó máa ń şe igbélárugę ibáşepò tí ó dán mòràn láàrin àwon elédè (iv) a máa ń lò ó gégé bí èdè àşírí láàrin àwọn elédè (v) kò sí ohun tí wón ń fi èdè Gèési şe tí èniyàn kò lè fi èdè abínibí şe (vi) èdè abínibí máa ń jé í èniyàn lè ronú jinlè láti mú èrò tuntun jáde tàbí láti şe àwárí imò tuntun (vii) ó dára fún itànkáè iròyìn fún idàgbàsókè àwùjo (viii) ó wúò fún kárà-kátà láàrin àwon tó nílò rè.'ŞÜGBÓN'(i) kì í şe èdè tó kárí ayé bíi èdè Gèési. (d) gúnlệ - Orò ikádií tí ó bá ibi tí aşèdánwò fi sí mu*Àkíyèsí: Aşèdánwò tí ó bá rólé apá kan, orí eéfà (6) ni a 6 gbé èrò rè lé.E. Létà sí àbúrò rè láti so àwon ipèníjà tí ó wà nínú lílo èro-ibánisorò alágbèékà àti ònà àbáyo sí àwon pèníià náà,Létà gbèfé ni èyí:(a) Àdirési akolétà àti déèti (b) İkíni ibèrè, b.a. àbúrò mi (owón/tòótó) (d) Kókó-létà: (i) àlàyé şókí lórí èro ibánisòrò alágbèékà àti iwúò rè (ii) àwọn ipèníjà tí ó wà nínú lilo èro ibánisòrò alágbèékà(a) şíşe àfarawé tí ó lè kó báni (b) kíkó sówó gbájú-ė/onijibiti orí aféfé (d) àşilò rệ lè şokùnfà àilera, ijàňbá, tàbí ikú òjýi nípasè şíşe ifàmóra agbára iná (e) àşilò rệ níoju pópó lè fa ijàhbá ńlá tàbí ikú òjiji (e) ó fàyè gba iwà àisòdodo láàrin àwon tó ń lò ó (f) ó ní gbàgede àti-kóni-ní-èkó-òdi (g) o fi ayè gba fífi àkókò ara eni şòfò\n(gb) ó fi àyề gba síso òrò sí agbòn/titú àşírí láirò-télè, èyí si máa ń fa yánpọnyánrin (ii) onà àbắyọ sí ipènijà tí ó wà nínú lílo èrọ ibánisòr ni:\nŞíşe igbéláruge iwà ikóra-eni-ní-ijanu láti òdo- eni kòòkan- òbí sí omọ- ilé-èkó sí akékòó- àwọn aláşę sí àwon ará ilú (e) İkíni iparí (e) Orúko akolětà (6 lè kún, ó si lè má kún). (a) Kóńsónáhti àránmúpè aşesilébů ni kóńsónáhtì tí ó máa ń dúró gégé. bí silébù nínú orò Yorůbá. Ở máa ń ní ohùn gệgé i fáwèli. (b) Àkosílę orỳ méjilá otòòtò tí ó ní kóńsónáħtì àránmúpè aşesílébů:i. gònbóii. òronbóiii. gbangbaiv. dùndúv. péńpévi. konkovii. dáńfóviil. géńdéix. bínńtínX. pàntíxi. ògòngòxi. ànjoonúxii. ònwòranXİv, rentiXv. ipáħleXvi. Bángbóşéxvii. panlaxviii. Kànkà",
    "explanation": "A. Láibiri iioba ibílè mi(a) ifáàrà - rò àkóso tó bá orí-or mu, b.a. ohun tí láibiri jé.(b) Kókó-orò: (i) Orúkọ lábiri náà (ii) İlú àtí àdúgbò tí láíbiri náà wà (iii) Orúkọ ijoba ibílè àti ipínlè tí ó wà (iv) Apèjíwe bí àyíká rè şe rí (v) Āpėjúwe bí inú rè şe rí (vi) AWon òşişé láíbiri náà (vi) Awon tí ó ń lò ó. (viii) Irú àwọn iwé atiohun ikékoó tí ó wả nínú láíbiri náà, b.a. bíbá igbà mu, bí wón s pò sí, oríşiríşi èka-èkó tí láíbiri kó jọ, abbl. (ix) Bí wón se to oríşiríşi àwọn iwé atiohui ikékòó inú rệ. (x) Āwon òfin tí ó de lilo rè, b.a. iwoléjáde ijókòókàwé, wiwà ní idákéróró, şíşe imótót nínú rè, dídá iwé tí a yá padà lásikò, abbl. (xi) Bí ijoba şe ń se àmójútó láíbiri náà. (xii) İhà ti aşèdánwò kọ sí láíbiri náà, b.a gbígba àwon òşisé, :pípèsè iwé, àga, tábil şíşe àtúnşe tíó yẹ, abbl. (d) İgúnlệ - orò ikádií tí ó bá orí-orò mi b.a. imòràn aşèdánwò fún ilosíwájú láíbi náà.B. Ibi lseré kan tí mo lo ní odún tí ó koja(a) ifáàrà -orò àkóso tó bá orí-orò mu, b. ohun tí ibi işeré ję. (b) Kókó-òro: (1) orúko ibi işeré náà (ii) ilú tí ibif işeré náà wà (ii) îdí tí aşèdánwò fi lo sí ibè (iv) àwon tiwon jo lo sí ibệ (v) ipalèmó tỉ wón se láti lọ sí ibệ, irú oúnje wón sè, aşo tí wón wỳ, abbl. (vi) irúfé okò tiwon wỳ dé ibệ (vii) bí àyíká ibè şe rf (viil) oríşiríşi àwon ohun iseré tí ó wà níbè (bo) ètò gbígba-ni-wolé sí ibè (x) àwon ohun mánigbàgbé tí 6 selè lójó ná (xi) ipa tí asèdánwò kó níbè lójó náà (xi) bí wón se padà silé láti ibi şeré náà(d) Igúnlệ – Ôrò ikádií tí ó bá ori-orġ m b.a. ihà tí aşèdánwò kọ sí irírí rè lójó náa.C. Iwa ibàjé(a)ifaara - Oro akoso ti o bá ori-oro mu, B.a. orlsll wà: rere ati búburú/ètó àti àito (b) Kókó-oro: (i) iwà kòtó ni a tún pè nf wà ibàjé (ii) àpeere orisi wà bàjé tí eniyàn lè hù: mågòmágó sise ninú ldánwo, kikỏ owó ilủ je, siso orò lú di t ara eni, ibánilòpò lónà ảitó, 1lo ipò agbára láti fi yà jeni, ijinigbé, pipani f şètütù olà, owó èyin/gbigbà ribá, olè jjà, ipåniyàn,, ole síse, imélé sişe, iró pipa, òfófó şise, àişe ojúse àbí lórí àwon omo, obùn şise, abbl. (iii) osé tí iwà ibàjé ń se ní àwùio wa: - àisí ifokan-tán-ara-eni mó - pipa iná èri-okàn èniyàn - fifi iyà je aláişè - kíkó ipayà/àibalè-okàn bá àwùjo nípasè àwọn jànhdùkú/omọ asunta, abbl. (iv) ònà àbáyo sí àwon iwà ibàjé náà: kí àwon òbí máa sa ipá wọn láti tojú àwon omo won kí àwon òbí máa bí iwònba omo tí wón è tójú dáadáa kí àwon òbí máa hu iwà rere tó lè jé àwòkóşe fún àwon omo gbígbé oríyin fún àwọn tí ó ń hu iwà rere ní àwùjo didójú ti àwọn tí ó ń hu iwà àitó ní àwůjo. Kí àwon aláşę máa şe ojúşe won fún igbáyégbádùn àwọn ará ilú.(d) Igúnlè - orọ ikádií tí ó bá orí-orò mu, b.a. ilosiwájú tí 6 lè bá àwùjo wa bí a bá gbogun ti iwà ibàjé.D. Èdè Gèési gbayi iu èdè abínibí lo(a) Iráàrà - Orò àkóso tí ó bá orforò mu, b.a. pàtàki èdè ní àwùjo omọniyàn (b) Kókó-òrò: A. Béè ni: Èdè Gèési qbayi iu èdè abínibí l (i) Edè Gèési jé èdè tí opòlopò èniyàn ń mú lò ní àwùjg (ii) BÍ èniyàn bá mgpèdè Gèési í lò dáadáa, ó lè tèțè rí işé gidi şe (iii) dandan ni láti yege nínú idánwò èdè Gèési kí èniyàn tó lè ní ànfààní láti lọ sí ilế- èkó gíga, påápåá ní àwùjo wa (iv) edè Geési jé òkan lára àwọn èdè àgbáyé i èniyàn lè mú lò láti bá àwọn ęlệdè miràn sorò (v) òun ni ó şe itéwógbà jù lọ ní gbogbo ilé- işé ijoba ní àwůjo wa (vi) èdè kárá-kátà kárí ayé ni (vi) gbígbỏ èdè Gèési ń fúnni ní àhfààní láti mọ işèlè tí ó ń lo níàgbáyé. SÙGBÓN (i) àjèji/àjòji lè kó sí páńpé àwon èniyàn ilú kan bí kò bá gbó èdè abínibí àdúgbò náà (ii) kì í şe èdè tí a lè fi şe òdiwòn bí èniyàn se gbón tó(B) Béè kó: Èdè abínibí gbayi ju èdè Gèési lo (i) èdè abínibí wúlò tó béè tí àwon àjèji/àjòji fi ń kó o (ii) èdè abínibí jé opákůtèlè fún àşà àti işe, b.a. iwà omọlúàbi/ rere, iwỌSQ, oúnję jię, èsin, igbàgbó, abbl. (iii) ó máa ń şe igbélárugę ibáşepò tí ó dán mòràn láàrin àwon elédè (iv) a máa ń lò ó gégé bí èdè àşírí láàrin àwọn elédè (v) kò sí ohun tí wón ń fi èdè Gèési şe tí èniyàn kò lè fi èdè abínibí şe (vi) èdè abínibí máa ń jé í èniyàn lè ronú jinlè láti mú èrò tuntun jáde tàbí láti şe àwárí imò tuntun (vii) ó dára fún itànkáè iròyìn fún idàgbàsókè àwùjo (viii) ó wúò fún kárà-kátà láàrin àwon tó nílò rè.'ŞÜGBÓN'(i) kì í şe èdè tó kárí ayé bíi èdè Gèési. (d) gúnlệ - Orò ikádií tí ó bá ibi tí aşèdánwò fi sí mu*Àkíyèsí: Aşèdánwò tí ó bá rólé apá kan, orí eéfà (6) ni a 6 gbé èrò rè lé.E. Létà sí àbúrò rè láti so àwon ipèníjà tí ó wà nínú lílo èro-ibánisorò alágbèékà àti ònà àbáyo sí àwon pèníià náà,Létà gbèfé ni èyí:(a) Àdirési akolétà àti déèti (b) İkíni ibèrè, b.a. àbúrò mi (owón/tòótó) (d) Kókó-létà: (i) àlàyé şókí lórí èro ibánisòrò alágbèékà àti iwúò rè (ii) àwọn ipèníjà tí ó wà nínú lilo èro ibánisòrò alágbèékà(a) şíşe àfarawé tí ó lè kó báni (b) kíkó sówó gbájú-ė/onijibiti orí aféfé (d) àşilò rệ lè şokùnfà àilera, ijàňbá, tàbí ikú òjýi nípasè şíşe ifàmóra agbára iná (e) àşilò rệ níoju pópó lè fa ijàhbá ńlá tàbí ikú òjiji (e) ó fàyè gba iwà àisòdodo láàrin àwon tó ń lò ó (f) ó ní gbàgede àti-kóni-ní-èkó-òdi (g) o fi ayè gba fífi àkókò ara eni şòfò\n(gb) ó fi àyề gba síso òrò sí agbòn/titú àşírí láirò-télè, èyí si máa ń fa yánpọnyánrin (ii) onà àbắyọ sí ipènijà tí ó wà nínú lílo èrọ ibánisòr ni:\nŞíşe igbéláruge iwà ikóra-eni-ní-ijanu láti òdo- eni kòòkan- òbí sí omọ- ilé-èkó sí akékòó- àwọn aláşę sí àwon ará ilú (e) İkíni iparí (e) Orúko akolětà (6 lè kún, ó si lè má kún). (a) Kóńsónáhti àránmúpè aşesilébů ni kóńsónáhtì tí ó máa ń dúró gégé. bí silébù nínú orò Yorůbá. Ở máa ń ní ohùn gệgé i fáwèli. (b) Àkosílę orỳ méjilá otòòtò tí ó ní kóńsónáħtì àránmúpè aşesílébů:i. gònbóii. òronbóiii. gbangbaiv. dùndúv. péńpévi. konkovii. dáńfóviil. géńdéix. bínńtínX. pàntíxi. ògòngòxi. ànjoonúxii. ònwòranXİv, rentiXv. ipáħleXvi. Bángbóşéxvii. panlaxviii. Kànkà",
    "year": "2024"
  },
  {
    "number": "2",
    "text": "àkiyèsí: iò àmi ohùn pon dandan \nÀbájáde lilo igbésè fonólóji àrànmó lóri àwon wúnrèn",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72497?exam_type=waec&type=theory",
    "correct_answer": "S/NWUNRENABÁJÁDE ARĂNMOa.ile IjoIleejob.eru igieruugid.ojo ibukunojoobukune.obe ilaobeelae.ise ipaiseepaf.ara okoarookog.aso okeasookegb.ori omioroomi/oromih.owo epooweepoi.agba iluagbaalu\n*İlò àmi ohùn pọn dandan",
    "explanation": "S/NWUNRENABÁJÁDE ARĂNMOa.ile IjoIleejob.eru igieruugid.ojo ibukunojoobukune.obe ilaobeelae.ise ipaiseepaf.ara okoarookog.aso okeasookegb.ori omioroomi/oromih.owo epooweepoi.agba iluagbaalu\n*İlò àmi ohùn pọn dandan",
    "year": "2024"
  },
  {
    "number": "3",
    "text": "Àfàyg awé-gbólóhùn afarahę àti èyà awe-gbolohun",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72502?exam_type=waec&type=theory",
    "correct_answer": "S/NAwe-gbolohunafareheEya awe-gbolohunafarahe ti o jea.ti Bayo raasapejuweb.pe omo naa fiogbon se easodorukod.pe Bola naa ko so otitoasodorukoe.ti o jaasapejuwee.bii buredi ti o bosomiasaponler.ki ile too moasaponleg.nitori pe oko re bajeasaponlegb.bi ina ko ba deasaponleh.ki n ko ile peteesiasodorukoi.ti e ba mu enyanmeji daniasaponle\n*Àkíyèsi: Aşèdánwò tí ó bá şi àfàyọ awé-gbólóhùn afarahę kò níí gba máàki kankan.",
    "explanation": "S/NAwe-gbolohunafareheEya awe-gbolohunafarahe ti o jea.ti Bayo raasapejuweb.pe omo naa fiogbon se easodorukod.pe Bola naa ko so otitoasodorukoe.ti o jaasapejuwee.bii buredi ti o bosomiasaponler.ki ile too moasaponleg.nitori pe oko re bajeasaponlegb.bi ina ko ba deasaponleh.ki n ko ile peteesiasodorukoi.ti e ba mu enyanmeji daniasaponle\n*Àkíyèsi: Aşèdánwò tí ó bá şi àfàyọ awé-gbólóhùn afarahę kò níí gba máàki kankan.",
    "year": "2024"
  },
  {
    "number": "4",
    "text": "Àpęęrę irúfé oro-orúko àti ilo wọn nínú gbólóhùn",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72512?exam_type=waec&type=theory",
    "correct_answer": "S/NIrufeOroOrukoApeereIlo won ninugbolohun1.Afoyemoife, alaafiaaanu, aloaini,adunimo, itiju,abo, ife, isoIfe ni akoja ofinAdun nii gbeyin ewuroAlo yin  dara abo yin asunwon. Maa ko itiju ba mi \"Ebi n pa mi\" Ko see fi ife wiii.Aridimuiwe, eja, isu, eye, omo, ife, iwe, orule, oko apataIwe kika yato siajako isu tuntun wu mi i je ju egbe lo Iwe adiye dun gan-an. Ori apata ni a sa elubo wa si Efon je wa ni etido.iii.Aseekaigo, owo, ileoko, abere, ika, ete, ojueti, ewu, sokoto, gele, bata, eku, efon, efonIle meta ni baba ojo ko si ilu wa Igo meji ni a ro apo si. Ewu kan soso ni okunrin talaka naa niiv.AlaiseekaAfefe, omi, yanrin, iyo, epo, iso, erukuAfefe nii gba eruku lalaala. Omi ni a ko n te ki a too te yanrin. Aponju iyo a maa ba obe je Edo ni iroju obe.v.IgbaAná, àárò, ale, odun, osun, ola, ojo, ose, saa, akoko, wakati, iseju, orun, isan, ije, itadogunÀárò ni a wà; ojo ale ni a n toro.Odun meje gbako ni eki imo-isegun oyibo n gba ose kan pere ni a lo ni ilu ti a lo.\n*Àkíyèsi: Aşèdánwò tí ó bá lo apeere ti o yato si eyi ti o fi sile labe (a) ni gbolohun (b) ko nii gba maaki labe (b).",
    "explanation": "S/NIrufeOroOrukoApeereIlo won ninugbolohun1.Afoyemoife, alaafiaaanu, aloaini,adunimo, itiju,abo, ife, isoIfe ni akoja ofinAdun nii gbeyin ewuroAlo yin  dara abo yin asunwon. Maa ko itiju ba mi \"Ebi n pa mi\" Ko see fi ife wiii.Aridimuiwe, eja, isu, eye, omo, ife, iwe, orule, oko apataIwe kika yato siajako isu tuntun wu mi i je ju egbe lo Iwe adiye dun gan-an. Ori apata ni a sa elubo wa si Efon je wa ni etido.iii.Aseekaigo, owo, ileoko, abere, ika, ete, ojueti, ewu, sokoto, gele, bata, eku, efon, efonIle meta ni baba ojo ko si ilu wa Igo meji ni a ro apo si. Ewu kan soso ni okunrin talaka naa niiv.AlaiseekaAfefe, omi, yanrin, iyo, epo, iso, erukuAfefe nii gba eruku lalaala. Omi ni a ko n te ki a too te yanrin. Aponju iyo a maa ba obe je Edo ni iroju obe.v.IgbaAná, àárò, ale, odun, osun, ola, ojo, ose, saa, akoko, wakati, iseju, orun, isan, ije, itadogunÀárò ni a wà; ojo ale ni a n toro.Odun meje gbako ni eki imo-isegun oyibo n gba ose kan pere ni a lo ni ilu ti a lo.\n*Àkíyèsi: Aşèdánwò tí ó bá lo apeere ti o yato si eyi ti o fi sile labe (a) ni gbolohun (b) ko nii gba maaki labe (b).",
    "year": "2024"
  },
  {
    "number": "5",
    "text": "BÍ İjàpá şe mọ àşírí Àşà nínú \"Ìtàn ijàpá àti Àşá\":",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72513?exam_type=waec&type=theory",
    "correct_answer": "(i) Ní igbà láéláé, iyàn mú ní ilú ijàpá dé ibi pé tèniyàn tẹranko kò rí oúnję ję mó (ii) İjàpá fura sí irin Àşá (iii) İrírí Áşá gégé bí àgbè jé kó mỳ pé iyàn lè mú nítorí.djò tí kò rò imo-işègůn işéjú, orún, òyinbó ń gbà. isán, itádógún (iv) Àşá wáá lọ dáko sí òkè òkun (ilú onà jínjin) tí òjò ti ń rò.(v) Latinú oko yií ni Aşá ti máa ń mú oúnje wá fún ara rè àti ębí rè ní ojoojúmó (vi) o şàkíyèsí pé Aşá kò rù lásikò iyàn yií (vii) İjàpá fura pé oúnję ni Àşá máa ń lo mú fún ebí rè bí ó şe máa ń jáde nilùú lójoojúmó (viii) Ní ojó kan İjàpá lọ ká Aşá mólé ní àáro kùtùkůtù (ix) Ô sọ fún Aşá pé ebi kò jé kí òun sùn mójú (x) O bę Àşá (xi) Äşá sọ fún ljàpá pé òun kò lè şe oore gba ikà (xii) ljàpá sọ pé òun mà tỉ pa iwà játijàti ti (xiii) Àşá ní kí ijàpá wá bá òun ní àfemójú ojó keji. (Xiv) Ní àfèmójú, ljàpá lọ bá Àşá  (xv) Wón gbéra ó di oko Aşá tíó wà hí òkè òkun (xvi) Wón débè, won jęun, wón yó, wón si tún dì lọ sílé (xvii Bayii ni ijapa se mo asiri Asa",
    "explanation": "(i) Ní igbà láéláé, iyàn mú ní ilú ijàpá dé ibi pé tèniyàn tẹranko kò rí oúnję ję mó (ii) İjàpá fura sí irin Àşá (iii) İrírí Áşá gégé bí àgbè jé kó mỳ pé iyàn lè mú nítorí.djò tí kò rò imo-işègůn işéjú, orún, òyinbó ń gbà. isán, itádógún (iv) Àşá wáá lọ dáko sí òkè òkun (ilú onà jínjin) tí òjò ti ń rò.(v) Latinú oko yií ni Aşá ti máa ń mú oúnje wá fún ara rè àti ębí rè ní ojoojúmó (vi) o şàkíyèsí pé Aşá kò rù lásikò iyàn yií (vii) İjàpá fura pé oúnję ni Àşá máa ń lo mú fún ebí rè bí ó şe máa ń jáde nilùú lójoojúmó (viii) Ní ojó kan İjàpá lọ ká Aşá mólé ní àáro kùtùkůtù (ix) Ô sọ fún Aşá pé ebi kò jé kí òun sùn mójú (x) O bę Àşá (xi) Äşá sọ fún ljàpá pé òun kò lè şe oore gba ikà (xii) ljàpá sọ pé òun mà tỉ pa iwà játijàti ti (xiii) Àşá ní kí ijàpá wá bá òun ní àfemójú ojó keji. (Xiv) Ní àfèmójú, ljàpá lọ bá Àşá  (xv) Wón gbéra ó di oko Aşá tíó wà hí òkè òkun (xvi) Wón débè, won jęun, wón yó, wón si tún dì lọ sílé (xvii Bayii ni ijapa se mo asiri Asa",
    "year": "2024"
  },
  {
    "number": "6",
    "text": "Kókó oro tí ó ję yọ nínú oríki \"Ìran Iiộkó\"",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72514?exam_type=waec&type=theory&page=2",
    "correct_answer": "(i) Işé bíbé odaràn lórí ni işé iran yií(ii) Aşę oba ni won máańfi şe işé yii(iii) Éyí ni wón şe ń ki wón ní oníşé-ikú omo Atękojóbalólele(iv) Işé afidà-béni-lóri-kegé yií ni İlòkó lókikí lé lórí jù lo(v) Oya ni iran yií máa ń bọ(vi) Iran oníşonà-aláwo ti ó ń gbé oya lórí ni tiwon(vii) Wón máa ń gbé ori eni ti òrişà bá pa dání nígbà tí wón bả ń yọ ayo orişà tó pa èniyån búburú(Viii) Wón tún máa ń bọ Ifá(ix) Olówó ni wón nínú iran yii(x) Opo omọ iran yií ló máa ń di akoni(xi) Iran yií féràn otikà(xii) Obi ni won fi n bo ida ti won fi n be ori odaran(xiii) Won ko gbodo se aso le ori lo si igbo oya(xiv) Won ko gbodo sin Aguntan ni ilu ira",
    "explanation": "(i) Işé bíbé odaràn lórí ni işé iran yií(ii) Aşę oba ni won máańfi şe işé yii(iii) Éyí ni wón şe ń ki wón ní oníşé-ikú omo Atękojóbalólele(iv) Işé afidà-béni-lóri-kegé yií ni İlòkó lókikí lé lórí jù lo(v) Oya ni iran yií máa ń bọ(vi) Iran oníşonà-aláwo ti ó ń gbé oya lórí ni tiwon(vii) Wón máa ń gbé ori eni ti òrişà bá pa dání nígbà tí wón bả ń yọ ayo orişà tó pa èniyån búburú(Viii) Wón tún máa ń bọ Ifá(ix) Olówó ni wón nínú iran yii(x) Opo omọ iran yií ló máa ń di akoni(xi) Iran yií féràn otikà(xii) Obi ni won fi n bo ida ti won fi n be ori odaran(xiii) Won ko gbodo se aso le ori lo si igbo oya(xiv) Won ko gbodo sin Aguntan ni ilu ira",
    "year": "2024"
  },
  {
    "number": "7",
    "text": "Iyàtò láàrin Ègè Didå àti Rárà Sisun:\nIjora tí 6 wà láàrin Ègè Dídá àti Rárà Sisun:",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72515?exam_type=waec&type=theory&page=2",
    "correct_answer": "(i) àwon oloro lo ni ege, awon elésù ló ni rarà ni igbà àtijó(ii) Ohùn tỉ afá dá ègè yàtò sí èyí ti a fi n sun rárà(iii) àwon ilú tí wón tỉ ń sun rárà bii Ồyỏ, ibàdàn, Oşogbo, Ede, abbl. yàtò sí èyí tí a ti ń dá ége bii Iséyin, Egbá, Òwu àti àwon ilú ajórúko mo Öwu(iv) didá ni à ń dá ègề: sísun ni à ń sun rárà.(i) à ń fi ègè didá àti rárà sísun ki oba, ijòyè, jagunjagun àti àwọn gbajúmo(ii) àwon méjèèji kò ní nhkankan şe pèlú òrişà kankan mó lóde-òní(iii) méjèèji ni won máa ń kó tí wón sì fĩ ń şişé şe lóde-òní(iv) wón lè lo méjèèji fún idárayá lásikò ayeyę(v) tokùnrin' tobìnrin ló ń şe méjèèjl.",
    "explanation": "(i) àwon oloro lo ni ege, awon elésù ló ni rarà ni igbà àtijó(ii) Ohùn tỉ afá dá ègè yàtò sí èyí ti a fi n sun rárà(iii) àwon ilú tí wón tỉ ń sun rárà bii Ồyỏ, ibàdàn, Oşogbo, Ede, abbl. yàtò sí èyí tí a ti ń dá ége bii Iséyin, Egbá, Òwu àti àwon ilú ajórúko mo Öwu(iv) didá ni à ń dá ègề: sísun ni à ń sun rárà.(i) à ń fi ègè didá àti rárà sísun ki oba, ijòyè, jagunjagun àti àwọn gbajúmo(ii) àwon méjèèji kò ní nhkankan şe pèlú òrişà kankan mó lóde-òní(iii) méjèèji ni won máa ń kó tí wón sì fĩ ń şişé şe lóde-òní(iv) wón lè lo méjèèji fún idárayá lásikò ayeyę(v) tokùnrin' tobìnrin ló ń şe méjèèjl.",
    "year": "2024"
  },
  {
    "number": "8",
    "text": "BÍ àwon wúndíá òkèrèwè şe fi èhónú wọn hàn lórí iwà iréniję tí olóyè Omíyalé hù:",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/yoruba/72517?exam_type=waec&type=theory&page=2",
    "correct_answer": "(i) Awon wúndíá àsówéré Òkèrèwé tó lé ní igba tò lówòowó(ii) Won ò gbin; won ò soro wọn ò sì pariwo(iii) Wón kàn ń kùn bí oyin ni(iv) Won ò woşo, àmó wón ró iró kíjipá olómi aró tí wón sì yọ oyàn wọn kộòkan sta(v) Wón şe irun won yętuyętu, won ò fi nikankan bò ó ,(vi) Wón já èka igi tó ní ewé lára lówó; wón fi bo orí won(vii) Wón ń rìn lọ láàrín igboro láisoro(viii) Awon omọ wéwéń tèlé won léyin; èyí jé kàyéfi fáwọn èniyàn tó ń wò wón(ix) Wón gbéra láti Òkèrèwè, wón doríko Ogbón- oya(x) Wón bèrè sí níí wolé olóyè Omíyalé lókòokan(xi) Bíi ogbón nínú wọn ya wo àgbàlá Omíyalé; wón sì bá a níbí tó ti ń kígbe pé \"ogun obinrin ká òhun molé o\"(xii) Móremí fa Mosún jáde sójú agbo; ó bèèrè lówó olóyè bóyá ó mọ Mosún(xiii) Olóyè paró pé òun kò rí Mosún rí(xiv) Ô tún sé pé òun ko ni ó ni omọ owó Mosún,(xv) Móremí na iróké òòşà owó rè sí olóyè pé kí,ó mú un dání(xvi) BÍ olóyè şe gbà á ni ó bệrè sí nif ka gbogbo işé ibi tí ó tí şe bòòròbò(xvii) Ó jéwó pé òun lỏ sọ.Mosún di idåkudà",
    "explanation": "(i) Awon wúndíá àsówéré Òkèrèwé tó lé ní igba tò lówòowó(ii) Won ò gbin; won ò soro wọn ò sì pariwo(iii) Wón kàn ń kùn bí oyin ni(iv) Won ò woşo, àmó wón ró iró kíjipá olómi aró tí wón sì yọ oyàn wọn kộòkan sta(v) Wón şe irun won yętuyętu, won ò fi nikankan bò ó ,(vi) Wón já èka igi tó ní ewé lára lówó; wón fi bo orí won(vii) Wón ń rìn lọ láàrín igboro láisoro(viii) Awon omọ wéwéń tèlé won léyin; èyí jé kàyéfi fáwọn èniyàn tó ń wò wón(ix) Wón gbéra láti Òkèrèwè, wón doríko Ogbón- oya(x) Wón bèrè sí níí wolé olóyè Omíyalé lókòokan(xi) Bíi ogbón nínú wọn ya wo àgbàlá Omíyalé; wón sì bá a níbí tó ti ń kígbe pé \"ogun obinrin ká òhun molé o\"(xii) Móremí fa Mosún jáde sójú agbo; ó bèèrè lówó olóyè bóyá ó mọ Mosún(xiii) Olóyè paró pé òun kò rí Mosún rí(xiv) Ô tún sé pé òun ko ni ó ni omọ owó Mosún,(xv) Móremí na iróké òòşà owó rè sí olóyè pé kí,ó mú un dání(xvi) BÍ olóyè şe gbà á ni ó bệrè sí nif ka gbogbo işé ibi tí ó tí şe bòòròbò(xvii) Ó jéwó pé òun lỏ sọ.Mosún di idåkudà",
    "year": "2024"
  }
]