[
  {
    "number": "322",
    "text": "SECTION A: ESSAY\nYour answer should not be less than 450 words. You are advised to spend 50 minutes on this section.\nWrite a story that ends with the statement: I was mistaken to have thought the night would be like other peaceful nights.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71807?exam_type=waec&type=theory&page=65",
    "correct_answer": "A Night Unlike Any Other\nThe moon cast a silver glow over our sleepy town, and the rhythmic chirping of crickets created a soothing melody. I had always found comfort in the predictability of our quiet nights, where nothing extraordinary ever happened. That evening was no different—or so I thought. My parents had already retired to their room, and my younger siblings were fast asleep. I sat by my window, enjoying the cool night breeze, oblivious to the series of events that would soon shake me to my core.\nIt all began with a faint rustling sound outside. At first, I dismissed it as the wind teasing the leaves or perhaps a stray cat scouring for food. But as the noise persisted, growing louder and more deliberate, unease crept over me. I tiptoed to the door and peered through the peephole. Darkness stretched before me, unbroken except for the dim glow of the streetlamp at the far end of the road. Convinced I was imagining things, I returned to my bed, but sleep refused to come.\nA sudden loud bang shattered the night’s silence. My heart pounded wildly as I bolted upright. Someone—or something—was outside. Summoning courage, I crept to the living room and peered through the curtains. What I saw made my blood run cold. Silhouettes of two men lurked near the gate. I wanted to scream, to alert my family, but fear paralysed me.\nI quickly switched off the lights, hoping to create the illusion that the house was deserted. My mind raced—were they burglars? Kidnappers? My trembling hands reached for my phone, and I dialled my father’s number, my voice barely above a whisper as I explained the situation. He instructed me to stay quiet and assured me he would call the police. As I crouched behind the sofa, listening to my own rapid breathing, the men advanced towards the house, their movements swift and calculated.\nMinutes felt like hours. I clutched a heavy object, ready to defend myself if necessary. Just as one of them attempted to force open the window, a sudden wail of sirens pierced the night air. Blue and red lights flashed across the yard as the police arrived. The intruders scrambled but within moments, they were apprehended.\nAs my family gathered, shaken yet safe, I realised how naïve I had been. I had believed that our nights would always be peaceful, that danger was something distant, belonging to stories on the evening news. But that night had shattered my illusion of safety.\nI was mistaken to have thought the night would be like other peaceful nights.",
    "explanation": "A Night Unlike Any Other\nThe moon cast a silver glow over our sleepy town, and the rhythmic chirping of crickets created a soothing melody. I had always found comfort in the predictability of our quiet nights, where nothing extraordinary ever happened. That evening was no different—or so I thought. My parents had already retired to their room, and my younger siblings were fast asleep. I sat by my window, enjoying the cool night breeze, oblivious to the series of events that would soon shake me to my core.\nIt all began with a faint rustling sound outside. At first, I dismissed it as the wind teasing the leaves or perhaps a stray cat scouring for food. But as the noise persisted, growing louder and more deliberate, unease crept over me. I tiptoed to the door and peered through the peephole. Darkness stretched before me, unbroken except for the dim glow of the streetlamp at the far end of the road. Convinced I was imagining things, I returned to my bed, but sleep refused to come.\nA sudden loud bang shattered the night’s silence. My heart pounded wildly as I bolted upright. Someone—or something—was outside. Summoning courage, I crept to the living room and peered through the curtains. What I saw made my blood run cold. Silhouettes of two men lurked near the gate. I wanted to scream, to alert my family, but fear paralysed me.\nI quickly switched off the lights, hoping to create the illusion that the house was deserted. My mind raced—were they burglars? Kidnappers? My trembling hands reached for my phone, and I dialled my father’s number, my voice barely above a whisper as I explained the situation. He instructed me to stay quiet and assured me he would call the police. As I crouched behind the sofa, listening to my own rapid breathing, the men advanced towards the house, their movements swift and calculated.\nMinutes felt like hours. I clutched a heavy object, ready to defend myself if necessary. Just as one of them attempted to force open the window, a sudden wail of sirens pierced the night air. Blue and red lights flashed across the yard as the police arrived. The intruders scrambled but within moments, they were apprehended.\nAs my family gathered, shaken yet safe, I realised how naïve I had been. I had believed that our nights would always be peaceful, that danger was something distant, belonging to stories on the evening news. But that night had shattered my illusion of safety.\nI was mistaken to have thought the night would be like other peaceful nights.",
    "year": "2024"
  },
  {
    "number": "323",
    "text": "SECTION A: ESSAY\nYour answer should not be less than 450 words. You are advised to spend 50 minutes on this section.\nThe Old Students' Association of your school has just erected an ultra-modern hall for the school. As the senior prefect, write a letter to the chairman, thanking him for this project and pointing out three other areas in which the school needs assistance.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71808?exam_type=waec&type=theory&page=65",
    "correct_answer": "Refiners' Secondary School,\nIjora, Mushin,\nLagos State.\n13th February, 2024.\nThe Chairman,Old Students' Association,Refiner's Secondary School,Mushin, Lagos.\nDear Sir,\nAPPRECIATION FOR THE NEW ULTRA-MODERN HALL AND REQUEST FOR FURTHER ASSISTANCE\nOn behalf of the students and staff of [Your School's Name], I extend my heartfelt gratitude to you and the entire Old Students' Association for the recent construction of the ultra-modern hall in our school. This generous and thoughtful contribution is a testament to your unwavering commitment to the progress and development of our alma mater. The new hall has already begun to serve multiple purposes, ranging from hosting school assemblies, examinations, and inter-school competitions to providing a venue for extracurricular activities and important events. This facility has undoubtedly enhanced the learning environment, and for that, we remain truly grateful.\nThe Old Students' Association has always been a pillar of support to the school, and while we celebrate this milestone, I would like to bring to your attention three other critical areas where the school is in dire need of assistance.\nFirstly,the school's library requires urgent refurbishment and expansion. The current library is inadequate to accommodate the growing student population, and many of the books are outdated, offering limited resources for research and study. A well-equipped library with modern books, e-learning resources, and comfortable reading spaces would greatly enhance students' academic performance. Additionally, the provision of computers with internet access would expose students to global knowledge and improve their research skills.\nSecondly,our science laboratories are in need of modernization. As education continues to evolve, practical experiments have become crucial for understanding scientific concepts. However, our laboratories lack essential equipment, such as microscopes, chemical reagents, and electrical circuit kits, making it difficult for students to carry out meaningful experiments. A well-furnished laboratory would bridge the gap between theory and practice, sparking students' interest in science-related careers and improving their performance in external examinations.\nLastly,our sports facilities require urgent attention. While academic excellence is vital, physical fitness and extracurricular activities are equally important for students' holistic development. Unfortunately, our football field is uneven and poorly maintained, and our basketball and volleyball courts have deteriorated over time. An upgrade of these facilities, along with the provision of sports kits and equipment, would encourage students to participate in sports, promote teamwork, and even open doors for those with athletic potential to compete at higher levels.\nOnce again, we appreciate the immense contributions of the Old Students' Association towards the betterment of our school. Your continuous support and dedication inspire us to strive for excellence, knowing that we have a strong network of alumni who care deeply about our growth. We remain hopeful that you will consider our humble requests, and we look forward to seeing more transformative projects in the near future.\nThank you for your time and consideration.\nYours sincerely,\n[signature]\nJemimah O. Ajiboye.Senior Prefect",
    "explanation": "Refiners' Secondary School,\nIjora, Mushin,\nLagos State.\n13th February, 2024.\nThe Chairman,Old Students' Association,Refiner's Secondary School,Mushin, Lagos.\nDear Sir,\nAPPRECIATION FOR THE NEW ULTRA-MODERN HALL AND REQUEST FOR FURTHER ASSISTANCE\nOn behalf of the students and staff of [Your School's Name], I extend my heartfelt gratitude to you and the entire Old Students' Association for the recent construction of the ultra-modern hall in our school. This generous and thoughtful contribution is a testament to your unwavering commitment to the progress and development of our alma mater. The new hall has already begun to serve multiple purposes, ranging from hosting school assemblies, examinations, and inter-school competitions to providing a venue for extracurricular activities and important events. This facility has undoubtedly enhanced the learning environment, and for that, we remain truly grateful.\nThe Old Students' Association has always been a pillar of support to the school, and while we celebrate this milestone, I would like to bring to your attention three other critical areas where the school is in dire need of assistance.\nFirstly,the school's library requires urgent refurbishment and expansion. The current library is inadequate to accommodate the growing student population, and many of the books are outdated, offering limited resources for research and study. A well-equipped library with modern books, e-learning resources, and comfortable reading spaces would greatly enhance students' academic performance. Additionally, the provision of computers with internet access would expose students to global knowledge and improve their research skills.\nSecondly,our science laboratories are in need of modernization. As education continues to evolve, practical experiments have become crucial for understanding scientific concepts. However, our laboratories lack essential equipment, such as microscopes, chemical reagents, and electrical circuit kits, making it difficult for students to carry out meaningful experiments. A well-furnished laboratory would bridge the gap between theory and practice, sparking students' interest in science-related careers and improving their performance in external examinations.\nLastly,our sports facilities require urgent attention. While academic excellence is vital, physical fitness and extracurricular activities are equally important for students' holistic development. Unfortunately, our football field is uneven and poorly maintained, and our basketball and volleyball courts have deteriorated over time. An upgrade of these facilities, along with the provision of sports kits and equipment, would encourage students to participate in sports, promote teamwork, and even open doors for those with athletic potential to compete at higher levels.\nOnce again, we appreciate the immense contributions of the Old Students' Association towards the betterment of our school. Your continuous support and dedication inspire us to strive for excellence, knowing that we have a strong network of alumni who care deeply about our growth. We remain hopeful that you will consider our humble requests, and we look forward to seeing more transformative projects in the near future.\nThank you for your time and consideration.\nYours sincerely,\n[signature]\nJemimah O. Ajiboye.Senior Prefect",
    "year": "2024"
  },
  {
    "number": "324",
    "text": "SECTION A: ESSAY\nYour answer should not be less than 450 words. You are advised to spend 50 minutes on this section.\nSeveral demonstrations have been organised in the past few months in your country. Write an article for publication in one of your national newspapers, discussing the causes of these demonstrations and proposing three ways by which the government could deal with them.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71809?exam_type=waec&type=theory&page=65",
    "correct_answer": "THE RISING WAVE OF DEMONSTRATIONS: CAUSES AND SOLUTIONS\nIn recent months, our nation has witnessed an increasing wave of demonstrations across various regions. These protests have been organised by different groups, including students, labour unions, civil society organisations, and even ordinary citizens who feel aggrieved by different socio-economic and political challenges. While the right to peaceful protest is enshrined in our constitution, the frequency and intensity of these demonstrations indicate a growing dissatisfaction among the populace. It is imperative to examine the root causes of these demonstrations and explore viable ways through which the government can effectively address them.\nOne of the primary causes of these demonstrations iseconomic hardship. The rising cost of living, inflation, and high unemployment rates have made life unbearable for many citizens. People find it difficult to afford basic necessities such as food, healthcare, and housing. When individuals and families struggle to meet their daily needs, frustration builds up, leading to public outcries and protests. Many of the recent demonstrations have been focused on demanding better wages, job opportunities, and government interventions to cushion the effects of economic downturns.\nAnother significant factor contributing to these protests ispoor governance and corruption. Citizens are becoming increasingly aware of cases of mismanagement of public funds, nepotism, and lack of accountability among government officials. The demand for transparency and good governance has led many to take to the streets to express their dissatisfaction. When people perceive that their leaders are enriching themselves at the expense of the masses, the natural response is to protest and demand reforms.\nAdditionally,insecurity and police brutalityhave also been major triggers for demonstrations. The alarming rate of kidnappings, banditry, and violent crimes has left many citizens feeling unsafe. In some cases, the very institutions meant to protect the people, such as the police force, have been accused of excessive use of force and human rights violations. This has further fueled anger and resentment, prompting individuals and groups to organise protests demanding justice and security reforms.\nTo effectively address these demonstrations, the government must adopt amulti-faceted approachthat prioritises both immediate and long-term solutions.\nFirstly,economic policies must be reviewed and strengthenedto improve the standard of living for citizens. The government should create job opportunities through investments in industries and infrastructure development. Additionally, stabilising inflation and providing financial relief packages to struggling households will ease the economic burden on the people.\nSecondly,there must be a renewed commitment to good governance and transparency. Anti-corruption agencies should be empowered to function independently, and public office holders must be held accountable for their actions. Establishing open communication channels between the government and the people can also help bridge the gap of distrust and prevent misunderstandings that lead to protests.\nLastly,security agencies must be reformed to prioritise human rights and the safety of citizens. Law enforcement officers should undergo regular training on community policing, conflict resolution, and the importance of upholding human dignity. Ensuring that perpetrators of police brutality and extrajudicial killings are prosecuted will restore public confidence in the justice system.\nIn conclusion, while demonstrations serve as a tool for expressing grievances, they also highlight the urgent need for reforms. The government must take proactive steps to address the underlying causes of protests by improving economic conditions, promoting good governance, and ensuring security for all. Only through these measures can we achieve a stable and prosperous nation where the voices of the people are heard and their rights respected.",
    "explanation": "THE RISING WAVE OF DEMONSTRATIONS: CAUSES AND SOLUTIONS\nIn recent months, our nation has witnessed an increasing wave of demonstrations across various regions. These protests have been organised by different groups, including students, labour unions, civil society organisations, and even ordinary citizens who feel aggrieved by different socio-economic and political challenges. While the right to peaceful protest is enshrined in our constitution, the frequency and intensity of these demonstrations indicate a growing dissatisfaction among the populace. It is imperative to examine the root causes of these demonstrations and explore viable ways through which the government can effectively address them.\nOne of the primary causes of these demonstrations iseconomic hardship. The rising cost of living, inflation, and high unemployment rates have made life unbearable for many citizens. People find it difficult to afford basic necessities such as food, healthcare, and housing. When individuals and families struggle to meet their daily needs, frustration builds up, leading to public outcries and protests. Many of the recent demonstrations have been focused on demanding better wages, job opportunities, and government interventions to cushion the effects of economic downturns.\nAnother significant factor contributing to these protests ispoor governance and corruption. Citizens are becoming increasingly aware of cases of mismanagement of public funds, nepotism, and lack of accountability among government officials. The demand for transparency and good governance has led many to take to the streets to express their dissatisfaction. When people perceive that their leaders are enriching themselves at the expense of the masses, the natural response is to protest and demand reforms.\nAdditionally,insecurity and police brutalityhave also been major triggers for demonstrations. The alarming rate of kidnappings, banditry, and violent crimes has left many citizens feeling unsafe. In some cases, the very institutions meant to protect the people, such as the police force, have been accused of excessive use of force and human rights violations. This has further fueled anger and resentment, prompting individuals and groups to organise protests demanding justice and security reforms.\nTo effectively address these demonstrations, the government must adopt amulti-faceted approachthat prioritises both immediate and long-term solutions.\nFirstly,economic policies must be reviewed and strengthenedto improve the standard of living for citizens. The government should create job opportunities through investments in industries and infrastructure development. Additionally, stabilising inflation and providing financial relief packages to struggling households will ease the economic burden on the people.\nSecondly,there must be a renewed commitment to good governance and transparency. Anti-corruption agencies should be empowered to function independently, and public office holders must be held accountable for their actions. Establishing open communication channels between the government and the people can also help bridge the gap of distrust and prevent misunderstandings that lead to protests.\nLastly,security agencies must be reformed to prioritise human rights and the safety of citizens. Law enforcement officers should undergo regular training on community policing, conflict resolution, and the importance of upholding human dignity. Ensuring that perpetrators of police brutality and extrajudicial killings are prosecuted will restore public confidence in the justice system.\nIn conclusion, while demonstrations serve as a tool for expressing grievances, they also highlight the urgent need for reforms. The government must take proactive steps to address the underlying causes of protests by improving economic conditions, promoting good governance, and ensuring security for all. Only through these measures can we achieve a stable and prosperous nation where the voices of the people are heard and their rights respected.",
    "year": "2024"
  },
  {
    "number": "325",
    "text": "SECTION A: ESSAY\nYour answer should not be less than 450 words. You are advised to spend 50 minutes on this section.\nYou are the principal speaker in a debate on the motion: Living in one's country is more advantageous than living abroad. Write your argument for or against the motion.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71810?exam_type=waec&type=theory&page=65",
    "correct_answer": "LIVING IN ONE'S COUNTRY IS MORE ADVANTAGEOUS THAN LIVING ABROAD\nMr. Chairman, Panel of Judges, Accurate Timekeeper, Distinguished Audience, I stand before you today to propose the motion that \"Living in one's country is more advantageous than living abroad.\" While it is undeniable that opportunities exist beyond our national borders, I strongly believe that remaining in one’s home country offers far greater benefits in terms of cultural identity, emotional stability, national development, and long-term security.\nFirstly,living in one’s country fosters a strong sense of cultural identity and belonging. Culture is an integral part of an individual's identity, influencing their values, beliefs, and traditions. When people migrate abroad, they often struggle to preserve their native customs and languages due to cultural assimilation. In contrast, remaining in one's home country allows individuals to stay connected to their roots, engage in local traditions, and pass these values down to future generations without the fear of losing them.\nSecondly,emotional stability and social support are more readily available at home. One of the greatest challenges of living abroad is loneliness and the lack of a strong support system. Many migrants face emotional distress due to homesickness and cultural isolation. At home, individuals have their family, friends, and communities to offer them support during difficult times. The comfort of being surrounded by familiar people and a known environment significantly contributes to one's overall well-being and happiness.\nAnother major advantage is thatliving in one’s country contributes to national development. When skilled individuals remain in their home country, they help in the growth of the economy by contributing their expertise to different sectors. Brain drain has become a significant issue in many developing countries where professionals such as doctors, engineers, and scientists leave for better opportunities abroad. If these individuals stay and work towards national progress, they can help build industries, improve public services, and contribute to the general welfare of the country.\nFurthermore,residing in one’s home country ensures long-term stability and security. Many people move abroad in search of better opportunities, but they often face challenges such as visa restrictions, discrimination, and uncertain residency statuses. In contrast, living in one’s country provides a sense of permanence, with full legal rights and privileges that are often denied to immigrants. Additionally, adapting to new laws, customs, and sometimes even weather conditions in foreign lands can be a daunting experience.\nOpponents of this motion might argue that living abroad provides better economic opportunities and a higher standard of living. While this may be true in some cases, it is also important to note that success is not solely dependent on location but rather on hard work, determination, and innovation. Many people have built successful lives within their home countries, proving that prosperity is achievable anywhere.\nIn conclusion, the advantages of living in one’s country far outweigh those of living abroad. From maintaining cultural identity and emotional well-being to contributing to national development and enjoying long-term security, it is clear that staying in one's homeland offers numerous benefits. I, therefore, urge this esteemed audience to support this motion wholeheartedly.\nThank you.",
    "explanation": "LIVING IN ONE'S COUNTRY IS MORE ADVANTAGEOUS THAN LIVING ABROAD\nMr. Chairman, Panel of Judges, Accurate Timekeeper, Distinguished Audience, I stand before you today to propose the motion that \"Living in one's country is more advantageous than living abroad.\" While it is undeniable that opportunities exist beyond our national borders, I strongly believe that remaining in one’s home country offers far greater benefits in terms of cultural identity, emotional stability, national development, and long-term security.\nFirstly,living in one’s country fosters a strong sense of cultural identity and belonging. Culture is an integral part of an individual's identity, influencing their values, beliefs, and traditions. When people migrate abroad, they often struggle to preserve their native customs and languages due to cultural assimilation. In contrast, remaining in one's home country allows individuals to stay connected to their roots, engage in local traditions, and pass these values down to future generations without the fear of losing them.\nSecondly,emotional stability and social support are more readily available at home. One of the greatest challenges of living abroad is loneliness and the lack of a strong support system. Many migrants face emotional distress due to homesickness and cultural isolation. At home, individuals have their family, friends, and communities to offer them support during difficult times. The comfort of being surrounded by familiar people and a known environment significantly contributes to one's overall well-being and happiness.\nAnother major advantage is thatliving in one’s country contributes to national development. When skilled individuals remain in their home country, they help in the growth of the economy by contributing their expertise to different sectors. Brain drain has become a significant issue in many developing countries where professionals such as doctors, engineers, and scientists leave for better opportunities abroad. If these individuals stay and work towards national progress, they can help build industries, improve public services, and contribute to the general welfare of the country.\nFurthermore,residing in one’s home country ensures long-term stability and security. Many people move abroad in search of better opportunities, but they often face challenges such as visa restrictions, discrimination, and uncertain residency statuses. In contrast, living in one’s country provides a sense of permanence, with full legal rights and privileges that are often denied to immigrants. Additionally, adapting to new laws, customs, and sometimes even weather conditions in foreign lands can be a daunting experience.\nOpponents of this motion might argue that living abroad provides better economic opportunities and a higher standard of living. While this may be true in some cases, it is also important to note that success is not solely dependent on location but rather on hard work, determination, and innovation. Many people have built successful lives within their home countries, proving that prosperity is achievable anywhere.\nIn conclusion, the advantages of living in one’s country far outweigh those of living abroad. From maintaining cultural identity and emotional well-being to contributing to national development and enjoying long-term security, it is clear that staying in one's homeland offers numerous benefits. I, therefore, urge this esteemed audience to support this motion wholeheartedly.\nThank you.",
    "year": "2024"
  },
  {
    "number": "326",
    "text": "SECTION A: ESSAY\nYour answer should not be less than 450 words. You are advised to spend 50 minutes on this section.\nYour friend wrote a letter to you and part of it reads: \"I think I am going to fail my forthcoming examinations! I don't know what to do.\"Write a letter of encouragement to your friend, discussing at least three things he or she can do to manage examination jitters.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71811?exam_type=waec&type=theory&page=66",
    "correct_answer": "59, Ikegwu Street,\nUmmuna, Umuahia,\nAbia State.\n15th July, 2024.\nDear Faustina,\nI hope this letter finds you well. I was deeply concerned when I read your message expressing your fear of failing your forthcoming examinations. I understand how overwhelming exams can be, but I want you to know that you are not alone in this. With the right mindset and preparation, you can overcome your fears and succeed. Allow me to share three effective strategies to help you manage examination jitters and approach your exams with confidence.\nFirstly,effective preparationis key to overcoming exam anxiety. Many students feel nervous because they do not have a structured study plan. I encourage you to create a realistic timetable that covers all your subjects while allocating sufficient time for revision. Break your study sessions into manageable periods with short breaks in between to enhance retention. Additionally, make use of past questions and mock exams to familiarise yourself with the exam pattern. Practising under timed conditions will help you gain confidence and improve your speed.\nSecondly,maintaining a positive mindsetis crucial in dealing with examination stress. It is easy to let self-doubt take over, but you must remind yourself of your past successes and hard work. Instead of saying, \"I am going to fail,\" start affirming, \"I am prepared, and I will do my best.\" Engage in relaxation techniques such as deep breathing exercises, meditation, or listening to calming music whenever anxiety creeps in. A positive attitude can make a significant difference in your performance.\nLastly,taking care of your physical and mental healthis essential. Many students neglect their well-being during exam periods, which only adds to their stress. Ensure you get adequate sleep each night because rest is vital for memory consolidation. Eat nutritious meals and stay hydrated to keep your brain functioning optimally. Moreover, engage in light physical activities such as walking or stretching to relieve tension. If stress becomes overwhelming, do not hesitate to talk to a friend, teacher, or family member for support.\nRemember, exams are not meant to break you; they are opportunities to showcase your knowledge and hard work. Believe in yourself, stay consistent with your preparation, and approach your exams with a calm and focused mind. I have no doubt that you will do well.\nWishing you all the best in your examinations. Please write back to let me know how you are doing.\nYours sincerely,James Chukwunendu.",
    "explanation": "59, Ikegwu Street,\nUmmuna, Umuahia,\nAbia State.\n15th July, 2024.\nDear Faustina,\nI hope this letter finds you well. I was deeply concerned when I read your message expressing your fear of failing your forthcoming examinations. I understand how overwhelming exams can be, but I want you to know that you are not alone in this. With the right mindset and preparation, you can overcome your fears and succeed. Allow me to share three effective strategies to help you manage examination jitters and approach your exams with confidence.\nFirstly,effective preparationis key to overcoming exam anxiety. Many students feel nervous because they do not have a structured study plan. I encourage you to create a realistic timetable that covers all your subjects while allocating sufficient time for revision. Break your study sessions into manageable periods with short breaks in between to enhance retention. Additionally, make use of past questions and mock exams to familiarise yourself with the exam pattern. Practising under timed conditions will help you gain confidence and improve your speed.\nSecondly,maintaining a positive mindsetis crucial in dealing with examination stress. It is easy to let self-doubt take over, but you must remind yourself of your past successes and hard work. Instead of saying, \"I am going to fail,\" start affirming, \"I am prepared, and I will do my best.\" Engage in relaxation techniques such as deep breathing exercises, meditation, or listening to calming music whenever anxiety creeps in. A positive attitude can make a significant difference in your performance.\nLastly,taking care of your physical and mental healthis essential. Many students neglect their well-being during exam periods, which only adds to their stress. Ensure you get adequate sleep each night because rest is vital for memory consolidation. Eat nutritious meals and stay hydrated to keep your brain functioning optimally. Moreover, engage in light physical activities such as walking or stretching to relieve tension. If stress becomes overwhelming, do not hesitate to talk to a friend, teacher, or family member for support.\nRemember, exams are not meant to break you; they are opportunities to showcase your knowledge and hard work. Believe in yourself, stay consistent with your preparation, and approach your exams with a calm and focused mind. I have no doubt that you will do well.\nWishing you all the best in your examinations. Please write back to let me know how you are doing.\nYours sincerely,James Chukwunendu.",
    "year": "2024"
  },
  {
    "number": "327",
    "text": "(a) What was the writer's plan for his son?\n(b) Why was the writer dissatisfied with his son's performance?\n(c) State two challenges that the writer faced while growing up.\n(d) What is the writer's attitude to life?\n(e) State two pieces of evidence that suggest that the writer's children were well cared for.\n(f) ...no expenses\n(i) What is the grammatical name given to this expression as it is used in the passage?\n(ii) What is its function?\n(g) His lack of push was a weight on my shoulders. What figure of speech is used in the expression above?\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:\n(i) scuttled\n(ii) ostentatiously \n(iii) reputable\n(iv) sprang\n(v) well-groomed\n(vi) reminiscences",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71812?exam_type=waec&type=theory&page=66",
    "correct_answer": "(a) What was the writer's plan for his son?The writer planned to use his son's love for parties as a motivation for academic success.\n(b) Why was the writer dissatisfied with his son's performance?The writer was dissatisfied because his son consistently placed tenth in class for two years and was not putting in enough effort to improve.\n(c) State two challenges that the writer faced while growing up.\nHis parents were separated, and he was mistreated by his stepmother.He had to work on his father's farm to raise money for his school fees.\n(d) What is the writer's attitude to life?The writer believes in hard work, perseverance and self-discipline. He also values modesty and does not believe in extravagant living.\n(e) State two pieces of evidence that suggest that the writer's children were well cared for.\nThey attended one of the best schools.They were always well-groomed.\n(f) ...no expense(i) What is the grammatical name given to this expression as it is used in the passage?It is a noun phrase.\n(ii) What is its function?It functions as the object of the verb \"had spared.\"\n(g) His lack of push was a weight on my shoulders.What figure of speech is used in the expression above?Metaphor.\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:(i)scuttled– disrupted, ruined, thwarted, shattered, spoilt, upset, wrecked, destroyed, foiled(ii)ostentatiously– extravagantly, flamboyantly, lavishly, showily, flashily.(iii)reputable– prestigious, famous, well-known, highly regarded, popular, well-recognised.(iv)sprang– arose, originated, stemmed, derived, emanated, emerged, came.(v)well-groomed– neat, well-dressed, clean, presentable, kempt(vi)reminiscences– memories, recollections, flashbacks, reflections, thoughts.",
    "explanation": "(a) What was the writer's plan for his son?The writer planned to use his son's love for parties as a motivation for academic success.\n(b) Why was the writer dissatisfied with his son's performance?The writer was dissatisfied because his son consistently placed tenth in class for two years and was not putting in enough effort to improve.\n(c) State two challenges that the writer faced while growing up.\nHis parents were separated, and he was mistreated by his stepmother.He had to work on his father's farm to raise money for his school fees.\n(d) What is the writer's attitude to life?The writer believes in hard work, perseverance and self-discipline. He also values modesty and does not believe in extravagant living.\n(e) State two pieces of evidence that suggest that the writer's children were well cared for.\nThey attended one of the best schools.They were always well-groomed.\n(f) ...no expense(i) What is the grammatical name given to this expression as it is used in the passage?It is a noun phrase.\n(ii) What is its function?It functions as the object of the verb \"had spared.\"\n(g) His lack of push was a weight on my shoulders.What figure of speech is used in the expression above?Metaphor.\n(h) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage:(i)scuttled– disrupted, ruined, thwarted, shattered, spoilt, upset, wrecked, destroyed, foiled(ii)ostentatiously– extravagantly, flamboyantly, lavishly, showily, flashily.(iii)reputable– prestigious, famous, well-known, highly regarded, popular, well-recognised.(iv)sprang– arose, originated, stemmed, derived, emanated, emerged, came.(v)well-groomed– neat, well-dressed, clean, presentable, kempt(vi)reminiscences– memories, recollections, flashbacks, reflections, thoughts.",
    "year": "2024"
  },
  {
    "number": "328",
    "text": "(a) In three sentences, one for each, summarise three indicators of the decline in the education of males according to the passage. \n(b) In three sentences, one for each, summarise three likely consequences of the decline in the education of males according to the passage.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/71813?exam_type=waec&type=theory&page=66",
    "correct_answer": "(a) The following are indicators of the decline in the education of males, according to the passage:\nMore girls than boys now enrol for secondary and tertiary education and the number of girls in classrooms often surpasses that of boys.Female students generally perform better academically than their male counterparts.Boys exhibit higher cases of truancy, frequently skipping school to attend parties or engage in cybercrime.\n(b) The following are likely consequences of the decline in the education of males:\nMore leadership positions in public and private establishments may be occupied by women.Marital conflicts may arise in homes where highly educated women are married to men with lower academic qualifications.Women in managerial and policymaking positions may formulate policies that favour them.",
    "explanation": "(a) The following are indicators of the decline in the education of males, according to the passage:\nMore girls than boys now enrol for secondary and tertiary education and the number of girls in classrooms often surpasses that of boys.Female students generally perform better academically than their male counterparts.Boys exhibit higher cases of truancy, frequently skipping school to attend parties or engage in cybercrime.\n(b) The following are likely consequences of the decline in the education of males:\nMore leadership positions in public and private establishments may be occupied by women.Marital conflicts may arise in homes where highly educated women are married to men with lower academic qualifications.Women in managerial and policymaking positions may formulate policies that favour them.",
    "year": "2024"
  }
]