[
  {
    "number": "1569",
    "text": "A government performs the following functions except?",
    "options": {
      "A": "safeguarding life and property",
      "B": "maintaining law and order",
      "C": "providing all the needs of its citizens",
      "D": "providing basic welfare needs"
    },
    "answer_url": "https://myschool.ng/classroom/government/48339?exam_type=waec&type=obj&page=314",
    "correct_answer": "C",
    "explanation": "While a government is responsible for safeguarding life and property, maintaining law and order and providing basic welfare needs, it cannot realistically provide all the needs of its citizens. This is often beyond the capacity of any government due to resource constraints and the diversity of individual needs.\nOther functions of government include:\n1. Law Making2. Military defense of the country3. Provision of employment4. Maintenance of law and order5. Promotion of economic growth and development6. Maintaining good relations with other sovereign states or countries (foreign diplomacy)7. Protection of civil liberties8. Protection of lives and properties9. Administration of justice10. Formulation and implementation of policies11. Provision of social welfare services",
    "year": "2018"
  },
  {
    "number": "1570",
    "text": "A political system in which the government controls every aspect of a citizen's life is _________.",
    "options": {
      "A": "feudalism",
      "B": "monarchy",
      "C": "democracy",
      "D": "totalitarianism"
    },
    "answer_url": "https://myschool.ng/classroom/government/48352?exam_type=waec&type=obj&page=314",
    "correct_answer": "D",
    "explanation": "Totalitarianism is a political concept of a mode of government that prohibits opposition parties, restricts individual opposition to the state and its claims, and exercises an extremely high degree of control over public and private life.",
    "year": "2018"
  },
  {
    "number": "1571",
    "text": "A political system in which the state owns and controls the major means of production is known as?",
    "options": {
      "A": "feudalism",
      "B": "socialism",
      "C": "fascism",
      "D": "capitalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/48353?exam_type=waec&type=obj&page=315",
    "correct_answer": "B",
    "explanation": "Socialism, social and economic doctrine that calls for public rather than private ownership or control of property and natural resources. it is a political and economic theory of social organization which advocates that the means of production, distribution, and exchange should be owned or regulated by the community as a whole.",
    "year": "2018"
  },
  {
    "number": "1572",
    "text": "Communist governments aim at distributing goods and services according to _____________.",
    "options": {
      "A": "gender and class",
      "B": "loyalty to the party",
      "C": "need and ability",
      "D": "work and residence"
    },
    "answer_url": "https://myschool.ng/classroom/government/48356?exam_type=waec&type=obj&page=315",
    "correct_answer": "C",
    "explanation": "Communismis a political and economic system that seeks to create a classless society in which the major means of production, such as mines and factories, are owned and controlled by the public.it is a system of government in which all property is owned by the community and each person contributes and receives according to their ability and needs.",
    "year": "2018"
  },
  {
    "number": "1573",
    "text": "The theory of separation of power is associated with?",
    "options": {
      "A": "Jean Bodin",
      "B": "Baron de Montesquieu",
      "C": "A.V Dicey",
      "D": "J.J Rousseau"
    },
    "answer_url": "https://myschool.ng/classroom/government/48357?exam_type=waec&type=obj&page=315",
    "correct_answer": "B",
    "explanation": "The theory of Doctrine of Separation of Power was first propounded byMontesquieu, a French scholar in and 1747 published in his book ‘Espirit des Louis’ (The spirit of the laws). Montesquieu found that if the power is concentrated in a single person’s hand or a group of people then it results in a tyrannical form of government.",
    "year": "2018"
  },
  {
    "number": "1574",
    "text": "The basic purpose of setting up a state is to ___________.",
    "options": {
      "A": "maintain law and order",
      "B": "protect foreign interest",
      "C": "Promote development",
      "D": "provide social facilities"
    },
    "answer_url": "https://myschool.ng/classroom/government/48358?exam_type=waec&type=obj&page=315",
    "correct_answer": "A",
    "explanation": "A state is a political organisation with a government that maintains a monopoly by use of force within a certain geographical territory. It must be able to maintain law and order, enforce obedience from its citizens and defend its territory from external/internal attacks when the need arises.",
    "year": "2018"
  },
  {
    "number": "1575",
    "text": "The process of taking part in the selection of leaders in a country is political ___________.",
    "options": {
      "A": "socialization",
      "B": "participation",
      "C": "interaction",
      "D": "culture"
    },
    "answer_url": "https://myschool.ng/classroom/government/48360?exam_type=waec&type=obj&page=315",
    "correct_answer": "B",
    "explanation": "Politicalparticipationis any activity that shapes, affects, or involves thepoliticalsphere.Politicalparticipationranges from voting to attending a rally to committing an act of terrorism to sending a letter to a representative.",
    "year": "2018"
  },
  {
    "number": "1576",
    "text": "By comparison, a state is ______________.",
    "options": {
      "A": "less permanent than a government",
      "B": "more permanent than a government",
      "C": "more changeable than a government",
      "D": "equally permanent with a government"
    },
    "answer_url": "https://myschool.ng/classroom/government/48362?exam_type=waec&type=obj&page=316",
    "correct_answer": "B",
    "explanation": "Astate isa type of political entity.  The maindifferencebetween state and government isthat thegovernmentrefers to a particular group of people who control thestateat a given time whereas thestate isan organized political community with sovereignty and more permanent. Thestatepowerisemployed through thegovernment.",
    "year": "2018"
  },
  {
    "number": "1577",
    "text": "in modern democracy, a government is?",
    "options": {
      "A": "a contract between the rulers and the ruled",
      "B": "a preserve of the political party in power",
      "C": "monopoly of the ethnic groups in the majority",
      "D": "alternation of power between the minority and majority tribes"
    },
    "answer_url": "https://myschool.ng/classroom/government/48371?exam_type=waec&type=obj&page=316",
    "correct_answer": "A",
    "explanation": "Modern democracy in many ways is the opposite of ancient democracy. Modern democracy requires that there must be a constitution, that there must be equality before the law, there must be individual rights and liberties, there must be civil rights and liberties, there must be human rights and there must be the rule of law to enforce those rights and liberties. In modern democracy, governance is a contract between the citizens and the ruled. This means that, the citizens choose people who would represent them (usually through elections) at various levels for a particular period of time,  and these representatives are accountable to the people.",
    "year": "2018"
  },
  {
    "number": "1578",
    "text": "The rule of law can be limited by?",
    "options": {
      "A": "power",
      "B": "state of emergency",
      "C": "legitimacy",
      "D": "checks and balances"
    },
    "answer_url": "https://myschool.ng/classroom/government/48377?exam_type=waec&type=obj&page=316",
    "correct_answer": "B",
    "explanation": "A state of emergency is a situation of national danger or disaster in which a government suspends normal constitutional procedures to regain control. Once a state of emergency is declared, the principle of the rule of law would be restrained as actions may be taken that negate the principle to restore normalcy.",
    "year": "2018"
  },
  {
    "number": "1579",
    "text": "The principle of separation of power becomes meaningful when it is linked with the concept of?",
    "options": {
      "A": "the certainty of the law",
      "B": "checks and balances",
      "C": "legality of the law",
      "D": "judicial independence"
    },
    "answer_url": "https://myschool.ng/classroom/government/48383?exam_type=waec&type=obj&page=316",
    "correct_answer": "B",
    "explanation": "The principle of separation of powers becomes meaningful when it is linked with the concept of checks and balances. This ensures that each branch of government (executive, legislative, and judicial) can limit the powers of the others, preventing any one branch from becoming too powerful.",
    "year": "2018"
  },
  {
    "number": "1580",
    "text": "Which of the following does not militate against representative government in West Africa?",
    "options": {
      "A": "electoral irregularities",
      "B": "coup d' etat",
      "C": "gagged media",
      "D": "universal adult suffrage"
    },
    "answer_url": "https://myschool.ng/classroom/government/48385?exam_type=waec&type=obj&page=316",
    "correct_answer": "D",
    "explanation": "The concept of universal suffrage, also known as general suffrage or common suffrage, consists of the right to vote of all adult citizens, regardless of property ownership, income, race, or ethnicity, subject only to minor exceptions. the right for every qualified adult to vote in an election doesn't hinder representative government. instead, voting births representative",
    "year": "2018"
  },
  {
    "number": "1581",
    "text": "Those who believe in democracy and good governance are opposed to a single party system because?",
    "options": {
      "A": "encourages weak leadership",
      "B": "does not ensure national unity",
      "C": "curtails personal liberty",
      "D": "encourages divisiveness"
    },
    "answer_url": "https://myschool.ng/classroom/government/48390?exam_type=waec&type=obj&page=317",
    "correct_answer": "C",
    "explanation": "The disadvantage of aonepartysystemis that there is no check on the power of theParty. This inevitably leads to corruption and abuses of power. What's more, aone-partystate cannot be maintained without secret police, repression, and suppression of the free flow of information.",
    "year": "2018"
  },
  {
    "number": "1582",
    "text": "The fundamental law of a country refers to its?",
    "options": {
      "A": "acts of parliament",
      "B": "conventions",
      "C": "constitution",
      "D": "judicial precedence"
    },
    "answer_url": "https://myschool.ng/classroom/government/48392?exam_type=waec&type=obj&page=317",
    "correct_answer": "C",
    "explanation": "Fundamental Law refers to theconstitutionof a state or nation; the basic law and principles contained in federal and state constitutions that direct and regulate how authority is exercised by the government.",
    "year": "2018"
  },
  {
    "number": "1583",
    "text": "A country's constitution could be derived from the following sources except?",
    "options": {
      "A": "judicial precedents",
      "B": "customary sources",
      "C": "statutory sources",
      "D": "party manifestoes"
    },
    "answer_url": "https://myschool.ng/classroom/government/48395?exam_type=waec&type=obj&page=317",
    "correct_answer": "D",
    "explanation": "The sources of a constitution are:-\nLegislature,Legal instrument,Statute and Parliamentary actsHistorical documentsConstitution of other countriesPrevious constitutions of the countryOpinions,writings and commentaries of eminent legal experts and political thinkers, government authorities and committeesUsages,Principles,Norms,Habits,Customs,Convention,Practices,Traditions,Rule of actions applicable to government- Common Law{Established and accepted patterns of behaviourof governance}Judicial decisions,Commentary by judiciary, Judges made maxims- Case Laws{Judge made laws}Decisions of constitutional assemblyParliamentary standing ordersLegal doctrines and conceptsTheory of judicial precedentReligious legal textsEquity,Justice and Good Conscience",
    "year": "2018"
  },
  {
    "number": "1584",
    "text": "Planning and formulation of government policies are first initiated at?",
    "options": {
      "A": "cabinet meetings",
      "B": "media houses",
      "C": "political rallies",
      "D": "open forum"
    },
    "answer_url": "https://myschool.ng/classroom/government/48396?exam_type=waec&type=obj&page=317",
    "correct_answer": "A",
    "explanation": "Major decisions are made atmeetingsof theCabinet, which are held once a month and are attended by allCabinetmembers. TheCabinetis also responsible for preparing the budget and policies to propose to the Full Council. Decisions are also taken bycabinetmembers individually.",
    "year": "2018"
  },
  {
    "number": "1585",
    "text": "Which of the following is the primary function of a parliament?",
    "options": {
      "A": "impeachment of the president",
      "B": "making of laws",
      "C": "ratifying international treaties",
      "D": "acting as an electoral college"
    },
    "answer_url": "https://myschool.ng/classroom/government/48397?exam_type=waec&type=obj&page=317",
    "correct_answer": "B",
    "explanation": "Parliament is held to have a range of roles within our political system:- In a formal sense the Parliament has to approve legislation, taxation and public spending. The primary function of the parliament / legislature (as in the case of a presidential system of government), is to make laws through the passing of bills.",
    "year": "2018"
  },
  {
    "number": "1586",
    "text": "Judicial review is a mechanism for checking __________.",
    "options": {
      "A": "arbitrary use of power",
      "B": "irresponsible journalism",
      "C": "electoral malpractices",
      "D": "military adventures"
    },
    "answer_url": "https://myschool.ng/classroom/government/48399?exam_type=waec&type=obj&page=318",
    "correct_answer": "A",
    "explanation": "Judicial review is a process under which executive or legislative actions are subject to review by the judiciary.Judicial reviewis one of the checks and balances in the separation of powers: the power of thejudiciaryto supervise the legislative and executive branches when the latter exceed their authority.",
    "year": "2018"
  },
  {
    "number": "1587",
    "text": "In a parliamentary system of government, the legislature and executive are fused to ensure \n.",
    "options": {
      "A": "supremacy of the ruling party in administering the state",
      "B": "smoothness in the administration of the state",
      "C": "the constitution is read in parliament at all time",
      "D": "the judiciary consults parliament before ruling on cases"
    },
    "answer_url": "https://myschool.ng/classroom/government/48402?exam_type=waec&type=obj&page=318",
    "correct_answer": "B",
    "explanation": "A parliamentary system is a system of democratic governance of a state where the executive derives its democratic legitimacy from its ability to command the confidence of the legislature, typically a parliament, and is also held accountable to that parliament. For instance thegovernmentmust gain a vote of confidence from the assembly, the assembly may grant to thegovernmentthepowerto make delegated legislation or the head ofgovernmentis automatically a member of the assembly. With this, everyone is collectively responsible for all decisions made and enable a smooth administration of governance.",
    "year": "2018"
  },
  {
    "number": "1588",
    "text": "A country with homogeneous societies and a small population is suitable for the establishment of ____________.",
    "options": {
      "A": "a unitary state",
      "B": "a nation state",
      "C": "a federal state",
      "D": "an autonomous state"
    },
    "answer_url": "https://myschool.ng/classroom/government/48406?exam_type=waec&type=obj&page=318",
    "correct_answer": "A",
    "explanation": "Aunitary stateis a system of government where all powers are concentrated in a central authority, with little or no autonomy given to regional governments. Countries withhomogeneous societies(where people share the same culture, language, religion and ethnicity) andsmall populationsare suitable for unitary systems because there is less need for decentralization or power-sharing among diverse groups.",
    "year": "2018"
  },
  {
    "number": "1589",
    "text": "Which of the following factors usually leads to the collapse of a confederal state?",
    "options": {
      "A": "weak central government",
      "B": "absent of a confederal parliament",
      "C": "ill equipped armed forces",
      "D": "absence of a ceremonial head of state"
    },
    "answer_url": "https://myschool.ng/classroom/government/48407?exam_type=waec&type=obj&page=318",
    "correct_answer": "A",
    "explanation": "A confederation is a union of sovereign states, united for purposes of common action often in relation to other states. Usually created by a treaty, confederations of states tend to be established for dealing with critical issues, such as defense, foreign relations, internal trade or currency, with the general government being required to provide support for all its members.\nConfederationfailedbecause of the lack of a strong central government. because they left too much power with the states. The central government had no power to levy or collect taxes, no power to regulate trade, and no power to enforce laws.",
    "year": "2018"
  },
  {
    "number": "1590",
    "text": "In the presidential system of government, the chief executive is responsible to the _____________.",
    "options": {
      "A": "judiciary",
      "B": "monarch",
      "C": "electorate",
      "D": "senate"
    },
    "answer_url": "https://myschool.ng/classroom/government/48410?exam_type=waec&type=obj&page=318",
    "correct_answer": "C",
    "explanation": "In presidential system of government, the executive is elected and is not responsible to the legislature, which cannot in normal circumstances dismiss it. Such dismissal is possible, however, in uncommon cases, often through impeachment. The president is responsible to the electorates  who elected him into office. Unlike the paliamentary system where the head of state is accountable to the parliament who elected him/her into office.",
    "year": "2018"
  },
  {
    "number": "1591",
    "text": "A federal government is a form of __________.",
    "options": {
      "A": "decentralization",
      "B": "centralization",
      "C": "confederation",
      "D": "revolution"
    },
    "answer_url": "https://myschool.ng/classroom/government/48416?exam_type=waec&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "A federal government is a form of decentralization, where power and authority are divided between a central governing authority and various regional or state governments. This system allows for a distribution of powers and responsibilities, as opposed to centralization, where power is concentrated at a single level of government.",
    "year": "2018"
  },
  {
    "number": "1592",
    "text": "Which of the following alternatives is a feature of a federation",
    "options": {
      "A": "unwritten constitution",
      "B": "unicameral legislature",
      "C": "supremacy of the constitution",
      "D": "right to secede"
    },
    "answer_url": "https://myschool.ng/classroom/government/48419?exam_type=waec&type=obj&page=319",
    "correct_answer": "C",
    "explanation": "Supremacy of the Constitution: The Constitution is binding on the Federal and the State Governments. The Central Government as well as the State Governments derives their powers from the Constitution. Also, neither of the two Governments should be in a position to override the provisions of the Constitution related to the powers and status enjoyed by the other.",
    "year": "2018"
  },
  {
    "number": "1593",
    "text": "To preserve individual liberties, the judiciary should _____________.",
    "options": {
      "A": "consist of honest and impartial judges",
      "B": "be appointed by the executives",
      "C": "be prosecuted for judgement against the executive",
      "D": "participate in partisan politics"
    },
    "answer_url": "https://myschool.ng/classroom/government/48421?exam_type=waec&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "It is vitally important in a democracy that individual judges and thejudiciaryas a whole areimpartialand independent of all external pressures and of each other so that those who appear before them and the wider public can have confidence that their cases will be decided fairly and in accordance with the law.",
    "year": "2018"
  },
  {
    "number": "1594",
    "text": "Citizens can seek redress against injustice from the state through the?",
    "options": {
      "A": "ombudsman",
      "B": "head of civil service",
      "C": "civil service commission",
      "D": "titular executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/48423?exam_type=waec&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "An ombudsman, ombudsperson, ombud or public advocate is an official who is charged with representing the interests of the public by investigating and addressing complaints of maladministration or a violation of rights. The ombudsman is usually appointed by the government or by parliament, but with a significant degree of independence.",
    "year": "2018"
  },
  {
    "number": "1595",
    "text": "Which of these functions is performed by both political parties and pressure groups?",
    "options": {
      "A": "interest aggregation and articulation",
      "B": "source of mediation in a state",
      "C": "provision of specialized information",
      "D": "seeking to manage the affairs of the state"
    },
    "answer_url": "https://myschool.ng/classroom/government/48434?exam_type=waec&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "Political parties and pressure groupswork to achieve democratic goals. In a democracy,political parties and pressureor special interestgroupsare free to develop policies to achieve goals they have created. They also are free to work to elect candidates that will support and will advance those policies.",
    "year": "2018"
  },
  {
    "number": "1596",
    "text": "Which of these is not a source of revenue for political parties?",
    "options": {
      "A": "dues",
      "B": "grants",
      "C": "tolls",
      "D": "donations"
    },
    "answer_url": "https://myschool.ng/classroom/government/48444?exam_type=waec&type=obj&page=320",
    "correct_answer": "C",
    "explanation": "Apart from publicfunds, electioneering campaigns and otherpartyactivities,  elections are supported through privatesourcesincluding monies and in-kind contributions made topolitical partiesor candidates from: subscriptions, fees and levies frompartymembership, fines, proceeds from investments made by party faithfuls.",
    "year": "2018"
  },
  {
    "number": "1597",
    "text": "Pressure groups seek to influence the policies of the government ______________.",
    "options": {
      "A": "to the advantage of their members",
      "B": "so that all citizens can benefit",
      "C": "to suit the manifestos of political parties",
      "D": "to conform with electoral act"
    },
    "answer_url": "https://myschool.ng/classroom/government/48447?exam_type=waec&type=obj&page=320",
    "correct_answer": "A",
    "explanation": "Apressure group, also known as an interestgrouporlobby, is an organization formed by like-minded people who seek to influence PUBLIC POLICY to promote an interest. Motives for action may be based on a shared political, religious, moral, health or commercial position.",
    "year": "2018"
  },
  {
    "number": "1598",
    "text": "Which of the following agencies helps the most in shaping public opinion?",
    "options": {
      "A": "pressure groups",
      "B": "mass media",
      "C": "college and universities",
      "D": "peer groups"
    },
    "answer_url": "https://myschool.ng/classroom/government/48454?exam_type=waec&type=obj&page=320",
    "correct_answer": "B",
    "explanation": "Public opinion can be influenced byage,gender,income, hobbies,race, religion,occupation, etc., as well as theeconomicsituation during or concerning a public issue. Public opinion is mostly influenced by mass media which includes television, magazines, radio, and newspapers. This is so because, it reaches a wide range of audience and opinions about governement policies and style of leadership is formed based on what is reported by the mass media",
    "year": "2018"
  },
  {
    "number": "1599",
    "text": "Public opinion can be measured through all of the following except the?",
    "options": {
      "A": "imposition of laws without any debate",
      "B": "conduct of opinion",
      "C": "general review",
      "D": "holding of referendum in a state"
    },
    "answer_url": "https://myschool.ng/classroom/government/48462?exam_type=waec&type=obj&page=320",
    "correct_answer": "A",
    "explanation": "The public's opinion  about a governement cant be measured or ascertained through the imposition of laws, rather government can get to know what people think about a particular issue affecting the country by conducting opinion polls, surveys. It's most often determined throughpublic opinionpolls, these polls are surveys commissioned by various groups in order to determine people's thoughts on particular matters. These polls are conducted by polling organizations, which are businesses thatmeasure public opinionthrough strategic methods. other methods include, reviews of policies, organizing seminars, fairs, referendums etc",
    "year": "2018"
  },
  {
    "number": "1600",
    "text": "An electoral system which allows party members to elect candidates for elective offices is called?",
    "options": {
      "A": "by election",
      "B": "primary election",
      "C": "general election",
      "D": "direct election"
    },
    "answer_url": "https://myschool.ng/classroom/government/48467?exam_type=waec&type=obj&page=320",
    "correct_answer": "B",
    "explanation": "Primaryelection. Aprimaryelectionis anelectionused either to narrow the field of candidates for a given elective office or to determine the nominees for political parties in advance of a generalelection. it is an electoral process where members of a political party can indicate their preference for a candidate in an upcoming general election or by-election, thus narrowing the field of candidates.",
    "year": "2018"
  },
  {
    "number": "1601",
    "text": "On which of the following grounds can a citizen abstain from voting?",
    "options": {
      "A": "religion",
      "B": "education",
      "C": "wealth",
      "D": "status"
    },
    "answer_url": "https://myschool.ng/classroom/government/48468?exam_type=waec&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "The status of an individual plays a major role in determining their ability to vote in an election.  The law is very clear on electoral processes and exceptions. foreigners, convicted criminals who are still serving time in prison and underage people are not eligible to vote. In Nigeria for instance, Avoting ageis a minimumageestablished by law that a person must attain before they can participate in the voting process and the legal age is 18 years. one's status is a major determinant of their eligibility to vote or not to vote in an election.",
    "year": "2018"
  },
  {
    "number": "1602",
    "text": "Indirect election is best described as?",
    "options": {
      "A": "only women electing legislators",
      "B": "the citizenry electing legislators",
      "C": "electoral college electing legislators",
      "D": "only adults electing legislators"
    },
    "answer_url": "https://myschool.ng/classroom/government/48470?exam_type=waec&type=obj&page=321",
    "correct_answer": "C",
    "explanation": "An indirect election is an election in which voters do not choose between candidates for an office, but elect people who then choose. It is one of the oldest forms of elections, and is still used today for many presidents, cabinets, upper houses, and supranational legislatures. Presidents and prime ministers can be indirectly elected by parliaments or by a special body convened solely for that purpose. The election of the executive government in most parliamentary systems is indirect: ''the citizens elect the parliamentarians, who then elect the government including most prominently the prime minister from among themselves''.\nAnelectoral collegeis a set of electors who are selected to elect a candidate to a particular office. Often these represent different organizations, political parties etc.",
    "year": "2018"
  },
  {
    "number": "1603",
    "text": "The class that controls and supervises the activities of the executive class in the civil service is?",
    "options": {
      "A": "clerical class",
      "B": "manipulative class",
      "C": "professional class",
      "D": "administrative class"
    },
    "answer_url": "https://myschool.ng/classroom/government/48474?exam_type=waec&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "Anexecutive administratoris responsible for theadministrativetasks ofexecutives. In this position, one can expect to conduct research, create statistical reports, and prepare agendas for top management. Other tasks may include overseeing the office budget and ordering office supplies. The admnisitrative class oversee the running of the office by administering basic office procecedures and templates to enable the executive carry out their functions",
    "year": "2018"
  },
  {
    "number": "1604",
    "text": "The agency responsible for investigating allegations of maladministration and punishing offending career officers in the executive is the?",
    "options": {
      "A": "federal character commission",
      "B": "ethics commission",
      "C": "judicial commission",
      "D": "public/civil service commission"
    },
    "answer_url": "https://myschool.ng/classroom/government/48477?exam_type=waec&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "Acivil service commissionis a government agency that is constituted by legislature to regulate the employment and working conditions ofcivil servants, oversee hiring and promotions, and promote the values of the publicservice,and to exercise disciplinary control over all FederalCivil Servants.",
    "year": "2018"
  },
  {
    "number": "1605",
    "text": "The anonymity of civil servants means that they should not be?",
    "options": {
      "A": "prosecuted for any professional misconduct",
      "B": "disciplined because of their expertise",
      "C": "above the law of the land",
      "D": "praised or blamed publicly"
    },
    "answer_url": "https://myschool.ng/classroom/government/48478?exam_type=waec&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "Anonymity (civil service)The anonymity of the civil service is linked to two concepts: permanence and neutrality. Civil servants, many of whom remain in their jobs whilst serving numerous governments, are thus likely to have to give advice to governments of different political parties, who may have different attitudes to policy. And it follows from both of the above that civil servants cannot be held accountable for the success or failure of government policy, for otherwise their public explanations could contain criticisms of their political masters.",
    "year": "2018"
  },
  {
    "number": "1606",
    "text": "The following were limitations imposed on traditional rulers under colonial rule except?",
    "options": {
      "A": "were not permitted to raise armed forces",
      "B": "had no power to impose tax",
      "C": "had no power to install or dispose a chief",
      "D": "were no longer spiritual heads of the people"
    },
    "answer_url": "https://myschool.ng/classroom/government/48481?exam_type=waec&type=obj&page=322",
    "correct_answer": "D",
    "explanation": "Under colonial rule, traditional rulers were often restricted in their powers, including their ability to raise armed forces, impose taxes or install or remove chiefs. However, they generally retained their roles as spiritual leaders, which was an important aspect of their traditional authority.\nOther limitations imposed on the traditional rulers by  the colonial masters include:\nChiefs barred from forming an armyNo power to impose taxesNo power of legislationGovernor to sanction the enthronement of chiefsBarred from Settling  inter-tribal conflicts through war",
    "year": "2018"
  },
  {
    "number": "1607",
    "text": "A system of administration which allowed traditional rulers to rule their people under the supervision of the British officials in West Africa is?",
    "options": {
      "A": "divide and rule",
      "B": "colonization",
      "C": "indirect rule",
      "D": "assimilation"
    },
    "answer_url": "https://myschool.ng/classroom/government/48483?exam_type=waec&type=obj&page=322",
    "correct_answer": "C",
    "explanation": "Indirect Ruleis the system of government in which the traditional structures of the local people were employed in the administration of the British overseas territories in West Africa.Indirect rulewas a system of governance used by the British and French to control parts of their colonial empires, particularly in Africa and Asia, through pre-existing indigenous power structures. These dependencies were often called \"protectorates\" or \"trucial states\". Traditional rulers were used as intermediaries between the british and their colonies.",
    "year": "2018"
  },
  {
    "number": "1608",
    "text": "Local government is established in order to _________",
    "options": {
      "A": "bring government nearer to the people",
      "B": "build churches and mosque",
      "C": "curb corruption in the society",
      "D": "promote political apathy"
    },
    "answer_url": "https://myschool.ng/classroom/government/48490?exam_type=waec&type=obj&page=322",
    "correct_answer": "A",
    "explanation": "Grassroots participation in governance. One of the major reasons for the creation of local government in Nigeria is tobring governance closer to the people. Participation by the citizens-in-governance is one of the underlying precepts of democracy and the modern notion of government.",
    "year": "2018"
  },
  {
    "number": "1609",
    "text": "One reason for the adoption of Indirect Rule in British West Africa was?",
    "options": {
      "A": "availability of British officials",
      "B": "to ensure justice",
      "C": "inadequate finance",
      "D": "to assimilate the indigenes"
    },
    "answer_url": "https://myschool.ng/classroom/government/48493?exam_type=waec&type=obj&page=322",
    "correct_answer": "C",
    "explanation": "Indirect Rule was adopted in British West Africa primarily due to financial constraints. The British government needed a cost-effective way to administer its colonies, and using existing local structures and rulers helped minimize administrative costs.",
    "year": "2018"
  },
  {
    "number": "1610",
    "text": "Which of the following policies replaced Assimilation?",
    "options": {
      "A": "indigenat",
      "B": "loi cadre",
      "C": "association",
      "D": "indirect rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/48497?exam_type=waec&type=obj&page=322",
    "correct_answer": "C",
    "explanation": "The purpose of the Policy of Assimilation was toturnAfrican natives into \"French\" men by educating them in the language and French culture and hence become French citizens or equals.\nIt was replaced with the Policy of Association. This policy is of the opposing idea that: the relationship between the conqueror and the conquered, of white and black peoples, should be one of ‘association’, not one of identity and merging; it emphasised cooperation between the rulers and the ruled.",
    "year": "2018"
  },
  {
    "number": "1611",
    "text": "Which of the following is a reason for the failure of the assimilation policy in French West Africa?",
    "options": {
      "A": "the change in the name of their culture",
      "B": "the refusal of Africans to be culturally colonized",
      "C": "the democratic policy of the french",
      "D": "bribery of the opinion leaders by the french"
    },
    "answer_url": "https://myschool.ng/classroom/government/48498?exam_type=waec&type=obj&page=323",
    "correct_answer": "B",
    "explanation": "The assimilation policy in French West Africa failed primarily because many Africans resisted being culturally assimilated into French norms and values. They wanted to retain their own cultural identities and resist the imposition of foreign cultural practices.\nThese are some of the other reasons the French Policy of Assimilation failed;\n1. The varied African cultures made it difficult for them to be absorbed into the French culture2. The Africans were not able to get the French type of education3. The Africans were not willing to become Christians4. They forced opposition from the Muslims5. The French did not compete with the Africans for cabinet posts and commercial activities6. African traditional rulers feared they would lose their position7. French traders feared competition, so they opposed the system8. It was expensive to implement the system because of the vastness of the French empire.",
    "year": "2018"
  },
  {
    "number": "1612",
    "text": "Nationalism prior to the second world war was led by?",
    "options": {
      "A": "educated elites and chiefs",
      "B": "chiefs and elders",
      "C": "aggrieved cocoa farmers",
      "D": "African merchants"
    },
    "answer_url": "https://myschool.ng/classroom/government/48501?exam_type=waec&type=obj&page=323",
    "correct_answer": "A",
    "explanation": "Nationalismcan be defined as the desire for Africans to end all forms of foreign control andinfluenceso as to be able too take charge of their political, social and economic affairs. The second world war helped build strong African nationalism, which resulted in acommongoal for all Africans to fight for their freedom. World War II led to decolonization of Africa by affecting both Europe and Africa militarily, psychologically, politically, and economically. it was basically made up of the educated elites who had been educated by west education and the chiefs who felt threatened they might loose their positions and place of authority amongst their subjects, if they do not fight back to retain their seats as traditional rulers.",
    "year": "2018"
  },
  {
    "number": "1613",
    "text": "Which of the following is not a factor leading to military intervention in West African states?",
    "options": {
      "A": "excessive control of public enterprise",
      "B": "falsification of election results",
      "C": "mismanagement of the country's economy",
      "D": "corruption in high places"
    },
    "answer_url": "https://myschool.ng/classroom/government/48503?exam_type=waec&type=obj&page=323",
    "correct_answer": "A",
    "explanation": "The reasons ofmilitary interventions in politicshas taken place on the basis of vested interest ofmilitary, poverty, economic instability, weak institutions, corruption and as well as on the basis of lowpoliticalculture.",
    "year": "2018"
  },
  {
    "number": "1614",
    "text": "One of the problems of military administration in West Africa is that soldiers",
    "options": {
      "A": "are representatives of the people",
      "B": "lack discipline",
      "C": "are not well organized",
      "D": "are not trained for governance"
    },
    "answer_url": "https://myschool.ng/classroom/government/48509?exam_type=waec&type=obj&page=323",
    "correct_answer": "D",
    "explanation": "The military are not trained to rule and so when they come into power by means of a coup d' tat, their style of leadership is usually aggressive with no regards to the law in most cases. A military is a heavily-armed, highly-organised force primarily intended for warfare, also known collectively as armed forces.",
    "year": "2018"
  },
  {
    "number": "1615",
    "text": "In order to promote democracy and  good governance, the commonwealth of Nations",
    "options": {
      "A": "prosecutes leaders who commit atrocities at the international criminal court",
      "B": "organises seminars and training programs on technical assistance  to members",
      "C": "sanction members who do not pay their dues",
      "D": "sponsors election observer teams to monitor the conduct of elections."
    },
    "answer_url": "https://myschool.ng/classroom/government/48517?exam_type=waec&type=obj&page=323",
    "correct_answer": "D",
    "explanation": "The commonwealth of nations helps in Building, supporting and strengthening legal systems in member countries. This includes promoting regular elections and strengthening election bodies, institutions and processes.\nThe Commonwealth regularly sends teams to observe and report on the conduct of elections. it help build lasting democratic institutions, enabling citizen participation and representation at national and local level. They believe in invitation, not intervention, and follow the principles outlined in the international declaration and code of conduct for election observers",
    "year": "2018"
  },
  {
    "number": "1616",
    "text": "The foreign policy of a country could be influenced by?",
    "options": {
      "A": "personality of political leader",
      "B": "number of schools in a country",
      "C": "number of ministers in a country",
      "D": "national"
    },
    "answer_url": "https://myschool.ng/classroom/government/48518?exam_type=waec&type=obj&page=324",
    "correct_answer": "A",
    "explanation": "Foreign policy is a a government's strategy in dealing with other nations.The basic factors thatinfluenceforeignpolicyare the individual and domesticinfluences. The outcome depends on the individual decision making ability, on the type of society and government they want to work with.Theseinfluencesoperate from the individual and domestic levels of analysis.",
    "year": "2018"
  },
  {
    "number": "1617",
    "text": "Which of the following is not a problem faced by ECOWAS",
    "options": {
      "A": "financial security",
      "B": "political instability",
      "C": "larger market",
      "D": "colonial heritage"
    },
    "answer_url": "https://myschool.ng/classroom/government/48522?exam_type=waec&type=obj&page=324",
    "correct_answer": "A",
    "explanation": "Major problems facing the Economic Community of West African States, or ECOWAS, include political instability and poorgovernanceof member states, weakness andlackof diversification of national economies, poor orabsentinfrastructures fortransportationand communications, and an abundance of similar organizations with the same objectives. ECOWAS also faces various social problems endemic to the region and the indifference to progress manifested by some of its members.",
    "year": "2018"
  },
  {
    "number": "1618",
    "text": "The United Nation Organisation (UNO) is primary regarded as successful because",
    "options": {
      "A": "its members continue to increase",
      "B": "of its control of outbreak of another world war",
      "C": "all member countries have veto power",
      "D": "more member countries acquire more nuclear power"
    },
    "answer_url": "https://myschool.ng/classroom/government/48528?exam_type=waec&type=obj&page=324",
    "correct_answer": "B",
    "explanation": "The United Nations was created to save succeeding generations from thescourge of war, protect human rights, maintain international peace and security, and uphold international law.",
    "year": "2018"
  }
]