[
  {
    "number": "94",
    "text": "peril in insurance means",
    "options": {
      "A": "payment that is made by insurance",
      "B": "events that lead to a loss",
      "C": "exposure to no risk at all",
      "D": "money that is paid for insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49835?exam_type=waec&type=obj&page=19",
    "correct_answer": "B",
    "explanation": "A specific risk or cause of loss covered by an insurance policy, such as a fire, windstorm, flood, or theft.",
    "year": "2016"
  },
  {
    "number": "95",
    "text": "The body charged with the responsibility to promote and uphold universally accepted standards in insurance business",
    "options": {
      "A": "Nigeria council of registered insurance brokers",
      "B": "chartered insurance institute of Nigeria",
      "C": "National insurers association",
      "D": "Nigeria insurance commission"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49845?exam_type=waec&type=obj&page=19",
    "correct_answer": "D",
    "explanation": "The National Insurance Commission (NAICOM) was established in 1997 by the National Insurance Commission Act 1997 with responsibility for ensuring the effective administration, supervision, regulation and control of insurance business in Nigeria and protection of insurance policyholders, beneficiaries and third parties to insurance contracts.",
    "year": "2016"
  },
  {
    "number": "96",
    "text": "when a policy is cancelled before its expiry date, what is owed to the insured is",
    "options": {
      "A": "earned premium",
      "B": "unearned premium",
      "C": "return premium",
      "D": "unpaid premium"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49853?exam_type=waec&type=obj&page=20",
    "correct_answer": "C",
    "explanation": "returnpremium. An amount, equal to a fraction of thepremium, which is given back to the insured in the case of a cancellation, an adjustment to the rate, or an overpayment of an advancepremium.",
    "year": "2016"
  },
  {
    "number": "97",
    "text": "The person named to recieve the life assurance proceeds after the date of the life assured is?",
    "options": {
      "A": "beneficiary",
      "B": "receiver",
      "C": "administrator",
      "D": "next of kin"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49861?exam_type=waec&type=obj&page=20",
    "correct_answer": "A",
    "explanation": "Abeneficiaryis the person or entity you name in a lifeinsurancepolicy to receive the death benefit.",
    "year": "2016"
  },
  {
    "number": "98",
    "text": "A term insurance policy is cheap because?",
    "options": {
      "A": "there is no claim if the insured survives the period",
      "B": "the claim is small and easy to pay",
      "C": "there is claim if the insured survives the period",
      "D": "there is no payment due to the insured"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49863?exam_type=waec&type=obj&page=20",
    "correct_answer": "A",
    "explanation": "Term insuranceis generallycheaperbecause the coverage is only provided for a specific period of time.Inmost cases, theinsurance companywill never pay out because you will outlive thetermand thepolicywill expire.",
    "year": "2016"
  },
  {
    "number": "99",
    "text": "which of the following benefits will be covered under personal accident insurance",
    "options": {
      "A": "burial expenses",
      "B": "medical expenses",
      "C": "legal expenses",
      "D": "mortuary expenses"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49866?exam_type=waec&type=obj&page=20",
    "correct_answer": "B",
    "explanation": "Medicalcareexpensesinclude payments for the diagnosis, cure, mitigation,treatment, or prevention of disease, or payments for treatments affecting any structure or function of the body.",
    "year": "2016"
  },
  {
    "number": "100",
    "text": "An attachment to an insurance policy that modifies the policy is?",
    "options": {
      "A": "applicable",
      "B": "variation list",
      "C": "log book",
      "D": "endorsement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49870?exam_type=waec&type=obj&page=20",
    "correct_answer": "D",
    "explanation": "The purpose of an endorsement is a policy change. Insurance companies create endorsements to offer options to insureds to add coverage or increase coverage limits, but insurers may also issue special endorsements to limit or restrict coverage. Insurance endorsements are used in property and casualty insurance.",
    "year": "2016"
  },
  {
    "number": "101",
    "text": "An event sufficiently related to a legally recognizable injury to be the cause of that injury is?",
    "options": {
      "A": "hazard",
      "B": "remote clause",
      "C": "proximate cause",
      "D": "peril"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49871?exam_type=waec&type=obj&page=21",
    "correct_answer": "C",
    "explanation": "Proximate causeis a keyprincipleof insurance and is concerned with how the loss or damage actually occurred and whether it is indeed as a result of an insured peril",
    "year": "2016"
  },
  {
    "number": "102",
    "text": "which of the following professionals assist in determining the actual cost of a loss to be paid by an insurer on a claim",
    "options": {
      "A": "loss adjuster",
      "B": "insurance broker",
      "C": "actuary",
      "D": "surveyor"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49875?exam_type=waec&type=obj&page=21",
    "correct_answer": "C",
    "explanation": "Anactuaryis a business professional who deals with the measurement and management of risk and uncertainty. Being anactuarymeans having highly valued mathematical skills and expertise. Actuaries come from different academic backgrounds but share a love of maths even if they haven’t done a maths degree.",
    "year": "2016"
  },
  {
    "number": "103",
    "text": "A blanket policy in fidelity guarantee insurance is to cover",
    "options": {
      "A": "cashiers handling cash",
      "B": "all staff that may handle cash",
      "C": "cash from office to bank",
      "D": "all receivables of the company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49880?exam_type=waec&type=obj&page=21",
    "correct_answer": "B",
    "explanation": "Fidelity Guarantee policyindemnifies againstinfidelityof an employee which leads to financial loss. It covers for the loss of money, goods and/or stock arising from dishonesty, embezzelment or misappropriation of company's funds &/or property by employees.\nAblanket policyis a form of property insurance that covers more than one type of property at one location, or the same type at various locations, or multiple types at multiples locations. It allows the policyholder to extend the coverage of a basic homeowner'spolicy.",
    "year": "2016"
  },
  {
    "number": "104",
    "text": "A ''no claim discount'' will be granted under",
    "options": {
      "A": "fidelity guarantee insurance",
      "B": "marine insurance",
      "C": "life insurance",
      "D": "motor insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49889?exam_type=waec&type=obj&page=21",
    "correct_answer": "D",
    "explanation": "No-claim bonus (NCB) is a discount in premium offered by insurance companies if a vehicle owner has not made a single claim during the term of the motor insurance policy.",
    "year": "2016"
  },
  {
    "number": "105",
    "text": "To insure any property, the insured must have",
    "options": {
      "A": "insurable interest",
      "B": "goodwill",
      "C": "premium",
      "D": "valuable consideration"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49892?exam_type=waec&type=obj&page=21",
    "correct_answer": "A",
    "explanation": "Insurable interest isdefined as the reasonable concern of a person to obtain insurance for any individual or property against unforeseen events such as death, losses, etc.",
    "year": "2016"
  },
  {
    "number": "106",
    "text": "A motor policy that provides cover for the loss or damage of a vehicle used for farming purposes is",
    "options": {
      "A": "private car policy",
      "B": "agricultural policy",
      "C": "special type policy",
      "D": "motor trades policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49901?exam_type=waec&type=obj&page=22",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "107",
    "text": "one of the difference between contract of life assurance and non life insurance is?",
    "options": {
      "A": "non-life requires renewal while life does not",
      "B": "life requires renewal while non-life does not",
      "C": "life is subject to indemnity while non life is not",
      "D": "non-life is subject to compensation while life is not"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49902?exam_type=waec&type=obj&page=22",
    "correct_answer": "D",
    "explanation": "Life insurance is a contract between an insurance policy holder and an insurer or assurer, where the insurer promises to pay a designated beneficiary a sum of money in exchange for a premium, upon the death of an insured person.\nNon-life insurancerefers to theinsuranceof goods and properties. ...Non-life insuranceis taken as a means of providing financial protection for building, machinery, equipment, furniture, and vehicle and merchandise items against the risk of fire, earthquake, accident and theft.",
    "year": "2016"
  },
  {
    "number": "108",
    "text": "The duty of a loss assessor is to ensure",
    "options": {
      "A": "adequate compensation to the insured",
      "B": "payment of premium to the insurer",
      "C": "that risk manager identifies the risk properly",
      "D": "that insurance broker collects commission"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49903?exam_type=waec&type=obj&page=22",
    "correct_answer": "A",
    "explanation": "A Loss Assessor is appointed by the policyholder when they need to submit a substantial or complex claim.\nIndependent entity hired and paid by the insured (policy holder) to negotiate an insurance claim with the insurer (insurance company). Thelossassessorreceives a fee that is usually a percentage of the claim amount received by the insured.",
    "year": "2016"
  },
  {
    "number": "109",
    "text": "which class of insurance would be required by a petrol filling station operator whose operation involve high financial  transactions?",
    "options": {
      "A": "burglary  policy",
      "B": "public liability policy",
      "C": "goods-in-transit policy",
      "D": "money policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49904?exam_type=waec&type=obj&page=22",
    "correct_answer": "D",
    "explanation": "Money insurance policy provides cover for loss of money in transit between the insured’s premises, bank and other specified places occasioned by robbery, theft or any other fortuitous cause. It also provides cover for loss of money in the business premises, safe or vault, etc.",
    "year": "2016"
  },
  {
    "number": "110",
    "text": "which of the following conditions must be met before and insurer is under obligation to pay claim",
    "options": {
      "A": "loss notification",
      "B": "premium payment",
      "C": "completion of proposal form",
      "D": "submission of policy paper to the insurer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49906?exam_type=waec&type=obj&page=22",
    "correct_answer": "B",
    "explanation": "In insurance, the insurance policy is a contract between the insurer and the insured, known as the policyholder, which determines the claims which the insurer is legally required to pay. In exchange for an initial payment, known as the premium, the insurer promises to pay for loss caused by perils covered under the policy language. The insurer is only obligated to pay for claims if the insured keeps their own part of the bargain by paying the premium.",
    "year": "2016"
  },
  {
    "number": "111",
    "text": "A risk classified is uninsurable when the",
    "options": {
      "A": "extent of the loss can be calculated",
      "B": "risk will occur no matter the precaution taken",
      "C": "risk may not happen",
      "D": "insurance company cannot pay"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49908?exam_type=waec&type=obj&page=23",
    "correct_answer": "B",
    "explanation": "Uninsurable riskis a condition that poses unknowable or unacceptableriskof loss or a situation in which the insurance would be against the law. Insurance companies limit their losses by not taking on certainrisksthat are very likely to result in a loss.\nIn many cases catastrophes, such as earthquakes, have becomeuninsurable risks. a situation for which an insurance company will not provide insurance, because, forexample, it is certain to happen: A person suffering from a terminal illness is considered to be anuninsurable risk.",
    "year": "2016"
  },
  {
    "number": "112",
    "text": "A profefessional charged with the responsibility of assessing loss in insurance",
    "options": {
      "A": "underwriter",
      "B": "adjuster",
      "C": "actuary",
      "D": "broker"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49909?exam_type=waec&type=obj&page=23",
    "correct_answer": "B",
    "explanation": "Aloss adjusteris an insurance agent who assesses the amount of compensation that should be paid after a person has claimed on their insurance policy.",
    "year": "2016"
  },
  {
    "number": "113",
    "text": "A clause that prevents the insurer from paying under a policy if the insured killed himself is?",
    "options": {
      "A": "exceptional clause",
      "B": "revival clause",
      "C": "accidental clause",
      "D": "suicide clause"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49911?exam_type=waec&type=obj&page=23",
    "correct_answer": "D",
    "explanation": "The “suicide clause.” Usually, this clause states that no death benefit will be paid if the insured commits suicide within two years of taking out a policy. Whenever an insured person replaces an existing life insurance policy with a new one, the time clock for the suicide clause is set back to zero and starts over again.",
    "year": "2016"
  },
  {
    "number": "114",
    "text": "A component of an insurance policy document that introduces the parties to the contract is,",
    "options": {
      "A": "exceptional clause",
      "B": "recital clause",
      "C": "particular clause",
      "D": "operative clause"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49914?exam_type=waec&type=obj&page=23",
    "correct_answer": "B",
    "explanation": "A recital clause is the introduction and identification of the relevant parties involved in the contract in terms of insurance. A recital helps define the contract in non-legal terms.",
    "year": "2016"
  },
  {
    "number": "115",
    "text": "The responsibility of the institute of loss adjuster is to?",
    "options": {
      "A": "regulate the activities of its members",
      "B": "settle disputes among insurance companies",
      "C": "register all insurance practitioners",
      "D": "act as intermediaries between government and its members"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49915?exam_type=waec&type=obj&page=23",
    "correct_answer": "A",
    "explanation": "The objectives of theInstituteis to establish and sustain a professional body of practicingLoss Adjustersin Nigeria; to engage in activities that will ensure the general welfare and public well being of InsuranceLoss Adjustersand to take necessary actions for the advancement of education in the field ofloss adjusting",
    "year": "2016"
  },
  {
    "number": "116",
    "text": "The process of transfering a risk already taken by an insurer to other insurers is?",
    "options": {
      "A": "assurance",
      "B": "re-investment",
      "C": "reinsurance",
      "D": "insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49917?exam_type=waec&type=obj&page=24",
    "correct_answer": "C",
    "explanation": "Reinsurance; The contract made between an insurance company and a third party to protect the insurance company from losses. Reinsurance is insurance that is purchased by an insurance company, in which some part of its own insurance liabilities is passed on to another insurance company.",
    "year": "2016"
  },
  {
    "number": "117",
    "text": "In motor insurance, which of the following covers will take care of all parties that can be involded in an accident",
    "options": {
      "A": "comprehensive",
      "B": "Act only",
      "C": "third party",
      "D": "third party, fire and theft"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49918?exam_type=waec&type=obj&page=24",
    "correct_answer": "A",
    "explanation": "Comprehensive insuranceis a coverage that helps pay to replace or repair your vehicle if it's stolen or damaged in an incident that's not a collision.Comprehensivetypically covers damage from fire, vandalism or falling objects (like a tree or hail).",
    "year": "2016"
  },
  {
    "number": "118",
    "text": "A class of insurance that covers policy holders for losses caused by fruadulent employees is?",
    "options": {
      "A": "all risk policy",
      "B": "key-man policy",
      "C": "fidelity guarantee policy",
      "D": "money insurance policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49919?exam_type=waec&type=obj&page=24",
    "correct_answer": "C",
    "explanation": "A fidelity guarantee is a form of insurance protection that covers policyholders for losses that they incur as a result of fraudulent acts by specified individuals. It usually insures a business for losses caused by the dishonest acts of its employees.",
    "year": "2016"
  },
  {
    "number": "119",
    "text": "Risk assumed by more than one insurance company and shared accordingly",
    "options": {
      "A": "co-insurance",
      "B": "joint insurance",
      "C": "re-insurance",
      "D": "group insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49920?exam_type=waec&type=obj&page=24",
    "correct_answer": "A",
    "explanation": ".co-insurance; is a situation in which two or more insurance companies share a risk",
    "year": "2016"
  },
  {
    "number": "120",
    "text": "An insurance cover that protects experts from bearing the cost of negligence arising from their service?",
    "options": {
      "A": "fidelity guarantee insurance",
      "B": "third party liability insurance",
      "C": "professional indemnity insurance",
      "D": "product liability insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49921?exam_type=waec&type=obj&page=24",
    "correct_answer": "C",
    "explanation": "professional indemnity insuranceis a form of liability insurance which helps protect professional advice- and service-providing individuals and companies from bearing the full cost of defending against a negligence claim made by a client, and damages awarded in such a civil lawsuit.",
    "year": "2016"
  },
  {
    "number": "121",
    "text": "which of the following policies can be used as security for a loan.",
    "options": {
      "A": "key-man policy",
      "B": "endowment policy",
      "C": "term insurance policy",
      "D": "whole life insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49923?exam_type=waec&type=obj&page=25",
    "correct_answer": "C",
    "explanation": "Acollateralassignment oflife insuranceis a conditional assignment appointing a lender as the primary beneficiary of a death benefit touseascollateral for a loan. If the borrower is unable to pay, the lendercancashinthelife insurance policyand recover what is owed.",
    "year": "2016"
  },
  {
    "number": "122",
    "text": "the insurance prinsiple that deals with mr adeyem's failure to inform the insurer about his wife's usage of the car is?",
    "options": {
      "A": "negligence",
      "B": "misrepresentation",
      "C": "untrue statement",
      "D": "utmost good faith"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49924?exam_type=waec&type=obj&page=25",
    "correct_answer": "D",
    "explanation": "utmost good faith\". It is the name of a legal doctrine which governs insurance contracts. This means that all parties to an insurance contract must deal in good faith, making a full declaration of all material facts in the insurance proposal.The parties to the insurance can contract must act in all honestly without witholding necessary information from each other.",
    "year": "2016"
  },
  {
    "number": "123",
    "text": "what is the effect of the damage by rioters as regards the claim. he will?",
    "options": {
      "A": "not get anything",
      "B": "be paid half",
      "C": "get money from rioters",
      "D": "be paid in full"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49925?exam_type=waec&type=obj&page=25",
    "correct_answer": "D",
    "explanation": "Comprehensive insurance is a type of insurance policy that provides wide-ranging coverage for unforeseen mishaps. It protects the insured person or company from things that happen to their property or business that are beyond their control. The comprehensive cover shield the vehicle from all unforseen events. the wife's failure to have a driving license didnt cause the rioters to attach the vehicle",
    "year": "2016"
  },
  {
    "number": "124",
    "text": "what is the proximage cause of the damage to the car",
    "options": {
      "A": "misrepresentation",
      "B": "inexperienced driving",
      "C": "riot",
      "D": "reckless driving"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49926?exam_type=waec&type=obj&page=25",
    "correct_answer": "C",
    "explanation": "Aproximate cause isone thatislegally sufficient to result in liability. Itisan act or omission thatisconsidered in law to result in a consequence, so that liabilitycanbe imposed on the actor. Itisthecausethat directly produces an event.",
    "year": "2016"
  },
  {
    "number": "125",
    "text": "surrender value is the amount payable if the insured",
    "options": {
      "A": "does not want to continue with the life policy",
      "B": "does not want to continue with car insurance",
      "C": "died when a policy is valid",
      "D": "died when a policy is not valid"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49927?exam_type=waec&type=obj&page=25",
    "correct_answer": "A",
    "explanation": "'Surrender Value' It is the amount the policyholder will get from the life insurance company if he decides to exit the policy before maturity, usually a whole life policy.",
    "year": "2016"
  },
  {
    "number": "126",
    "text": "business interruption claims will only be settled if it is caused by?",
    "options": {
      "A": "permanent disability",
      "B": "machinery breakdown",
      "C": "sickness",
      "D": "death"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49928?exam_type=waec&type=obj&page=26",
    "correct_answer": "B",
    "explanation": "Business interruption insurance(also known asbusiness income insurance) is a type ofinsurancethatcoversthe loss ofincomethat abusinesssuffers after a disaster. Theincomelosscoveredmay be due to disaster-related closing of thebusinessfacility or due to the rebuilding process after a disaster.",
    "year": "2016"
  },
  {
    "number": "127",
    "text": "which of the following is a subject matter of insurance in fire policy",
    "options": {
      "A": "building",
      "B": "shares",
      "C": "corporation",
      "D": "money"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49930?exam_type=waec&type=obj&page=26",
    "correct_answer": "A",
    "explanation": "Subject matter of insurance is the life, limbs, property, rights or any potential legal liability insured under a policy. in a fire policy, a building is a subject matter",
    "year": "2016"
  },
  {
    "number": "128",
    "text": "An insurer will recover claims paid wrongly to an insured if",
    "options": {
      "A": "it was ex-gratia payment",
      "B": "there was a mistake of law",
      "C": "the premium had not been paid",
      "D": "it was effected by court order"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49932?exam_type=waec&type=obj&page=26",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "129",
    "text": "The principle of insurance that demands that the insured must stand to loss in the event of a loss before taking a policy is",
    "options": {
      "A": "consideration",
      "B": "insurable interest",
      "C": "proximate cause",
      "D": "subrogation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49933?exam_type=waec&type=obj&page=26",
    "correct_answer": "B",
    "explanation": "Insurable interest isdefined as the reasonable concern of a person to obtain insurance for any individual or property against unforeseen events such as death, losses, etc. it is the main reason an insurance contract is entered into",
    "year": "2016"
  },
  {
    "number": "130",
    "text": "A guarantee issue by an insurance company to support their client who is applying for a contract is",
    "options": {
      "A": "performance bond",
      "B": "bid bond",
      "C": "retention bond",
      "D": "advance payment bond"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49935?exam_type=waec&type=obj&page=26",
    "correct_answer": "A",
    "explanation": "performance bond; is a bond issued by a bank or other financial institution, guaranteeing the fulfilment of a particular contract.",
    "year": "2016"
  },
  {
    "number": "131",
    "text": "features of insurable risk include?\n(i) fortuity (ii) insurer (iii) utmost good faith (iv) financial value",
    "options": {
      "A": "I and ii only",
      "B": "ii and iii",
      "C": "iii and iv",
      "D": "I and iv only"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49936?exam_type=waec&type=obj&page=27",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "132",
    "text": "A document used to alter the information contained in the schedule of a policy is?",
    "options": {
      "A": "slip",
      "B": "endorsement",
      "C": "cover note",
      "D": "policy form"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49937?exam_type=waec&type=obj&page=27",
    "correct_answer": "B",
    "explanation": "Aninsurance endorsementis an amendment or addition to an existinginsurancecontract which changes the terms or scope of the original policy.Endorsementsmay also be referred to as riders. Aninsurance endorsementmay be used to add, delete, exclude or otherwise altercoverage.",
    "year": "2016"
  },
  {
    "number": "133",
    "text": "Ex-gratia payment is made where there is",
    "options": {
      "A": "no legal liability obligation",
      "B": "legal liability obligation",
      "C": "need to refund a premium",
      "D": "delay in payment of compensation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49939?exam_type=waec&type=obj&page=27",
    "correct_answer": "A",
    "explanation": "ex gratia payment. A sum of moneypaidwhen there was no obligation or liability topayit. For example, a lump sumpaymentover and above the pension benefits of a retiring employee. In insurance claims, it may take the form ofpaymentfor which the insurer did not appear to be liable.",
    "year": "2016"
  },
  {
    "number": "134",
    "text": "the sum assured is the value of the?",
    "options": {
      "A": "claim",
      "B": "policy",
      "C": "premium",
      "D": "penalty"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49941?exam_type=waec&type=obj&page=27",
    "correct_answer": "B",
    "explanation": "· An insurance claim is a formal request by a policyholder to an insurance company for coverage or compensation for a covered loss or policy event.",
    "year": "2016"
  },
  {
    "number": "135",
    "text": "Hazard in insurance means?",
    "options": {
      "A": "a situation that posses a threat to life or property",
      "B": "a situation where there is no agreement",
      "C": "event that cannot legally be insured",
      "D": "event that has been insured in the past"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49942?exam_type=waec&type=obj&page=27",
    "correct_answer": "A",
    "explanation": "Hazardis a condition or situation that increases the chance of loss in aninsured risk.",
    "year": "2016"
  },
  {
    "number": "136",
    "text": "A life insurance contract will be affected by failure to disclose?",
    "options": {
      "A": "correct address",
      "B": "status of assured",
      "C": "place of work",
      "D": "correct date of birth"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49943?exam_type=waec&type=obj&page=28",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "137",
    "text": "A document used to provide evidence of insurance if the policy document is not imediately available is",
    "options": {
      "A": "certificate",
      "B": "cover note",
      "C": "proposal form",
      "D": "endorsement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49944?exam_type=waec&type=obj&page=28",
    "correct_answer": "B",
    "explanation": "A cover note a temporary certificate showing that a person has a current insurance policy.",
    "year": "2016"
  },
  {
    "number": "138",
    "text": "To assess aviation risks, the underwriter would want to know the",
    "options": {
      "A": "size of the airport",
      "B": "financial capacity of the airline",
      "C": "age of the aircraft",
      "D": "staff strength of the airline"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49945?exam_type=waec&type=obj&page=28",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2016"
  },
  {
    "number": "139",
    "text": "The policy taken to cover loss of income that a business suffers when its facilities are closed due to a disaster is",
    "options": {
      "A": "group insurance",
      "B": "business support",
      "C": "fire insurance",
      "D": "business interruption"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49947?exam_type=waec&type=obj&page=28",
    "correct_answer": "D",
    "explanation": "Business interruption insurance (also known as business income insurance) is a type of insurance that covers the loss of income that a business suffers after a disaster.The income loss covered may be due to disaster-related closing of the business facility or due to the rebuilding process after a disaster",
    "year": "2016"
  },
  {
    "number": "140",
    "text": "A life policy where the insured cannot make claim himself because the payment cannot be made in his life time is",
    "options": {
      "A": "whole life policy",
      "B": "annuity policy",
      "C": "key-man policy",
      "D": "endowment policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49949?exam_type=waec&type=obj&page=28",
    "correct_answer": "A",
    "explanation": "whole life policy is a life insurance policy which is guaranteed to remain in force for the insured's entire lifetime, provided required premiums are paid, or to the maturity date. it can only be cashed after the death of the insured.",
    "year": "2016"
  },
  {
    "number": "141",
    "text": "what is the sum assured for the policy",
    "options": {
      "A": "N26,400",
      "B": "N44,000",
      "C": "N300,000",
      "D": "N528,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49952?exam_type=waec&type=obj&page=29",
    "correct_answer": "D",
    "explanation": "2200 * 12 months = 26,400 (yearly premium)\n26,400 * 20years = 528,000",
    "year": "2016"
  },
  {
    "number": "142",
    "text": "what is the term for the period he will be allowed to reinstate the contract",
    "options": {
      "A": "cooling off period",
      "B": "repayments",
      "C": "days of grace",
      "D": "lays days"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49953?exam_type=waec&type=obj&page=29",
    "correct_answer": "C",
    "explanation": "Aninsurance grace periodis a defined amount of time after the premium is due in which a policyholder can make a premium payment without coverage lapsing.",
    "year": "2016"
  },
  {
    "number": "143",
    "text": "what is the term used for the amount payable to mr. Thomas if he chooses to discontinue with the contract",
    "options": {
      "A": "premium return",
      "B": "reinstatement return",
      "C": "terminal claim",
      "D": "surrender value"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49955?exam_type=waec&type=obj&page=29",
    "correct_answer": "D",
    "explanation": "'Surrender Value'; It is the amount the policyholder will get from the life insurance company if he decides to exit the policy before maturity.",
    "year": "2016"
  }
]