[
  {
    "number": "42",
    "text": "Highlight the preservation of the Qur;an in the early days of Islam.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56450?exam_type=waec&type=theory&page=9",
    "correct_answer": "According to the Muslim understanding, the Qur’an was revealed to the Prophet Muhammad  over 23 years, from the age of 40 to his death at the age of 63. Over those 23 years, he received the revelation from God in a number of ways. Most commonly, it was spoken to him directly by the Angel Gabriel, but at other times it came during his dreams, and on a number of occasions, it even came to him directly from God, and he experienced this as the sound of a heavy bell, after which the words of the revelation were made clear to him.\nThroughout those 23 years, the Prophet  endeavoured to share the revelation with those around him as soon as it came. He did this verbally, as he couldn’t read or write, but he strongly encouraged others around him to write down the revelation, as well as memorise it. This was the basis of how Muslims believe the Qur’an became preserved, not purely through written or oral means, but with both strengthening the other. The companions around him constantly strove to memorise the verses, with many eventually memorising the entire book, and simultaneously wrote these verses on parchment, bone, wood, stone, basically whatever they had around them. Over time at least 65 companions functioned as scribes for the Prophet , who eventually established a school in Madinah dedicated to teaching 900 of his companions to read and write.\nHowever, the dialect of the Quraishi tribe that the Prophet  spoke in was not the only dialect of the Arabian peninsula, and as the religion was adopted by a growing number of tribes, they began to struggle with understanding the Qur’an. To overcome this, the Prophet  was given permission to teach the Qur’an in 7 of the main dialects in the region, allowing the message to be understood more widely. These dialects didn’t affect the written records, as they were only different when the Qur’an was actually vocalised.\nThis was the state of the Qur’an at the death of the Prophet . Hundreds of companions who had memorised the complete Qur’an in 7 official dialects, all of which were considered valid ways of reciting the Qur’an, as well as an incredible amount of written records that were held by the Prophets companions throughout Madinah and beyond. The placing of each verse within each chapter had been established by the Prophet , but because each chapter functions as an independent unit, the companions had different ways of ordering the chapters themselves within the book as a whole.",
    "explanation": "According to the Muslim understanding, the Qur’an was revealed to the Prophet Muhammad  over 23 years, from the age of 40 to his death at the age of 63. Over those 23 years, he received the revelation from God in a number of ways. Most commonly, it was spoken to him directly by the Angel Gabriel, but at other times it came during his dreams, and on a number of occasions, it even came to him directly from God, and he experienced this as the sound of a heavy bell, after which the words of the revelation were made clear to him.\nThroughout those 23 years, the Prophet  endeavoured to share the revelation with those around him as soon as it came. He did this verbally, as he couldn’t read or write, but he strongly encouraged others around him to write down the revelation, as well as memorise it. This was the basis of how Muslims believe the Qur’an became preserved, not purely through written or oral means, but with both strengthening the other. The companions around him constantly strove to memorise the verses, with many eventually memorising the entire book, and simultaneously wrote these verses on parchment, bone, wood, stone, basically whatever they had around them. Over time at least 65 companions functioned as scribes for the Prophet , who eventually established a school in Madinah dedicated to teaching 900 of his companions to read and write.\nHowever, the dialect of the Quraishi tribe that the Prophet  spoke in was not the only dialect of the Arabian peninsula, and as the religion was adopted by a growing number of tribes, they began to struggle with understanding the Qur’an. To overcome this, the Prophet  was given permission to teach the Qur’an in 7 of the main dialects in the region, allowing the message to be understood more widely. These dialects didn’t affect the written records, as they were only different when the Qur’an was actually vocalised.\nThis was the state of the Qur’an at the death of the Prophet . Hundreds of companions who had memorised the complete Qur’an in 7 official dialects, all of which were considered valid ways of reciting the Qur’an, as well as an incredible amount of written records that were held by the Prophets companions throughout Madinah and beyond. The placing of each verse within each chapter had been established by the Prophet , but because each chapter functions as an independent unit, the companions had different ways of ordering the chapters themselves within the book as a whole.",
    "year": "2014"
  },
  {
    "number": "43",
    "text": "Outline the lessons in the Prophet&rsquo;s (S.A.W.) Farewell Sermon.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56451?exam_type=waec&type=theory&page=9",
    "correct_answer": "The month of Zhul Hijja is a special month. It is the month of Hajj. Just as the last ten nights of Ramadan are the best nights of the year, so are the first ten days of Zhul Hijjah. In fact, they are the best ten days of the year filled with immense blessings. One should increase his/her acts of worship (ibadat) through fasting, charity, zikr, additional prayers, supplications, and of course,udhiyahor animal sacrifice, a tradition commemorating the legacy of Ibrahim (AS) for his willingness to sacrifice his son Ismael. This occasion occurs on the tenth day of Zhul Hijjah.In the tenth year after migration to al-Madinah (hijirah), Muhammad (SAW) performed his only hajj along with thousands of companions. The journey of hajj was indeed a significant event. The Prophet (SAW) established the rites of Hajj, an important mode of worship incumbent upon every able Muslim once in his/her lifetime. Additionally, according to some scholars, it is believed that on the ninth day, the day of Arafat, he (SAW) received the last revelation,“This day, I have perfected for you your religion (deen), completed my favor upon you and am pleased with Islam as your deen (way of life).”(al-Ma’idah, 5:3)The companions rejoiced. However, upon hearing the ayah, Omar (RAA) cried. The Prophet (SAW) asked, “What makes you cry O’ Omar?” “Although nothing is perfect, our deen is perfect now and I fear that with time it is going to deteriorate,” Omar replied. The Prophet (SAW) agreed and said, “You have spoken the truth.” He (SAW) then said, “Islam began as something strange, and shall return to being strange as it began, so blessed are the strangers.”Indeed, the samejahilipractices that were prevalent before Islam such as tribal wars, bloodshed, intoxication, music, adultery and fornication, interest and usury, etc. can be seen today everywhere in the world and just as Islam was conceived to be strange back then, the same teachings today are considered to be strange. Therefore, blessed are strangers who adhere to the deen dearly while sharing its message with others.Throughout the journey of hajj, the Prophet (SAW) would admonish and advise his people. His speeches were collected in what is commonly known as “The Prophet’s Farewell Sermon” orHajjatul Wada’.The sermon highlighted the most significant teachings of his prophetic mission of twenty-three years. Such pearls of wisdom have been etched in the books and minds of many Muslims for all time to come. It was, among others things, a document of human rights.After praising and thanking Allah (SWT), the Prophet (SAW) said, “O people! Lend me an attentive ear. For I know not whether after this year I shall ever be among you. Therefore, listen to what I am saying very carefully and take these words to those who are not present here today.” Months after he delivered the sermon, the Prophet (SAW) returned back to His Lord leaving behind a great legacy.The Prophet’s speech began with a word of caution. He addressed the sanctity of human lives. He (SAW) reminds, “O people! Just as you regard this month, this day, this city as sacred so regard the life and property of every Muslim as a sacred trust. Return the goods entrusted to you to their rightful owners. Hurt no one so that no one may hurt you. Remember that you will meet your Lord and that He will indeed reckon your deeds.”The Prophet (SAW) took advantage of the most blessed and sacred day of Arafat in the sacred month of Hajj, in the most sacred place in the world, Makkah to make a point. Bloodshed is forbidden due to the sanctity of human life. In addition to human life, people’s properties are also sacred. In a hadith the prophet insisted, “The blood, wealth and honor of the Muslim are sacred to all Muslims.” He (SAW) stressed, “The destruction of the world in the sight of Allah is lighter than the killing of one Muslim man.”The Qur’an is very clear on this subject as many passages address the sanctity of human lives. In one place Allah emphatically stresses this point,“And do not take any human being’s life – (the life) which God has willed to be sacred – except through (due process of) law.”(17:33) The Qur’an clearly states that whoever kills an innocent soul has committed an act akin to murdering all of humanity.“If anyone kills a person; unless in retribution for murder or spreading corruption in the land, it is as if he kills all mankind, while if any saves a life it is as if he saves the lives of all mankind” (al-Ma’idah,5:32).The US declaration of “War on Terrorism” has left millions dead. The imperial wars succeeded in dividing Muslims creating a rift between Muslim nation states sowing the seed of discord and disunity. Muslims killing other Muslims, complete destruction of cities and towns, people leaving their homes and properties to be plundered and looted by gangs that allege to be good Muslims - apparently the teachings of the Prophet (SAW) have fallen on deaf ears.In addition to the sanctity of human lives, the Prophet mentioned the sanctity of properties, “Return the goods entrusted to you to their rightful owners.” This statement echoes Allah’s mandate,“Allah commands you to return the trusts to their rightful owners.”(an-Nisa’, 4:58) One of the main qualities of a true believer is that they safeguard their trusts and fulfill their promises.Muslims who have betrayed any trust, big or small, to any person, Muslim or non-Muslim, must settle it before meeting his/her Lord. Those who don’t will have a difficult time on the Day of Judgment as such matters will be settled by Allah (SWT) on the grand day of accountability,“And He is the Best of Judges.”(al-An’am, 6:57) The Prophet (SAW) made it very clear, “Hurt no one so that no one may hurt you. Remember that you will meet your Lord and that He will indeed reckon your deeds.”In his sermon, the Prophet (SAW) touched upon something of great importance, the subject of interest and usury (riba). Riba was introduced in Arabia by the Jews who lived there. The practice ofribais so abhorrent that even the polytheists (mushriks) of Quraish would not accept a penny earned from interest when rebuilding the Ka’bah. Originally the Ka’bah extended to the extremities of Hijr of Ismail (semi-circle). However, due to shortage of funds, they built the Ka’bah into the cube as it is known today. The polytheists of Makkah recognized the filth ofribaand knew very well its negative implications and how such a practice could invite the wrath of God.The Prophet (SAW) in his farewell sermon cautioned, “Allah has forbidden you to take usury (interest). Therefore, all interest obligations shall henceforth be waived. Your capital is yours to keep. You will neither inflict nor suffer any inequity. Allah has judged that there shall be noribaand that all interest due to Abbass Bin Abdul Muttalib be waived.”The entire world economic system is based on interest (riba). This practice strengthens some countries and weakens others. It makes the rich richer and the poor poorer, thus widening the gap between the haves and the have-nots. This is purely contrary to the teachings of Islam. Fair distribution of wealth based on fair dealing and equity is the spirit of Islamic economics. The main principal clause in the Islamic economic system is “So that it (wealth) does not circulate between the rich among you.” (al-Hashr, 59:7)",
    "explanation": "The month of Zhul Hijja is a special month. It is the month of Hajj. Just as the last ten nights of Ramadan are the best nights of the year, so are the first ten days of Zhul Hijjah. In fact, they are the best ten days of the year filled with immense blessings. One should increase his/her acts of worship (ibadat) through fasting, charity, zikr, additional prayers, supplications, and of course,udhiyahor animal sacrifice, a tradition commemorating the legacy of Ibrahim (AS) for his willingness to sacrifice his son Ismael. This occasion occurs on the tenth day of Zhul Hijjah.In the tenth year after migration to al-Madinah (hijirah), Muhammad (SAW) performed his only hajj along with thousands of companions. The journey of hajj was indeed a significant event. The Prophet (SAW) established the rites of Hajj, an important mode of worship incumbent upon every able Muslim once in his/her lifetime. Additionally, according to some scholars, it is believed that on the ninth day, the day of Arafat, he (SAW) received the last revelation,“This day, I have perfected for you your religion (deen), completed my favor upon you and am pleased with Islam as your deen (way of life).”(al-Ma’idah, 5:3)The companions rejoiced. However, upon hearing the ayah, Omar (RAA) cried. The Prophet (SAW) asked, “What makes you cry O’ Omar?” “Although nothing is perfect, our deen is perfect now and I fear that with time it is going to deteriorate,” Omar replied. The Prophet (SAW) agreed and said, “You have spoken the truth.” He (SAW) then said, “Islam began as something strange, and shall return to being strange as it began, so blessed are the strangers.”Indeed, the samejahilipractices that were prevalent before Islam such as tribal wars, bloodshed, intoxication, music, adultery and fornication, interest and usury, etc. can be seen today everywhere in the world and just as Islam was conceived to be strange back then, the same teachings today are considered to be strange. Therefore, blessed are strangers who adhere to the deen dearly while sharing its message with others.Throughout the journey of hajj, the Prophet (SAW) would admonish and advise his people. His speeches were collected in what is commonly known as “The Prophet’s Farewell Sermon” orHajjatul Wada’.The sermon highlighted the most significant teachings of his prophetic mission of twenty-three years. Such pearls of wisdom have been etched in the books and minds of many Muslims for all time to come. It was, among others things, a document of human rights.After praising and thanking Allah (SWT), the Prophet (SAW) said, “O people! Lend me an attentive ear. For I know not whether after this year I shall ever be among you. Therefore, listen to what I am saying very carefully and take these words to those who are not present here today.” Months after he delivered the sermon, the Prophet (SAW) returned back to His Lord leaving behind a great legacy.The Prophet’s speech began with a word of caution. He addressed the sanctity of human lives. He (SAW) reminds, “O people! Just as you regard this month, this day, this city as sacred so regard the life and property of every Muslim as a sacred trust. Return the goods entrusted to you to their rightful owners. Hurt no one so that no one may hurt you. Remember that you will meet your Lord and that He will indeed reckon your deeds.”The Prophet (SAW) took advantage of the most blessed and sacred day of Arafat in the sacred month of Hajj, in the most sacred place in the world, Makkah to make a point. Bloodshed is forbidden due to the sanctity of human life. In addition to human life, people’s properties are also sacred. In a hadith the prophet insisted, “The blood, wealth and honor of the Muslim are sacred to all Muslims.” He (SAW) stressed, “The destruction of the world in the sight of Allah is lighter than the killing of one Muslim man.”The Qur’an is very clear on this subject as many passages address the sanctity of human lives. In one place Allah emphatically stresses this point,“And do not take any human being’s life – (the life) which God has willed to be sacred – except through (due process of) law.”(17:33) The Qur’an clearly states that whoever kills an innocent soul has committed an act akin to murdering all of humanity.“If anyone kills a person; unless in retribution for murder or spreading corruption in the land, it is as if he kills all mankind, while if any saves a life it is as if he saves the lives of all mankind” (al-Ma’idah,5:32).The US declaration of “War on Terrorism” has left millions dead. The imperial wars succeeded in dividing Muslims creating a rift between Muslim nation states sowing the seed of discord and disunity. Muslims killing other Muslims, complete destruction of cities and towns, people leaving their homes and properties to be plundered and looted by gangs that allege to be good Muslims - apparently the teachings of the Prophet (SAW) have fallen on deaf ears.In addition to the sanctity of human lives, the Prophet mentioned the sanctity of properties, “Return the goods entrusted to you to their rightful owners.” This statement echoes Allah’s mandate,“Allah commands you to return the trusts to their rightful owners.”(an-Nisa’, 4:58) One of the main qualities of a true believer is that they safeguard their trusts and fulfill their promises.Muslims who have betrayed any trust, big or small, to any person, Muslim or non-Muslim, must settle it before meeting his/her Lord. Those who don’t will have a difficult time on the Day of Judgment as such matters will be settled by Allah (SWT) on the grand day of accountability,“And He is the Best of Judges.”(al-An’am, 6:57) The Prophet (SAW) made it very clear, “Hurt no one so that no one may hurt you. Remember that you will meet your Lord and that He will indeed reckon your deeds.”In his sermon, the Prophet (SAW) touched upon something of great importance, the subject of interest and usury (riba). Riba was introduced in Arabia by the Jews who lived there. The practice ofribais so abhorrent that even the polytheists (mushriks) of Quraish would not accept a penny earned from interest when rebuilding the Ka’bah. Originally the Ka’bah extended to the extremities of Hijr of Ismail (semi-circle). However, due to shortage of funds, they built the Ka’bah into the cube as it is known today. The polytheists of Makkah recognized the filth ofribaand knew very well its negative implications and how such a practice could invite the wrath of God.The Prophet (SAW) in his farewell sermon cautioned, “Allah has forbidden you to take usury (interest). Therefore, all interest obligations shall henceforth be waived. Your capital is yours to keep. You will neither inflict nor suffer any inequity. Allah has judged that there shall be noribaand that all interest due to Abbass Bin Abdul Muttalib be waived.”The entire world economic system is based on interest (riba). This practice strengthens some countries and weakens others. It makes the rich richer and the poor poorer, thus widening the gap between the haves and the have-nots. This is purely contrary to the teachings of Islam. Fair distribution of wealth based on fair dealing and equity is the spirit of Islamic economics. The main principal clause in the Islamic economic system is “So that it (wealth) does not circulate between the rich among you.” (al-Hashr, 59:7)",
    "year": "2014"
  },
  {
    "number": "44",
    "text": "Write Hadith 3 of an-Nawaw?, translate and comment on it.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56452?exam_type=waec&type=theory&page=9",
    "correct_answer": "Brief Commentary:\nThe correct translation of Islam is “submission”, and it is incorrect to translate it as “peace”A building is built on pillars, and if the pillars are not there, then the building will collapse, therefore if these pillars of Islam are not there then a person’s Islam will collapseWe are required to say the testimony in this lifetime, and believing in it without having ever said it is not sufficientIt is incorrect to translate “la ilaaha illa Allah” to be “There is no god but Allah” because Allah mentions in the Qur’an that there are other gods, and He also spoke about the one who takes his desire to be his god, therefore we don’t say there is no god but Allah because there are other gods but they are not real gods that deserve worship.The correct translation of “la ilaaha illa Allah” is “There is no deity worthy of worship except Allah”Virtues of “la ilaaha illa Allah”:It is a price tag for the gardens of paradiseHe whose last words are la ilaaha illa Allah will enter paradiseIt is a salvation from the hellfireIt necessitates being forgivenIt is the best of all good actionsIt wipes away sinsIt renews the eeman that is planted in the heartIt outweighs on the scales the records of sinsIt traverses all barriers until it reaches Allah, the MajesticIt is the best of what all the prophets have saidIt is the best form of remembranceIt is a protection from the shaytaanIt is a means of safety from the darkness of the grave and the terror of the gatheringIt will be a distinguishing sign for the believers when they emerge from their gravesTo know it is the best blessing that Allah has blessed us withThe prophet (sallaAllahu ‘alayhi wasallam) said, “Whoever says la ilaaha illa Allah will enter Jannah” (Reported in ibn Hibban). This doesn’t mean just saying it, rather it means saying it with full meaning, therefore fulfilling its conditionsThe conditions of of “la ilaaha illa Allah” are:Knowledge in what you are saying. [Muhammad:19]Certainty in what you are saying. [Al-Hujurat:15]Sincerity in your worship. [Al-Zumar:2]Truthfulness in what you are saying. [Al-Zumar:54]Love for what you are saying and what it entails. [Al-Baqarah:165]Submission to what it entails. [Al-Nisaa’:125]Acceptance in everything that it entails. [Al-Ahzab-36]The conditions of “Muhammad Rasoolu Allah” are:Affirming his message and believing in it inwardly within the heart. [Al-Hujurat:15]Uttering the testimony and affirming it outwardly upon the tongue. [Al-Hujurat:15]Following him by acting upon whatever he has come with from the truth and abandoning whatever he has prohibited from falsehood. [‘Aal-Imran:31]Attesting to whatever he has informed of from enjoining the good and prohibiting the evil and the unseen affairs of the past and in the future and other than that. [Al-Hashr:7]Love for him must be more intense than love for oneself, wealth, father, son and all of the people. (The prophet (sallaAllahu ‘alayhi wasallam) said, “None of you truly believes until I am more beloved to them than their father, children, and all of mankind” [Reported in Bukhari & Muslim])Putting his statement over the rest of the people, regardless of whoever they might be, and to act upon his Sunnah. [Al-Hujurat:1]To magnify, honour, respect, exalt, and revere him. And to magnify, honour respect, exalt, and revere what he came with from Allah, and that is the Book and the purified Sunnah. And that cannot occur, except by acting upon the two of them and loving them more than one loves himself. [Al-Fat-h:8,9]The testimony is an example of how the previous prophets (alayhim assalam) used to give da’wa, which is by negating all that is incorrect and then affirming what is correct. This can be seen as the testimony starts off with a negation “None worthy of worship”, which is followed by an affirmation “except Allah”A major deviation of the real purpose of the testimony is to say that everything is in the heart and actions are not neededAnother major deviation is to concern ourselves with purification of the heart and ignoring everything else\nThe hadith says “establishing the prayer”, which is different to just “praying”In the Qur’an Allah refers to the believers as those who establish the prayer, but when He speaks about the ones who don’t pray properly, or don’t pray on time, He just refers to them as “the ones who pray” e.g. {Woe unto the ones who pray} [Al-Maa’oon, 107:4]Definitions of “establishing the prayer”:Praying with the heart, soul, with awe and with khushoo’Bowing and prostrating, reciting of a complete manner, with full concentration and fear of AllahPrayer is the best of deedsThe effects of prayer on a person keeps him away from evilIbn Al-Qayyim said prayer is of five degrees:The one who is careless and is therefore punishedThe one who prays on time but at the same time he is distracted and is therefore admonishedThe one who fulfils his prayer by fighting the devil and is therefore redeemedThe one who is entirely concerned with his prayer and is therefore rewardedThe one who performs his prayer while only being preoccupied with Allah and is therefore rewarded and brought closer to AllahAbandoning the prayer takes someone out of the fold of this religionThe Messenger of Allah (sallaAllahu ‘alayhi wasallam) was talking about obligatory prayers and he said, “whoever abandons it purposely, then bari’at minhu al dhimma(Islam is free from him)” (ibn Majah)The Messenger of Allah (sallaAllahu ‘alayhi wasallam) said:  “The covenant that distinguishes between us and them is the prayer, and whoever neglects it has disbelieved(become a kaafir).” (Ahmad)However, The Messenger of Allah (sallaAllahu ‘alayhi wasallam) also said: “Whoever says la ilaaha illa Allah will enter jannah” (ibn hibban)The above hadith seems to contradict the two hadiths mentioned before it, as the implied meaning of the hadith is that saying “la ilaaha illa Allah” is sufficient to admit someone into JannahTo understand the topic better, and remove the conflict, Scholars say:Shahada is the key to jannah, and every key has its teeth. The teeth for it were mentioned in the commentary of the first part of the hadith, and they included “Submission to what it entails”, therefore praying falls under this conditionWe give preference for the explicit evidences over the implicit ones. The above hadith implies that prayer is not required to admit someone into Jannah, but the two hadiths before it explicitly say that it is required, so we understand it in light of the two hadiths before it, which is that prayer is actually requiredThe majority opinion is that if someone generally stops praying then he becomes a kaafir, but if he prays on and off then he is not a kaafir, but has committed a grave sinPrayer is composed of pledges, commitments, and recognitions which we make in every prayer. A great short piece of work was written on this topic. A summary in English can be found by going tohttps://hadithcommentary.wordpress.com/articles/letteronsalahZakah linguistically means:To purifyTo growTo blessThe Shar’i (Islamic) meaning is: To give a certain amount of wealth from a certain category of wealth to a certain group of people at a certain time of yearFrom the above definition, we learn that zakah is not always 2.5%, as sometimes it can even be 10%, depending on what you are giving zakah fromIf we don’t pay zakah, then had it not been for the animals, we would be prevented from rainImportance of zakah:Usually listed with Salah in the Qur’anReason for Abu Bakr to wage war on the Arab tribesCan be a reason for Allah withholding rainfall from us if we leave itCan be a source of punishment for us in the hereafter if we leave itWhy we give zakahIt is a test for those who claim to love Allah, as you are parting with what you love (wealth) for what you love more (Allah)To be free from the destructive characteristic of miserlinessTo thank Allah for His blessingsBenefits of giving zakahIt frees oneself from miserliness which Allah ordered us to stay away from. [Al-hashr, 59:9]It refines your characterIt increases your wealth. [Saba’, 34: 39]It helps you to strive against your own nafs (soul)It shows that Islam is not an individualistic faithIt helps in tasting the sweetness of ImanIt is haram to do hajj and fulfil all its requirements, but think you haven’t been forgivenBenefits of hajj:You have all of your sins forgivenEntails all the five pillars of IslamYou glorify and manifest the emblems of AllahHelps a person in submitting to AllahTeaches us that Allah’s wisdom and knowledge is greater than oursThe linguistic meaning of fasting is to restrain oneself from somethingThe shar’i (Islamic) meaning of fasting is refraining from food, drink, and sexual intercourse from dawn until sunsetFasting can be split into three levelsGeneral fasting: abstaining from food, drink, and sexual intercourseSpecial fasting: general fasting + keeping the  tongue, eyesight, hands, feet, hearing and all other limbs away from sinsExtra special fasting: special fasting + restraining the heart from lowly ambitions, thoughts that move one away from Allah, and freeing it from anything other than AllahFasting helps in attaining piety because we train ourselves from refraining from good things, so it will be easier to refrain from bad thingsWhen we break our fast, we are happy because we can eat, and because the reward of fasting has no limitsBenefits of fasting:Helps in attaining pietyDecreases one’s desiresHas unlimited rewardReward can never be taken away from us",
    "explanation": "Brief Commentary:\nThe correct translation of Islam is “submission”, and it is incorrect to translate it as “peace”A building is built on pillars, and if the pillars are not there, then the building will collapse, therefore if these pillars of Islam are not there then a person’s Islam will collapseWe are required to say the testimony in this lifetime, and believing in it without having ever said it is not sufficientIt is incorrect to translate “la ilaaha illa Allah” to be “There is no god but Allah” because Allah mentions in the Qur’an that there are other gods, and He also spoke about the one who takes his desire to be his god, therefore we don’t say there is no god but Allah because there are other gods but they are not real gods that deserve worship.The correct translation of “la ilaaha illa Allah” is “There is no deity worthy of worship except Allah”Virtues of “la ilaaha illa Allah”:It is a price tag for the gardens of paradiseHe whose last words are la ilaaha illa Allah will enter paradiseIt is a salvation from the hellfireIt necessitates being forgivenIt is the best of all good actionsIt wipes away sinsIt renews the eeman that is planted in the heartIt outweighs on the scales the records of sinsIt traverses all barriers until it reaches Allah, the MajesticIt is the best of what all the prophets have saidIt is the best form of remembranceIt is a protection from the shaytaanIt is a means of safety from the darkness of the grave and the terror of the gatheringIt will be a distinguishing sign for the believers when they emerge from their gravesTo know it is the best blessing that Allah has blessed us withThe prophet (sallaAllahu ‘alayhi wasallam) said, “Whoever says la ilaaha illa Allah will enter Jannah” (Reported in ibn Hibban). This doesn’t mean just saying it, rather it means saying it with full meaning, therefore fulfilling its conditionsThe conditions of of “la ilaaha illa Allah” are:Knowledge in what you are saying. [Muhammad:19]Certainty in what you are saying. [Al-Hujurat:15]Sincerity in your worship. [Al-Zumar:2]Truthfulness in what you are saying. [Al-Zumar:54]Love for what you are saying and what it entails. [Al-Baqarah:165]Submission to what it entails. [Al-Nisaa’:125]Acceptance in everything that it entails. [Al-Ahzab-36]The conditions of “Muhammad Rasoolu Allah” are:Affirming his message and believing in it inwardly within the heart. [Al-Hujurat:15]Uttering the testimony and affirming it outwardly upon the tongue. [Al-Hujurat:15]Following him by acting upon whatever he has come with from the truth and abandoning whatever he has prohibited from falsehood. [‘Aal-Imran:31]Attesting to whatever he has informed of from enjoining the good and prohibiting the evil and the unseen affairs of the past and in the future and other than that. [Al-Hashr:7]Love for him must be more intense than love for oneself, wealth, father, son and all of the people. (The prophet (sallaAllahu ‘alayhi wasallam) said, “None of you truly believes until I am more beloved to them than their father, children, and all of mankind” [Reported in Bukhari & Muslim])Putting his statement over the rest of the people, regardless of whoever they might be, and to act upon his Sunnah. [Al-Hujurat:1]To magnify, honour, respect, exalt, and revere him. And to magnify, honour respect, exalt, and revere what he came with from Allah, and that is the Book and the purified Sunnah. And that cannot occur, except by acting upon the two of them and loving them more than one loves himself. [Al-Fat-h:8,9]The testimony is an example of how the previous prophets (alayhim assalam) used to give da’wa, which is by negating all that is incorrect and then affirming what is correct. This can be seen as the testimony starts off with a negation “None worthy of worship”, which is followed by an affirmation “except Allah”A major deviation of the real purpose of the testimony is to say that everything is in the heart and actions are not neededAnother major deviation is to concern ourselves with purification of the heart and ignoring everything else\nThe hadith says “establishing the prayer”, which is different to just “praying”In the Qur’an Allah refers to the believers as those who establish the prayer, but when He speaks about the ones who don’t pray properly, or don’t pray on time, He just refers to them as “the ones who pray” e.g. {Woe unto the ones who pray} [Al-Maa’oon, 107:4]Definitions of “establishing the prayer”:Praying with the heart, soul, with awe and with khushoo’Bowing and prostrating, reciting of a complete manner, with full concentration and fear of AllahPrayer is the best of deedsThe effects of prayer on a person keeps him away from evilIbn Al-Qayyim said prayer is of five degrees:The one who is careless and is therefore punishedThe one who prays on time but at the same time he is distracted and is therefore admonishedThe one who fulfils his prayer by fighting the devil and is therefore redeemedThe one who is entirely concerned with his prayer and is therefore rewardedThe one who performs his prayer while only being preoccupied with Allah and is therefore rewarded and brought closer to AllahAbandoning the prayer takes someone out of the fold of this religionThe Messenger of Allah (sallaAllahu ‘alayhi wasallam) was talking about obligatory prayers and he said, “whoever abandons it purposely, then bari’at minhu al dhimma(Islam is free from him)” (ibn Majah)The Messenger of Allah (sallaAllahu ‘alayhi wasallam) said:  “The covenant that distinguishes between us and them is the prayer, and whoever neglects it has disbelieved(become a kaafir).” (Ahmad)However, The Messenger of Allah (sallaAllahu ‘alayhi wasallam) also said: “Whoever says la ilaaha illa Allah will enter jannah” (ibn hibban)The above hadith seems to contradict the two hadiths mentioned before it, as the implied meaning of the hadith is that saying “la ilaaha illa Allah” is sufficient to admit someone into JannahTo understand the topic better, and remove the conflict, Scholars say:Shahada is the key to jannah, and every key has its teeth. The teeth for it were mentioned in the commentary of the first part of the hadith, and they included “Submission to what it entails”, therefore praying falls under this conditionWe give preference for the explicit evidences over the implicit ones. The above hadith implies that prayer is not required to admit someone into Jannah, but the two hadiths before it explicitly say that it is required, so we understand it in light of the two hadiths before it, which is that prayer is actually requiredThe majority opinion is that if someone generally stops praying then he becomes a kaafir, but if he prays on and off then he is not a kaafir, but has committed a grave sinPrayer is composed of pledges, commitments, and recognitions which we make in every prayer. A great short piece of work was written on this topic. A summary in English can be found by going tohttps://hadithcommentary.wordpress.com/articles/letteronsalahZakah linguistically means:To purifyTo growTo blessThe Shar’i (Islamic) meaning is: To give a certain amount of wealth from a certain category of wealth to a certain group of people at a certain time of yearFrom the above definition, we learn that zakah is not always 2.5%, as sometimes it can even be 10%, depending on what you are giving zakah fromIf we don’t pay zakah, then had it not been for the animals, we would be prevented from rainImportance of zakah:Usually listed with Salah in the Qur’anReason for Abu Bakr to wage war on the Arab tribesCan be a reason for Allah withholding rainfall from us if we leave itCan be a source of punishment for us in the hereafter if we leave itWhy we give zakahIt is a test for those who claim to love Allah, as you are parting with what you love (wealth) for what you love more (Allah)To be free from the destructive characteristic of miserlinessTo thank Allah for His blessingsBenefits of giving zakahIt frees oneself from miserliness which Allah ordered us to stay away from. [Al-hashr, 59:9]It refines your characterIt increases your wealth. [Saba’, 34: 39]It helps you to strive against your own nafs (soul)It shows that Islam is not an individualistic faithIt helps in tasting the sweetness of ImanIt is haram to do hajj and fulfil all its requirements, but think you haven’t been forgivenBenefits of hajj:You have all of your sins forgivenEntails all the five pillars of IslamYou glorify and manifest the emblems of AllahHelps a person in submitting to AllahTeaches us that Allah’s wisdom and knowledge is greater than oursThe linguistic meaning of fasting is to restrain oneself from somethingThe shar’i (Islamic) meaning of fasting is refraining from food, drink, and sexual intercourse from dawn until sunsetFasting can be split into three levelsGeneral fasting: abstaining from food, drink, and sexual intercourseSpecial fasting: general fasting + keeping the  tongue, eyesight, hands, feet, hearing and all other limbs away from sinsExtra special fasting: special fasting + restraining the heart from lowly ambitions, thoughts that move one away from Allah, and freeing it from anything other than AllahFasting helps in attaining piety because we train ourselves from refraining from good things, so it will be easier to refrain from bad thingsWhen we break our fast, we are happy because we can eat, and because the reward of fasting has no limitsBenefits of fasting:Helps in attaining pietyDecreases one’s desiresHas unlimited rewardReward can never be taken away from us",
    "year": "2014"
  },
  {
    "number": "45",
    "text": "Write on the six authentic collections of Hadith (Sihaus-Sittah).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56453?exam_type=waec&type=theory&page=9",
    "correct_answer": "The six most authentic collections of Hadith by the six famous imams are together called Sihah Sittaor ‘the authentic six’. First amongthem is Muhammad bin Ismail al-Bukhari, the author of Sahih Bukhari. He was born on July 19, 810 at Bukhara in Central Asia and died on August 31, 870 at a place known as Khartank, near Samarkhand.\nNext among them is Muslim bin Hajjah al-Nishapuri who was born in Nishapur in Iran, in 206 AH/821 CE and died in the same city in 261 AH or 874 CE. His Sahih Muslim is second in authenticity, next to that of Bukhari.\nAbu Dawood, Sulaiman bin Al-Ash’ath bin Ishaq Al-Azdi As-Sijistani, who was one of the eminent Imam of Hadeeth, was born in 202 AH. He was a Persian but of Arab descent. He died at Basra on Friday in the month of Shawwal 275 H or 888/9 CE.\nImaam Tirmizi was born in the year 209 AH during the reign of the Abbasid Khalifa Mamoon al Rasheed. He died in the year 279 AH in a village called Bawag at the ripe age of 70.  Fifth in line of these compilers is Abu Abd al-Rahman Ahmad ibn Shu’ayb al-Nasa’i. He wasborn in Nasa in Nishapur region in 215 AH. He died in Makkah and was buried in a place between the Safa and Marwah. The year of his death was 303 AH.\nSixth of the compilers is Abu Abdullah Muhammad ibn Yazid ibn Majah al-Rab’i al-Qazwini, commonly known as Imam Ibn Majah who was born in Qazwin in Persia in 209 AH or 824 CE. He was a hafiz of hadith and the author of Kitab as-Sunnah, one of the six most authentic collections of ahadith. He died on 22 Ramadan 273 AH or 887 CE in Qazwin. He is the author of a famous collection ofHadith Sunan Ibn Majah. Curiously, all these six compilers were Persian.  In case you are computer and Internet-user, this information could be just at your fingertips. You can log on to Google and type on Sihah sitta or six compilation of Hadith.",
    "explanation": "The six most authentic collections of Hadith by the six famous imams are together called Sihah Sittaor ‘the authentic six’. First amongthem is Muhammad bin Ismail al-Bukhari, the author of Sahih Bukhari. He was born on July 19, 810 at Bukhara in Central Asia and died on August 31, 870 at a place known as Khartank, near Samarkhand.\nNext among them is Muslim bin Hajjah al-Nishapuri who was born in Nishapur in Iran, in 206 AH/821 CE and died in the same city in 261 AH or 874 CE. His Sahih Muslim is second in authenticity, next to that of Bukhari.\nAbu Dawood, Sulaiman bin Al-Ash’ath bin Ishaq Al-Azdi As-Sijistani, who was one of the eminent Imam of Hadeeth, was born in 202 AH. He was a Persian but of Arab descent. He died at Basra on Friday in the month of Shawwal 275 H or 888/9 CE.\nImaam Tirmizi was born in the year 209 AH during the reign of the Abbasid Khalifa Mamoon al Rasheed. He died in the year 279 AH in a village called Bawag at the ripe age of 70.  Fifth in line of these compilers is Abu Abd al-Rahman Ahmad ibn Shu’ayb al-Nasa’i. He wasborn in Nasa in Nishapur region in 215 AH. He died in Makkah and was buried in a place between the Safa and Marwah. The year of his death was 303 AH.\nSixth of the compilers is Abu Abdullah Muhammad ibn Yazid ibn Majah al-Rab’i al-Qazwini, commonly known as Imam Ibn Majah who was born in Qazwin in Persia in 209 AH or 824 CE. He was a hafiz of hadith and the author of Kitab as-Sunnah, one of the six most authentic collections of ahadith. He died on 22 Ramadan 273 AH or 887 CE in Qazwin. He is the author of a famous collection ofHadith Sunan Ibn Majah. Curiously, all these six compilers were Persian.  In case you are computer and Internet-user, this information could be just at your fingertips. You can log on to Google and type on Sihah sitta or six compilation of Hadith.",
    "year": "2014"
  },
  {
    "number": "46",
    "text": "Examine the conditions under which a Muslim is exempted from the fast of Ramadan.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56454?exam_type=waec&type=theory&page=10",
    "correct_answer": "1. THE FIRST CATEGORY OF VALID EXEMPTION: ILLNESS\nIllness is any condition that takes a person outside the bounds of health as the result of some indisposition. Ibn Qudamah (d. 1223ce) said: “There is consensus among the scholars regarding the permissibility of breaking the fast due to illness in general, as stated in the verse of the Quran: Yet if one among you is sick or is on a journey, [such a person shall then fast] the same number of other days (Surat Al-Baqarah, 2:185).\nThe Companion (of the Prophet, on him be peace) Salamah ibn Al-Akwa‘ reported:\nWhen the verse“wa ‘ala’l-ladhîna uûthiqunahu…”/“Yet for those who are hardly able to endure it…” (Surat Al-Baqarah, 2:184) was revealed, those who wanted to break their fast were allowed to break their fast and pay the redemption, until the verse “Shahru Ramadan alladhi…”’ / “It was the month of Ramadan in which…” (Sûrat Al-Baqarah, 2:185) was revealed and abrogated the one before it.\nSo, the prescription to fast went through stages. First, God permitted the believers to break their fast. Then God obligated the fast unless one had a valid justification for not doing so.\nIllness remained a valid reason for not fasting, though not any illness or pain legitimately excuses one from fasting. If one fears that fasting will worsen the sickness, delay its cure, or cause damage to anything in the body, then one has a valid excuse for breaking the fast. In fact, oneshouldbreak one’s fast under these circumstances, for the higher obligation is to keep oneself from becoming debilitated or, of course, from perishing.\nIf one is well, but feels the difficulty of fasting, this does not rise to the level of sufficient cause for breaking the fast. The exception here is the Hanafi legal school’s position that if one who is well believes itvery likelythe fast will cause him or her to fall ill, one can break the fast. If, however, the fear of illness is anxiety or apprehension of illness, more delusion or obsession than actuality, then it is not permissible to break fast.\nThe Malikis disagree with the Hanafis in this, holding that if the healthy person has no illness to begin with but merely harbors a fear that fasting will cause illness, then he or she is barred from breaking the fast because the fear of illness neither proves the likelihood of such an outcome, nor does it meet the standard of a sufficient legal proof authorizing action. If, however, one knows with great certainty that fasting will definitely cause real harm, he or she can break the fast. The distinction, then, is diagnosing the likely onset of real harm as a result of fasting as opposed to a difficulty caused by fasting, as difficulty in fasting is a wholly invalid justification.\nNow, even though one who is ill ought to break the fast, it does not render his or her fast invalid if one chooses to complete the fast.\nTHE SECOND CATEGORY OF VALID EXEMPTION: TRAVEL\nA. Travel defined and delimited\nThe kind of travel that allows one to break one’s fast must fulfill at least three conditions, and a fourth, according to all but the Hanafi juristic school:\n1. DISTANCE:Enough for one to shorten the ritual prayer (about 50 miles, according to most scholars, but the norm, which is the better measure, is what is considered by people of the time and place a journey).\n2. DURATION:The person in the state of travel or far from home does not have the intention of staying at that destination for more than three days. In this latter case, the person may be permitted to not fast during the travel (if they fulfill the requirements of distance, exceedance, and intentionality), but must resume the fast when they arrive at their destination of more than three days.\n3. EXCEEDANCE:One must go beyond the limits of the city or town one is staying in. This means if one were to travel 50 miles but still be within his metropolitan or town area, it would not count as travel. The question of whether one’s metropolitan area remains as one’s town or home region should be taken seriously, such as Greater Chicago, for instance.\n4aINTENTIONALITY:According to the majority of scholars, the person undertaking the journey must not be making it for unlawful reasons or to unlawful destinations, like a gambling trip to Las Vegas. This is because the allowance to break one’s fast is to make travel easy. If someone is undertaking an unlawful action, they are not included in the principle of creating ease for the traveler.\nTHE THIRD CATEGORY OF VALID EXEMPTION: AGE\nThere is consensus that it is permissible for the elderly not to fast. There is no specific definition for old age. It pertains to what people know and agree to be an age that is very advanced and disabling.\nTHE FOURTH CATEGORY OF VALID EXEMPTION: THIRST AND HUNGER\nSevere thirst and grave hunger are both valid reasons not to fast, but not just any kind of acute thirst or hunger. If one really believes that the continuation of their fast will physically harm them because they are suffering from severe thirst or hunger, then it is permissible for them to break fast. If one in the military anticipates engagement and breaks the fast because of this likelihood, but engagement does not occur, there is no penalty for having broken the fast.\nTHE FIFTH CATEGORY OF VALID EXEMPTION: COERCION\nIf a faster’s well-being is threatened, such as it being said to a faster: “If you do not break your fast, you will be punished or confined,” there is no penalty if one breaks the fast under such duress. Yet one remains obliged to make up this missed fast.",
    "explanation": "1. THE FIRST CATEGORY OF VALID EXEMPTION: ILLNESS\nIllness is any condition that takes a person outside the bounds of health as the result of some indisposition. Ibn Qudamah (d. 1223ce) said: “There is consensus among the scholars regarding the permissibility of breaking the fast due to illness in general, as stated in the verse of the Quran: Yet if one among you is sick or is on a journey, [such a person shall then fast] the same number of other days (Surat Al-Baqarah, 2:185).\nThe Companion (of the Prophet, on him be peace) Salamah ibn Al-Akwa‘ reported:\nWhen the verse“wa ‘ala’l-ladhîna uûthiqunahu…”/“Yet for those who are hardly able to endure it…” (Surat Al-Baqarah, 2:184) was revealed, those who wanted to break their fast were allowed to break their fast and pay the redemption, until the verse “Shahru Ramadan alladhi…”’ / “It was the month of Ramadan in which…” (Sûrat Al-Baqarah, 2:185) was revealed and abrogated the one before it.\nSo, the prescription to fast went through stages. First, God permitted the believers to break their fast. Then God obligated the fast unless one had a valid justification for not doing so.\nIllness remained a valid reason for not fasting, though not any illness or pain legitimately excuses one from fasting. If one fears that fasting will worsen the sickness, delay its cure, or cause damage to anything in the body, then one has a valid excuse for breaking the fast. In fact, oneshouldbreak one’s fast under these circumstances, for the higher obligation is to keep oneself from becoming debilitated or, of course, from perishing.\nIf one is well, but feels the difficulty of fasting, this does not rise to the level of sufficient cause for breaking the fast. The exception here is the Hanafi legal school’s position that if one who is well believes itvery likelythe fast will cause him or her to fall ill, one can break the fast. If, however, the fear of illness is anxiety or apprehension of illness, more delusion or obsession than actuality, then it is not permissible to break fast.\nThe Malikis disagree with the Hanafis in this, holding that if the healthy person has no illness to begin with but merely harbors a fear that fasting will cause illness, then he or she is barred from breaking the fast because the fear of illness neither proves the likelihood of such an outcome, nor does it meet the standard of a sufficient legal proof authorizing action. If, however, one knows with great certainty that fasting will definitely cause real harm, he or she can break the fast. The distinction, then, is diagnosing the likely onset of real harm as a result of fasting as opposed to a difficulty caused by fasting, as difficulty in fasting is a wholly invalid justification.\nNow, even though one who is ill ought to break the fast, it does not render his or her fast invalid if one chooses to complete the fast.\nTHE SECOND CATEGORY OF VALID EXEMPTION: TRAVEL\nA. Travel defined and delimited\nThe kind of travel that allows one to break one’s fast must fulfill at least three conditions, and a fourth, according to all but the Hanafi juristic school:\n1. DISTANCE:Enough for one to shorten the ritual prayer (about 50 miles, according to most scholars, but the norm, which is the better measure, is what is considered by people of the time and place a journey).\n2. DURATION:The person in the state of travel or far from home does not have the intention of staying at that destination for more than three days. In this latter case, the person may be permitted to not fast during the travel (if they fulfill the requirements of distance, exceedance, and intentionality), but must resume the fast when they arrive at their destination of more than three days.\n3. EXCEEDANCE:One must go beyond the limits of the city or town one is staying in. This means if one were to travel 50 miles but still be within his metropolitan or town area, it would not count as travel. The question of whether one’s metropolitan area remains as one’s town or home region should be taken seriously, such as Greater Chicago, for instance.\n4aINTENTIONALITY:According to the majority of scholars, the person undertaking the journey must not be making it for unlawful reasons or to unlawful destinations, like a gambling trip to Las Vegas. This is because the allowance to break one’s fast is to make travel easy. If someone is undertaking an unlawful action, they are not included in the principle of creating ease for the traveler.\nTHE THIRD CATEGORY OF VALID EXEMPTION: AGE\nThere is consensus that it is permissible for the elderly not to fast. There is no specific definition for old age. It pertains to what people know and agree to be an age that is very advanced and disabling.\nTHE FOURTH CATEGORY OF VALID EXEMPTION: THIRST AND HUNGER\nSevere thirst and grave hunger are both valid reasons not to fast, but not just any kind of acute thirst or hunger. If one really believes that the continuation of their fast will physically harm them because they are suffering from severe thirst or hunger, then it is permissible for them to break fast. If one in the military anticipates engagement and breaks the fast because of this likelihood, but engagement does not occur, there is no penalty for having broken the fast.\nTHE FIFTH CATEGORY OF VALID EXEMPTION: COERCION\nIf a faster’s well-being is threatened, such as it being said to a faster: “If you do not break your fast, you will be punished or confined,” there is no penalty if one breaks the fast under such duress. Yet one remains obliged to make up this missed fast.",
    "year": "2014"
  },
  {
    "number": "47",
    "text": "Explain the conditions under which a Muslim woman may seek divorce.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56456?exam_type=waec&type=theory&page=10",
    "correct_answer": "Despite Muslim community perceptions that under Islamic laws women can only divorce with their husband’s consent or by means of community processes, there are in factmultipleoptions available by which Muslim women in Australia can secure a religious divorce. Derived from the primary religious texts of the Qur’an andSunnah(sayings and teachings of Prophet Muhammad) and formulated by Muslim male jurists into religious rulings by the twelfth century (six centuries after the introduction of Islam), they have become codified in many contemporary Muslim countries through case law or legislation.\nMen can initiate divorce throughtalaq— which is no-fault — and they do not need the wife’s consent. According to Muslim jurists, this form of divorce is extra-judicial, in that they do not need to declare it before a religious authority. In order to manage registration of marriages and divorces, however, most Muslim countries now require men divorcing throughtalaqto notify the court.\nWomen are able to initiate divorce through the process ofkhul‘.This is a form of no-fault divorce referred to in the Qur’an andSunnahwhere the husband’s consent was not stated to be required. In these primary texts, the wife is granted the ability to divorce her husband for the simple reason ofincompatibility, and there are records of women at the time of the Prophet who married and divorced numerous times. There are also reports of women who married the Prophet but then changed their mind on the wedding night and he granted them divorce without seeking cause.\nOver time, however, the majority of Muslim male jurists determined that the husband’s consent was necessary, and most Muslim countries today still adopt these twelfth-century rulings. Interestingly, case law in Pakistan (1967) and legislation in Egypt (2000) returned to the Prophetic practice whereby the husband’s consent was not needed.\nIf the husband is at fault, women can also initiate a judicial divorce throughfaskh,tafriqorta‘liq— whereby in Muslim countries they present their case and prove certain grounds before a court judge. Because this form of divorce does not require the husband’s consent, this is usually the main option women take when they are not successful withkhul‘. Given there are no such courts in Australia, Muslim women seek out divorce through community processes involving imams.\nMany imams or religious leaders in Australia prefer the husband to pronouncetalaqor give their consent to akhul‘, so that they are not responsible for ending the marriage, but in extreme cases of domestic violence they will award women this form of divorce. However, as reported by the ABC in aseries of investigations across various religious communities in 2018, a number of Muslim women experiencing domestic violence faced numerous challenges seeking religious divorce from imams. This was in part due to imams having narrow interpretations as to what constituted “domestic violence” and requiring meetings with both the husband and wife present in the same place.\nIn my research, as well asthat of others, imams and community leaders are becoming aware of the dangers presented to women experiencing domestic violence and are working with specialist services to make the religious divorce a safer process for women.\nAnother option for divorce is that women can specify in their marriage contract her right to divorce throughtalaq at-tafwid, whereby the husband grants his right oftalaqto his wife through delegation so that she can initiate divorce without needing his consent. Contrary to common belief among many Muslims, he still maintains his right oftalaq. Given the sensitive nature of mentioning divorce at the time of marriage, many Muslim women are discouraged by their families from including it in their contract for fear that they are seen as not committing to the marriage long-term. There is a long tradition oftalaq at-tafwidin countries such as Bangladesh, India and Pakistan, but it is largely unknown and not commonly practised in many other Muslim countries and communities, including in Australia.",
    "explanation": "Despite Muslim community perceptions that under Islamic laws women can only divorce with their husband’s consent or by means of community processes, there are in factmultipleoptions available by which Muslim women in Australia can secure a religious divorce. Derived from the primary religious texts of the Qur’an andSunnah(sayings and teachings of Prophet Muhammad) and formulated by Muslim male jurists into religious rulings by the twelfth century (six centuries after the introduction of Islam), they have become codified in many contemporary Muslim countries through case law or legislation.\nMen can initiate divorce throughtalaq— which is no-fault — and they do not need the wife’s consent. According to Muslim jurists, this form of divorce is extra-judicial, in that they do not need to declare it before a religious authority. In order to manage registration of marriages and divorces, however, most Muslim countries now require men divorcing throughtalaqto notify the court.\nWomen are able to initiate divorce through the process ofkhul‘.This is a form of no-fault divorce referred to in the Qur’an andSunnahwhere the husband’s consent was not stated to be required. In these primary texts, the wife is granted the ability to divorce her husband for the simple reason ofincompatibility, and there are records of women at the time of the Prophet who married and divorced numerous times. There are also reports of women who married the Prophet but then changed their mind on the wedding night and he granted them divorce without seeking cause.\nOver time, however, the majority of Muslim male jurists determined that the husband’s consent was necessary, and most Muslim countries today still adopt these twelfth-century rulings. Interestingly, case law in Pakistan (1967) and legislation in Egypt (2000) returned to the Prophetic practice whereby the husband’s consent was not needed.\nIf the husband is at fault, women can also initiate a judicial divorce throughfaskh,tafriqorta‘liq— whereby in Muslim countries they present their case and prove certain grounds before a court judge. Because this form of divorce does not require the husband’s consent, this is usually the main option women take when they are not successful withkhul‘. Given there are no such courts in Australia, Muslim women seek out divorce through community processes involving imams.\nMany imams or religious leaders in Australia prefer the husband to pronouncetalaqor give their consent to akhul‘, so that they are not responsible for ending the marriage, but in extreme cases of domestic violence they will award women this form of divorce. However, as reported by the ABC in aseries of investigations across various religious communities in 2018, a number of Muslim women experiencing domestic violence faced numerous challenges seeking religious divorce from imams. This was in part due to imams having narrow interpretations as to what constituted “domestic violence” and requiring meetings with both the husband and wife present in the same place.\nIn my research, as well asthat of others, imams and community leaders are becoming aware of the dangers presented to women experiencing domestic violence and are working with specialist services to make the religious divorce a safer process for women.\nAnother option for divorce is that women can specify in their marriage contract her right to divorce throughtalaq at-tafwid, whereby the husband grants his right oftalaqto his wife through delegation so that she can initiate divorce without needing his consent. Contrary to common belief among many Muslims, he still maintains his right oftalaq. Given the sensitive nature of mentioning divorce at the time of marriage, many Muslim women are discouraged by their families from including it in their contract for fear that they are seen as not committing to the marriage long-term. There is a long tradition oftalaq at-tafwidin countries such as Bangladesh, India and Pakistan, but it is largely unknown and not commonly practised in many other Muslim countries and communities, including in Australia.",
    "year": "2014"
  },
  {
    "number": "48",
    "text": "State the factors that contributed to the success of the Prophet;s (S.A.W.) mission in Madinah",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56457?exam_type=waec&type=theory&page=10",
    "correct_answer": "A delegation from Medina, consisting of the representatives of the twelve important clans of Medina, invited Muhammad as a neutral outsider to serve as the chief arbitrator for the entire community. There was fighting in Yathrib (Medina) mainly involving itsArabandJewishinhabitants for around a hundred years before 620.The recurring slaughters and disagreements over the resulting claims, especially after thebattle of Bu'athin which all the clans were involved, made it obvious to them that the tribal conceptions of blood-feud andan eye for an eyewere no longer workable unless there was one man with authority to adjudicate in disputed cases. The delegation from Medina pledged themselves and their fellow-citizens to accept Muhammad into their community and physically protect him as one of themselves.\nMuhammad instructed his followers to emigrate to Medina until virtually all of his followers had leftMecca. Being alarmed at the departure of Muslims, according to the tradition, the Meccans plotted to assassinate him. He instructed his cousin and future son-in-lawAlito sleep in his bed to trick the assassins that he had stayed (and to fight them off in his stead) and secretly slipped away from the town. By 622, Muhammad had emigrated to Medina, then known as Yathrib, a large agriculturaloasis. Following the emigration, the Meccans seized the properties of the Muslim emigrants in Mecca.\nThe first group ofpaganconverts to Islam in Medina were the clans who had not produced great leaders for themselves but had suffered from warlike leaders from other clans. This was followed by the general acceptance of Islam by thepagan populationof Medina, apart from some exceptions. This was, according toIbn Ishaq, influenced by the conversion to Islam ofSa'd ibn Mua'dh, one of the prominent leaders in Medina.Among the things Muhammad did in order to settle the longstanding grievances among the tribes of Medina was drafting a document known as theConstitution of Medina(date debated), establishing a kind of brotherhood among the eight Medinan tribes andMuslim emigrants from Mecca, which specified the rights and duties of all citizens and the relationship of the different communities in Medina (including that of the Muslim community to other communities specifically the Jews and other \"Peoples of the Book\"). The community defined in the Constitution of Medina,umma, had a religious outlook but was also shaped by the practical considerations and substantially preserved the legal forms of the oldArab tribes.Muhammad's adoption of facing north towardsJerusalemwhen performing the daily prayers (qibla) however need not to necessarily be a borrowing from the Jews as the reports about the direction of prayer before migration to Medina are contradictory and further this direction of prayer was also practiced among other groups inArabia.",
    "explanation": "A delegation from Medina, consisting of the representatives of the twelve important clans of Medina, invited Muhammad as a neutral outsider to serve as the chief arbitrator for the entire community. There was fighting in Yathrib (Medina) mainly involving itsArabandJewishinhabitants for around a hundred years before 620.The recurring slaughters and disagreements over the resulting claims, especially after thebattle of Bu'athin which all the clans were involved, made it obvious to them that the tribal conceptions of blood-feud andan eye for an eyewere no longer workable unless there was one man with authority to adjudicate in disputed cases. The delegation from Medina pledged themselves and their fellow-citizens to accept Muhammad into their community and physically protect him as one of themselves.\nMuhammad instructed his followers to emigrate to Medina until virtually all of his followers had leftMecca. Being alarmed at the departure of Muslims, according to the tradition, the Meccans plotted to assassinate him. He instructed his cousin and future son-in-lawAlito sleep in his bed to trick the assassins that he had stayed (and to fight them off in his stead) and secretly slipped away from the town. By 622, Muhammad had emigrated to Medina, then known as Yathrib, a large agriculturaloasis. Following the emigration, the Meccans seized the properties of the Muslim emigrants in Mecca.\nThe first group ofpaganconverts to Islam in Medina were the clans who had not produced great leaders for themselves but had suffered from warlike leaders from other clans. This was followed by the general acceptance of Islam by thepagan populationof Medina, apart from some exceptions. This was, according toIbn Ishaq, influenced by the conversion to Islam ofSa'd ibn Mua'dh, one of the prominent leaders in Medina.Among the things Muhammad did in order to settle the longstanding grievances among the tribes of Medina was drafting a document known as theConstitution of Medina(date debated), establishing a kind of brotherhood among the eight Medinan tribes andMuslim emigrants from Mecca, which specified the rights and duties of all citizens and the relationship of the different communities in Medina (including that of the Muslim community to other communities specifically the Jews and other \"Peoples of the Book\"). The community defined in the Constitution of Medina,umma, had a religious outlook but was also shaped by the practical considerations and substantially preserved the legal forms of the oldArab tribes.Muhammad's adoption of facing north towardsJerusalemwhen performing the daily prayers (qibla) however need not to necessarily be a borrowing from the Jews as the reports about the direction of prayer before migration to Medina are contradictory and further this direction of prayer was also practiced among other groups inArabia.",
    "year": "2014"
  },
  {
    "number": "49",
    "text": "Write Suratun-Nas either in Arabic or transliteration, translate and comment on it.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56458?exam_type=waec&type=theory&page=10",
    "correct_answer": "Bismillaahir Rahmaanir Raheem﻿\nQul a'oozu birabbin naasMalikin naasIlaahin naasMin sharril waswaasil khannaasAllazee yuwaswisu fee sudoorin naasMinal jinnati wannaas(End Juz 30)\nIn the name of Allah, Most Gracious, Most Merciful.\nSay: I seek refuge with the Lord and Cherisher of Mankind,The King (or Ruler) of Mankind,The god (or judge) of Mankind,-From the mischief of the Whisperer (of Evil), who withdraws (after his whisper)(The same) who whispers into the hearts of Mankind,-Among Jinns and among men.",
    "explanation": "Bismillaahir Rahmaanir Raheem﻿\nQul a'oozu birabbin naasMalikin naasIlaahin naasMin sharril waswaasil khannaasAllazee yuwaswisu fee sudoorin naasMinal jinnati wannaas(End Juz 30)\nIn the name of Allah, Most Gracious, Most Merciful.\nSay: I seek refuge with the Lord and Cherisher of Mankind,The King (or Ruler) of Mankind,The god (or judge) of Mankind,-From the mischief of the Whisperer (of Evil), who withdraws (after his whisper)(The same) who whispers into the hearts of Mankind,-Among Jinns and among men.",
    "year": "2014"
  },
  {
    "number": "50",
    "text": "Write on the Hadith collection of Imam Bukhari.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56460?exam_type=waec&type=theory&page=10",
    "correct_answer": "Bukhari states, \"There was once a time during one of our sessions when my teacher Ishaaq Ibn Rahway remarked it would be appreciated if someone could collect ahadith which held strong and reliable testimonials and write them in the form of a book.\" This inspired Bukhari which was later strengthened by a dream in which Bukhari met the Prophet (SAW). Upon waking, he visited several interpreters for an appropriate interpretation. They all answered that it meant he would in future cleanse the Prophet (SAW) of all lies spoken by the people through narrating misunderstood ahadith. This gave Bukhari great comfort and strength once he started the writing of his book Al-Jame-ul-Sahih. The complete name of the book is ˜Al-Jame-ul-Sahih-al-Musnad-min-ahaadeethe-Rasulillah Sallallahu Alaihi Wasallam-wa-sunanihi-wa-Ayyaamihi, which means a collected version of ahadith in the form of a book which relates to us the sayings, actions and the life of the Prophet Sallallahu Alaihi Wasallam (SAW).Bukhari had taken great care in writing the ahadith and choosing those which met the standards and conditions which he set to find ahadith with only strong testimonials which included only reliable and trustworthy testifiers. He spent 16 years in writing the book, altering it a total of three times. Allaamah Ayni reports of Ibn Tahir's remark that Bukhari had written Sahih Bukhari in his hometown Bukhara. Ibn Bujair however, relates that he had started his compiling in Makkah, and some have reported of seeing him in Basra. There is still another differing remark made by others who comment on seeing him in Madinah to write his book. However, we find Bukhari relating himself that he wrote Sahih Bukhari in Masjid-e-Haraam.Before he actually placed a hadith in his compilation he used to perform ghusl and prayed to Allah(SWT) through two rakah nafl prayers asking for guidance. Bukhari worked such that only after being completely satisfied with the hadith in question did he give it a place in his book. Due to this great care which was taken, the people were heard to say that the ahadith which Bukhari has narrated have been so carefully phrased and with such precision that it is felt that Bukhari had heard the ahadith directly through the Prophet(SAW).\nAbu Zaid Marwazi reports that I was once asleep in between the ˜Black stone' and ˜Maqaam-e-Ibrahim' when the Prophet (SAW) appeared in my dream he stated, \"O Abu Zaid! For how long shall you teach Imam Shafi's book ? When shall you start the teaching of my book?\"I questioned, \"O Prophet (SAW)! Which book is yours?\" He replied, \"Mohammed Ibn Ismail's Al-Jame-ul-Sahih.\"Hafiz Ibn Hajar reports that Bukhari has kept it of utmost importance to only narrate ahadith of a strong testimonial which can be proven by the name of the book. However, along with this Bukhari also made an effort to explain all points which are difficult to understand, which is the reason why he has given a plentiful host of meanings for one sentence which may include a word that is in reality difficult to understand. Bukhari has included within his book(s) the art of narrating ahadith which have been divided into eight different chapters. These chapters contain subjects which have been sub-titled and are famous for the ingenious way in which they have been phrased.Bukhari has imposed conditions which all narrators and testifiers must meet before the hadith can be selected. One condition requires that all testifiers must have a strong memory. There are also restrictions made upon this condition:All the Muhadditheen who possess great knowledge of ahadith must agree upon the testifiers... in question ability to learn and memorize, along with his reporting techniques.The testimonial must be complete without any missing testifiers.\nIf there are two different narrators of a hadith related to them by a Sahaabi then the hadith shall be given a high stage in rank. However, if only one narrator can be found and the testimonial proves to be a strong one then this shall be accepted without any doubts.Allaamah Nawawi relates that all scholars in Islam have agreed that Sahih Bukhari has earnestly gained the reward of being the most authentic after the Holy Qura'an.",
    "explanation": "Bukhari states, \"There was once a time during one of our sessions when my teacher Ishaaq Ibn Rahway remarked it would be appreciated if someone could collect ahadith which held strong and reliable testimonials and write them in the form of a book.\" This inspired Bukhari which was later strengthened by a dream in which Bukhari met the Prophet (SAW). Upon waking, he visited several interpreters for an appropriate interpretation. They all answered that it meant he would in future cleanse the Prophet (SAW) of all lies spoken by the people through narrating misunderstood ahadith. This gave Bukhari great comfort and strength once he started the writing of his book Al-Jame-ul-Sahih. The complete name of the book is ˜Al-Jame-ul-Sahih-al-Musnad-min-ahaadeethe-Rasulillah Sallallahu Alaihi Wasallam-wa-sunanihi-wa-Ayyaamihi, which means a collected version of ahadith in the form of a book which relates to us the sayings, actions and the life of the Prophet Sallallahu Alaihi Wasallam (SAW).Bukhari had taken great care in writing the ahadith and choosing those which met the standards and conditions which he set to find ahadith with only strong testimonials which included only reliable and trustworthy testifiers. He spent 16 years in writing the book, altering it a total of three times. Allaamah Ayni reports of Ibn Tahir's remark that Bukhari had written Sahih Bukhari in his hometown Bukhara. Ibn Bujair however, relates that he had started his compiling in Makkah, and some have reported of seeing him in Basra. There is still another differing remark made by others who comment on seeing him in Madinah to write his book. However, we find Bukhari relating himself that he wrote Sahih Bukhari in Masjid-e-Haraam.Before he actually placed a hadith in his compilation he used to perform ghusl and prayed to Allah(SWT) through two rakah nafl prayers asking for guidance. Bukhari worked such that only after being completely satisfied with the hadith in question did he give it a place in his book. Due to this great care which was taken, the people were heard to say that the ahadith which Bukhari has narrated have been so carefully phrased and with such precision that it is felt that Bukhari had heard the ahadith directly through the Prophet(SAW).\nAbu Zaid Marwazi reports that I was once asleep in between the ˜Black stone' and ˜Maqaam-e-Ibrahim' when the Prophet (SAW) appeared in my dream he stated, \"O Abu Zaid! For how long shall you teach Imam Shafi's book ? When shall you start the teaching of my book?\"I questioned, \"O Prophet (SAW)! Which book is yours?\" He replied, \"Mohammed Ibn Ismail's Al-Jame-ul-Sahih.\"Hafiz Ibn Hajar reports that Bukhari has kept it of utmost importance to only narrate ahadith of a strong testimonial which can be proven by the name of the book. However, along with this Bukhari also made an effort to explain all points which are difficult to understand, which is the reason why he has given a plentiful host of meanings for one sentence which may include a word that is in reality difficult to understand. Bukhari has included within his book(s) the art of narrating ahadith which have been divided into eight different chapters. These chapters contain subjects which have been sub-titled and are famous for the ingenious way in which they have been phrased.Bukhari has imposed conditions which all narrators and testifiers must meet before the hadith can be selected. One condition requires that all testifiers must have a strong memory. There are also restrictions made upon this condition:All the Muhadditheen who possess great knowledge of ahadith must agree upon the testifiers... in question ability to learn and memorize, along with his reporting techniques.The testimonial must be complete without any missing testifiers.\nIf there are two different narrators of a hadith related to them by a Sahaabi then the hadith shall be given a high stage in rank. However, if only one narrator can be found and the testimonial proves to be a strong one then this shall be accepted without any doubts.Allaamah Nawawi relates that all scholars in Islam have agreed that Sahih Bukhari has earnestly gained the reward of being the most authentic after the Holy Qura'an.",
    "year": "2014"
  },
  {
    "number": "51",
    "text": "Highlight the significance of Zakat.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56462?exam_type=waec&type=theory&page=11",
    "correct_answer": "Zakah is the third of the Five Pillars of Islam. It is giving money to the poor. Muslims believe that it is their duty to ensure Allah’s wealth has been distributed equally as everyone is the same - Allah created everyone equally. If a Muslim decides not to follow the pillar of Zakah, it may affect how they are judged in the afterlife. This could make it more likely that they will be sent to Hell (Jahannam) rather than Paradise (Jannah).\nZakah means ‘that which purifies’. By giving money to charity, Muslims can cleanse their wealth. It is important that Muslims do not get attached to unnecessary things such as money and possessions. Islam teaches that focusing on wealth and material possessions does not make a good Muslim.\nZakah refers to a Muslim giving 2.5% of their earnings to charity, after they have paid for what is necessary to support themselves and their family. This means that people who are too poor are not required to suffer hardship in order to give Zakah. Muslims see wealth as ultimately belonging to Allah, and giving Zakah helps to make people more equal. Helping one another is also seen as helping Allah. Zakah donations help Muslims to purify their souls by not being greedy. It is said that the giver of the money will receive a ‘hundred-fold’ back in the afterlife. This means that the giver of the money will receive back a hundred times what they gave as Zakah during their life.\nSome Muslims perform Zakah by giving directly to a charity. Others contribute to donations in the mosque, which then distributes the money to people in need.\nAs well as donating money in a mosque, some Muslims choose to invest time or money (known as Sadaqah) in a chosen charity of their choice. They do this in order to please Allah. However, there are some limitations to how Muslims can donate their time and money. According to Surah 9 in the Qur’an, Zakah can only be used for the following:\nhelping the poorhelping people in needfreeing prisoners, slaves or captiveshelping people out of debt",
    "explanation": "Zakah is the third of the Five Pillars of Islam. It is giving money to the poor. Muslims believe that it is their duty to ensure Allah’s wealth has been distributed equally as everyone is the same - Allah created everyone equally. If a Muslim decides not to follow the pillar of Zakah, it may affect how they are judged in the afterlife. This could make it more likely that they will be sent to Hell (Jahannam) rather than Paradise (Jannah).\nZakah means ‘that which purifies’. By giving money to charity, Muslims can cleanse their wealth. It is important that Muslims do not get attached to unnecessary things such as money and possessions. Islam teaches that focusing on wealth and material possessions does not make a good Muslim.\nZakah refers to a Muslim giving 2.5% of their earnings to charity, after they have paid for what is necessary to support themselves and their family. This means that people who are too poor are not required to suffer hardship in order to give Zakah. Muslims see wealth as ultimately belonging to Allah, and giving Zakah helps to make people more equal. Helping one another is also seen as helping Allah. Zakah donations help Muslims to purify their souls by not being greedy. It is said that the giver of the money will receive a ‘hundred-fold’ back in the afterlife. This means that the giver of the money will receive back a hundred times what they gave as Zakah during their life.\nSome Muslims perform Zakah by giving directly to a charity. Others contribute to donations in the mosque, which then distributes the money to people in need.\nAs well as donating money in a mosque, some Muslims choose to invest time or money (known as Sadaqah) in a chosen charity of their choice. They do this in order to please Allah. However, there are some limitations to how Muslims can donate their time and money. According to Surah 9 in the Qur’an, Zakah can only be used for the following:\nhelping the poorhelping people in needfreeing prisoners, slaves or captiveshelping people out of debt",
    "year": "2014"
  },
  {
    "number": "52",
    "text": "Describe the conditions under which a Muslim performs ritual bath (ghusl).",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56464?exam_type=waec&type=theory&page=11",
    "correct_answer": "Ghusl becomes obligatory for seven causes, and theghuslfor each of these different causes has different names:\nGhusl Janabatisghuslperformed after sexual intercourse or ejaculation.Ghusl Haydis followingmenstruation.Ghusl Nifasis followinglochia.Ghusl Mayyitisghuslperformed on a dead Muslim.\nIn some denominations, two further categories obligate ghusl:\nGhusl Istihadais for irregular bleeding (in women).Ghusl Mas-hil Mayyitbecomes obligatory if one directly touches a dead body.Ghusl also becomes obligatory following a vow or oath to perform it.",
    "explanation": "Ghusl becomes obligatory for seven causes, and theghuslfor each of these different causes has different names:\nGhusl Janabatisghuslperformed after sexual intercourse or ejaculation.Ghusl Haydis followingmenstruation.Ghusl Nifasis followinglochia.Ghusl Mayyitisghuslperformed on a dead Muslim.\nIn some denominations, two further categories obligate ghusl:\nGhusl Istihadais for irregular bleeding (in women).Ghusl Mas-hil Mayyitbecomes obligatory if one directly touches a dead body.Ghusl also becomes obligatory following a vow or oath to perform it.",
    "year": "2014"
  }
]