[
  {
    "number": "5",
    "text": "Study specimen C(Cattle Hoof) ,D ,E(Rabbit) and F and answer the questions that follow.\n(a) Mention two other farm animals from which; (i) specimen A (Chicken Egg) could be obtained (ii) specimen B (Cattle Horn) could be obtained (iii) specimen C could be obtained \n(b) State four ways in which specimen A is important.\n(c) State one function of each specimen B and C in farm animals \n(d) List three products that could be obtained from specimen B.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59727?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  },
  {
    "number": "6",
    "text": "(a) Give four reasons why farmers keep specimen E.\n(b) Mention two products that could be obtained from specimen E.\n(c) If specimen E was serviced on 12th May 2016 and conceived on the same day, calculate the expected kindling date.\n(d) Sate two ways of controlling ear manage on specimen E.\n(e) Mention two endoparasites and two ectoparasites that could infest specimen E.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59728?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  },
  {
    "number": "7",
    "text": "(a) State four ways of controlling specimen G (Rat) on an animal farm.\n(b) State four effects of specimen H (Tick) on cattle.\n(c) Mention three other organisms which have similar effects as specimen H on farm animals.\n(d) State four ways of controlling specimen H.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59729?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  },
  {
    "number": "8",
    "text": "(a)(i) Mention two forms in which specimen J (Guinea Grass) could be preserved.\n(ii) State three qualities of each of the preserved forms of specimen J mentions in 4(a)(i) \n(b) State three advantages of growing specimens J and K (Pueraria) together on a pasture.\n(c) List four management practices that could be adopted to improve a pasture on which specimen J and K are grown.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59730?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  }
]