[
  {
    "number": "5",
    "text": "(a) State three uses each of specimens A (RAKE), C (SHOVEL), and D (CUTLASS)\n(b) Describe Specimen E (WHEELBARROW).\n(C) State three ways of maintaining Specimen E.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59705?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "6",
    "text": "Take a sample each of specimens F (CLAY SOIL), G (LOAMY SOIL) and H (SANDY SOIL) and rub each between the thumb and forefinger. Put a sample of each of the specimens on your palm and add a little amount of water sufficient to wet it. Mix each sample with water. Attempt producing a roll and then a ring. \n(a) Tabulate your observations from the experiment.\n(b) Name two crops that can be grown on specimen H.\n(c) (i) Which of specimens F,G, and H is preferred for maize productions?\n(ii) Give three reasons for your answers in (c)(i).\n(d) State three ways in which specimen l (EARTHWORM) is of economic importance in agriculture.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59706?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "7",
    "text": "(a) Using a table, classify specimens J, K, L, M, N and O into the following crops groups: Fruit, Leafy vegetable, Bulb and Root.\n(b) List five general cultural practices that are carried out by farmers when growing Specimens J, K, L, M, N and O.\n(c) State four ways in which the growing of Specimens J, K, L, M, N and is important to humans.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59707?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "8",
    "text": "(a) State the main food nutrient obtainable from specimen Q (BONE MEAL) and two main food nutrients obtainable from Specimen S(CATFISH)\n(b) State three functions of each of the two main nutrients obtainable from specimen S mentioned in (a).\n(c) Name three farm animals from which specimen Q could be obtained.\n(d) Give three disadvantages of using the ingredients prepared from specimen P (BLOOD MEAL) in compounding livestock feed",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59708?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  }
]