[
  {
    "number": "13",
    "text": "(a) Study specimen E (NPK 15:15:15, F (WOOD ASH), G (LIMESTONE), and H (COWDUNG) and answer the following questions.\n(i) State three major nutrients supplied to crops by specimen E\n(ii) List three methods that could be used to apply specimen E on a farm\n(b) State three agricultural uses of each of specimens F and G\n(c) Mention three ways in which specimen H is important to the soil",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59714?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "14",
    "text": "Study specimens I (WHEELBARROW), J (FILE), K (PALM OIL) and L (COTTON LINT) carefully and answer the following questions.\n(a) (i) Give two uses each of specimens I and J\n(ii) State two general ways of maintaining specimens I and J\n\n(b) (i) Give the botanical names of the crops from which, each of specimens K and L were obtained\n(ii) Outline the steps involved in the traditional method of producing specimen K",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59715?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "15",
    "text": "Study specimens P (APHID),Q (COWPEA SEEDS) and R (COCONUT FRIUT)and answer the following questions;\n(a) (i) State three effects of specimen P on crops\n(ii) Mention two ways of controlling specimen Pl\n(b)(i) Give two benefits of including the crop from which specimen Q was obtained in a mixed cropping system\n(ii) Name the major storage pest of specimen Q\n(c) State five uses of specimen R\n(d) Give the botanical names of the crops from which specimens Q and R were obtained.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59716?exam_type=waec&type=practical&page=3",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "16",
    "text": "Study specimens T (CHICKEN EGG) and U (TILIPIA FISH) and answer the following questions;\n(a)i. Name three breeds of the farm animal which produces specimen T\n\n(ii) State four ways in which specimen T is economically important\n(b)(i) Mention two methods of harvesting specimen U, from the pond\n(ii) List two by-products that could be obtained from the processing of specimen U\n(iii) State four methods of preserving specimen U",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59717?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  }
]