[
  {
    "number": "29",
    "text": "A friend of yours who has been living in Europe for some years has written to invite you to join him. Write a reply to his letter giving, at least, three reasons why you would rather remain in your country.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50619?exam_type=waec&type=theory&page=6",
    "correct_answer": "3 Olisa Avenue,\nlkeja,\nLagos,\nNigeria.\nAugust 14, 2014.\nDear Atey,\nHow are you doing over there in Sweden? I hope everything is okay with you and your studies? I was very happy to get your letter dated 25th June 2014. I must tell you that the letter went a long way in filling the vacuum you left behind with your sudden departure to Europe to search for greener pasture. Atey I must also let you know that everyone is missing you dearly here in Nigeria.\nSometimes we your friends that is to say Osaze.Yemi and Kewe meet at the usual joint at Playball Viewing Centre at Maku Street where we used to watch English Premiership matches to talk about you fondly. We try to imagine the type of life you will be living over there with their kind of weather.I hear it is always cold down there being a Scandinavian country and that the citizens walk about wearing thick clothes, smoking and drinking whisky because of the harsh weather. What a life!\nI must tell you that I appreciate your letter because it was informative and very timely I must say. I read the contents over and over again; taking my time to make sure nothing was left behind. I enjoyed the most the third paragraph where you narrated how you were recently embarrassed at an eatery for not knowing how to use folks and knives. I laughed so much at that story that my stomach almost burst. Well, it is a pity that you allowed that to happen to you because I remember that I encouraged you to do something about it before you travelled but you took my advice for granted. I believe that you have learnt your lesson now. I will advise you as a friend to go learn how to eat with cutlery now because you are no more in Nigeria where most of our food are finger food you know. It is not too late to learn how to eat with cutlery.\nNow, in the letter you sent you want me to join you in Sweden and I must say that am very delighted to read that part I must confess. I use this opportunity to thank you for being very thoughtful and nice to me among all your numerous friends. But Atey am sorry to decline your offer of invitation and I want you to please try to understand and bear with me.1 know you will be itching to know why I declined your offer of invitation .The reasons are that my mother is sick and needs my attention urgently. As the first son I have to be around her all the time, am currently gainfully employed in the country after many years of searching for a job and lastly the security situation has improved because the president is doing his best to ensure that the citizens are well protected.\nI wish you the best in Sweden and please don't forget to reply to my letter. Love you and take care.\nYour best friend,\nAnu",
    "explanation": "3 Olisa Avenue,\nlkeja,\nLagos,\nNigeria.\nAugust 14, 2014.\nDear Atey,\nHow are you doing over there in Sweden? I hope everything is okay with you and your studies? I was very happy to get your letter dated 25th June 2014. I must tell you that the letter went a long way in filling the vacuum you left behind with your sudden departure to Europe to search for greener pasture. Atey I must also let you know that everyone is missing you dearly here in Nigeria.\nSometimes we your friends that is to say Osaze.Yemi and Kewe meet at the usual joint at Playball Viewing Centre at Maku Street where we used to watch English Premiership matches to talk about you fondly. We try to imagine the type of life you will be living over there with their kind of weather.I hear it is always cold down there being a Scandinavian country and that the citizens walk about wearing thick clothes, smoking and drinking whisky because of the harsh weather. What a life!\nI must tell you that I appreciate your letter because it was informative and very timely I must say. I read the contents over and over again; taking my time to make sure nothing was left behind. I enjoyed the most the third paragraph where you narrated how you were recently embarrassed at an eatery for not knowing how to use folks and knives. I laughed so much at that story that my stomach almost burst. Well, it is a pity that you allowed that to happen to you because I remember that I encouraged you to do something about it before you travelled but you took my advice for granted. I believe that you have learnt your lesson now. I will advise you as a friend to go learn how to eat with cutlery now because you are no more in Nigeria where most of our food are finger food you know. It is not too late to learn how to eat with cutlery.\nNow, in the letter you sent you want me to join you in Sweden and I must say that am very delighted to read that part I must confess. I use this opportunity to thank you for being very thoughtful and nice to me among all your numerous friends. But Atey am sorry to decline your offer of invitation and I want you to please try to understand and bear with me.1 know you will be itching to know why I declined your offer of invitation .The reasons are that my mother is sick and needs my attention urgently. As the first son I have to be around her all the time, am currently gainfully employed in the country after many years of searching for a job and lastly the security situation has improved because the president is doing his best to ensure that the citizens are well protected.\nI wish you the best in Sweden and please don't forget to reply to my letter. Love you and take care.\nYour best friend,\nAnu",
    "year": "2014"
  },
  {
    "number": "30",
    "text": "Write an article suitable for publication in your school magazine on the need to inculcate good moral value in the youth",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50620?exam_type=waec&type=theory&page=6",
    "correct_answer": "THE NEED TO INCULCATE GOOD MORAL VALUE IN THE YOUTH\nMorality is ethics or principles that makes one stand out among multitude and it is a means of assessing an individual's worth in any Society. Moral value therefore in our youth is what cannot be overemphasized in the youths. Youths of any country today are the leaders of tomorrow, as a result, there is the need to inculcate good moral in them i as the world has been bedeviled with a lot of immorality. Immorality is most common in our youths and if this menace is not curbed, it will further create anarchy in our environments and to its inhabitants. The need therefore to inculcate good moral value in our youths is a responsibility of not only the parents but the community as a whole.\nMorality is what people look out for in every youth and every morally upright youth is a source of pride to his parents. Charity they say begins at home, and a youth must be properly disciplined from childhood by his parents. The parents of such child have little or nothing to worry about when he becomes a youth.\nAnother institution which needs to inculcate moral values in the youth is the community. The upbringing of a child in the African society is the total responsibility of the entire community members. The adults discipline a child with love when he misbehaves. More so, the government as in the case of Nigeria has discovered that youth without . ut m oral will constitute nuisance to the community. This we can see with the case of terrorism facing our nation the recent times. Thousands of lives have been lost and properties destroyed.\nFurthermore, the government has seen that the most effective means of inculcating moral value in the. youth should start from the grass root. This has made the government to introduce civic education into the school curriculum from primary education to the tertiary. This is aimed at curbing the menace of terrorism, cultism, drug addiction, among others in the youth.\nIn addition, Religious groups and non-governmental organizations have seen the need to inculcate good moral values in the youth as a result of immorality which has taken over our society. Sermons have been preached and seminars organized to help advise the youth to dissociate themselves from groups which will not add positive values to their lives.\nPrincipally, the role of the school precisely teachers and guidance and counseling department in instilling good moral value in the youth cannot be overlooked. Since youth spend more time at schools, they should be properly monitored so that they do not join bad peers. Youths should be properly discipline by the school authorities and reported to the appropriate authorities for rehabilitation if found to have belonged to any such bad group.\nFinally, failure to pay attention to the timing youths has been the major cause of upheavals in our country. Our i youths should be engaged by our government and be made productive. A morally upright youth therefore is an asset to the nation at large.\nReuben Akodu,\nSS3C",
    "explanation": "THE NEED TO INCULCATE GOOD MORAL VALUE IN THE YOUTH\nMorality is ethics or principles that makes one stand out among multitude and it is a means of assessing an individual's worth in any Society. Moral value therefore in our youth is what cannot be overemphasized in the youths. Youths of any country today are the leaders of tomorrow, as a result, there is the need to inculcate good moral in them i as the world has been bedeviled with a lot of immorality. Immorality is most common in our youths and if this menace is not curbed, it will further create anarchy in our environments and to its inhabitants. The need therefore to inculcate good moral value in our youths is a responsibility of not only the parents but the community as a whole.\nMorality is what people look out for in every youth and every morally upright youth is a source of pride to his parents. Charity they say begins at home, and a youth must be properly disciplined from childhood by his parents. The parents of such child have little or nothing to worry about when he becomes a youth.\nAnother institution which needs to inculcate moral values in the youth is the community. The upbringing of a child in the African society is the total responsibility of the entire community members. The adults discipline a child with love when he misbehaves. More so, the government as in the case of Nigeria has discovered that youth without . ut m oral will constitute nuisance to the community. This we can see with the case of terrorism facing our nation the recent times. Thousands of lives have been lost and properties destroyed.\nFurthermore, the government has seen that the most effective means of inculcating moral value in the. youth should start from the grass root. This has made the government to introduce civic education into the school curriculum from primary education to the tertiary. This is aimed at curbing the menace of terrorism, cultism, drug addiction, among others in the youth.\nIn addition, Religious groups and non-governmental organizations have seen the need to inculcate good moral values in the youth as a result of immorality which has taken over our society. Sermons have been preached and seminars organized to help advise the youth to dissociate themselves from groups which will not add positive values to their lives.\nPrincipally, the role of the school precisely teachers and guidance and counseling department in instilling good moral value in the youth cannot be overlooked. Since youth spend more time at schools, they should be properly monitored so that they do not join bad peers. Youths should be properly discipline by the school authorities and reported to the appropriate authorities for rehabilitation if found to have belonged to any such bad group.\nFinally, failure to pay attention to the timing youths has been the major cause of upheavals in our country. Our i youths should be engaged by our government and be made productive. A morally upright youth therefore is an asset to the nation at large.\nReuben Akodu,\nSS3C",
    "year": "2014"
  },
  {
    "number": "31",
    "text": "Write a letter to the Minister of Education in your country discussing, at least, three ways by which the quality of education could be improved.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50621?exam_type=waec&type=theory&page=7",
    "correct_answer": "Saint Isabel Group of Schools,\nAdekunle Odeku Street,\nlbadan,\nOyo State.\n2nd July, 2014.\nThe Minister,\nMinistry of Education,\nCentral District Area,\nGarki,\nAbuja.\nDear Sir,\nWAYS BY WHICH THE QUALITY OF EDUCATION COULD BE IMPROVED IN NIGERIA\nThere is no doubt that the standard of education in Nigeria has fallen and. educationists, parents, students and stakeholders have clamoured for an improvement in our educational sector. The down fall of the educational system has caused a major setback in the system and this has resulted in the production of half-baked graduates. The quality of education therefore could be improved in the ways mentioned below.\nThe government of Nigeria should allow our educational system to be returned to the missionaries. When Western education came to Nigeria it was run by the missionaries and standards then equal what was obtainable elsewhere. Since government took over the affairs of running the educational system, its standards have fallen drastically.\nThe qualities of teachers in our school starting from the pre-school classes to higher institution have to be checked. Government must conduct periodic tests and screening of teachers in order to ascertain the quality of teachings they impact on the students. Teachers should be encouraged to improve on their teaching skills and academic qualifications so as to meet up with the current trends obtainable in the world.\nMinistry of Education should provide adequate infrastructure in our schools. The laboratories, workshops and vocational centres should be equipped with adequate facilities or tools. In this case, the government needs the support of stakeholders, cooperate bodies and commercial organizations to fund such projects. Relevant textbooks, teaching aids and internet facilities should be provided to make teaching easier and learning comfortable.\nQuality of education in Nigeria could also be improved through periodic review of educational curriculum. Old and irrelevant topics should be discarded and replaced with new and relevant ones. Subjects that can make students creative and innovative should be introduced in schools.\nAn important aspect which cannot be left out is the motivation of teachers. Their salaries should be paid regularly and reviewed regularly. This will put an end to endless strikes in our institutions which have also disrupted our academic calendar.\nHonourable Minister, education is seen as the pillar of development in any nation and it determines the growth of a nation structurally and economically. We hope that our educational sector will under your tenure undergo drastic reform by ensuring that all the ways suggested above are put into consideration.\nI look forward to an educational system in Nigeria which will meet up with the standards found around the world.\nYours faithfully,\nAyo Adeniyi.",
    "explanation": "Saint Isabel Group of Schools,\nAdekunle Odeku Street,\nlbadan,\nOyo State.\n2nd July, 2014.\nThe Minister,\nMinistry of Education,\nCentral District Area,\nGarki,\nAbuja.\nDear Sir,\nWAYS BY WHICH THE QUALITY OF EDUCATION COULD BE IMPROVED IN NIGERIA\nThere is no doubt that the standard of education in Nigeria has fallen and. educationists, parents, students and stakeholders have clamoured for an improvement in our educational sector. The down fall of the educational system has caused a major setback in the system and this has resulted in the production of half-baked graduates. The quality of education therefore could be improved in the ways mentioned below.\nThe government of Nigeria should allow our educational system to be returned to the missionaries. When Western education came to Nigeria it was run by the missionaries and standards then equal what was obtainable elsewhere. Since government took over the affairs of running the educational system, its standards have fallen drastically.\nThe qualities of teachers in our school starting from the pre-school classes to higher institution have to be checked. Government must conduct periodic tests and screening of teachers in order to ascertain the quality of teachings they impact on the students. Teachers should be encouraged to improve on their teaching skills and academic qualifications so as to meet up with the current trends obtainable in the world.\nMinistry of Education should provide adequate infrastructure in our schools. The laboratories, workshops and vocational centres should be equipped with adequate facilities or tools. In this case, the government needs the support of stakeholders, cooperate bodies and commercial organizations to fund such projects. Relevant textbooks, teaching aids and internet facilities should be provided to make teaching easier and learning comfortable.\nQuality of education in Nigeria could also be improved through periodic review of educational curriculum. Old and irrelevant topics should be discarded and replaced with new and relevant ones. Subjects that can make students creative and innovative should be introduced in schools.\nAn important aspect which cannot be left out is the motivation of teachers. Their salaries should be paid regularly and reviewed regularly. This will put an end to endless strikes in our institutions which have also disrupted our academic calendar.\nHonourable Minister, education is seen as the pillar of development in any nation and it determines the growth of a nation structurally and economically. We hope that our educational sector will under your tenure undergo drastic reform by ensuring that all the ways suggested above are put into consideration.\nI look forward to an educational system in Nigeria which will meet up with the standards found around the world.\nYours faithfully,\nAyo Adeniyi.",
    "year": "2014"
  },
  {
    "number": "32",
    "text": "You are the main speaker in a debate on the topic: Technology has made the world a better place. Write your arguments for or against the motion.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50622?exam_type=waec&type=theory&page=7",
    "correct_answer": "TECHNOLOGY HAS MADE THE WORLD A BETTER PLACE\nGood morning Mr. Chairman, panel of Judges, accurate time keeper, co-debaters, ladies and gentlemen. Am here today to support the motion that states that 'Technology has made the world a better place'.\nIt is through technology that the world came to embrace modern ways of life through the use of television, car, radio, telephone, etc. In the past the people lived an archaic and primitive existence until technology was embraced and today life has been made easier for everyone via technology. Technology has helped us and it is still helping us to live longer. In the past people died without anybody fathoming the causes of their death until technology came in and helped in unraveling the causes of death. The magic was done through the invention of equipment that run tests on humans to detect the causes, nature, symptoms and cures of illnesses.\nIt is also through technology that we are able to communicate effectively with one another. In the past communicating with distant friends. relations, etc. was done via only letter writing but the advent of technology gave us telephone and now mobile phones. Today one does not have to write often because one can sit in the comfort of one room and within seconds communicate with anybody in any part of the world. Likewise. everybody now has a mobile phone with them and can communicate with ease.\nTechnology has also made work easier via the use of computer. Today we have computers in our various homes and offices which help us to work fast with ease. People now abhor doing things manually and have resorted to the use of computer for communication and business transactions. Think of how the world would be without computers in our homes and offices. Technology has made the world a better place to live in because it has given us the engineering used in building good roads, houses, cars and bridges across the world.\nTechnology has made the world a better place through the invention of airplanes which can travel to any part of the world in the speed of lightning. In the past people spent days, weeks and months to get to any part of Africa, Europe and America. The journeys were usually fraught with dangers but the airplanes have made travelling from one continent to another continent easier and fun to embark on.\nTechnology has made the world a better place to live in with the advent of electricity. In the past people lived in the dark because of the absence of power. People tend to retire early to bed once it was evening. But the situation has changed today because power is now generated to give us night visibility. We now go about our social life and businesses even late into the night because of power generation.\nTherefore, ladies and gentlemen. I stand here today purely convince in my mind that technology has made the world a better place to live in for everybody.",
    "explanation": "TECHNOLOGY HAS MADE THE WORLD A BETTER PLACE\nGood morning Mr. Chairman, panel of Judges, accurate time keeper, co-debaters, ladies and gentlemen. Am here today to support the motion that states that 'Technology has made the world a better place'.\nIt is through technology that the world came to embrace modern ways of life through the use of television, car, radio, telephone, etc. In the past the people lived an archaic and primitive existence until technology was embraced and today life has been made easier for everyone via technology. Technology has helped us and it is still helping us to live longer. In the past people died without anybody fathoming the causes of their death until technology came in and helped in unraveling the causes of death. The magic was done through the invention of equipment that run tests on humans to detect the causes, nature, symptoms and cures of illnesses.\nIt is also through technology that we are able to communicate effectively with one another. In the past communicating with distant friends. relations, etc. was done via only letter writing but the advent of technology gave us telephone and now mobile phones. Today one does not have to write often because one can sit in the comfort of one room and within seconds communicate with anybody in any part of the world. Likewise. everybody now has a mobile phone with them and can communicate with ease.\nTechnology has also made work easier via the use of computer. Today we have computers in our various homes and offices which help us to work fast with ease. People now abhor doing things manually and have resorted to the use of computer for communication and business transactions. Think of how the world would be without computers in our homes and offices. Technology has made the world a better place to live in because it has given us the engineering used in building good roads, houses, cars and bridges across the world.\nTechnology has made the world a better place through the invention of airplanes which can travel to any part of the world in the speed of lightning. In the past people spent days, weeks and months to get to any part of Africa, Europe and America. The journeys were usually fraught with dangers but the airplanes have made travelling from one continent to another continent easier and fun to embark on.\nTechnology has made the world a better place to live in with the advent of electricity. In the past people lived in the dark because of the absence of power. People tend to retire early to bed once it was evening. But the situation has changed today because power is now generated to give us night visibility. We now go about our social life and businesses even late into the night because of power generation.\nTherefore, ladies and gentlemen. I stand here today purely convince in my mind that technology has made the world a better place to live in for everybody.",
    "year": "2014"
  },
  {
    "number": "33",
    "text": "Write a story to illustrate the saying: The devil makes work for idle hands.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50624?exam_type=waec&type=theory&page=7",
    "correct_answer": "THE DEVIL MAKES WORK FOR IDLE HANDS\nLife has not been the same for me for some time now. I just cannot explain how it happened because am still in the state of shock and confusion as I write this sad story. My name is Ajiri and am in my teens. I live with my parents in Lagos and i have two younger siblings .My parents tried their best to shower love on me since I was their first child. For me, life was nothing but fun and enjoyment all the way. I was totally carefree about everything, I did anything Hiked with nobody counseling or ordering me about until my 'joy' and carefree life put me into trouble.\nMy problem started after i finished my UTME and instead of looking for something productive to do with my life i chose going to the bus-stop close to my house to read and argue football matches with other readers at the newspaper vendor's stand. This habit of going to the bus-stop on daily basis arguing endlessly about football matches and the money being paid to the footballers in various Western leagues was frowned upon by my parents.\nMy parents, especially my dad didn't like this unpleasant habit of mine. He condemned it to the high heavens but I refused to heed to his advice. Then one fateful day around 5am, he woke me up from my sleep in my bedroom and started talking to me in a fatherly way, 'Obot, what is wrong with you? I have repeatedly advised you as my first son to desist from this habit of spending the whole day at the vendor s stand arguing football. Why can't you look for something to do while you wait for your UTME result? I want you to go to that computer school across the road to make inquiry on how to enroll as their student. Give me the feedback when I come back from the office, okay?' He said clutching his briefcase firmly in his right hand and heading straight to his recently bought Mazda car parked at the garage.\nI was so bitter that as soon as he left I started banging on my door to show my anger towards him. 'Why should I learn computer? Why can't I be left alone to enjoy my life for once? I screamed the more, waking up my siblings in their rooms.\nThen, that same morning as usual I went to the vendor's stand to read newspapers and out of the blues a team of policemen in a.pick-up van raided the place and I was among those arrested I tried to explain my mission to the bus-stop that morning but they would not listen to me. l ended up spending four days at their station and I was exposed to mosquitoes' bites in their smelly cell until my parents came for my bail The DPO told my dad that his men carried out the arrest that morning because an elderly woman was robbed the previous night in her apartment. As I was about leaving the station with my dad suddenly my mother started scolding me, Now you have learnt your lesson since you don t want to change your ways,you have now realized that the devil makes work for idle hands'",
    "explanation": "THE DEVIL MAKES WORK FOR IDLE HANDS\nLife has not been the same for me for some time now. I just cannot explain how it happened because am still in the state of shock and confusion as I write this sad story. My name is Ajiri and am in my teens. I live with my parents in Lagos and i have two younger siblings .My parents tried their best to shower love on me since I was their first child. For me, life was nothing but fun and enjoyment all the way. I was totally carefree about everything, I did anything Hiked with nobody counseling or ordering me about until my 'joy' and carefree life put me into trouble.\nMy problem started after i finished my UTME and instead of looking for something productive to do with my life i chose going to the bus-stop close to my house to read and argue football matches with other readers at the newspaper vendor's stand. This habit of going to the bus-stop on daily basis arguing endlessly about football matches and the money being paid to the footballers in various Western leagues was frowned upon by my parents.\nMy parents, especially my dad didn't like this unpleasant habit of mine. He condemned it to the high heavens but I refused to heed to his advice. Then one fateful day around 5am, he woke me up from my sleep in my bedroom and started talking to me in a fatherly way, 'Obot, what is wrong with you? I have repeatedly advised you as my first son to desist from this habit of spending the whole day at the vendor s stand arguing football. Why can't you look for something to do while you wait for your UTME result? I want you to go to that computer school across the road to make inquiry on how to enroll as their student. Give me the feedback when I come back from the office, okay?' He said clutching his briefcase firmly in his right hand and heading straight to his recently bought Mazda car parked at the garage.\nI was so bitter that as soon as he left I started banging on my door to show my anger towards him. 'Why should I learn computer? Why can't I be left alone to enjoy my life for once? I screamed the more, waking up my siblings in their rooms.\nThen, that same morning as usual I went to the vendor's stand to read newspapers and out of the blues a team of policemen in a.pick-up van raided the place and I was among those arrested I tried to explain my mission to the bus-stop that morning but they would not listen to me. l ended up spending four days at their station and I was exposed to mosquitoes' bites in their smelly cell until my parents came for my bail The DPO told my dad that his men carried out the arrest that morning because an elderly woman was robbed the previous night in her apartment. As I was about leaving the station with my dad suddenly my mother started scolding me, Now you have learnt your lesson since you don t want to change your ways,you have now realized that the devil makes work for idle hands'",
    "year": "2014"
  },
  {
    "number": "34",
    "text": "Read the following passage carefully and answer the questions on it.\n      The case of Dr. David Akide drives home the point that nobody should be written off as a failure as long as he has not died. As far as I can retail, he was one of the weakest in class throughout our primary school career. Right from the second grade, he was the butt of most of our jokes. Indeed, whenever the teacher referred a question to him, most of us waited eagerly to have a good laugh. But we all admired him for two things. For one thing. he was the only one who never wrote with the right hand as he was a complete southpaw. Then, he endured all the jokes cheerfully and indeed referred to himself as \"Mr. Why Hurry.\" For ever sociable, he was a friend to everybody who came close enough.\n      Not surprising, we left him behind in the primary school as he could not get admitted to any of the secondary schools to which he took an admission examination. That was why. from the time I entered the secondary school, I lost contact with him. Nor did any of my mates whom I closely associated with ever mention meeting him anywhere. As far as most of us were concerned. David had faded away into obscurity. I imagined that he must have ended up in one of the low-grade vocations since he was at least good in handicraft.  \n      Then. a few months ago thirty-eight years after I last saw him in the primary school, while I was watching a 9 0' clock television network programme, I saw David being interviewed by a team of reporters. He was introduced as a specialist surgeon who have made his mark in heart surgery in the nation's leading teaching hospital. The questions were on his recent feat in his successful correction of abnormality in the heart of a patient who had been written off by • most other specialists. The patient fully recovered and was now back in his vocation as a mechanic.\n      I was amazed. I was pleasantly surprised. From the interview. it became clear that he had experienced a surge in intellectual prowess late in his secondary career and zoomed into and through the university as a medical students. Thereafter, it had been one major achievement after another for him in his chosen field.\n(a) What evidence is there that the writer is not a young person?\n(b) For what two things was David Akide admired by others in the primary school?\n(c) Why could he not move into a secondary school then along with the others?\n(d) What did the writer assume had been the fate of David after leaving the primary school?\n(e) What is established by the fact that David Akide was being interviewed by a panel of reporters on the nation's network programme?\n(f) Why was the writer amazed?\n(g) \"... while I was watching a 9 o. clock television network programme ...\"\n(i) What is the grammatical name given to this expression as it is used in the passage?\n(ii) What is its function?\n(h) \" ... zoomed into and through the university, ..\n(i) What figure of speech is used in this expression?\n(ii) What does it mean?\n(i) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) cheerfully (ii) sociable (iii) imagined (iv) vocation (v) achievement",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50625?exam_type=waec&type=theory&page=7",
    "correct_answer": "(a) The evidence is that he had left primary school thirty-eight years before.\n(b)(i) He (was the only pupil who) wrote with his left hand. He was a complete southpaw.\n(ii) He was sociable/friendly/cheerful.\n(c) He could not pass the entrance examinations.\n(d) The writer assumed that David had taken up a low-grade vocation.\n(e) The fact that David Akide was being interviewed by a panel of reporters on the television network proves that he was an important person (an achiever).\n(f) He was amazed because Akide, (a weak pupil), had become a specialist surgeon.\n(g) i It is an adverbial clause (of time).\n(ii) It modifies (the verb) \"saw\"\n(h) It is a metaphor.\n(ii) it means that Akide had gone through the university quickly.\n(i)(i) cheerful - light heartedly, in good spirits, heartily, without taking offence, pleasantly.\n(ii) sociable - affable, pleasant, outgoing, easy to get along with.\n(iii) imagined - assumed, presumed, thought, felt, took it.\n(iv) vocation - career, job, occupation, work.\n(v) achievement - accomplishment, success, feat, attainment.",
    "explanation": "(a) The evidence is that he had left primary school thirty-eight years before.\n(b)(i) He (was the only pupil who) wrote with his left hand. He was a complete southpaw.\n(ii) He was sociable/friendly/cheerful.\n(c) He could not pass the entrance examinations.\n(d) The writer assumed that David had taken up a low-grade vocation.\n(e) The fact that David Akide was being interviewed by a panel of reporters on the television network proves that he was an important person (an achiever).\n(f) He was amazed because Akide, (a weak pupil), had become a specialist surgeon.\n(g) i It is an adverbial clause (of time).\n(ii) It modifies (the verb) \"saw\"\n(h) It is a metaphor.\n(ii) it means that Akide had gone through the university quickly.\n(i)(i) cheerful - light heartedly, in good spirits, heartily, without taking offence, pleasantly.\n(ii) sociable - affable, pleasant, outgoing, easy to get along with.\n(iii) imagined - assumed, presumed, thought, felt, took it.\n(iv) vocation - career, job, occupation, work.\n(v) achievement - accomplishment, success, feat, attainment.",
    "year": "2014"
  },
  {
    "number": "35",
    "text": "Read the following passage carefully and answer the questions on it.\n      Have you ever considered the vast differences between the conventional desktop telephone and the modern handset telephone? The desktop telephone has one distinct function: that of making and receiving calls. Apart from that, perhaps the other use is aesthetic — adding some beauty to the furniture pieces in the room. The conventional telephone set was a status symbol, as only the rich and highly privileged could afford it.\n      To obtain it, one had to fill many forms and have three well known citizens to attest to one's sterling qualities as a highly responsible member of the society. Then, after paying several fees, one had to wait for several months before the telecommunications department officials would come to install the wires, in order to get one's set connected to the national grid. After that, the applicant might count himself among the privileged ones in the community. But he must not heave a sigh of relief yet: his problem may just be beginning. The inclement weather may remind him that his use of the facility is at its mercy. A rainstorm or even a strong wind can destroy some of the wire-bearing poles, thus cutting him off from other telephone users. Besides, a vehicular accident may knock down a pole or several of them. It is not even uncommon for termites to render wooden poles useless. Finally, there are the problems of the communications department officials who are noted for bringing bills late, and cutting off wires for failure to pay up promptly. Most often, the bills bear little resemblance to actual consumption. Thus, the telephone is not always there at one s service.\n      Like the conventional desktop telephone set, the handset has the primary function of making and receiving calls. Beyond that, there are vast differences between them. To begin with, the small handset is not much of a status symbol now. It is very easy to carry about and it can be used everywhere by all and sundry. The telephone service providers have flooded the market with lines at very low prices, such that most users can boast of two or more lines. Gone are the days when one had to apply for a set and wait for months. Today, all that it takes is to purchase the handset, which could be very cheap or very costly depending on one's preferences and purse. Once it is purchased, its user could have access to dozens of functions. Apart from making and receiving calls, one could send text messages and receive responses within minutes. The set could be used to take pictures which could be as clear as any taken with a professional camera. One could also connect to the internet to read newspapers and send mails. Besides, the set could be used to store songs; it could also be used as a radio receiver. One could use the handset to programme schedules of activities. The reliable timepiece on it could be used as a watch. Young ones play games on their handsets and store pictures of loved ones on them.\n      However, with all these advantages, the handset has one obvious shortcoming: it can easily be lost or stolen. This is where the conventional desktop telephone is not vulnerable.\n(a) In three sentences, one for each, summarize the problems associated with owning the desktop telephone.\n(b) In three sentences, one for each, summarize the advantages which the handset telephone has over the desktop telephone.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/english-language/50626?exam_type=waec&type=theory&page=7",
    "correct_answer": "(a) (i) The process of obtaining a desktop telephone is difficult/cumbersome. OR It is difficult to obtain a desktop telephone.\n(ii) Unexpected/negative/unfavourable incidents/occurences may affect the telephone line/wires.\n(iii) The inefficient/poor billing (system) affects the use of the desktop telephone.\n(b)(i) The handset telephone is easy/ easier to obtain.\n(ii) It has a variety of uses. It has more uses/functions/applications than the desktop telephone.\n(iii) It is portable. It is more portable than the desktop telephone. It is easy to carry about. It is easier to carry about",
    "explanation": "(a) (i) The process of obtaining a desktop telephone is difficult/cumbersome. OR It is difficult to obtain a desktop telephone.\n(ii) Unexpected/negative/unfavourable incidents/occurences may affect the telephone line/wires.\n(iii) The inefficient/poor billing (system) affects the use of the desktop telephone.\n(b)(i) The handset telephone is easy/ easier to obtain.\n(ii) It has a variety of uses. It has more uses/functions/applications than the desktop telephone.\n(iii) It is portable. It is more portable than the desktop telephone. It is easy to carry about. It is easier to carry about",
    "year": "2014"
  }
]