[
  {
    "number": "1574",
    "text": "Which of the following is a non-renewable natural resources?",
    "options": {
      "A": "Rubber",
      "B": "Oil palm",
      "C": "Coal",
      "D": "Cocoa"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68926?exam_type=waec&type=obj&page=315",
    "correct_answer": "C",
    "explanation": "Non-renewable natural resources are those that cannot be replaced once they are used up. Coal is a fossil fuel that is formed from the remains of plants and animals that lived millions of years ago. It takes millions of years to form coal, so it is a non-renewable resource.",
    "year": "2023"
  },
  {
    "number": "1575",
    "text": "The demand for a factor input as a result of the demand for its output is known as",
    "options": {
      "A": "market demand",
      "B": "complementary demand",
      "C": "competitive demand",
      "D": "derived demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68928?exam_type=waec&type=obj&page=315",
    "correct_answer": "D",
    "explanation": "The demand for a factor input as a result of the demand for its output is known as derived demand. This is because the demand for the factor input is derived from the demand for the final product that the factor input is used to produce.For example, the demand for labor is derived from the demand for goods and services that are produced by labor. If the demand for goods and services increases, then the demand for labor will also increase.",
    "year": "2023"
  },
  {
    "number": "1576",
    "text": "If the government stops subsidy on cocoa production, the supply curve of cocoa will",
    "options": {
      "A": "become vertical",
      "B": "remain unchanged",
      "C": "shift to the left",
      "D": "shift to the right"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68930?exam_type=waec&type=obj&page=316",
    "correct_answer": "C",
    "explanation": "If the government stops subsidy on cocoa production, the supply curve of cocoa will shift to the left. This is because the subsidy was making it cheaper to produce cocoa, so when the subsidy is removed, the cost of production will increase. As a result, fewer cocoa beans will be supplied at any given price.",
    "year": "2023"
  },
  {
    "number": "1577",
    "text": "A monopolist may enjoy abnormal profit only if its",
    "options": {
      "A": "marginal cost exceeds marginal revenue",
      "B": "demand curve is perfectly elastic",
      "C": "expenditure on advertisement increases",
      "D": "price exceeds average total cost"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68931?exam_type=waec&type=obj&page=316",
    "correct_answer": "D",
    "explanation": "A monopolist may enjoy abnormal profit only if its price exceeds average total cost. This is because a monopolist is the only producer in the market, and they can therefore set the price of their product. If the price exceeds average total cost, the monopolist will be making a profit.",
    "year": "2023"
  },
  {
    "number": "1578",
    "text": "The supply of light could be met using a candle, lantern and gas lamp. This is an example of a",
    "options": {
      "A": "complementary supply",
      "B": "abnormal supply",
      "C": "joint supply",
      "D": "composite supply"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68932?exam_type=waec&type=obj&page=316",
    "correct_answer": "A",
    "explanation": "The supply of light could be met using a candle, lantern, and gas lamp is an example of joint supply. This is because the three products are produced together and cannot be produced separately.In joint supply, two or more products are produced from the same input. The products are said to be jointly supplied because they are produced simultaneously and cannot be produced separately.For example, in the case of the supply of light, the three products are candles, lanterns, and gas lamps. These products are produced from the same input, which is fuel. The products cannot be produced separately because they all require fuel to be produced.",
    "year": "2023"
  },
  {
    "number": "1579",
    "text": "Industries are sometimes located in areas which are not profitable so as to",
    "options": {
      "A": "encourage rural-urban migration",
      "B": "be able to even-out development",
      "C": "bring about external economies of scale",
      "D": "be able to reap internal economies of scale"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68933?exam_type=waec&type=obj&page=316",
    "correct_answer": "B",
    "explanation": "Industries are sometimes located in areas which are not profitable so as to even-out development. This is a government policy that aims to reduce regional disparities in economic development.By locating industries in less developed areas, the government hopes to create jobs and boost economic growth in these areas. This can help to reduce poverty and improve the standard of living in these areas.",
    "year": "2023"
  },
  {
    "number": "1580",
    "text": "A government may cause a favourable change in her invisible trade account by",
    "options": {
      "A": "developing tourism and other services",
      "B": "imposing high tariff on exports",
      "C": "encouraging people to go for medical treatment abroad",
      "D": "increasing the export of her primary products"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68934?exam_type=waec&type=obj&page=316",
    "correct_answer": "A",
    "explanation": "A government may cause a favourable change in her invisible trade account by developing tourism and other services. Invisible trade account records the movement of services across borders. It includes items such as tourism, transportation, insurance, and royalties.A government can promote tourism and other services by:- Investing in infrastructure, such as airports, hotels, and tourist attractions.- Promoting the country as a tourist destination.- Providing incentives to businesses that provide services to foreigners.These measures can help to increase the number of tourists and other service providers in the country, which can lead to a favourable change in the invisible trade account.",
    "year": "2023"
  },
  {
    "number": "1581",
    "text": "To overcome the problem of double counting under the expenditure approach,",
    "options": {
      "A": "spending on intermediate goods and inputs are considered",
      "B": "valued added method is used",
      "C": "proper accounting standards must be used",
      "D": "only spending on final goods are considered"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68935?exam_type=waec&type=obj&page=317",
    "correct_answer": "D",
    "explanation": "To overcome the problem of double counting under the expenditure approach, only spending on final goods are considered.The expenditure approach to calculating national income measures the total spending on goods and services in an economy. However, this can lead to double counting, as the same good or service can be counted multiple times if it is used in the production of other goods and services.To avoid double counting, only spending on final goods is considered when using the expenditure approach. Final goods are goods and services that are not used to produce other goods and services. Intermediate goods, on the other hand, are goods and services that are used to produce other goods and services.By only considering spending on final goods, the problem of double counting is avoided. This is because final goods are not used to produce other goods and services, so they are not counted multiple times.",
    "year": "2023"
  },
  {
    "number": "1582",
    "text": "At what point on the total product curve shown above will marginal product be negative?",
    "options": {
      "A": "Q",
      "B": "S",
      "C": "R",
      "D": "P"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68940?exam_type=waec&type=obj&page=317",
    "correct_answer": "B",
    "explanation": "Marginal product is negative at point S on the total product curve. This is because the total product curve is decreasing at point S. When the total product curve is decreasing, the marginal product is negative.The marginal product is the additional output that is produced when one additional unit of input is added. In this case, the additional output is decreasing, so the marginal product is negative.The other points on the total product curve, P, Q, and R, are all increasing. Therefore, the marginal product is positive at these points.",
    "year": "2023"
  },
  {
    "number": "1583",
    "text": "National income is calculated mainly to",
    "options": {
      "A": "determine how income is to shared",
      "B": "help firms generate more funds",
      "C": "determine aid to to be received from other nations",
      "D": "determine the level of sectoral performance"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68942?exam_type=waec&type=obj&page=317",
    "correct_answer": "D",
    "explanation": "National income is calculated mainly to determine the level of sectoral performance.The level of sectoral performance is important because it can indicate the strength of the economy and the potential for future growth. By measuring the level of sectoral performance, governments can identify areas where the economy is doing well and areas where it needs improvement.",
    "year": "2023"
  },
  {
    "number": "1584",
    "text": "Assisting members to solve temporary balance of payments problems is the reasons for the establishment of the",
    "options": {
      "A": "International Monetary Fund",
      "B": "Economic Commission for Africa",
      "C": "World Bank",
      "D": "African Development Bank"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68944?exam_type=waec&type=obj&page=317",
    "correct_answer": "A",
    "explanation": "The IMF is an international organization that was founded in 1944. Its main goal is to promote international monetary cooperation and facilitate international trade. The IMF does this by providing loans to countries that are experiencing balance of payments problems.A balance of payments problem occurs when a country's imports exceed its exports. This can lead to a shortage of foreign currency, which can make it difficult for the country to pay for imports. The IMF can provide loans to countries with balance of payments problems to help them to cover their import shortfalls and stabilize their currencie",
    "year": "2023"
  },
  {
    "number": "1585",
    "text": "Money is able to function more as a medium of exchange when",
    "options": {
      "A": "there is a fall in production",
      "B": "more prople engage in subsistence production",
      "C": "individuals and nations are self-sufficient",
      "D": "there is specialization of labour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68946?exam_type=waec&type=obj&page=317",
    "correct_answer": "D",
    "explanation": "Money is able to function more as a medium of exchange when there is specialization of labour. Specialization of labour, on the other hand, increases the need for money. This is because specialization means that people produce different goods and services, which they then trade with each other. Money is needed to facilitate these trades..",
    "year": "2023"
  },
  {
    "number": "1586",
    "text": "An economy system is mainly concerned with",
    "options": {
      "A": "studying the relationship between ends and means",
      "B": "the allocation of scarce resources between alternative ends",
      "C": "handling situations of abudant resources",
      "D": "the establishment of economic laws"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68947?exam_type=waec&type=obj&page=318",
    "correct_answer": "B",
    "explanation": "An economy system is mainly concerned with the allocation of scarce resources between alternative ends. This is because resources are always scarce, meaning that there is never enough to satisfy all of our wants and needs. As a result, we have to make choices about how to allocate our resources in a way that maximizes our well-being.",
    "year": "2023"
  },
  {
    "number": "1587",
    "text": "When the marginal utility from the consumption of commodity X (Mux) is greater than the price commodity X (Px), a rational consumer should",
    "options": {
      "A": "strive to remain in disequilibrium",
      "B": "consume the same quantity of commodity X",
      "C": "consume more of commodity X",
      "D": "reduce consumption of commodity X"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68949?exam_type=waec&type=obj&page=318",
    "correct_answer": "C",
    "explanation": "A rational consumer should consume more of commodity X when the marginal utility from the consumption of commodity X (Mux) is greater than the price commodity X (Px). This is because the consumer is getting more satisfaction from consuming each additional unit of commodity X than they are paying for it. As a result, the consumer should continue to consume more of the commodity until the marginal utility is equal to the price.",
    "year": "2023"
  },
  {
    "number": "1588",
    "text": "Which of the following items is not classified as working capital?",
    "options": {
      "A": "Fuel",
      "B": "Money to pay wages",
      "C": "Semi-finished goods",
      "D": "Equipment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68951?exam_type=waec&type=obj&page=318",
    "correct_answer": "D",
    "explanation": "The answer is equipment. Working capital is the difference between a company's current assets and current liabilities. Current assets are those that can be converted into cash within a year, such as cash, accounts receivable, and inventory. Current liabilities are those that are due within a year, such as accounts payable and accrued expenses.Equipment is a long-term asset, meaning that it is not expected to be converted into cash within a year. Therefore, it is not classified as working capital.The other options, fuel, money to pay wages, and semi-finished goods, are all current assets and are therefore classified as working capital.To summarize, the item that is not classified as working capital is equipment.",
    "year": "2023"
  },
  {
    "number": "1589",
    "text": "If the demand for a commodity remains constant as price increases, the commodity is said to be",
    "options": {
      "A": "perfectly price inelastic",
      "B": "unit price elastic",
      "C": "price elastic",
      "D": "price inelastic"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68954?exam_type=waec&type=obj&page=318",
    "correct_answer": "D",
    "explanation": "If the demand for a commodity remains constant as price increases, the commodity is said to be perfectly price inelastic. This means that the quantity demanded of the commodity does not change at all in response to changes in price.Price elasticity of demand is a measure of how responsive the demand for a good or service is to changes in its price. It is calculated as the percentage change in quantity demanded divided by the percentage change in price.A perfectly price inelastic good has an elasticity of demand of 0. This means that the quantity demanded does not change at all in response to changes in price.Some examples of perfectly price inelastic goods include:- Life-saving drugs- Basic food items- Essential services (e.g., electricity, water)In these cases, the demand for the good is so high that even a large increase in price will not cause consumers to decrease their consumption.",
    "year": "2023"
  },
  {
    "number": "1590",
    "text": "Warehousing is an economic activity that falls under",
    "options": {
      "A": "secondary production",
      "B": "primary production",
      "C": "tertiary production",
      "D": "intermediate production"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68957?exam_type=waec&type=obj&page=318",
    "correct_answer": "D",
    "explanation": "Warehousing is an economic activity that falls under intermediate production. Intermediate production is the production of goods and services that are used to produce other goods and services. In the case of warehousing, the goods and services that are produced are storage space and logistics services. These services are used by businesses to store their products and to distribute them to their customers.",
    "year": "2023"
  },
  {
    "number": "1591",
    "text": "The study of economics is mainly concerned with how to",
    "options": {
      "A": "rank individuals' wants given the abundant resources",
      "B": "make choice when resources are inadequate",
      "C": "satisfy every member of all societies",
      "D": "produce all the goods needed by everyone"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68961?exam_type=waec&type=obj&page=319",
    "correct_answer": "B",
    "explanation": "The study of economics is mainly concerned with how to make choices when resources are inadequate. This is because resources are always scarce, meaning that there is never enough to satisfy all of our wants and needs. As a result, we have to make choices about how to allocate our resources in a way that maximizes our well-being.The other options listed are not the main focus of economics. While economics can be used to rank individuals' wants, satisfy every member of all societies, and produce all the goods needed by everyone, these are not the primary goals of the discipline. Economics is more concerned with understanding how these things are achieved in the real world, and how we can make better decisions about how to allocate our resources.",
    "year": "2023"
  },
  {
    "number": "1592",
    "text": "Use the graph above to answer the question\nThe curve labelled W shows the",
    "options": {
      "A": "regressive tax",
      "B": "proportional tax",
      "C": "specific tax",
      "D": "progressive tax"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68963?exam_type=waec&type=obj&page=319",
    "correct_answer": "D",
    "explanation": "A progressive tax is a tax system in which the tax rate increases as the amount of taxable income increases. This means that people with higher incomes pay a higher percentage of their income in taxes than people with lower incomes.The curve labeled W shows that the tax rate increases as the amount of taxable income increases. This is the defining characteristic of a progressive tax system.",
    "year": "2023"
  },
  {
    "number": "1593",
    "text": "Resources are pooled for the mutual benefit of its members mainly in a",
    "options": {
      "A": "cooperative society",
      "B": "joint stock company",
      "C": "private company",
      "D": "partnership"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68965?exam_type=waec&type=obj&page=319",
    "correct_answer": "A",
    "explanation": "A cooperative society is a type of business organization that is owned and controlled by its members. The members of a cooperative society pool their resources together in order to provide goods and services to each other at a fair price.In a cooperative society, the members are the ones who benefit from the pooled resources. The profits of the cooperative society are distributed to the members, and the members have a say in how the cooperative society is run.",
    "year": "2023"
  },
  {
    "number": "1594",
    "text": "The total fixed cost curve is",
    "options": {
      "A": "horizontal",
      "B": "upward sloping",
      "C": "vertical",
      "D": "downward sloping"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68968?exam_type=waec&type=obj&page=319",
    "correct_answer": "C",
    "explanation": "The total fixed cost curve is vertical. This is because the total fixed cost does not change with the level of output.Fixed costs are costs that do not vary with the level of output. These costs are incurred regardless of how much output is produced. Examples of fixed costs include rent, insurance, and depreciation.The total fixed cost curve is a graph that shows the relationship between total fixed cost and the level of output. The curve is vertical because the total fixed cost does not change with the level of output.",
    "year": "2023"
  },
  {
    "number": "1595",
    "text": "A small scale firm located within an industrial estate will enjoy",
    "options": {
      "A": "government protection and funding",
      "B": "technological economies of scale",
      "C": "financial economies of scale",
      "D": "external economies of scale"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68970?exam_type=waec&type=obj&page=319",
    "correct_answer": "D",
    "explanation": "A small scale firm located within an industrial estate will enjoy external economies of scale. This is because the firm will be able to benefit from the shared infrastructure and services that are available in the industrial estate.External economies of scale are cost savings that are enjoyed by firms as a result of the growth of the industry as a whole. These savings can be realized through the sharing of infrastructure, such as roads, water, and electricity, and the pooling of resources, such as research and development.In addition, the firm may also be able to benefit from the clustering of firms in the industrial estate. This clustering can lead to increased competition, which can drive down prices and improve the quality of products and services.",
    "year": "2023"
  },
  {
    "number": "1596",
    "text": "Country M enjoys absolute advantage over country N in the production of commodities X and Y, if country M",
    "options": {
      "A": "is inefficient in the production of both commodities X and Y",
      "B": "is more efficient than country N in producing both commodities X and Y",
      "C": "can produce only commodity Y cheaper than country N",
      "D": "and country N are efficient in the production of both goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68976?exam_type=waec&type=obj&page=320",
    "correct_answer": "B",
    "explanation": "Country M enjoys absolute advantage over country N in the production of commodities X and Y if country M is more efficient than country N in producing both commodities X and Y.Absolute advantage refers to the ability of a country to produce a good or service using fewer resources than another country. In this case, country M is able to produce both commodities X and Y using fewer resources than country N. This means that country M can produce more of both commodities with the same amount of resources, or it can produce the same amount of both commodities with fewer resources.",
    "year": "2023"
  },
  {
    "number": "1597",
    "text": "Commericial banks help in economic development mainly by",
    "options": {
      "A": "acting as trustees and executors of wills",
      "B": "acting as intermediaries between government and borowers",
      "C": "serving as custodians of valuables",
      "D": "giving financial advice to the government"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68979?exam_type=waec&type=obj&page=320",
    "correct_answer": "B",
    "explanation": "Commercial banks collect deposits from savers and lend these deposits to borrowers. This process of intermediation allows savers to earn interest on their deposits and borrowers to obtain the funds they need to invest in businesses and other productive activities.Commercial banks also provide other services that can help economic development, such as:Making payments: Commercial banks facilitate payments by providing checking accounts and other payment services. This makes it easier for businesses to conduct transactions and for consumers to purchase goods and services.Providing credit: Commercial banks provide loans to businesses and consumers. This helps businesses to expand and create jobs, and it helps consumers to purchase homes and other goods and services.Investing in the community: Commercial banks invest in the community by making loans to small businesses, providing financial education, and supporting local charities. This helps to create jobs and improve the quality of life in the community.",
    "year": "2023"
  },
  {
    "number": "1598",
    "text": "When job vacancies are publicized, the government is mainly trying to solve the problem of",
    "options": {
      "A": "residual unemployment",
      "B": "cyclical unemployment",
      "C": "technological unemployment",
      "D": "frictional unemployment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68982?exam_type=waec&type=obj&page=320",
    "correct_answer": "D",
    "explanation": "The government is mainly trying to solve the problem of frictional unemployment when job vacancies are publicized.Frictional unemployment is the unemployment that occurs when people are between jobs. This can happen when people are changing jobs, when they are new to the labor market, or when they are re-entering the labor market after a period of unemployment.Publicizing job vacancies can help to reduce frictional unemployment by making it easier for people to find jobs. This is because it increases the visibility of job opportunities and makes it easier for people to match their skills and experience with the needs of employers.",
    "year": "2023"
  },
  {
    "number": "1599",
    "text": "An indication that there is inflation in a country is that",
    "options": {
      "A": "there is a decrease in the demand for goods and services",
      "B": "there are too many goods in circulation",
      "C": "the same amount of money buys lower quantity of goods",
      "D": "people prefer to lend than to borrow"
    },
    "answer_url": "https://myschool.ng/classroom/economics/68996?exam_type=waec&type=obj&page=320",
    "correct_answer": "C",
    "explanation": "An indication that there is inflation in a country is that the same amount of money buys lower quantity of goods. Inflation is a general increase in prices and a decrease in the purchasing value of money. This means that the same amount of money can buy fewer goods and services.",
    "year": "2023"
  },
  {
    "number": "1600",
    "text": "An example of government's recurrent expenditure is",
    "options": {
      "A": "electrification projects in rural areas",
      "B": "the cost of building a school",
      "C": "purchase of new vehicles",
      "D": "paying salaries of workers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69004?exam_type=waec&type=obj&page=320",
    "correct_answer": "D",
    "explanation": "The cost of paying salaries of workers is an example of government's recurrent expenditure. Recurrent expenditure is a type of government spending that is necessary to keep the government running on a day-to-day basis. It includes costs such as salaries, benefits, and pensions for government employees, as well as the cost of operating government buildings and facilities.",
    "year": "2023"
  },
  {
    "number": "1601",
    "text": "A fall in the price of a normal commodity which has elastic demand will result in",
    "options": {
      "A": "a fall in demand",
      "B": "a fall in quantity demanded",
      "C": "an increase in revenue",
      "D": "a decrease in revenue"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69006?exam_type=waec&type=obj&page=321",
    "correct_answer": "C",
    "explanation": "A fall in the price of a normal commodity which has elastic demand will result in an increase in revenue. This is because elastic demand means that consumers are very responsive to changes in price. When the price falls, consumers will buy more of the commodity, which will increase the total revenue.",
    "year": "2023"
  },
  {
    "number": "1602",
    "text": "The dependency ratio of a country is the",
    "options": {
      "A": "the children and aged who rely on the active population for support",
      "B": "people who are cared for by their extended families",
      "C": "total active population who depend on government for survival",
      "D": "number of children who depend on their parents for survival"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69009?exam_type=waec&type=obj&page=321",
    "correct_answer": "A",
    "explanation": "The dependency ratio of a country is the children and aged who rely on the active population for support.The dependency ratio is a measure of the number of people who are not of working age (children and the elderly) compared to the number of people who are of working age (15-64 years old). A high dependency ratio means that there are a lot of people who are not of working age, which can put a strain on the economy. A low dependency ratio means that there are a lot of people of working age, which can be a sign of a healthy economy.",
    "year": "2023"
  },
  {
    "number": "1603",
    "text": "When the demand for a commodity increases while supply remains unchanged, the equilibrium price and quantity will",
    "options": {
      "A": "increase",
      "B": "remain constant",
      "C": "decrease",
      "D": "turn negative"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69015?exam_type=waec&type=obj&page=321",
    "correct_answer": "A",
    "explanation": "When the demand for a commodity increases while supply remains unchanged, the equilibrium price and quantity will increase. This is because the increase in demand will create a shortage at the current price. As a result, sellers will be able to raise prices, and the quantity traded will increase.The equilibrium price will increase until the quantity demanded equals the quantity supplied. At this point, the market will be in equilibrium again.",
    "year": "2023"
  },
  {
    "number": "1604",
    "text": "Consumers have access to a variety of goods through the activities of the",
    "options": {
      "A": "retailers",
      "B": "advertising agencies",
      "C": "mass media",
      "D": "wholesalers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69018?exam_type=waec&type=obj&page=321",
    "correct_answer": "A",
    "explanation": "Retailers are businesses that sell goods directly to consumers, whether through physical stores or online platforms. They offer a wide range of products from various manufacturers and wholesalers, making them easily accessible to consumers. Retailers create a convenient and engaging shopping experience, allowing consumers to browse, compare, and purchase goods in one location.",
    "year": "2023"
  },
  {
    "number": "1605",
    "text": "The malthusian theory of population is best illustrated when",
    "options": {
      "A": "the size of the population and available resources are equal",
      "B": "both population and food supply increase at the same rate",
      "C": "food supply increases much faster than population growth",
      "D": "population increases much faster than food supply"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69021?exam_type=waec&type=obj&page=321",
    "correct_answer": "D",
    "explanation": "The Malthusian theory of population is best illustrated when population increases much faster than food supply. This is because the Malthusian theory argues that population growth is exponential, while food supply growth is linear. This means that the population will eventually outgrow the food supply, leading to famine, disease, and war",
    "year": "2023"
  },
  {
    "number": "1606",
    "text": "The Net National Product (NNP) of a country is $50m while the depreciation allowance is $10m. The Gross National Product (GNP) is",
    "options": {
      "A": "$40m",
      "B": "$60m",
      "C": "$30m",
      "D": "$500m"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69023?exam_type=waec&type=obj&page=322",
    "correct_answer": "B",
    "explanation": "GNP = NNP + Depreciation AllowanceIn this case, the NNP is $50m and the depreciation allowance is $10m. Therefore, the GNP is:GNP = $50m + $10m = $60m",
    "year": "2023"
  },
  {
    "number": "1607",
    "text": "The rate of growth of population is",
    "options": {
      "A": "initial population plus number of births and net migration",
      "B": "the difference between birth rate and death rate",
      "C": "birth rate less death rate plus net migration",
      "D": "the number of immigrants plus number of births"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69025?exam_type=waec&type=obj&page=322",
    "correct_answer": "C",
    "explanation": "The rate of growth of population is generally calculated using the formula: birth rate minus death rate plus net migration. This formula takes into account the components that contribute to changes in population size over a specific period of time.",
    "year": "2023"
  },
  {
    "number": "1608",
    "text": "The price level and the value of money are",
    "options": {
      "A": "positively related",
      "B": "directly related",
      "C": "not related",
      "D": "inversely related"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69026?exam_type=waec&type=obj&page=322",
    "correct_answer": "D",
    "explanation": "The price level and the value of money are inversely related. The price level is the average price of goods and services in an economy. The value of money is the amount of goods and services that can be purchased with a unit of money.When the price level increases, the value of money decreases. This is because the same amount of money can buy fewer goods and services. Conversely, when the price level decreases, the value of money increases. This is because the same amount of money can buy more goods and services.",
    "year": "2023"
  },
  {
    "number": "1609",
    "text": "One of the factor that may not promote industrial development is",
    "options": {
      "A": "local firms entering into partnerships with foreign firms",
      "B": "granting capital to firms at reasonable interest rates",
      "C": "setting up industrial estates with modern amenities",
      "D": "granting old firms tax exemptions"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69028?exam_type=waec&type=obj&page=322",
    "correct_answer": "D",
    "explanation": "The factor that may not promote industrial development is granting old firms tax exemptions.Tax exemptions are a form of government subsidy that can be given to firms in order to promote economic development. However, they can also have the unintended consequence of discouraging innovation and efficiency.This is because tax exemptions can make it easier for old firms to stay in business, even if they are not competitive. This can prevent new firms from entering the market, which can stifle innovation and economic growth.",
    "year": "2023"
  },
  {
    "number": "1610",
    "text": "If a firm retrenches some of its factory workers its",
    "options": {
      "A": "average fixed cost may increase",
      "B": "variable cost will decline",
      "C": "marginal cost may increase",
      "D": "fixed cost is likely to increase"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69031?exam_type=waec&type=obj&page=322",
    "correct_answer": "B",
    "explanation": "If a firm retrenches some of its factory workers, its variable cost will decline. This is because variable costs are costs that vary with the level of output. When the number of workers is reduced, the amount of variable costs will also be reduced.",
    "year": "2023"
  },
  {
    "number": "1611",
    "text": "Many workers are employed in the agricultural sector of developing countries because",
    "options": {
      "A": "labour intensive method is mostly adopted",
      "B": "abnormal profits are made",
      "C": "wages in the sector is high",
      "D": "they practice mechanized system of farming"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69035?exam_type=waec&type=obj&page=323",
    "correct_answer": "A",
    "explanation": "Many workers are employed in the agricultural sector of developing countries because labour intensive method is mostly adopted.In developing countries, the agricultural sector is often the most labor-intensive sector of the economy. This is because the land is often not suitable for mechanized farming, and the labor force is often abundant and relatively inexpensive.As a result, the agricultural sector employs a large number of people, even though it is not the most productive sector of the economy. This is why many workers are employed in the agricultural sector of developing countries.",
    "year": "2023"
  },
  {
    "number": "1612",
    "text": "Taxes levied on goods and services by government are called",
    "options": {
      "A": "indirect taxes",
      "B": "direct taxes",
      "C": "coporate taxes",
      "D": "poll taxes"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69041?exam_type=waec&type=obj&page=323",
    "correct_answer": "A",
    "explanation": "Taxes levied on goods and services by the government are called indirect taxes. Indirect taxes are taxes that are collected from businesses when they sell goods or services. The businesses then pass the tax on to consumers in the form of higher prices.",
    "year": "2023"
  },
  {
    "number": "1613",
    "text": "The average revenue curve of a firm in a perfect market is the same as the",
    "options": {
      "A": "supply curve of the firm",
      "B": "average cost curve of the firm",
      "C": "demand curve of the firm",
      "D": "total revenue curve of the firm"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69044?exam_type=waec&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "The average revenue curve of a firm in a perfect market is the same as the demand curve of the firm. This is because in a perfect market, the firm is a price taker, meaning that they cannot influence the market price. As a result, the firm's demand curve is also the market demand curve, and the average revenue curve is equal to the demand curve.",
    "year": "2023"
  },
  {
    "number": "1614",
    "text": "The most liquid asset among the following is",
    "options": {
      "A": "cheque",
      "C": "cash",
      "D": "shares"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69047?exam_type=waec&type=obj&page=323",
    "correct_answer": "C",
    "explanation": "Liquidity refers to how easily an asset can be converted into cash without loss of value. Cash is the most liquid asset because it can be used to purchase goods and services immediately. Shares, bonds, and cheques are less liquid because they cannot be converted into cash as easily.",
    "year": "2023"
  },
  {
    "number": "1615",
    "text": "Petrol and Kerosene are jointly obtained from crude oil. If the supply of petrol increases, the",
    "options": {
      "A": "cost of crude oil production has increased",
      "B": "supply of kerosene will rise",
      "C": "supply of kerosene will remain unchanged",
      "D": "supply of kerosene will fall"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69049?exam_type=waec&type=obj&page=323",
    "correct_answer": "B",
    "explanation": "If the supply of petrol increases, the supply of kerosene will rise. This is because petrol and kerosene are jointly supplied, meaning that they are produced from the same source. When the supply of petrol increases, it means that there is more crude oil available to be used to produce kerosene. As a result, the supply of kerosene will also increase.The cost of crude oil production has no bearing on the supply of kerosene. The cost of production will only affect the supply of kerosene if it becomes too expensive to produce kerosene. However, in this case, the supply of kerosene would fall, not rise.",
    "year": "2023"
  },
  {
    "number": "1616",
    "text": "The fixing of maximum prices by government is mainly on",
    "options": {
      "A": "imported capital goods",
      "B": "inferior goods",
      "C": "selected essential goods",
      "D": "luxury goods"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69050?exam_type=waec&type=obj&page=324",
    "correct_answer": "C",
    "explanation": "The fixing of maximum prices by government is mainly on selected essential goods. This is because the government wants to ensure that these goods are affordable for everyone, especially the poor.Inferior goods are goods that people demand less of as their income increases. Luxury goods are goods that people demand more of as their income increases. Imported capital goods are goods that are used to produce other goods.The government is less likely to fix maximum prices on these goods because they are not essential for everyone's survival.Here are some examples of selected essential goods that the government may fix maximum prices on:FoodWaterElectricityMedicineHousingThe government may also fix maximum prices on other goods that are considered to be essential, such as gasoline and public transportation.The goal of fixing maximum prices on essential goods is to prevent prices from rising too high, which could make these goods unaffordable for some people. This can help to protect the poor and vulnerable from the effects of inflation.However, there are also some potential drawbacks to fixing maximum prices. For example, it can lead to shortages of goods, as suppliers may be reluctant to sell their goods at a lower price. It can also lead to black markets, where goods are sold at prices above the maximum price.The government must carefully consider the pros and cons of fixing maximum prices before making a decision",
    "year": "2023"
  },
  {
    "number": "1617",
    "text": "When more of tax on a product is borne by the buyer than the seller, the commodity involved has",
    "options": {
      "A": "perfectly elastic demand",
      "B": "perfectly inelastic demand",
      "C": "fairly inelastic demand",
      "D": "elastic demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69052?exam_type=waec&type=obj&page=324",
    "correct_answer": "C",
    "explanation": "The answer is inelastic demand. When the demand for a commodity is inelastic, the buyers are less sensitive to changes in price. This means that they will continue to buy the same amount of the commodity even if the price increases. As a result, the burden of the tax will be borne by the buyers.",
    "year": "2023"
  },
  {
    "number": "1618",
    "text": "The marks obtained by 9 students in a class test are recorded below: 9, 8, 7, 5,7, 6, 8, 9 and 7. What is the median mark?",
    "options": {
      "A": "7",
      "B": "8.5",
      "C": "8",
      "D": "7.5"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69053?exam_type=waec&type=obj&page=324",
    "correct_answer": "A",
    "explanation": "The median mark is the middle mark when the marks are arranged in ascending order. First, let's arrange the marks in ascending order: 5, 6, 7, 7, 7, 8, 8, 9, 9Since there are 9 students, the median mark is the average of the 4th and 5th marks. The 4th mark is 7 and the 5th mark is also 7, so the median mark is 7.Therefore, the answer is 7.",
    "year": "2023"
  },
  {
    "number": "1619",
    "text": "Tariffs, quotas and embargoes are examples of",
    "options": {
      "A": "trade restriction policies",
      "B": "monetary policies",
      "C": "fiscal policies",
      "D": "foreign exchange policies"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69055?exam_type=waec&type=obj&page=324",
    "correct_answer": "A",
    "explanation": "Trade restriction policies are government interventions that are designed to restrict the flow of goods and services between countries. They can be used to protect domestic industries from foreign competition, to raise revenue for the government, or to achieve other policy objectives.Tariffs are taxes that are imposed on imported goods. Quotas are limits on the quantity of goods that can be imported. Embargoes are bans on the import or export of certain goods.",
    "year": "2023"
  },
  {
    "number": "1620",
    "text": "Trade protection will assit economic growth in developing countries if it can",
    "options": {
      "A": "allow the importation of cheaper goods people want",
      "B": "effectively safeguard newly established firms",
      "C": "eliminate importation of all commodities",
      "D": "generate enough revenue through export duties"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69056?exam_type=waec&type=obj&page=324",
    "correct_answer": "B",
    "explanation": "Newly established firms in developing countries often face stiff competition from established foreign firms. Trade protection can help these new firms to compete by shielding them from some of the competition. This can give them time to grow and develop, and eventually become competitive on their own.",
    "year": "2023"
  },
  {
    "number": "1621",
    "text": "A country is described as developing if",
    "options": {
      "A": "the income per head is low",
      "B": "the contribution of tertiary sector to national income is high",
      "C": "the population is decreasing",
      "D": "there is low labour supply"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69059?exam_type=waec&type=obj&page=325",
    "correct_answer": "A",
    "explanation": "A country is described as developing if the income per head is low. A developing country is a country that is in the process of economic development. This means that the country is trying to increase its standard of living and improve the quality of life for its citizens.One of the key indicators of a developing country is the income per head. This is the average income of a person in the country. If the income per head is low, it means that the standard of living in the country is also low.",
    "year": "2023"
  },
  {
    "number": "1622",
    "text": "A joint stock company enjoys perpetual existence because",
    "options": {
      "A": "there is a higher degree of specialization",
      "B": "it is a corporate entity",
      "C": "it is formed by a minimum of seven members",
      "D": "its shares are easily"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69062?exam_type=waec&type=obj&page=325",
    "correct_answer": "B",
    "explanation": "A joint stock company enjoys perpetual existence because it is a corporate entity. This means that the company is a legal person separate from its members. As a result, the company can continue to exist even if the members change or die.",
    "year": "2023"
  },
  {
    "number": "1623",
    "text": "Which of the following is not a problem facing Economic Community of West African States (ECOWAS)?",
    "options": {
      "A": "Language barriers",
      "B": "Inadequate supply of labour",
      "C": "Production of the same commodities",
      "D": "Poor transportation and communication"
    },
    "answer_url": "https://myschool.ng/classroom/economics/69064?exam_type=waec&type=obj&page=325",
    "correct_answer": "B",
    "explanation": "Inadequate supply of labour is not a problem facing the Economic Community of West African States (ECOWAS).ECOWAS is a regional economic community of 15 countries in West Africa. The countries in ECOWAS share a common goal of economic integration, and they have made significant progress in this area. However, there are still some challenges that the community faces, including language barriers, production of the same commodities, and poor transportation and communication.Inadequate supply of labour is not one of the challenges facing ECOWAS. In fact, the region has a large and growing labor force. This is due to the high population growth rates in many of the ECOWAS countries. The labour force is also relatively young, which means that there is a large pool of potential workers.",
    "year": "2023"
  }
]