[
  {
    "number": "25",
    "text": "Study the diagrams above and use them as guides in carrying out the following instructions.\n\nUsing the spring balance provided, determine the weight of the object of mass M= 50.0g in air. Record this weight as W\\(_{1}\\).\nDetermine the weight of the object when it is completely immersed in water contained in a beaker as shown in the diagram above. Record the weight as W\\(_{2}\\).\nDetermine the weight of the object when it is completely immersed in a liquid labeled L. Record the weight as W\\(_{3}\\).\nEvaluate U = (W\\(_{1}\\) - W\\(_{2}\\)) and V = (W\\(_{1}\\) -W\\(_{3}\\)).\nRepeat the procedure with the objects of masses M= 100g, 150g, 200g, and 250g\nIn each case, evaluate U = (W\\(_{1}\\) - W\\(_{2}\\)) and V = (W\\(_{1}\\) -W\\(_{3}\\)).\n Tabulate your readings.\nPlot a graph with V on the vertical axis and U on the horizontal axis.\nDetermine the slope, s, of the horizontal graph.\nState two precautions taken to ensure accurate results.\n\n(b)i. State Archimedes' principle.\nii.  A piece of brass of mass 20.0g is hung on a spring balance from a rigid support and completely immersed in kerosene from of density 8.0 x 10\\(^{2}\\)kgm\\(^{-3}\\).  Determine the readings of the spring balance (g= 10ms\\(^{-2}\\), density of brass 8.0 x 10\\(^{3}\\)kgm\\(^{-3}\\))",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59997?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "26",
    "text": "You are provided with a syringe, a petri-dish firmly attached to the base of the movable piston (plunger) of the syringe, a Set of weights, and other necessary apparatus.\n\nPull the piston of the syringe upward until it can no longer move. Read and record this position of the piston on the graduated mark on the syringe as V\\(_{o}\\).\nClamp the syringe and ensure that it is vertical.\nPlace a mass M= 500g gently at the center of the petri-dish.\nRead and record the new position of the piston as V.\nEvaluate V\\(^{1}\\).\nRepeat the procedure for four other values of M= 1000g, 1500g, 2000g, and 2500g.\nTabulate your readings.\nPlot a graph with V\\(^{-1}\\) on the vertical axis and M on the horizontal axis, starting both axes from the origin (0,0).\nDetermine the slope, s, of the graph.\nEvaluate k = s\\(^{-1}\\).\nState two precautions taken to ensure accurate results.\n\n(b)i. When a weight is placed on the petri-dish, which quantities of the gas in the syringe (\\(\\Omega\\)) increases; (\\(\\beta\\)) decrease?\nii. What is responsible for the pressure exerted by a gas in a closed vessel?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60002?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "27",
    "text": "You are provided with a potentiometer, an ammeter, a voltmeter, a standard resistor, and other necessary apparatus. Using the circuit diagram above as a guide carry out the following instructions.\n\nSet up a circuit as illustrated in the diagram above.\nClose the key, K.\nRead and record the ammeter reading l\\(_{o}\\) and the voltmeter reading V\\(_{o}\\) when jockey J is not making contact with the potentiometer wire OQ.\nUsing J, make a contact with the potentiometer wire OQ at a point P such that OP = 1Ocm.\nRead and record the current and the corresponding value of the voltage V.\nRepeat the procedure for other values of OP= 20cm, 30cm, 40cm, 50cm, and 60cm.\nTabulate your readings.\nPlot a graph with V on the vertical axis and I on the horizontal axis, starting both axes from the origin (0, 0).\nDetermine the slope, s, of the graph.\nDetermine the value of V when I = 0.\nState two precautions taken to obtain accurate results.\n\n(b) i. State two advantages of a lead-acid accumulator over a dry Leclanche cell.\nii. A cell of emf 2V and internal resistance of 1\\(\\Omega\\) passes current through an external load of 9\\(\\Omega\\). Calculate the potential drop across the cell.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60004?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  }
]