[
  {
    "number": "77",
    "text": "(a) In what three ways can specimen A (RADIO TRANSMITTER) enhance farmers' productivity?\n(b)(i) Name the operation for which specimen B (BURDIZZO PLIER) is used.\n(ii) Describe how specimen B is used\n(iii) State two maintenance practices for specimen B\n(c) Give three uses of specimen C (BASKET)\n(d) State the importance of specimen D (EGG CANDLER)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59964?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  },
  {
    "number": "78",
    "text": "(a) Classify specimens E (GRASSHOPPER), F (COTTON STAINER), and G (WEEVIL)according to the type of mouthparts they possess.\n(b) State two damages done to crops by each of specimens E, F, G, and H (TERMITES)\n(c) State two control measures of each of specimens G and H.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59965?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  },
  {
    "number": "79",
    "text": "(a) State one method of propagating each of specimens I (CASSAVA), J (YAMSEED), K (COCOYAM), and L (GINGER)\n(b) State three advantages of staking specimen J.\n(c) Give two pests and two diseases of specimen I\n(d) Name the toxic Substance present in specimen I and give one process of reducing it.\n(e) Give two uses of specimen L.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59966?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  },
  {
    "number": "80",
    "text": "(a) State four effects of specimen M (LIVER FLUKE) on farm animals\n(b) Name the primary and intermediate host of specimen M\n(c) State three adaptive features of specimen N (TAPEWORM) which enable it to survive in its host\n(d) State three control measures of each of specimens M and N in livestock management",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59967?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  }
]