[
  {
    "number": "49",
    "text": "The right which an insurer has to stand in the place of the insured against a negligent party is?",
    "options": {
      "A": "insurable interest",
      "B": "subrogation",
      "C": "proximate cause",
      "D": "contribution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49741?exam_type=waec&type=obj&page=10",
    "correct_answer": "B",
    "explanation": "Subrogationis a term describing a legal right held by most insurance carriers to legally pursue a third party that caused an insurance loss to the insured. This is done in order to recover the amount of the claim paid by the insurance carrier to the insured for the loss.",
    "year": "2017"
  },
  {
    "number": "50",
    "text": "A life policy holder enjoy days of grace",
    "options": {
      "A": "at the inception of the policy",
      "B": "at the renewal time of the policy",
      "C": "when he surrenders the policy",
      "D": "when the policy is paid up"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49746?exam_type=waec&type=obj&page=10",
    "correct_answer": "B",
    "explanation": "Agraceperiod allows a borrower or insurance customer to delay payment for a short period of time beyond the due date.\ninsurers allowpolicyholdersa period ofgraceof at least 15days, during which arrear premiumscanbe rectified. In thelife insuranceindustry, the norm is to allowpolicyholdersagraceperiod of 30days.",
    "year": "2017"
  },
  {
    "number": "51",
    "text": "which of the following factors is not considered when calculating premium in life assurance policy",
    "options": {
      "A": "expense",
      "B": "mortality",
      "C": "interest",
      "D": "losses"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49753?exam_type=waec&type=obj&page=11",
    "correct_answer": "A",
    "explanation": "There are several factors used to determine your life insurance premiums, including the following:\nAge.Ageis probably the single primary factor that determines your life insurance premiums. ...Gender.Physical condition.Smoking.Yourmedical history.Your family'smedical history.Occupation.",
    "year": "2017"
  },
  {
    "number": "52",
    "text": "A functional reinsurance is that it",
    "options": {
      "A": "protects the account of the insurer against large claims",
      "B": "discourage the spread of risk in the insurance market",
      "C": "provides protection for uninsured losses",
      "D": "encourages the insured to make claims from more than one insurer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49757?exam_type=waec&type=obj&page=11",
    "correct_answer": "A",
    "explanation": "Reinsuranceis also known as insurance for insurers or stop-loss insurance.Reinsuranceis the practice whereby insurers transfer portions of their risk portfolios to other parties by some form of agreement to reduce the likelihood of paying a large obligation resulting from an insurance claim.",
    "year": "2017"
  },
  {
    "number": "53",
    "text": "A method of providing indemnity under glass insurance policy is?",
    "options": {
      "A": "cash payment",
      "B": "repairs",
      "C": "replacement",
      "D": "reinstatement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49761?exam_type=waec&type=obj&page=11",
    "correct_answer": "C",
    "explanation": "Methods Of Providing Indemnity To Insurance Contract :\nThere are various ways through which indemnity may be provided. These are :\nCash Payment:This is the usual way of making payment of a claim. This method is simpler, easier and less cumbersome.Repair: This is also another way of providing compensation. Rather than making cash payment, the insurers will get the loss repaired to pre-loss condition as far as practicable.Replacement: Usually in case of total loss the insurers may replace the subject-matter by another one of the same standard, age and quality. A glass would normally be replaced than repaired.\nReinstatement: The insurers may also reinstate the property by option. This is usually considered with regard to buildings damaged or destroyed by fire. Usually it is the option of the insurers to decide any one of the above four methods.",
    "year": "2017"
  },
  {
    "number": "54",
    "text": "which type of insurance product is appropriate for a young couple who is embarking on a holiday trip abroad?",
    "options": {
      "A": "whole life policy",
      "B": "investment linked policy",
      "C": "education endowment policy",
      "D": "term assurance policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49763?exam_type=waec&type=obj&page=11",
    "correct_answer": "D",
    "explanation": "Term life insurance or term assurance is life insurance that provides coverage at a fixed rate of payments for a limited period of time, the relevant term. After that period expires, coverage at the previous rate of premiums is no longer guaranteed and the client must either forgo coverage or potentially obtain further coverage with different payments or conditions. If the life insured dies during the term, the death benefit will be paid to the beneficiary.",
    "year": "2017"
  },
  {
    "number": "55",
    "text": "information required in a proposal form for employer's liability is insurance include",
    "options": {
      "A": "age and health condition of the employees",
      "B": "the number of employees and the annual wage roll of the proposer",
      "C": "nature and description of goods to be carried or dispatched",
      "D": "the extent to which the vehicle of the proposer will be put to private use"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49764?exam_type=waec&type=obj&page=11",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2017"
  },
  {
    "number": "56",
    "text": "The reason for issuing certificate of motor insurance is that , it is",
    "options": {
      "A": "required by law for all motor policy holders",
      "B": "a general practice world wide",
      "C": "a support to policy document",
      "D": "a replacement for the policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49765?exam_type=waec&type=obj&page=12",
    "correct_answer": "A",
    "explanation": "Of all the documentationissuedbymotor insurers, theCertificate of Motor Insurancestands alone as the most important document. Its primarypurposeis to provide evidence that at least the minimum level ofinsurancecover required by the Road Traffic Act is in place on a givenvehicle.",
    "year": "2017"
  },
  {
    "number": "57",
    "text": "The principle of utmost good faith allows the insured",
    "options": {
      "A": "to accept all risks proposed for insurance",
      "B": "the right to sue the insurer",
      "C": "to make claim from more than one insurer",
      "D": "to make a full disclosure of the proposed risk"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49766?exam_type=waec&type=obj&page=12",
    "correct_answer": "D",
    "explanation": "Utmost Good Faith. Utmost good faith is a common law principle (sometimes called Uberrimae Fidei). The principle means thatevery person who enters into a contract of insurancehas a legal obligation to act with utmost good faith towards the company offering the insurance.\nIt means that both the policyholder and the insurer need to disclose all material and relevant information to each other before commencement of the contract.",
    "year": "2017"
  },
  {
    "number": "58",
    "text": "A primary function of insurance is the?",
    "options": {
      "A": "creation of a common pool",
      "B": "provision of security",
      "C": "stimulation of business enterprises",
      "D": "loss prevention and control"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49767?exam_type=waec&type=obj&page=12",
    "correct_answer": "D",
    "explanation": "The mainfunctionof theinsuranceis to provide protection against the probable chances of loss. The time and amount of loss are uncertain and at the happening of risk, the person will suffer the loss in absence ofinsurance. Theinsuranceguarantees the payment of loss and thus protects the assured from sufferings.",
    "year": "2017"
  },
  {
    "number": "59",
    "text": "one of the feature of ''with profit whole life assurance'' is that profit is allocated to the policy?",
    "options": {
      "A": "as soon as the policy holder dies",
      "B": "up to the date of death of the policyholder",
      "C": "when the insurer decides to pay the policyholder",
      "D": "as soon as the insured surrenders the policy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49768?exam_type=waec&type=obj&page=12",
    "correct_answer": "B",
    "explanation": "What is aWhole Lifepolicy? AWhole Lifepolicy will pay out a lump sum benefit when thelifeassured dies. This type of Whole of Life policy provides cover for the rest of your life.\nWhole-of-lifepolicies payout a lump sum when you die, whenever that is. The size of the payout depends on your policy. With some policies, you can stop paying once you reach a certain age, but with others you have to make monthly or annual payments right up until you die.",
    "year": "2017"
  },
  {
    "number": "60",
    "text": "The price paid for the purchase of insurance policy is?",
    "options": {
      "A": "premium",
      "B": "claim",
      "C": "renewal",
      "D": "benefit"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49770?exam_type=waec&type=obj&page=12",
    "correct_answer": "A",
    "explanation": "Aninsurance premiumis the amount of money an individual or business must pay for aninsurancepolicy.Insurance premiumsare paid for policies that cover healthcare, auto, home, life, and others.Insurance premiumsmay increase after the policy period ends.",
    "year": "2017"
  },
  {
    "number": "61",
    "text": "The period of insurance in non-life insurance contract is usually",
    "options": {
      "A": "one month",
      "B": "one year",
      "C": "two years",
      "D": "three years"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49771?exam_type=waec&type=obj&page=13",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2017"
  },
  {
    "number": "62",
    "text": "The demand for payment made by the insured to the insurer following occurence of the event insured against is",
    "options": {
      "A": "consideration",
      "B": "gratification",
      "C": "commission",
      "D": "claim"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49773?exam_type=waec&type=obj&page=13",
    "correct_answer": "D",
    "explanation": "Aninsurance claimis a formal request by a policyholder to aninsurancecompany forcoverageor compensation for a covered loss or policy event. Theinsurancecompany validates theclaimand, once approved, issues payment to theinsuredor an approved interested party on behalf of theinsured.",
    "year": "2017"
  },
  {
    "number": "63",
    "text": "Term insurance benefits are payable",
    "options": {
      "A": "at surrender",
      "B": "at death",
      "C": "before maturity"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49774?exam_type=waec&type=obj&page=13",
    "correct_answer": "B",
    "explanation": "The death benefit would be paid by the insurance company if the insured died during the one-year term, while no benefit is paid if the insured dies one day after the last day of the one-year term. The premium paid is then based on the expected probability of the insured dying in that one year.\nYou purchase this insurance for a set amount of time, or a \"term,\" often in 5, 10, 20, or 30 year increments. It's usually at a set price, which means you pay the same amount of money for the policy ever year until the term is up. If you should die during the term, the beneficiaries of your policy will receive the value of the policy. If you don't die during the term, there's no payout. (The good news is you're still alive!)",
    "year": "2017"
  },
  {
    "number": "64",
    "text": "An insurance intermediary that is professionally liable for acts of negligence in the discharge of his duties to his client is an insurance",
    "options": {
      "A": "agent",
      "B": "broker",
      "C": "consultant",
      "D": "underwriter"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49776?exam_type=waec&type=obj&page=13",
    "correct_answer": "B",
    "explanation": "An insurance broker is  a person or company registered as an adviser on matters of insurance and as an arranger of insurance cover with an insurer on behalf of a client.",
    "year": "2017"
  },
  {
    "number": "65",
    "text": "life insurance is a contract of?",
    "options": {
      "A": "indemnity",
      "B": "subrogation",
      "C": "benefit",
      "D": "contribution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49777?exam_type=waec&type=obj&page=13",
    "correct_answer": "C",
    "explanation": "Alife insurancepolicy is acontractwith aninsurancecompany. In exchange for premium payments, theinsurancecompany provides a lump-sum payment, known as a deathbenefit, to beneficiaries upon theinsured'sdeath. Typically,life insuranceis chosen based on the needs and goals of the owner. is a contract of benefit",
    "year": "2017"
  },
  {
    "number": "66",
    "text": "In an endowment policy, benefits are paid at death or",
    "options": {
      "A": "a lump  sum is paid on maturity",
      "B": "regular payments are made after maturity",
      "C": "regular payments are made before maturity",
      "D": "no payments is made until the death of the insured."
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49778?exam_type=waec&type=obj&page=14",
    "correct_answer": "A",
    "explanation": "An endowment policy is alife insurance contract designed to pay a lump sum after a specific term(on its 'maturity') or on death.",
    "year": "2017"
  },
  {
    "number": "67",
    "text": "The part of the policy that describes the event that could lead to loss in an insurance contract is",
    "options": {
      "A": "recital clause",
      "B": "condition",
      "C": "specification",
      "D": "operative clause"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49779?exam_type=waec&type=obj&page=14",
    "correct_answer": "D",
    "explanation": "Theoperative clauseof the policy is a promissoryclause. It is a promise that the insurer undertakes to pay the benefits of the policy if the reason(s) why the policy was incepted, and issued by the insurer, happens while the policy is in force.",
    "year": "2017"
  },
  {
    "number": "68",
    "text": "Insurance is defined as pooling of risk because many people",
    "options": {
      "A": "with common interest make claims every year",
      "B": "with common risk insure with the same company",
      "C": "with common interest insure with reinsurance company",
      "D": "form common association to help themselves"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49780?exam_type=waec&type=obj&page=14",
    "correct_answer": "B",
    "explanation": "Risk pooling in insurance is a practice where the company groups large numbers of policyholders together to lower the impact of higher-riskindividuals by placing them alongside lowerriskones. The company is able to offer higherriskpolicyholders more affordable coverage as a result.",
    "year": "2017"
  },
  {
    "number": "69",
    "text": "The policy of insurance is signed by the?",
    "options": {
      "A": "representative of the insured",
      "B": "representative of the insurer",
      "C": "insurance broker",
      "D": "insurance consultant"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49781?exam_type=waec&type=obj&page=14",
    "correct_answer": "B",
    "explanation": "Signature of Insurance Policies: An insurance document,suchas an insurance policy, an insurance certificate or a declaration under an open cover, must appear to be signed by an insurance company, an underwriter or their agents or their proxies.",
    "year": "2017"
  },
  {
    "number": "70",
    "text": "The document that is legally required to be issued by insurers in respect of compulsory insurance is",
    "options": {
      "A": "cover note",
      "B": "endorsement",
      "C": "certificate",
      "D": "renewal note"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49782?exam_type=waec&type=obj&page=14",
    "correct_answer": "B",
    "explanation": "A cover note is a temporary document issued by an insurance company that provides proof ofinsurance coverageuntil a final insurance policy can be issued.\nAn insurance endorsement is anamendment or addition to an existing insurance contractwhich changes the terms or scope of the original policy. Endorsements may also be referred to as riders. An insurance endorsement may be used to add, delete, exclude or otherwise alter coverage.\nA certificate of insurance (COI) is issued by an insurance company or broke. The COI verifies the existence of an insurance policy and summarizes the key aspects and conditions of the policy.\nRenewal note; a note sent by an insurance company asking the insured person to renew the insurance.",
    "year": "2017"
  },
  {
    "number": "71",
    "text": "The class of insurance that does not require a certificate is?",
    "options": {
      "A": "motor insurance",
      "B": "marine insurance",
      "C": "fire insurance",
      "D": "aviation insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49783?exam_type=waec&type=obj&page=15",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2017"
  },
  {
    "number": "72",
    "text": "How many days are allowed in life insurance as days of grace",
    "options": {
      "A": "25 days",
      "B": "30 days",
      "C": "35 days",
      "D": "60"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49784?exam_type=waec&type=obj&page=15",
    "correct_answer": "B",
    "explanation": "Graceperiods for late payments last anywhere from 30 to 60daysand yourlife insuranceremains in force during that time. \"",
    "year": "2017"
  },
  {
    "number": "73",
    "text": "The person that buys a life insurance policy is an",
    "options": {
      "A": "actuary",
      "B": "assured",
      "C": "assesor",
      "D": "agent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49785?exam_type=waec&type=obj&page=15",
    "correct_answer": "B",
    "explanation": "An assured:Legal owner or beneficiary of a lifeinsurancepolicy.",
    "year": "2017"
  },
  {
    "number": "74",
    "text": "The body that regulates the activities of insurance market in Nigeria",
    "options": {
      "A": "National Insurance Commission",
      "B": "professional reinsurance association of nigeria",
      "C": "Nigeria insurers Association",
      "D": "Nigeria council of registered insurance brokers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49786?exam_type=waec&type=obj&page=15",
    "correct_answer": "A",
    "explanation": "The NationalInsuranceCommission (NAICOM) was established in 1997 by the NationalInsuranceCommission Act 1997 with responsibility for ensuring the effective administration, supervision,regulationand control ofinsurancebusinessin Nigeriaand protection ofinsurancepolicyholders, beneficiaries and third parties toinsurancecontracts.",
    "year": "2017"
  },
  {
    "number": "75",
    "text": "Life policies can be used as a collateral for loan when the policy has?",
    "options": {
      "A": "ceased to be life",
      "B": "been temporary suspended",
      "C": "acquired surrender value",
      "D": "been made paid-up"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49787?exam_type=waec&type=obj&page=15",
    "correct_answer": "C",
    "explanation": "Acollateralassignment oflife insuranceis a conditional assignment appointing a lender as the primary beneficiary of a death benefit touseascollateralfor aloan. If the borrower is unable to pay, the lendercancash in thelife insurance policyand recover what is owed.\n'Surrender Value': It is theamountthe policyholder will get from the life insurance company if he decides to exit the policy beforematurity.",
    "year": "2017"
  },
  {
    "number": "76",
    "text": "The factor which increases the possibility of loss that emanates from the insured attitude is?",
    "options": {
      "A": "physical hazard",
      "B": "moral hazard",
      "C": "uninsured peril",
      "D": "excepted peril"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49789?exam_type=waec&type=obj&page=16",
    "correct_answer": "B",
    "explanation": "moral hazardoccurs when someone increases their exposure to risk when insured, especially when a person takes more risks because someone else bears the cost of those risks.",
    "year": "2017"
  },
  {
    "number": "77",
    "text": "The expert who uses statistics to develop the premium payable in a life contract is an",
    "options": {
      "A": "adjuster",
      "B": "actuary",
      "C": "assesor",
      "D": "agent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49790?exam_type=waec&type=obj&page=16",
    "correct_answer": "B",
    "explanation": "Anactuaryis a business professional who deals with the measurement and management of risk and uncertainty",
    "year": "2017"
  },
  {
    "number": "78",
    "text": "The insured who suffered a loss would be entitled to the amount of compensation payable for the loss under the principle of?",
    "options": {
      "A": "insurable interest",
      "B": "utmost good faith",
      "C": "indemnity",
      "D": "contribution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49791?exam_type=waec&type=obj&page=16",
    "correct_answer": "C",
    "explanation": "-Indemnityis a comprehensive form of insurance compensation for damages or loss and, in the legal sense, it may also refer to an exemption from liability for damages.Indemnityis considered to be a contractual agreement between two parties whereby one party agrees to compensate the loss occurred to the other party (indemnityholder) due to the act of the indemnitor or any other party.",
    "year": "2017"
  },
  {
    "number": "79",
    "text": "A life policy that pays the sum assured if the policy holder dies anytime within the policy period is",
    "options": {
      "A": "term assurance",
      "B": "pure endowment",
      "C": "whole life insurance",
      "D": "personal accident insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49792?exam_type=waec&type=obj&page=16",
    "correct_answer": "A",
    "explanation": "A term assurance policy will be set up to last for a certain period of time (usually a specific number of years or until you reach a certain age): this is known as the term of the policy. A payment will only be made in the event of your death during that period.",
    "year": "2017"
  },
  {
    "number": "80",
    "text": "A policy that covers a trader against the risk of payment default by customer is",
    "options": {
      "A": "stock insurance",
      "B": "trade insurance",
      "C": "credit insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49793?exam_type=waec&type=obj&page=16",
    "correct_answer": "C",
    "explanation": "FidelityGuaranteeInsuranceprovidesinsuranceagainst direct financial loss to companies arising out of the dishonesty of their employees.",
    "year": "2017"
  },
  {
    "number": "81",
    "text": "which of the following professionals is an operator in the reinsurance market?",
    "options": {
      "A": "agent",
      "B": "consultant",
      "C": "broker",
      "D": "adjuster"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49795?exam_type=waec&type=obj&page=17",
    "correct_answer": "C",
    "explanation": "Aninsurance brokeris a specialist ininsuranceand risk management.Brokersact on behalf of their clients and provide advice in the interests of their clients.",
    "year": "2017"
  },
  {
    "number": "82",
    "text": "The part of a policy that describes the event that led to  a loss is",
    "options": {
      "A": "operative clause",
      "B": "recital clause",
      "C": "heading",
      "D": "schedule"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49796?exam_type=waec&type=obj&page=17",
    "correct_answer": "A",
    "explanation": "The Operative clause in an insurance policy sets outs the circumstances that must be present before an insurance company will pay out any claims to insured parties.",
    "year": "2017"
  },
  {
    "number": "83",
    "text": "The type of life insurance policy where the premium goes towards the policy with no interest element is",
    "options": {
      "A": "endowment policy",
      "B": "whole life insurance",
      "C": "annuity policy",
      "D": "term insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49799?exam_type=waec&type=obj&page=17",
    "correct_answer": "A",
    "explanation": "Endowmentlife insurance policies do not have investment risk orinterestrate risk.  anendowment policydoes not earn anyinterestthroughout the term",
    "year": "2017"
  },
  {
    "number": "84",
    "text": "The document used by the insurer to ask questions about a risk to be covered is",
    "options": {
      "A": "certificates",
      "B": "proposal form",
      "C": "policy form",
      "D": "schedule"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49801?exam_type=waec&type=obj&page=17",
    "correct_answer": "B",
    "explanation": "A proposal form is astandard printed document that is completed by a person who is requesting insurance coverage. The main source of information in an application for risk coverage is the proposal form that the applicant or the intermediary submits to the insurer.",
    "year": "2017"
  },
  {
    "number": "85",
    "text": "The policy which covers either death or disability resulting from an injury is",
    "options": {
      "A": "personal accident insurance",
      "B": "fidelity guaranteed",
      "C": "sickness insurance",
      "D": "motor insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49802?exam_type=waec&type=obj&page=17",
    "correct_answer": "A",
    "explanation": "Personal Accident insuranceor PAinsuranceis an annual policy which provides compensation in the event of injuries, disability or death caused solely by violent,accidental, external and visible events. It is different from lifeinsuranceand medical & healthinsurance.",
    "year": "2017"
  },
  {
    "number": "86",
    "text": "The first insurance company to establish its branch office in Nigeria is",
    "options": {
      "A": "Norwich insurance company",
      "B": "Royal exchange assurance",
      "C": "Yorkshire insurance company",
      "D": "phoenix of Nigeria assurance company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49807?exam_type=waec&type=obj&page=18",
    "correct_answer": "B",
    "explanation": "The Company started operations in Nigeria represented by Barclays Bank DCO in 1918. A branch of the then parent Company, Royal Exchange Assurance, London, (REA...), was then established in Lagos on February 28, 1921. REA was originally founded in 1720 and was one of the first two insurance companies to receive legal status by Royal Charter.",
    "year": "2017"
  },
  {
    "number": "87",
    "text": "The insurance cover a businessman who buys goods from lagos and wants to transport it to kano would require is",
    "options": {
      "A": "marine insurance",
      "B": "business interruption insurance",
      "C": "theft insurance",
      "D": "goods in transit insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49809?exam_type=waec&type=obj&page=18",
    "correct_answer": "D",
    "explanation": "Goods in Transitpolicy (GIT) covers thegoodsof theinsuredagainst fire, theft or accidental damage while thegoodsare being loaded or unloaded, as well as, while thegoodsare intransitor whilst temporarily housed within the general course oftransit.",
    "year": "2017"
  },
  {
    "number": "88",
    "text": "The policy cover with musa insurance is",
    "options": {
      "A": "averagely insured",
      "B": "fully insured",
      "C": "under insured",
      "D": "over insured"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49815?exam_type=waec&type=obj&page=18",
    "correct_answer": "B",
    "explanation": "Fully Insuredis another way of saying there is no-risk or liability as the policyholder and the insurance company assumes all the risk aside from paid premiums.",
    "year": "2017"
  },
  {
    "number": "89",
    "text": "The maximum aount to be paid for kayode's shop  that was damged is",
    "options": {
      "A": "N15,000",
      "B": "N30,000",
      "C": "N45,000",
      "D": "N60,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49816?exam_type=waec&type=obj&page=18",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2017"
  },
  {
    "number": "90",
    "text": "The claims on kayode's shop would be paid by",
    "options": {
      "A": "musa and okon insurance company",
      "B": "musa insurance company",
      "C": "okon insurance company",
      "D": "Mr Adekunle only"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49818?exam_type=waec&type=obj&page=18",
    "correct_answer": "A",
    "explanation": "The principle of contribution comes in play here. The principle holding that two or more insurers each liable for a covered loss should participate in the payment of that loss. Having paid its share of a loss, an insurer may be entitled to equitablecontribution—a legal right to recover part of the payment from another insurer whose policy was also applicable.",
    "year": "2017"
  },
  {
    "number": "91",
    "text": "What is the premium payable for the comprehensive cover",
    "options": {
      "A": "N37,000",
      "B": "N150,000",
      "C": "N155,000",
      "D": "N187,500"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49824?exam_type=waec&type=obj&page=19",
    "correct_answer": "D",
    "explanation": "comprehensive cover = 10% + 2.5% of N1.5M\n150,000 + 37,500 = 187500",
    "year": "2017"
  },
  {
    "number": "92",
    "text": "The document issued to Eke within one week of the contract is",
    "options": {
      "A": "cover note",
      "B": "proposal form",
      "C": "satisfaction note",
      "D": "renewal notice"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49827?exam_type=waec&type=obj&page=19",
    "correct_answer": "A",
    "explanation": "Acover noteis a temporary document issued by an insurance company that provides proof of insurance coverage until a final insurance policy can be issued. Acover noteis different from a certificate of insurance or an insurance policy document.",
    "year": "2017"
  },
  {
    "number": "93",
    "text": "The second document issued to the Eke is",
    "options": {
      "A": "satisfaction note",
      "B": "renewal notice",
      "C": "proposal form",
      "D": "certificate of insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49831?exam_type=waec&type=obj&page=19",
    "correct_answer": "D",
    "explanation": "Acertificate of insuranceis a document used to provide information on specificinsurancecoverage. Thecertificateprovides verification of theinsuranceand usually contains information on types and limits of coverage,insurancecompany, policy number, namedinsured, and the policies' effective periods.",
    "year": "2017"
  }
]