[
  {
    "number": "1",
    "text": "A document issued by an insurer giving temporary protection to the insure is?",
    "options": {
      "A": "endorsement",
      "B": "certificate",
      "C": "proposal form",
      "D": "cover note"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49604?exam_type=waec&type=obj",
    "correct_answer": "D",
    "explanation": "cover note; A cover note is a temporary document issued by an insurance company that provides proof of insurance coverage until a final insurance policy can be issued.",
    "year": "2018"
  },
  {
    "number": "2",
    "text": "The financial interest of the insured in an insurance policy is the",
    "options": {
      "A": "subject matter of insurance",
      "B": "subject matter of the contract",
      "C": "assignment of the contract",
      "D": "deed of the contract"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49609?exam_type=waec&type=obj",
    "correct_answer": "C",
    "explanation": "An assignment of contract occurs when one party to an existing contract (the \"assignor\") hands off the contract's obligations and benefits to another party (the \"assignee\"). Ideally, theassignorwants theassigneeto step into his shoes and assume all of his contractual obligations and rights.",
    "year": "2018"
  },
  {
    "number": "3",
    "text": "full return of premium paid for a contract of insurance is applicable in a situation involving?",
    "options": {
      "A": "double insurance",
      "B": "reduction of cover",
      "C": "absence of agreement",
      "D": "financial distress"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49614?exam_type=waec&type=obj",
    "correct_answer": "A",
    "explanation": "double insurance: Situation in which the same risk is insured by two overlapping but independent insurance policies. When an individual has double insurance, he or she has coverage by two different insurance companies upon the identical interest in the identical subject matter.\nThe general rule is that in the event of double insurance, if a loss is caused by the risk insured against, subject to the terms of each insurance policy, the insured may recover the full amount of his loss from whichever insurer or insurers he chooses.",
    "year": "2018"
  },
  {
    "number": "4",
    "text": "one of the steps taken by an insurer in claim settlement is to?",
    "options": {
      "A": "investigate the loss",
      "B": "assess the risk",
      "C": "present a claim",
      "D": "appoint loss assessor"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49622?exam_type=waec&type=obj",
    "correct_answer": "B",
    "explanation": "Once you are injured in an accident, receiving compensation is more than just a simply filing a claim with the guilty party’s insurance.\nMost of the time, there will be negotiating involved with the insurance company along with an extensive investigation of your claims. After all of this, insurance companies may still low-ball your claim, and knowing how to proceed can be very important.",
    "year": "2018"
  },
  {
    "number": "5",
    "text": "A risk considered as sub standard in future can be dealt with by insurers through\n(i) premium loading (ii) double insurance (iii) excess imposition",
    "options": {
      "A": "I and II",
      "B": "I and III",
      "C": "II and III",
      "D": "I,II and III"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49630?exam_type=waec&type=obj",
    "correct_answer": "B",
    "explanation": "premium loading;The amount an insurer needs to cover its expenses and generate profit.\nExcessimposition- Your insurer mayimposea non-standardexcess, because of the number of claims you have had, or other factors which may mean you are more likely to make a claim.",
    "year": "2018"
  },
  {
    "number": "6",
    "text": "Non-indemnity insurance policies are referred to as",
    "options": {
      "A": "benefit policies",
      "B": "profit policies",
      "C": "non-profit policies",
      "D": "non-benefit policies"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49638?exam_type=waec&type=obj&page=2",
    "correct_answer": "A",
    "explanation": "In non-indemnity insurance the sum which the insured is entitled to receive from the insurer does not necessarily bear any relation to the actual loss, if any, suffered by the insured. Life insurance contracts, personal accident and sickness insurance are examples of non-indemnity insurance.\nA benefit policy is the advantage, privilege, right, or financial reimbursement (such as that made under an insurancepolicy, medical plan, or pension plan).\nfor examplelifeinsuranceisnon-indemnity insurance.",
    "year": "2018"
  },
  {
    "number": "7",
    "text": "insurer XYZ is jointly covered for two lines surplus treaty reinsurance by reinsurers I,J,K and L for a retention limit of N120,000. The amount of cession for reinsurer K if all reinsurers share the risk equally with the sum insured of N360,000 is?",
    "options": {
      "A": "N45,000",
      "B": "N60,000",
      "C": "N90,000",
      "D": "N120,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49642?exam_type=waec&type=obj&page=2",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "8",
    "text": "Marine cargo insurance indemnifies the insured for a loss of?",
    "options": {
      "A": "vessel",
      "B": "container",
      "C": "consignment",
      "D": "freight"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49643?exam_type=waec&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "marine cargo insuranceis a class of propertyinsurancethat insures property while in transit against loss or damage arising from perils associated with the navigation of the sea or air and subsequent land and inland waterways. shippers can requestcargo insuranceto protect their goods from loss, damage, or theft while in transit.\nconsignmentis a batch of goods destined for or delivered to someone.",
    "year": "2018"
  },
  {
    "number": "9",
    "text": "An insured arranges for his premium payment to cease at the age of 70. This is a whole life policy with",
    "options": {
      "A": "indeterminate premium payment",
      "B": "limited premium payment",
      "C": "single premium payment",
      "D": "modified premium payment"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49644?exam_type=waec&type=obj&page=2",
    "correct_answer": "B",
    "explanation": "Alimited premium paymentplan is a plan where youpaythepremiumfor a shorter span of time and enjoy the benefits of aninsurancecover for a long time.",
    "year": "2018"
  },
  {
    "number": "10",
    "text": "One of the functions of the institute of loss adjuster of Nigeria is to",
    "options": {
      "A": "provide a forum to improve insurance business",
      "B": "prepare the insured's claims",
      "C": "offer technical services in claim investigation",
      "D": "adjust loss to suit the insured"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49645?exam_type=waec&type=obj&page=2",
    "correct_answer": "C",
    "explanation": "The objectives of the Institute is to establish and sustain a professional body of practicing Loss Adjusters in Nigeria; to engage in activities that will ensure the general welfare and public well being of Insurance Loss Adjusters and to take necessary actions for the advancement of education in the field of loss adjusting in Nigeria. The objectives shall be pursued:\nBy establishing and maintaining institutions, libraries, schools, and recreation centres for the succour, assistance or education of its members, and the public in Nigeria in Loss Adjusting.By applying the Funds of the Institute in the purchase of proprietary or other interests and the establishment of projects the proceeds of which shall be appropriated wholly and entirely for charitable purposes and public well being of Loss Adjusters in Nigeria.",
    "year": "2018"
  },
  {
    "number": "11",
    "text": "The legth of time in which a proposer is expected to effect changes in life insurance contract is?",
    "options": {
      "A": "days of grace",
      "B": "cooling off period",
      "C": "rectification",
      "D": "endorsement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49647?exam_type=waec&type=obj&page=3",
    "correct_answer": "B",
    "explanation": "cooling-off period,is a period during which you can cancel the policy for any reason. If you cancel, you should get a refund of any premiums you've paid, but the insurer is allowed to charge to cover days when the policy was in force, plus an administration fee.",
    "year": "2018"
  },
  {
    "number": "12",
    "text": "modern insurance business was introduced into nigeria by?",
    "options": {
      "A": "American merchants",
      "B": "British merchants",
      "C": "French merchants",
      "D": "Portuguese merchants"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49649?exam_type=waec&type=obj&page=3",
    "correct_answer": "B",
    "explanation": "History of Insurance in Nigeria.This form of social insurance is still in existence in Nigeria among community groups. In the 20th century, the British merchants introduced modern commercial insurance into West Africa. In 1921, the Royal Exchange Insurance established the first insurance company with a branch in Lagos.",
    "year": "2018"
  },
  {
    "number": "13",
    "text": "The use of gas burners for cutting and welding is considered in insurance contract as",
    "options": {
      "A": "a favourable morale hazard",
      "B": "a favourable physical hazard",
      "C": "an unfavourable morale hazard",
      "D": "an unfavourable physical hazard"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49650?exam_type=waec&type=obj&page=3",
    "correct_answer": "D",
    "explanation": "A physical hazardis defined as \"A factor within the environment that can harm the body without necessarily touching it. Vibration and noise are examples of physical hazards\".\nPhysical hazards include but aren't limited to electricity, radiation, pressure, noise, heights and vibration amongst many others.\nWelding is a potentially hazardous activity and precautions are required to avoid electrocution, fire and explosion, burns, electric shock, vision damage, inhalation of poisonous gases and fumes, and exposure to intense ultraviolet radiation.",
    "year": "2018"
  },
  {
    "number": "14",
    "text": "The method of paying premium in life insurance contract in which premium payable increases as age increases is?",
    "options": {
      "A": "natural premium",
      "B": "level premium",
      "C": "risk premium",
      "D": "pure premium"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49651?exam_type=waec&type=obj&page=3",
    "correct_answer": "A",
    "explanation": "Loading the player... A risk premium is the return in excess of the risk-free rate of return an investment is expected to yield; an asset's risk premium is a form of compensation for investors who tolerate the extra risk, compared to that of a risk-free asset, in a given investment.\nAlevelpremiumis a type of insurancepremiumthat is regularly associated with term life insurance. The termlevelpremiumbasically means that you are going to have the samepremiumpayment for the entire life of the policy.\nThe pure premium \"refers to that portion of that rate needed to pay losses and loss-adjustment expenses\".\nnatural premium.: the amount required to meet the mortality cost of life insurance for each particular year and increasing from year to year for any given unit of protection.",
    "year": "2018"
  },
  {
    "number": "15",
    "text": "The right to effect a contract of insurance on the life of a debtor by the creditor is?",
    "options": {
      "A": "utmost good faith",
      "B": "proximate cause",
      "C": "insurable interest",
      "D": "contribution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49652?exam_type=waec&type=obj&page=3",
    "correct_answer": "C",
    "explanation": "Insurable interestis an essential requirement for issuing an insurance policy which makes the entity or event legal, valid and protected against intentionally harmful acts. People not subject to financial loss do not have aninsurable interest.",
    "year": "2018"
  },
  {
    "number": "16",
    "text": "A condition precedent to an insurance contract is the",
    "options": {
      "A": "extent of the cover granted",
      "B": "right to cancel the insurance contract",
      "C": "right to take possession of damaged property",
      "D": "existence of the subject matter of insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49658?exam_type=waec&type=obj&page=4",
    "correct_answer": "D",
    "explanation": "ContractSubject matter of insuranceis the life, limbs, property, rights or any potential legal liabilityinsuredunder a policy.Subject matterof contract is theinsured'sfinancial interest in thesubject matter of insurance.",
    "year": "2018"
  },
  {
    "number": "17",
    "text": "Addition of a new building to an existing fire and special perils insurance would be effected through the issuance of?",
    "options": {
      "A": "a new policy",
      "B": "an endorsement",
      "C": "a specification",
      "D": "a rectification"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49661?exam_type=waec&type=obj&page=4",
    "correct_answer": "B",
    "explanation": "The purpose of an endorsement is a policy change. Insurance companies create endorsements to offer options to insureds to add coverage or increase coverage limits, but insurers may also issue special endorsements to limit or restrict coverage. Insurance endorsements are used in property and casualty insurance.",
    "year": "2018"
  },
  {
    "number": "18",
    "text": "claims paid by insurers in the event of loss is irrecoverable when the?",
    "options": {
      "A": "average clause is applied",
      "B": "sum insured has been exhausted",
      "C": "sum insured has not been exhausted",
      "D": "payment is and ex gratia basis"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49666?exam_type=waec&type=obj&page=4",
    "correct_answer": "A",
    "explanation": "average clause. is an insurance policy that restricts the amount payable to a sum not to exceed the value of the property destroyed and that bears the same proportion to the loss as the face of the policy does to the value of the property insured",
    "year": "2018"
  },
  {
    "number": "19",
    "text": "The minimum cover for motorist in nigeria is?",
    "options": {
      "A": "''Act'' only",
      "B": "third party only",
      "C": "fire and theft",
      "D": "comprehensive insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49670?exam_type=waec&type=obj&page=4",
    "correct_answer": "B",
    "explanation": "Theminimumamount of autoinsurance in Nigeriathatmotoristsmust carry is third party motorinsurance. Know the Terminology In the autoinsuranceworld, a third party is defined as everyone involved in an accident except the policyholder.",
    "year": "2018"
  },
  {
    "number": "20",
    "text": "The class of insurance under which a visitor who was bitten by her host dog would be compensated is?",
    "options": {
      "A": "personal liability insurance",
      "B": "public liability insurance",
      "C": "professional indemnity insurance",
      "D": "employers liability insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49672?exam_type=waec&type=obj&page=4",
    "correct_answer": "B",
    "explanation": "public liability insurance: Insurance that covers the insured in the case of legal action brought by members of the public.Public Liability insuranceis designed to protect the insured against negligence for accidental loss of or damage to third party property, bodily injury etc",
    "year": "2018"
  },
  {
    "number": "21",
    "text": "A claimant who is not legally entitled to a claim under an insurance contract may be offered a payment on?",
    "options": {
      "A": "constructive total loss basis",
      "B": "partial loss basis",
      "C": "advice of loss basis",
      "D": "ex-gratia basis"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49673?exam_type=waec&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "Exgratia(/ˌɛks ˈɡreɪʃiə/; also spelledex-gratia) is Latin for \"by favour\", and is most often used in a legal context. When something has been doneexgratia, it has been done voluntarily, out of kindness or grace.",
    "year": "2018"
  },
  {
    "number": "22",
    "text": "one benefit of life insurance policy is that it serves as",
    "options": {
      "A": "replacement of earnings after injuries",
      "B": "provision for bad debts",
      "C": "collateral for loans",
      "D": "repair cost of damaged properties"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49674?exam_type=waec&type=obj&page=5",
    "correct_answer": "A",
    "explanation": "Life insurance provides an infusion of cash for dealing with the adverse financial consequences of the insured's death. Life insurance enjoys favorable tax treatment unlike any other financial instrument. Death benefits are generallyincome-tax-free to the beneficiary.\nThepurpose of life insuranceis to provide financial protection to surviving dependents after the death of aninsured.",
    "year": "2018"
  },
  {
    "number": "23",
    "text": "concealment of information considered to be material to the contract of insurance is violating the principle of?",
    "options": {
      "A": "subrogation",
      "B": "indemnity",
      "C": "insurable  interest",
      "D": "utmost good faith"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49678?exam_type=waec&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "Utmost good faith is acommon law principle(sometimes calledUberrimae Fidei). The principle means thatevery person who enters into a contract of insurancehas a legal obligation to act with utmost good faith (honesty) towards the company offering the insurance.",
    "year": "2018"
  },
  {
    "number": "24",
    "text": "Extension cover under money insurance policy doesnt include?",
    "options": {
      "A": "shortage",
      "B": "hold-up",
      "C": "personal injury",
      "D": "damaged to safe"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49679?exam_type=waec&type=obj&page=5",
    "correct_answer": "A",
    "explanation": "Money insurance policyprovidescover forlossof money intransit between theinsured'spremises, bank and other specified places occasioned by robbery, theft or any other fortuitous cause. It also providescover forlossof money inthe business premises, safe or vault, etc.",
    "year": "2018"
  },
  {
    "number": "25",
    "text": "The form of term assurance that operates three options which must be excised before maturity is",
    "options": {
      "A": "decreasing term insurance",
      "B": "increasing term insurance",
      "C": "level term insurance",
      "D": "convertible term insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49681?exam_type=waec&type=obj&page=5",
    "correct_answer": "D",
    "explanation": "Aconvertible insurancepolicy is atermusually related to lifeinsurance. This type of policy provides the benefit of obtaining less expensivetermlifeinsurancenow while maintaining the option to convert to a permanent policy at a later date asinsuranceneeds and financial resources change.\nDecreasing term insuranceis renewabletermlifeinsurancewith coveragedecreasingover the life of the policy at a predetermined rate. Premiums are usually constant throughout the contract, and reductions in coverage typically occur monthly or annually.\nIncreasing termlifeinsurance. Atermlife policy that increases the death benefit each year during theterm. Concurrently, as the death benefit increasLevel-premiuminsuranceistermlifeinsurancefor which the premiums are guaranteed to remain the same throughout the contract, while the amount ofcoverageprovided increases.es, so does the premium. If kept long enough, the premium on this policy willincreasefaster than the death benefit.",
    "year": "2018"
  },
  {
    "number": "26",
    "text": "The document used pending the issuance of certificate in motor insurance policy is",
    "options": {
      "A": "a cover note",
      "B": "a proposal form",
      "C": "an endorsement",
      "D": "a slip"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49682?exam_type=waec&type=obj&page=6",
    "correct_answer": "A",
    "explanation": "A cover note is a temporary document issued by an insurance company that provides proof of insurance coverage until a final insurance policy can be issued. A cover note is different from a certificate of insurance or an insurance policy document.",
    "year": "2018"
  },
  {
    "number": "27",
    "text": "contract of insurance which involves large industrial risks are handled for protection through the completion of?",
    "options": {
      "A": "a proposal form",
      "B": "a policy form",
      "C": "an endorsement",
      "D": "a slip"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49684?exam_type=waec&type=obj&page=6",
    "correct_answer": "A",
    "explanation": "A proposal formis theformcompleted by the policyholder when applying forinsurance. You will need to fill in information about the risk you are insuring e.g. the rebuild cost of your house or type of car you own.\nAninsurance policy formthat is designed to be used by many different insurers and has exactly the same provisions, regardless of the insurer issuing thepolicy. Most standardinsurance policy formsare developed byinsuranceadvisory organizations, such asInsuranceServices Office, Inc.\nA placingslipis a document created by a broker that contains a summary of the terms of a proposedinsuranceor reinsurance contract which is then presented by the broker to selected underwriters for their consideration.\nAninsurance endorsementis an amendment or addition to an existinginsurancecontract which changes the terms or scope of the original policy.",
    "year": "2018"
  },
  {
    "number": "28",
    "text": "The winding up of an insurance is legally required to be based on a petition written from not less than",
    "options": {
      "A": "30 policy holders",
      "B": "40 policy holders",
      "C": "50 policy holder",
      "D": "60policy holders"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49686?exam_type=waec&type=obj&page=6",
    "correct_answer": "C",
    "explanation": "The Insurance Act 2003 provides for the liquidation of insurers on the petition of either50policyholders or the National Insurance Commission. Section33of the act prohibits the voluntary winding up of insurance businesses, except for the purpose of effecting an amalgamation, transfer or acquisition.",
    "year": "2018"
  },
  {
    "number": "29",
    "text": "insurers requesting for membership of Nigeria Insurers Association is required by law to?\n(i) have been registered with NAICOM (ii)operate with sound insurance principles (iii) hold membership of CHN (iv)  ascribe to the policy holding of NIA",
    "options": {
      "A": "i, ii and iii only",
      "B": "i, ii and iv",
      "C": "i, iii and iv",
      "D": "ii, iii and iv"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49690?exam_type=waec&type=obj&page=6",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "30",
    "text": "A general question in an insurance proposal form is",
    "options": {
      "A": "name of the proposal",
      "B": "carriage of fare-paying passenger",
      "C": "description of the proposers' premises",
      "D": "methods of construction"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49693?exam_type=waec&type=obj&page=6",
    "correct_answer": "A",
    "explanation": "Proposal (application) forms are questionnaires issued by the insurer to be completed by the proposer or his/her agent, which ask questions about the subject matter of cover. Since the insurer will use the information to assess a premium and set the terms and conditions of the policy, the prospective insured must disclose all the material circumstances, whether or not the proposal form asks for them.",
    "year": "2018"
  },
  {
    "number": "31",
    "text": "An insurance policy is subject to a franchise of N115,000, how much would an insured who suffered of N120,000 recieve as compwnsation",
    "options": {
      "A": "N5,000",
      "B": "N115,000",
      "C": "N120,000",
      "D": "N235,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49695?exam_type=waec&type=obj&page=7",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "32",
    "text": "The insurance professional who assist the third party to evaluate the extent of loss in a motor accident is",
    "options": {
      "A": "a loss adjustor",
      "B": "a loss assessor",
      "C": "a consultant",
      "D": "an investigator"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49696?exam_type=waec&type=obj&page=7",
    "correct_answer": "B",
    "explanation": "A Loss Assessor is appointed by the policyholder when they need to submit a substantial or complex claim. All fees are paid by the Policyholder.",
    "year": "2018"
  },
  {
    "number": "33",
    "text": "A reinsurance cover of N100,000 in excess of N20,000 was entered by insurer K with reinsurer M. In the event of a loss amounting to N120,000, M would pay?",
    "options": {
      "A": "N20,000",
      "B": "N120,000",
      "C": "N80,000",
      "D": "N100,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49699?exam_type=waec&type=obj&page=7",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "34",
    "text": "A loss assessor in a claim settlement process is representing the interest of the?",
    "options": {
      "A": "insured",
      "B": "insurer",
      "C": "reinsurer",
      "D": "broker"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49700?exam_type=waec&type=obj&page=7",
    "correct_answer": "A",
    "explanation": "A Loss Assessor is appointed by the policyholder when they need to submit a substantial or complex claim. All fees are paid by the Policyholder.(insured)",
    "year": "2018"
  },
  {
    "number": "35",
    "text": "one of the perils of nature is?",
    "options": {
      "A": "heating",
      "B": "earthquake",
      "C": "civil commotion",
      "D": "spontaneous combustion"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49701?exam_type=waec&type=obj&page=7",
    "correct_answer": "B",
    "explanation": "Natural peril; This category includes suchperilsas injury and damage caused bynaturalelements such as rain, ice, snow, typhoon, hurricane, volcano, wave action, wind, earthquake, or flood.",
    "year": "2018"
  },
  {
    "number": "36",
    "text": "A condition which the insuring public would use to evaluate the financial stability of an insurer is?",
    "options": {
      "A": "prompt payment of claims",
      "B": "adequate reinsurance treaty",
      "C": "allowance for ex-gratia payment",
      "D": "settlement of investigated claims"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49704?exam_type=waec&type=obj&page=8",
    "correct_answer": "A",
    "explanation": "The “Prompt Paymentof InsuranceClaims” imposes certain deadlines on insurers for responding to, investigating, and accepting or rejectingclaims. The purpose is to “promote theprompt paymentof insuranceclaimspursuant to policies of insurance.” The general public would use this to judge the insurance capability of owning up to reponsibilities",
    "year": "2018"
  },
  {
    "number": "37",
    "text": "A factor to be considered before a proposal for endowment assurance is accepted is the proposer's?",
    "options": {
      "A": "marital status",
      "B": "place of birth",
      "C": "date of birth",
      "D": "social status"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49708?exam_type=waec&type=obj&page=8",
    "correct_answer": "C",
    "explanation": "an endowment assurance policy is a life insurance contract that is designed to pay a lump sum after some specified period of time on death. However, if the policy term ends whilst you are in good health, the entire sum is given to you. The date of birth is a vital factor for this insurance contract",
    "year": "2018"
  },
  {
    "number": "38",
    "text": "payment of compensation under professional indemnity insurance would be influenced by?",
    "options": {
      "A": "assault",
      "B": "trespass",
      "C": "nuisance",
      "D": "negligence"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49710?exam_type=waec&type=obj&page=8",
    "correct_answer": "D",
    "explanation": "Professional Indemnity Insurance(PII) is a form of liabilityinsurancethat helps protectprofessionaladvisers, service-providing individuals and companies from bearing the full cost of defending themselves against a negligence claim made by a client and damages awarded in such a civil lawsuit in the conduct their business",
    "year": "2018"
  },
  {
    "number": "39",
    "text": "car plying the road seeking passengers for payment of fares are classified by insurers as?",
    "options": {
      "A": "private motor",
      "B": "commercial vehicle",
      "C": "motor trade",
      "D": "general cartage"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49713?exam_type=waec&type=obj&page=8",
    "correct_answer": "B",
    "explanation": "Acommercialvehicleis any type of motorvehicleused for transporting goods or transporting paying passengers.",
    "year": "2018"
  },
  {
    "number": "40",
    "text": "The subject matter of insurance in the package is?",
    "options": {
      "A": "obinna's life",
      "B": "the N2,000,000 loan",
      "C": "musa's life",
      "D": "the sum assured of N20,000"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49716?exam_type=waec&type=obj&page=8",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "41",
    "text": "The peril  insured against by musa is",
    "options": {
      "A": "the loan",
      "B": "death",
      "C": "bad debt",
      "D": "disability"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49717?exam_type=waec&type=obj&page=9",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "42",
    "text": "one of the duties of  a loss adjustor is",
    "options": {
      "A": "advice the claimant on claims processing",
      "B": "ensure prompt payment of claims",
      "C": "estimate maximum loss",
      "D": "investigate the cause of loss"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49722?exam_type=waec&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "Loss Adjusters, also known asclaims adjusters, work forinsurancecompanies and examine property damage to determine how much aninsurancecompany should compensate the claimant.",
    "year": "2018"
  },
  {
    "number": "43",
    "text": "family income benefit effected without capital benefit pays the sum assured from the date of?",
    "options": {
      "A": "death of the assured till a specified period",
      "B": "survival of the assured till a specified period",
      "C": "survival of the assured till a specified period",
      "D": "personal accident insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49724?exam_type=waec&type=obj&page=9",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "44",
    "text": "A manufacturing company whose production was abruptly stopped by fire incidence would have its claim for loss of earning settled under the class of",
    "options": {
      "A": "fire insurance",
      "B": "all risk insurance",
      "C": "product liability insurance",
      "D": "consequential loss insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49728?exam_type=waec&type=obj&page=9",
    "correct_answer": "D",
    "explanation": "What is 'Consequential Loss'.A consequential loss is an indirect loss resulting from an insured's inability to use business property or equipment. A business owner may purchase insurance to protect them against the secondary loss of property and equipment due to a natural disaster or accident.",
    "year": "2018"
  },
  {
    "number": "45",
    "text": "An insurance that could be effected with profit feauture is",
    "options": {
      "A": "term insurance",
      "B": "public liability insurance",
      "C": "endowment assurance",
      "D": "personal accident insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49732?exam_type=waec&type=obj&page=9",
    "correct_answer": "C",
    "explanation": "Anendowment policyis a lifeinsurancecontract designed to pay a lump sum after a specific term (on its 'maturity') or on death. Typical maturities are ten, fifteen or twenty years up to a certain age limit. Some policies also pay out in the case of critical illness.",
    "year": "2018"
  },
  {
    "number": "46",
    "text": "The effect of the minimum cover on the two vehicles is the the?",
    "options": {
      "A": "two vehicles will be repaired by jaguna's insurer",
      "B": "insurer of each vehicle is responsible for the repairs",
      "C": "vehicle of Basanya will be repaired by jaguna's insurer",
      "D": "two vehicles are not entitled to compensation from the insurer"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49733?exam_type=waec&type=obj&page=10",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "47",
    "text": "The compensation would be calculated as",
    "options": {
      "A": "N75,000 payable to jaguna",
      "B": "N80,000 payable to jaguna",
      "C": "N155,000 payable to basanya",
      "D": "N230,000 payable to basanya"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49734?exam_type=waec&type=obj&page=10",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "48",
    "text": "jaguna's repaired expenses of N75,000 would be paid by",
    "options": {
      "A": "jaguna's insurer",
      "B": "jaguna",
      "C": "Basanya's insurer",
      "D": "Basanya"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/insurance/49735?exam_type=waec&type=obj&page=10",
    "correct_answer": "A",
    "explanation": "click here",
    "year": "2018"
  }
]