[
  {
    "number": "1",
    "text": "(a)(i) Mention the major nutrients supplied by specimen A (Fish meal) in animal diet. (ii) State four functions of the nutrients mentioned in 1(a)(i). (iii) Name three feed stuffs that could be used in place of specimen A.\n(b)Give four reasons for keeping specimen B on a farm (Chicken)\n(c) Mention three management practices which are carried out during the rearing of specimen B.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59718?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "2",
    "text": "(a)  State two uses of specimen D in animal production (b) Mention four activities which requires the use of specimen E in animal production. (c)(i) State three precautions which should bee taken by the farmer when using specimen F for the purpose of catration in pigs. (d) Name three tools which could be used in place of specimen F for carrying out castration in famr animals.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59719?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "3",
    "text": "(a)  List three stages in the life cycle of specimen G (Liver Fluke) (b) State four effects of specimen G on the farm animals. (c) Mention three ways of controlling specimen G on farm animals (d) Draw and label specimen H (Tape worm)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59724?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "4",
    "text": "(a)(i) Mention two products which could be obtained from specimen K (Fresh Milk)  (ii) Name the method by which specimen K could be made wholesome for human consumption.\n(b)(i) Give two function of specimen L in farm animals. (ii) State two features of specimen L which enables it to perform its functions.\n(c) State two ways of preserving specimen M. \n(d) State two responses of chicks to the use of specimen N in a brooder house under each of the following conditions. (i) excessive heat (ii) insufficient heat (iii) optimum heat.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59726?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  }
]