[
  {
    "number": "1633",
    "text": "On the fifth day, the manifestation of the power of God's word was evident in the creation of the",
    "options": {
      "A": "earth",
      "B": "moon and stars",
      "C": "fishes and birds",
      "D": "vegetation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69322?exam_type=waec&type=obj&page=327",
    "correct_answer": "C",
    "explanation": "According to Genesis, on the fifth day of creation, God said, \"And God said, 'Let the waters bring forth swarms of living creatures, and let birds fly above the earth across the firmament of the heavens.'\"(Genesis 1:20 - RSV).",
    "year": "2023"
  },
  {
    "number": "1634",
    "text": "Which of the following was God's instruction to Adam after creation? To eat",
    "options": {
      "A": "of any tree except that of the knowledge of good and evil.",
      "B": "freely of every tree except the ones with apples.",
      "C": "from the tree in the middle of the garden.",
      "D": "any animal and plant in Eden."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69324?exam_type=waec&type=obj&page=327",
    "correct_answer": "A",
    "explanation": "In Genesis, God's instruction to Adam regarding eating is presented as follows:\n\"And the Lord God commanded the man, saying, 'You may surely eat of every tree of the garden, but of the tree of the knowledge of good and evil you shall not eat, for in the day that you eat of it you shall surely die.'\" (Genesis 2:16-17, RSV)\nSo, God allowed Adam to eat from any tree in the garden except the tree of the knowledge of good and evil.",
    "year": "2023"
  },
  {
    "number": "1635",
    "text": "In which of the following ways did God evaluate His work after creation?",
    "options": {
      "A": "Very perfect",
      "B": "Satisfactory",
      "C": "Excellent",
      "D": "Very good"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69325?exam_type=waec&type=obj&page=327",
    "correct_answer": "D",
    "explanation": "31 And God saw everything that he had made, and behold, it was very good. And there was evening and there was morning, a sixth day - Genesis 1:31 (RSV)",
    "year": "2023"
  },
  {
    "number": "1636",
    "text": "What was the rationale behind Reuben placing Joseph into a dry well? To",
    "options": {
      "A": "instill discipline in him",
      "B": "send the lad back home",
      "C": "prevent him from escaping",
      "D": "sell him out later."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69344?exam_type=waec&type=obj&page=328",
    "correct_answer": "B",
    "explanation": "The story can be found in Genesis 37:12-36\nAccording to this biblical account, Joseph's brothers were jealous of him because their father, Jacob, showed favouritism towards Joseph. Joseph had also shared dreams with his brothers in which he seemed to have a position of authority over them, which further fueled their resentment.\nReuben, however, was not in favour of harming Joseph. Instead of letting his brothers kill Joseph, Reuben suggested that they throw him into a pit or a dry well, intending to later come back, rescue him and bring him back home. The idea was to prevent Joseph from being killed by his jealous brothers, and Reuben intended to return and bring Joseph safely back to their father.",
    "year": "2023"
  },
  {
    "number": "1637",
    "text": "According to Pharaoh's dream, what did the seven gaunt and thin cows that came out of the Nile River do? They",
    "options": {
      "A": "terrified him in his dream",
      "B": "fed on the reed grass",
      "C": "ate all the seven ears of grains",
      "D": "ate up the seven sleek and fat cows"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69345?exam_type=waec&type=obj&page=328",
    "correct_answer": "D",
    "explanation": "This dream is described in Genesis 41:1-7. In Pharaoh's dream, he saw seven fat and sleek cows emerging from the Nile River, followed by seven gaunt and thin cows. The thin cows then proceeded to devour or eat up the seven fat cows. This dream was interpreted by Joseph, who was known for interpreting dreams. He interpreted this particular dream as a prediction of seven years of abundance in Egypt followed by seven years of famine.",
    "year": "2023"
  },
  {
    "number": "1638",
    "text": "Which of the following was not a sign to convince the Israelites that Moses was sent by God?",
    "options": {
      "A": "Moses' rod becoming a serpent",
      "B": "Moses hand becoming leprous",
      "C": "River Nile becoming a pool of blood",
      "D": "Flowers growing from Moses' rod"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69346?exam_type=waec&type=obj&page=328",
    "correct_answer": "D",
    "explanation": "The sign that is not specifically mentioned in the Bible as a convincing sign to the Israelites that Moses was sent by God is:\nD. Flowers growing from Moses' rod.\nThe other signs (A. Moses' rod becoming a serpent, B. Moses' hand becoming leprous, and C. River Nile becoming a pool of blood) are documented in the Book of Exodus as miraculous events that occurred to validate Moses' divine mission to lead the Israelites out of Egypt.",
    "year": "2023"
  },
  {
    "number": "1639",
    "text": "The dominant trait exhibited by the lsraelites following the ill-report of the spies about Canaan was",
    "options": {
      "A": "boldness",
      "B": "humility",
      "C": "despair",
      "D": "unfaithfulness"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69360?exam_type=waec&type=obj&page=328",
    "correct_answer": "D",
    "explanation": "The Israelites displayed unfaithfulness following the negative report of the spies about Canaan because they doubted and murmured against God's promises and leadership through Moses. They expressed a lack of trust in God's ability to fulfil His promises to bring them into the promised land, showing a lack of faith and loyalty towards God despite witnessing His previous signs and wonders. This unfaithfulness led them to despair and a desire to return to Egypt, questioning God's plan for them and ultimately disobeying His commands. (Numbers 14)",
    "year": "2023"
  },
  {
    "number": "1640",
    "text": "Moses gave a portion of his authority to Joshua when he was commissioned before the lsraelites so that Joshua would",
    "options": {
      "A": "be known by the Israelites",
      "B": "be obeyed by the Israelites",
      "C": "receive power from God",
      "D": "lead the Moabites to Egypt"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69362?exam_type=waec&type=obj&page=328",
    "correct_answer": "B",
    "explanation": "Moses gave a portion of his authority to Joshua when he was commissioned before the Israelites so that Joshua would: B. be obeyed by the Israelites.\nThis is based on the books of Numbers and Deuteronomy where Moses, at God's command, appointed Joshua as his successor to lead the Israelites into the Promised Land. Moses laid his hands on Joshua, symbolizing the transfer of authority and leadership. This act was to ensure that the people would recognize and obey Joshua as their new leader.",
    "year": "2023"
  },
  {
    "number": "1641",
    "text": "Which attribute of Joshua and Caleb distinguished them from the other spies?",
    "options": {
      "A": "The confidence they had in themselves",
      "B": "Their knowledge of the land that they spied",
      "C": "Their preparedness to face any challenge",
      "D": "The absolute trust they had in God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69363?exam_type=waec&type=obj&page=329",
    "correct_answer": "D",
    "explanation": "The attribute of Joshua and Caleb that distinguished them from the other spies was D. The absolute trust they had in God. Twelve spies were sent to explore the land of Canaan. Joshua and Caleb were the only two spies who brought back a positive and faith-filled report, expressing their trust in God's ability to give them victory over the challenges in the land. The other spies were filled with fear and lacked the same level of faith and trust in God.",
    "year": "2023"
  },
  {
    "number": "1642",
    "text": "Up! For this is the day in which the Lord has given Sisera into your hands. Does not the Lord go out before\nyou? This statement was made by",
    "options": {
      "A": "Barak",
      "B": "Deborah",
      "C": "Jabin",
      "D": "Jael"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69365?exam_type=waec&type=obj&page=329",
    "correct_answer": "B",
    "explanation": "This statement is found in Judges 4:14. Deborah, the prophetess and judge of Israel, made this declaration to Barak, the military commander, encouraging him to lead the Israelite forces against Sisera, the commander of the Canaanite army.",
    "year": "2023"
  },
  {
    "number": "1643",
    "text": "King Ahab became sad and discontent in his palace as a result of",
    "options": {
      "A": "his inability to secure Naboth's vineyard.",
      "B": "the deeds of Jezebel towards Naboth",
      "C": "the conspiracy of the nobles against Naboth",
      "D": "the punishment God promised his household."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69367?exam_type=waec&type=obj&page=329",
    "correct_answer": "A",
    "explanation": "King Ahab became sad and discontent in his palace as a result of A. his inability to secure Naboth's vineyard. This event is recorded in the Bible in 1 Kings 21. Ahab desired Naboth's vineyard, but Naboth refused to sell or exchange it. Ahab's discontent and sadness stemmed from his frustration at not being able to acquire the vineyard. This led to the events that unfolded with the involvement of Jezebel and the tragic fate of Naboth.",
    "year": "2023"
  },
  {
    "number": "1644",
    "text": "Eli's failure to decisively discipline his children led to all the following except the",
    "options": {
      "A": "capture of the Ark of the Covenant.",
      "B": "collapse of his priestly lineage.",
      "C": "institution of monarchy in Israel",
      "D": "humiliation of Israel by the Philistines."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69371?exam_type=waec&type=obj&page=329",
    "correct_answer": "C",
    "explanation": "Eli was a high priest and judge in Israel during the time of the judges. His failure to discipline his sons, who were also priests, resulted in their misconduct and ultimately in God's judgment. However, the institution of the monarchy in Israel occurred later, during the time of Samuel, as the people requested a king. Eli's failures did contribute to significant consequences, such as the capture of the Ark of the Covenant and the collapse of his priestly lineage, but it did not directly lead to the institution of the monarchy.",
    "year": "2023"
  },
  {
    "number": "1645",
    "text": "According to Samuel, Saul's stubbornness against God is comparable to",
    "options": {
      "A": "murder",
      "B": "divination",
      "C": "idolatry",
      "D": "lying"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69374?exam_type=waec&type=obj&page=329",
    "correct_answer": "C",
    "explanation": "This is found in 1 Samuel 15:23. Samuel rebukes Saul for not fully obeying God's command to utterly destroy the Amalekites and their possessions. Samuel equates Saul's disobedience and stubbornness to rebellion, likening it to the sin of idolatry:\nFor rebellion is as the sin of divination,and stubbornness is as iniquity and idolatry.Because you have rejected the word of the Lord,he has also rejected you from being king.” (1 Samuel 15:23 - RSV)",
    "year": "2023"
  },
  {
    "number": "1646",
    "text": "Behold, to obey is better than to sacrifice, and to harken than the fat of rams.... It can be inferred from this statement that God",
    "options": {
      "A": "prefers offering to sacrifices",
      "B": "prefers obedience to sacrifices",
      "C": "accept only Holy offerings",
      "D": "abhors all forms of sacrifices"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69377?exam_type=waec&type=obj&page=330",
    "correct_answer": "B",
    "explanation": "This statement is from 1 Samuel 15:22. Samuel is rebuking Saul for not fully obeying God's command, emphasizing that God values obedience more than ritualistic sacrifices. It underscores the importance of genuine obedience and a heart turned toward God rather than mere external rituals or offerings.",
    "year": "2023"
  },
  {
    "number": "1647",
    "text": "Why then did you not obey the voice of the Lord? Why did you swoop on the soil and do what was evil in the\nsight of the Lord? The offence of the addressee was that he",
    "options": {
      "A": "spared the Kenites",
      "B": "spared Agag and the fatty animal of Amalek",
      "C": "totally disobeyed David's voice",
      "D": "sacrificed to God without Samuel's approval."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69380?exam_type=waec&type=obj&page=330",
    "correct_answer": "B",
    "explanation": "The offence of the addressee (Saul) was that he: B. spared Agag and the fatty animals of Amalek.\nThis can be found in 1 Samuel 15. God had commanded Saul to utterly destroy the Amalekites and all their possessions, but Saul spared King Agag and some of the best livestock. This disobedience led to Samuel's rebuke and the subsequent rejection of Saul as king by God.",
    "year": "2023"
  },
  {
    "number": "1648",
    "text": "Which of the following personalities accompanied David in his search for Saul in the wilderness of Ziph?",
    "options": {
      "A": "Abishai",
      "B": "Joab",
      "C": "Abner",
      "D": "Ahimelech"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69387?exam_type=waec&type=obj&page=330",
    "correct_answer": "A",
    "explanation": "In 1 Samuel 26:6, it is mentioned: \"Then David said to Ahimelech the Hittite and to Abishai the son of Zeruiah, Joab's brother, 'Who will go down with me into the camp to Saul?' And Abishai said, 'I will go down with you.'\"\nSo, Abishai is the one who accompanied Saul in the search for David in the wilderness of Ziph according to the biblical account.",
    "year": "2023"
  },
  {
    "number": "1649",
    "text": "In which of the following ways did David demonstrate his submission to the will of God? He",
    "options": {
      "A": "Married Saul's  daughter",
      "B": "spared the life of Saul",
      "C": "fought Goliath to save lsrael",
      "D": "accepted to rule lsrael"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69389?exam_type=waec&type=obj&page=330",
    "correct_answer": "B",
    "explanation": "David demonstrated his submission to the will of God in the following way: B. spared the life of Saul. This occurred on more than one occasion when David had the opportunity to harm or kill Saul but chose not to because he respected Saul as the anointed king and trusted in God's timing and judgment. (1 Samuel 24 & 26)",
    "year": "2023"
  },
  {
    "number": "1650",
    "text": "The construction of the Temple by Solomon was in fulfilment of God's prophecy to:",
    "options": {
      "A": "Samuel",
      "B": "Saul",
      "C": "El",
      "D": "David"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69390?exam_type=waec&type=obj&page=330",
    "correct_answer": "D",
    "explanation": "The prophecy regarding the building of the Temple is found in 2 Samuel 7:12-13 where God speaks to David through the prophet Nathan and promises a lasting dynasty for David's descendants.\n\"When your days are fulfilled and you lie down with your fathers, I will raise up your offspring after you, who shall come from your body, and I will establish his kingdom. He shall build a house for my name, and I will establish the throne of his kingdom forever.\"\nThis prophecy is fulfilled through Solomon, David's son, who later becomes the king of Israel and constructs the Temple in Jerusalem. The construction of the Temple is considered the realization of God's promise to David, as conveyed through the prophet Nathan.",
    "year": "2023"
  },
  {
    "number": "1651",
    "text": "What was Solomon's response when he discovered that his encounter with God was a dream? He",
    "options": {
      "A": "offered burnt offering before the ark",
      "B": "settled a dispute between two harlots",
      "C": "informed all his elders.",
      "D": "organised a feast for his wives"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69392?exam_type=waec&type=obj&page=331",
    "correct_answer": "A",
    "explanation": "When Solomon discovered that his encounter with God was a dream, his response was:\nA. offered burnt offering before the ark.\nThis incident is recorded in the Bible, specifically in 1 Kings 3:15. After Solomon's dream in which God offered him anything he desired, Solomon woke up and realized it was a dream. He then went to Jerusalem and stood before the Ark of the Covenant, offered burnt offerings, and prepared a feast for all his servants. This indicates his reverence for the dream and his commitment to fulfilling what God had spoken to him in the dream.",
    "year": "2023"
  },
  {
    "number": "1652",
    "text": "Which of the following was God's reason for which he gave Solomon what he did not ask for in his encounter with him in a dream?",
    "options": {
      "A": "Solomon needed more help from God.",
      "B": "God does not give only one thing to people",
      "C": "Solomon was very special to God",
      "D": "God blesses people who have pure heart"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69428?exam_type=waec&type=obj&page=331",
    "correct_answer": "D",
    "explanation": "In 1 Kings 3:5-14, when God appeared to Solomon in a dream and offered to give him anything he asked for, Solomon asked for wisdom to govern the people of Israel. God, pleased with Solomon's request, not only granted him wisdom but also gave him wealth, honour, and long life because of the purity of Solomon's heart and his desire for wisdom to govern justly. Therefore, option D reflects how God blesses those with a pure heart.",
    "year": "2023"
  },
  {
    "number": "1653",
    "text": "In which of the following ways did Obadiah demonstrate his loyalty to God during the persecution that occurred in his time? He",
    "options": {
      "A": "refused to serve the king's idol",
      "B": "sent his idolatrous wife away",
      "C": "hid the prophets of Yahweh in caves",
      "D": "tore down the altars of Baal"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69432?exam_type=waec&type=obj&page=331",
    "correct_answer": "C",
    "explanation": "In 1 Kings 18:3-4, Obadiah demonstrated his loyalty to God during the persecution by hiding a hundred prophets of Yahweh in caves and providing them with bread and water. This act of protecting and sustaining the prophets amidst the threat of persecution reflects Obadiah's commitment to God and his refusal to comply with the king's idolatrous practices.",
    "year": "2023"
  },
  {
    "number": "1654",
    "text": "The greatest wrath of God on Israel was incurred during the reign of king",
    "options": {
      "A": "Rehoboam",
      "B": "Jeroboam",
      "C": "Ahab",
      "D": "Asa"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69434?exam_type=waec&type=obj&page=331",
    "correct_answer": "C",
    "explanation": "The reign of King Ahab is often associated with significant disobedience and idolatry in Israel which led to God's displeasure and wrath. The prophet Elijah confronted Ahab and his wife Jezebel for their promotion of Baal worship and other sinful practices. A specific incident illustrating God's wrath during Ahab's reign is the confrontation on Mount Carmel, where Elijah challenged the prophets of Baal (1 Kings 18). Ahab's reign is often considered a period of great apostasy in Israel's history.",
    "year": "2023"
  },
  {
    "number": "1655",
    "text": "Deborah's response to Barak's request to accompany him to battle against Jabin was that",
    "options": {
      "A": "she will enquire from the Lord",
      "B": "the glory will be given to a woman",
      "C": "she was too busy to join him",
      "D": "the wrath of God will visit Barak"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69435?exam_type=waec&type=obj&page=331",
    "correct_answer": "B",
    "explanation": "In Judges 4:9, when Barak requested that Deborah accompany him to battle against Jabin, Deborah responded that the glory of the victory would be given to a woman. This prophecy was fulfilled when Jael, another woman, played a crucial role in the defeat of the Canaanite general Sisera.",
    "year": "2023"
  },
  {
    "number": "1656",
    "text": "Naaman's request for two mules of Israelite soil after his cure was a result of his belief that",
    "options": {
      "A": "there was magic in the soil of lsrael",
      "B": "Israel's soil was superior to Syrian soil",
      "C": "Hebrew God could only be worshipped on Hebrew soil",
      "D": "he would not be able to visit Samaria regularly"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69436?exam_type=waec&type=obj&page=332",
    "correct_answer": "C",
    "explanation": "Naaman's request for two mules of Israelite soil after his cure was because of the belief that the God of Israel, who healed him through the prophet Elisha, could only be worshipped on Hebrew soil. In 2 Kings 5, Naaman, a commander in the Syrian army, was cured of leprosy after following Elisha's instructions to wash in the Jordan River seven times. After his healing, Naaman expressed his desire to worship the God of Israel and sought permission to take two mules' worth of Israelite soil back to Syria because he believed that he could only worship God on that specific soil.",
    "year": "2023"
  },
  {
    "number": "1657",
    "text": "Which of the following reasons did King Josiah give when he decreed that the workers in charge of the renovation should not render account to anybody? They were",
    "options": {
      "A": "his god-fearing kinsmen",
      "B": "from the priestly family of Zadok",
      "C": "sincere in all their transactions",
      "D": "excellent at performing their work"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69437?exam_type=waec&type=obj&page=332",
    "correct_answer": "C",
    "explanation": "King Josiah gave the reason that the workers in charge of the renovation should not render an account to anybody because they were sincere in their transactions. This can be found in 2 Kings 22:5-7 (RSV):\n\"5 and let it be given into the hand of the workmen who have the oversight of the house of the Lord; and let them give it to the workmen who are at the house of the Lord, repairing the house, 6 that is, to the carpenters, and to the builders, and to the masons, as well as for buying timber and quarried stone to repair the house. 7But no accounting shall be asked from them for the money which is delivered into their hand, for they deal honestly.”",
    "year": "2023"
  },
  {
    "number": "1658",
    "text": "All the following were attributed to Josiah's reform except",
    "options": {
      "A": "making the Book of the Law a reference book",
      "B": "abolishing wizards and medium practices",
      "C": "reducing the worship of Yahweh to a very low state",
      "D": "restoring Jerusalem to its original pre-eminence."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69438?exam_type=waec&type=obj&page=332",
    "correct_answer": "C",
    "explanation": "Josiah's reform aimed to strengthen the worship of Yahweh and eliminate idolatrous practices. Therefore, reducing the worship of Yahweh to a very low state is not consistent with Josiah's reform. The other options (making the Book of the Law a reference book, abolishing wizards and medium practices, and restoring Jerusalem to its original pre-eminence) are elements of the reforms attributed to King Josiah in the biblical accounts.",
    "year": "2023"
  },
  {
    "number": "1659",
    "text": "What was the reason for which the rebuilding of the Temple was opposed by Rehum and his associates?",
    "options": {
      "A": "They lacked the spirit of fair play",
      "B": "Their offer to help was rejected",
      "C": "They had no spirit of tolerance",
      "D": "They were obedient to constituted authority."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69441?exam_type=waec&type=obj&page=332",
    "correct_answer": "C",
    "explanation": "The reason for opposing the rebuilding of the Temple by Rehum and his associates was that they believed the city of Jerusalem was rebellious and wicked. They feared that if the city was rebuilt and its walls finished, the Jews would not pay tribute, customs, or tolls, which would impair the royal revenue. Additionally, they mentioned that the city had a history of rebellion and sedition against kings and provinces, leading to its destruction in the past. All of these prove that Rehum and his associates were intolerant to the people of  Israel.",
    "year": "2023"
  },
  {
    "number": "1660",
    "text": "The rebuilding of the Temple in Jerusalem became successful as a result of God's influence over King",
    "options": {
      "A": "Josiah",
      "B": "Cyrus",
      "C": "Darius",
      "D": "Nebuchadnezzar"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69442?exam_type=waec&type=obj&page=332",
    "correct_answer": "B",
    "explanation": "The successful rebuilding of the Temple in Jerusalem is attributed to the decree of Cyrus the Great, the Persian king. King Cyrus issued a decree allowing the Jewish exiles to return to their land and rebuild the Temple. This is recorded in Ezra 1:1-4.",
    "year": "2023"
  },
  {
    "number": "1661",
    "text": "Which of the following was not a reason for which Daniel suffered blackmail from his peers? He",
    "options": {
      "A": "had an excellent spirit",
      "B": "was an exile from Judah",
      "C": "distinguished himself",
      "D": "made petition to his God."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69443?exam_type=waec&type=obj&page=333",
    "correct_answer": "B",
    "explanation": "Being an exile from Judah was not a reason for which Daniel suffered blackmail from his peers. In the Book of Daniel, Daniel faced opposition and blackmail from his peers because he had an excellent spirit, distinguished himself in his duties, and remained faithful in his devotion to God, including making petitions to his God. The fact that he was an exile from Judah was not a specific reason for the blackmail but rather a part of his background.",
    "year": "2023"
  },
  {
    "number": "1662",
    "text": "During the time of Amos, why were the rich said to be above the law? They",
    "options": {
      "A": "knew all the judges",
      "B": "were feared by the judges",
      "C": "could secure any verdict they wanted",
      "D": "formulated the rules which were obeyed"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69444?exam_type=waec&type=obj&page=333",
    "correct_answer": "C",
    "explanation": "During the time of Amos, it was said that the rich were above the law because they could secure any verdict they wanted. This reflects a situation where the wealthy individuals had significant influence and power which allowed them to manipulate the legal system to their advantage.",
    "year": "2023"
  },
  {
    "number": "1663",
    "text": "The basket of summer fruit in Amos' vision signified the",
    "options": {
      "A": "end of fruit season in lsrael",
      "B": "next fruit season in the land",
      "C": "kinds of fruit to eat at that time",
      "D": "end of the people of lsrael."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69445?exam_type=waec&type=obj&page=333",
    "correct_answer": "D",
    "explanation": "In Amos' vision, the basket of summer fruit symbolized the impending judgment on the people of Israel. The Hebrew word for \"summer fruit\" in Amos 8:2 sounds similar to the Hebrew word for \"end\". The vision conveyed the message that, just as the summer fruit marks the end of the harvest season, so too would the end come for the people of Israel due to their unrighteousness and social injustices.",
    "year": "2023"
  },
  {
    "number": "1664",
    "text": "Jesus' acceptance to be baptised by John was meant to",
    "options": {
      "A": "show his respect for John",
      "B": "fulfil all righteousness",
      "C": "wash away his sins",
      "D": "prove that he is a saviour"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69446?exam_type=waec&type=obj&page=333",
    "correct_answer": "B",
    "explanation": "When Jesus was baptized by John the Baptist, it was to fulfil all righteousness. This act demonstrated Jesus' obedience to God's will and his identification with humanity. Though Jesus was sinless, he participated in the baptism to align with God's plan and set an example for others. This event is recorded in the Gospel accounts, including Matthew 3:13-17.",
    "year": "2023"
  },
  {
    "number": "1665",
    "text": "The temptations of Jesus in the wilderness were meant to",
    "options": {
      "A": "test his magical powers",
      "B": "show that there was temptation after baptism",
      "C": "show that the devil has great power",
      "D": "prepare Jesus adequately for his ministry."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69447?exam_type=waec&type=obj&page=333",
    "correct_answer": "D",
    "explanation": "Jesus' temptations served as a preparatory period for Jesus before he officially began his public ministry. The temptations were a test of his character, resolve, and commitment to fulfilling God's plan.",
    "year": "2023"
  },
  {
    "number": "1666",
    "text": "The assertion that if anyone comes to me and does not hate his own father and his own life, he cannot be my disciple, Jesus meant to say that",
    "options": {
      "A": "salvation is an individual affair",
      "B": "discipleship is about selfishness and being self-centred",
      "C": "one should not keep families",
      "D": "material things are irrelevant to the kingdom of God."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69448?exam_type=waec&type=obj&page=334",
    "correct_answer": "A",
    "explanation": "Jesus' statement about hating one's own father and life is emphasizing the individual commitment required for discipleship and the decision to follow the path leading to salvation. It emphasizes the personal choice and commitment each individual must make in response to the call of Jesus.\nThe language of \"hate\" in this context is exaggerated and is meant to communicate the idea of prioritizing Jesus over everything else, including family ties and personal preferences. However, it doesn't mean a literal call to hatred, but instead, it's about putting the path of discipleship and salvation as the most important priority in one's life. It emphasizes the individual's decision to wholeheartedly embrace following Jesus as the primary objective of their life.",
    "year": "2023"
  },
  {
    "number": "1667",
    "text": "No one who puts his hand on the plough and looks back is fit for the kingdom of God. What is required of a true disciple according to the above statement?",
    "options": {
      "A": "Hard work",
      "B": "Self-sacrifice",
      "C": "Total humility",
      "D": "Absolute commitment"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69450?exam_type=waec&type=obj&page=334",
    "correct_answer": "D",
    "explanation": "The statement \"No one who puts his hand on the plough and looks back is fit for the kingdom of God\" emphasizes the need for absolute commitment from a true disciple. It conveys the idea that once a person decides to follow Jesus, they should remain focused and committed to the path of discipleship without turning back or being distracted.",
    "year": "2023"
  },
  {
    "number": "1668",
    "text": "One lesson we can learn from the story of the unmerciful servant is that we should",
    "options": {
      "A": "forgive our debtors seventy times",
      "B": "be patient with our debtors",
      "C": "ignore the plight of our debtors",
      "D": "take our debtors to the appropriate authority for sanctions."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69451?exam_type=waec&type=obj&page=334",
    "correct_answer": "A",
    "explanation": "The lesson we can learn from the story of the unmerciful servant, found in Matthew 18:21-35, is the importance of forgiveness. In the parable, the servant who was forgiven a massive debt by his master refused to show the same mercy to a fellow servant with a much smaller debt. The point of the story is to emphasize the need for believers to be forgiving and merciful to others, just as God has shown mercy to us.",
    "year": "2023"
  },
  {
    "number": "1669",
    "text": "Lord, how often shall my brother sin against me, and l forgive him? Jesus' response to the above question meant forgiveness",
    "options": {
      "A": "must be done only seven times",
      "B": "takes place where there is a plea",
      "C": "is exercised when offence is repeated severally",
      "D": "does not need to have any limitation"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69452?exam_type=waec&type=obj&page=334",
    "correct_answer": "D",
    "explanation": "In response to Peter's question about how often he should forgive his brother who sins against him, Jesus said, \"I do not say to you, up to seven times, but up to seventy times seven\" (Matthew 18:21-22). This implies that forgiveness should not have a set limit but should be extended generously and without counting. Therefore, option D, \"does not need to have any limitation,\" is the appropriate answer.",
    "year": "2023"
  },
  {
    "number": "1670",
    "text": "Jesus' command to his disciples to put away their sword, as those who take the sword will perish by the sword implies that",
    "options": {
      "A": "violence begets violence",
      "B": "violence should be a last resort",
      "C": "there is a curse on those who use the sword",
      "D": "Christianity condone violence."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69453?exam_type=waec&type=obj&page=334",
    "correct_answer": "A",
    "explanation": "The command \"Put your sword back into its place. For all who take the sword will perish by the sword\" (Matthew 26:52) by Jesus implies that violence begets violence. It suggests that engaging in violence tends to perpetuate a cycle of violence and retaliation. He is trying to warn about the destructive consequences of relying on the sword or violence as a means of resolving conflicts.",
    "year": "2023"
  },
  {
    "number": "1671",
    "text": "Certainly, this man also was with him, for he is a Galilean. Immediately after this accusation, all the following happened except the",
    "options": {
      "A": "addressee denied knowing Jesus",
      "B": "accused remembered the Lord's prophecy",
      "C": "cock crowed three times",
      "D": "addressee went out and hanged himself"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69454?exam_type=waec&type=obj&page=335",
    "correct_answer": "D",
    "explanation": "The event where the addressee (Peter) went out and hanged himself is not immediately after the accusation mentioned. Instead, it is a later event involving Judas Iscariot, who betrayed Jesus. The correct sequence of events immediately after the accusation is:\nThe addressee (Peter) denied knowing Jesus (Matthew 26:72).The accused (Peter) remembered the Lord's prophecy about his denial (Matthew 26:75).The cock crowed three times, fulfilling Jesus' prediction (Matthew 26:74-75).",
    "year": "2023"
  },
  {
    "number": "1672",
    "text": "Which of the synoptic gospels states that after Jesus was crucified, the earth shook and the rocks split?",
    "options": {
      "A": "Matthew",
      "B": "Mark",
      "C": "Luke",
      "D": "John"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69455?exam_type=waec&type=obj&page=335",
    "correct_answer": "A",
    "explanation": "The statement about the earth shaking and the rocks splitting after Jesus was crucified is found in the Gospel of Matthew. Specifically, Matthew 27:51 describes these natural phenomena occurring at the moment of Jesus' death on the cross.",
    "year": "2023"
  },
  {
    "number": "1673",
    "text": "Which of these events in the life of Jesus formed the foundation of the Christian faith? His",
    "options": {
      "A": "death",
      "B": "transfiguration",
      "C": "baptism",
      "D": "resurrection"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69456?exam_type=waec&type=obj&page=335",
    "correct_answer": "D",
    "explanation": "The foundation of the Christian faith is primarily based on the resurrection of Jesus Christ. The resurrection is considered the central event that validates the claims of Jesus as the Son of God and the Saviour. The belief in the resurrection is fundamental to Christian theology as it symbolises victory over sin and death and provides hope for eternal life.",
    "year": "2023"
  },
  {
    "number": "1674",
    "text": "The ultimate results of Ananias and Sapphira's deaths were that",
    "options": {
      "A": "membership reduced drastically",
      "B": "the church knew peace thereafter",
      "C": "more souls were won for Christ",
      "D": "members became honest"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69458?exam_type=waec&type=obj&page=335",
    "correct_answer": "D",
    "explanation": "The direct result is that members of the church became honest.  Acts 5:11 (RSV) mentions \"great fear came upon the whole church\". The fear and reverence that the incident instilled in the church community contributed to a sense of order and seriousness about the consequences of dishonesty or hypocrisy within the early Christian fellowship.",
    "year": "2023"
  },
  {
    "number": "1675",
    "text": "The following lessons could be learnt from Saul's experience on his way to Damascus except",
    "options": {
      "A": "sinners are special before God",
      "B": "each individual has a specific purpose on earth",
      "C": "ignorantly persecuting God is acceptable",
      "D": "any individual can be an asset to God's kingdom"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69461?exam_type=waec&type=obj&page=335",
    "correct_answer": "C",
    "explanation": "From Saul's experience on his way to Damascus (recorded in Acts 9:1-22), the lessons include:\nA. Sinners are special before God: Saul, despite his past actions of persecuting Christians, was chosen by God for a specific purpose, demonstrating God's grace and mercy towards sinners.\nB. Each individual has a specific purpose on earth: Saul's encounter with Jesus led to his conversion and redirection of purpose. It highlights the idea that every individual has a unique role or purpose in God's plan.\nD. Any individual can be an asset to God's kingdom: Saul, who later became the apostle Paul, became a significant asset to God's kingdom after his conversion, preaching and spreading the message of Christianity.\nThe lesson not learned from Saul's experience is that ignorantly persecuting God is acceptable. Saul's persecution of Christians was not justified, and his encounter with Jesus led to a profound transformation and realization of the error in his actions.",
    "year": "2023"
  },
  {
    "number": "1676",
    "text": "What was the reason for Ananias' reluctance to pray over Saul to regain his sight?",
    "options": {
      "A": "Saul had not yet repented of his deeds",
      "B": "Saul was not one of the disciples of Christ",
      "C": "He was aware of his persecution of Christians in Damascus",
      "D": "He was not sure Saul was converted already."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69463?exam_type=waec&type=obj&page=336",
    "correct_answer": "C",
    "explanation": "Ananias' reluctance to pray over Saul to regain his sight was rooted in his awareness of Saul's reputation for persecuting Christians in Damascus. Ananias expressed concern about Saul's past actions and was initially hesitant to approach him. This account is found in Acts 9:10-19 in the New Testament.",
    "year": "2023"
  },
  {
    "number": "1677",
    "text": "Herod's arrest of Peter after the execution of James was meant to",
    "options": {
      "A": "establish Herod as a good and thoughtful King",
      "B": "show his hatred for the disciples of Christ",
      "C": "win the favour and approval of the Jews",
      "D": "hinder the further spread of the gospel"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69464?exam_type=waec&type=obj&page=336",
    "correct_answer": "C",
    "explanation": "Herod's persecution of the apostles, including the arrest of Peter and the execution of James, was done to win the favour and approval of the Jews. The motive behind Herod's actions was to appease the Jewish authorities and gain political favour with them.",
    "year": "2023"
  },
  {
    "number": "1678",
    "text": "Jesus condemned the tradition 'Corban' because it",
    "options": {
      "A": "was a term of abuse in lsrael",
      "B": "meant that one should not swear",
      "C": "contradicted one's obligation to parents",
      "D": "they were people laden with iniquity"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69465?exam_type=waec&type=obj&page=336",
    "correct_answer": "C",
    "explanation": "The tradition of \"Corban\" was condemned by Jesus because it contradicted one's obligation to parents. The term \"Corban\" referred to a practice where someone dedicated their property or resources to God, declaring it as an offering, and thus, exempting themselves from using it for the support of their parents. Jesus criticized this tradition, emphasizing the importance of honouring one's parents and fulfilling one's responsibilities toward them. This is mentioned in Mark 7:9-13 and Matthew 15:3-9.",
    "year": "2023"
  },
  {
    "number": "1679",
    "text": "In the sermon on the Mount, who did Jesus say will inherit the earth? He meant the",
    "options": {
      "A": "peacemaker",
      "B": "meek",
      "C": "merciful",
      "D": "pure in heart"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69466?exam_type=waec&type=obj&page=336",
    "correct_answer": "B",
    "explanation": "In the Sermon on the Mount, Jesus said, \"Blessed are the meek, for they shall inherit the earth\" (Matthew 5:5, RSV).",
    "year": "2023"
  },
  {
    "number": "1680",
    "text": "According to Luke, Jesus sent the seventy others on missions as",
    "options": {
      "A": "labourers and reapers",
      "B": "lambs in the midst of wolves",
      "C": "preachers of the kingdom of God",
      "D": "messengers in the vineyard."
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69467?exam_type=waec&type=obj&page=336",
    "correct_answer": "B",
    "explanation": "According to Luke 10:3, Jesus sent the seventy others on missions as \"lambs in the midst of wolves.\" This metaphor emphasizes the challenging and potentially dangerous nature of the mission, where they were vulnerable and needed to rely on God's guidance and protection.",
    "year": "2023"
  },
  {
    "number": "1681",
    "text": ". \"Ah, Lord God! Behold, I do not know how to speak for I am only a youth.\"",
    "options": {
      "A": "Amos",
      "B": "Isaiah",
      "C": "Ezekiel",
      "D": "Jeremiah"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69468?exam_type=waec&type=obj&page=337",
    "correct_answer": "D",
    "explanation": "The statement \"Ah, Lord God! Behold, I do not know how to speak, for I am only a youth\" is attributed to the prophet Jeremiah. It is found in Jeremiah 1:6 in the Bible.",
    "year": "2023"
  },
  {
    "number": "1682",
    "text": "In the creation story, the responsibility to give names to all living creatures was performed by",
    "options": {
      "A": "God",
      "B": "Adam and Eve",
      "C": "man",
      "D": "angels of God"
    },
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/69469?exam_type=waec&type=obj&page=337",
    "correct_answer": "C",
    "explanation": "In the creation story, according to the Book of Genesis, the responsibility to give names to all living creatures was performed by Adam. It is written in Genesis 2:19-20:\n\"Now the Lord God had formed out of the ground all the wild animals and all the birds in the sky. He brought them to the man to see what he would name them; and whatever the man called each living creature, that was its name. So the man gave names to all the livestock, the birds in the sky, and all the wild animals.\"\nTherefore, Adam, the first man, was given the responsibility of naming the animals.",
    "year": "2023"
  }
]