[
  {
    "number": "202",
    "text": "(a) Narrate the Second Creation story.\n \n(b) In what two ways were the functions assigned to man in this account significant?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51894?exam_type=waec&type=theory&page=41",
    "correct_answer": "(a)  In the beginning, God made the earth and the heavens. There were no plants nor herbs because rain had not fallen. The Lord formed man out of dust (of the earth) and breathed into his nostrils the breath of life, thus making him become a living being. God then planted a garden in Eden, put the man there and grew plants and the tree of life and the tree of knowledge of good and evil. Four rivers flowed on four sides to water the garden and the man was to maintain the garden. God directed the man to eat of all the trees but not the fruit of the tree of knowledge, for he would die any day he ate the fruit. The man was alone, hence, there was the need to find a suitable help mate. Then God created all living creatures and the man was charged to give them names. To provide the man a helper fit for him, God made from Adam's rib a woman, gave her to Adam as flesh of his flesh and Adam called her woman.\n(b) The functions assigned to man in the second creation story are as follows:\n(i) He was to act as God's agent in furthering the act of creation of various types of vegetation.\n(ii) He was to give names to all creations. This is a very important function because by knowing the name of a person or thing, you know his or its nature and can, therefore, exercise power over it.\n(iii) He was to eat of all trees and plants, but, never the tree of knowledge of good and evil. This order refects the dual nature of man, flesh and soul, good and evil. It is unfortunate that this dual nature was soon to play a negative role when flesh overtook soul while evil overtook good, leading to the fall of man.\n(iv) By his acceptance of Eve,woman, Adam acknowledged God's institution of marriage.\n(v) Man now has a right to choose between life and death.",
    "explanation": "(a)  In the beginning, God made the earth and the heavens. There were no plants nor herbs because rain had not fallen. The Lord formed man out of dust (of the earth) and breathed into his nostrils the breath of life, thus making him become a living being. God then planted a garden in Eden, put the man there and grew plants and the tree of life and the tree of knowledge of good and evil. Four rivers flowed on four sides to water the garden and the man was to maintain the garden. God directed the man to eat of all the trees but not the fruit of the tree of knowledge, for he would die any day he ate the fruit. The man was alone, hence, there was the need to find a suitable help mate. Then God created all living creatures and the man was charged to give them names. To provide the man a helper fit for him, God made from Adam's rib a woman, gave her to Adam as flesh of his flesh and Adam called her woman.\n(b) The functions assigned to man in the second creation story are as follows:\n(i) He was to act as God's agent in furthering the act of creation of various types of vegetation.\n(ii) He was to give names to all creations. This is a very important function because by knowing the name of a person or thing, you know his or its nature and can, therefore, exercise power over it.\n(iii) He was to eat of all trees and plants, but, never the tree of knowledge of good and evil. This order refects the dual nature of man, flesh and soul, good and evil. It is unfortunate that this dual nature was soon to play a negative role when flesh overtook soul while evil overtook good, leading to the fall of man.\n(iv) By his acceptance of Eve,woman, Adam acknowledged God's institution of marriage.\n(v) Man now has a right to choose between life and death.",
    "year": "2000"
  },
  {
    "number": "203",
    "text": "(a) Describe the return of the Exiles from Babylon during the reign of Cyrus.\n \n(b) Give two reasons for the positive response from the people.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51895?exam_type=waec&type=theory&page=41",
    "correct_answer": "(a) In the first year of Cyrus, king of Persia, he issued a decree to the effect that the Lord, the God of heaven, had charged him to build a house for Him in Jerusalem. He, therefore, allowed everybody from among the Jewish exiles, who so wished, to return to Jerusalem in order to rebuild the temple. He authorised that such returnees should be assisted with silver and gold and other essential materials, including freewill offerings to God for His yet-to-be-built house in Jerusalem. In quick response, the heads of families, the priests, the Levites and others who were touched by this gesture rose up. Others who were so minded gave them all assistance in cash and kind, including beasts of burden. Cyrus himself brought out all the vessels which Nebuchadnezzar had looted from the temple, counted them and handed them over to Sheshbazzar, the leader of the returnees. A large company then left Babylon for Judah.\n(b) Reasons for positive response on the part of the exiles are:\n(i) The people had the feeling that home is home coupled with the spirit of nationalism.\n(ii) In a foreign land, they could not freely practice their culture and religion.\n(iii) Slavery is a curse to any people.\n(iv) It showed the fulfilment of God's promise.",
    "explanation": "(a) In the first year of Cyrus, king of Persia, he issued a decree to the effect that the Lord, the God of heaven, had charged him to build a house for Him in Jerusalem. He, therefore, allowed everybody from among the Jewish exiles, who so wished, to return to Jerusalem in order to rebuild the temple. He authorised that such returnees should be assisted with silver and gold and other essential materials, including freewill offerings to God for His yet-to-be-built house in Jerusalem. In quick response, the heads of families, the priests, the Levites and others who were touched by this gesture rose up. Others who were so minded gave them all assistance in cash and kind, including beasts of burden. Cyrus himself brought out all the vessels which Nebuchadnezzar had looted from the temple, counted them and handed them over to Sheshbazzar, the leader of the returnees. A large company then left Babylon for Judah.\n(b) Reasons for positive response on the part of the exiles are:\n(i) The people had the feeling that home is home coupled with the spirit of nationalism.\n(ii) In a foreign land, they could not freely practice their culture and religion.\n(iii) Slavery is a curse to any people.\n(iv) It showed the fulfilment of God's promise.",
    "year": "2000"
  },
  {
    "number": "204",
    "text": "(a) Identify the actions taken by King Solomon which are commended as marks of his wisdom.\n \n(b) State two unwise decisions taken by King Solomon.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51897?exam_type=waec&type=theory&page=41",
    "correct_answer": "(a) At the beginning of the reign of king Solomon, God asked him to make a request from Him and he rightly asked for wisdom to rule his people well. God added unto him riches and prosperity with the proviso that should he remain loyal like his father, He would grant him long life. Between the two harlots, he exhibited true wisdom in his judgement and he was also famous for his many proverbs and songs and for his botanical and scientific knowledge. The hallmark of his wisdom was, however, the temple which he built for the Lord in Jerusalem. He dedicated it with singing, dancing and sacrifices to the Lord. During the dedication, he prayed to God with devotion, not only for his people, but also for foreigners who would pray to God of Israel while facing the temple in Jerusalem. He brought the ark of the covenant from its former modest place of abode into the very presence of God in the holiest part of the temple. His commercial interests brought prosperity to his country.\n(b) Some of king Solomon's unwise decisions are:\n(i) Solomon's love of many foreign women was in total negation of God's command.\n(ii) He allowed his foreign wives to come into Israel with their foreign gods. Not only did he build temples for these gods, he worshipped them together with these wives of his.\n(iii) Solomon's forced labour (made up chiefly of slaves) and his over-taxation dissipated the economy of Israel.\n(iv) His foreign diplomatic trading connections often cost Israel loss of territory. (For example, he lost twenty cities to Hiram, king of Tyre which he exchanged for the timber and expertise from Tyre",
    "explanation": "(a) At the beginning of the reign of king Solomon, God asked him to make a request from Him and he rightly asked for wisdom to rule his people well. God added unto him riches and prosperity with the proviso that should he remain loyal like his father, He would grant him long life. Between the two harlots, he exhibited true wisdom in his judgement and he was also famous for his many proverbs and songs and for his botanical and scientific knowledge. The hallmark of his wisdom was, however, the temple which he built for the Lord in Jerusalem. He dedicated it with singing, dancing and sacrifices to the Lord. During the dedication, he prayed to God with devotion, not only for his people, but also for foreigners who would pray to God of Israel while facing the temple in Jerusalem. He brought the ark of the covenant from its former modest place of abode into the very presence of God in the holiest part of the temple. His commercial interests brought prosperity to his country.\n(b) Some of king Solomon's unwise decisions are:\n(i) Solomon's love of many foreign women was in total negation of God's command.\n(ii) He allowed his foreign wives to come into Israel with their foreign gods. Not only did he build temples for these gods, he worshipped them together with these wives of his.\n(iii) Solomon's forced labour (made up chiefly of slaves) and his over-taxation dissipated the economy of Israel.\n(iv) His foreign diplomatic trading connections often cost Israel loss of territory. (For example, he lost twenty cities to Hiram, king of Tyre which he exchanged for the timber and expertise from Tyre",
    "year": "2000"
  },
  {
    "number": "205",
    "text": "a) Describe the circumstances which brought Amos face to face with Amaziah, the priest of Bethel.\n \n(b) Give two reasons why those who oppose God should be condemned.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51900?exam_type=waec&type=theory&page=41",
    "correct_answer": "(a) Amos denounced the high places of Israel and pronounced that God would rise against the house of Jeroboam with the sword. Then Amaziah, the priest of Bethel, sent word to king Jeroboam that Amos had conspired against him and that :he land was not able to bear all his words. He said that Jeroboam would die by the sword and Israel must go into exile. To Amos, Amaziah said, \"0 seer, go, flee to the land of Judah, eat bread there, and prophesy there; but never again prophesy at Bethel...\" Amos replied, 'I am no prophet, nor a prophet's son; I am a herdsman, and a dresser of sycamore Tees. The Lord took me from following the flock to go and prophesy to my people, Israel. Therefore, hear the word of the Lord. For ordering me to shut up, your wife shall become a harlot in the city; your sons and daughters shall fail by the sword; your land shall be parcelled out by line. You yourself shall die in an unclean land and Israel shall surely go into exile away from its land.\"\n(b) Those who oppose God should be condemned for the following reasons:\n(i) Since God is our creator, it is condemnable to oppose Him.\n(ii) Opponents of God are evil to others; they deceive others.\n(iii) They should be opposed because their teaching leads to unhappiness and destruction.\n(iv) They violate God's law, word and will.",
    "explanation": "(a) Amos denounced the high places of Israel and pronounced that God would rise against the house of Jeroboam with the sword. Then Amaziah, the priest of Bethel, sent word to king Jeroboam that Amos had conspired against him and that :he land was not able to bear all his words. He said that Jeroboam would die by the sword and Israel must go into exile. To Amos, Amaziah said, \"0 seer, go, flee to the land of Judah, eat bread there, and prophesy there; but never again prophesy at Bethel...\" Amos replied, 'I am no prophet, nor a prophet's son; I am a herdsman, and a dresser of sycamore Tees. The Lord took me from following the flock to go and prophesy to my people, Israel. Therefore, hear the word of the Lord. For ordering me to shut up, your wife shall become a harlot in the city; your sons and daughters shall fail by the sword; your land shall be parcelled out by line. You yourself shall die in an unclean land and Israel shall surely go into exile away from its land.\"\n(b) Those who oppose God should be condemned for the following reasons:\n(i) Since God is our creator, it is condemnable to oppose Him.\n(ii) Opponents of God are evil to others; they deceive others.\n(iii) They should be opposed because their teaching leads to unhappiness and destruction.\n(iv) They violate God's law, word and will.",
    "year": "2000"
  },
  {
    "number": "206",
    "text": "(a) Highlight the main features in the Lukan account of the birth, the circumcision and the presentation of Jesus in the temple.\n \n(b) Give two reasons for the two rituals of circumcision and the temple presentation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51904?exam_type=waec&type=theory&page=42",
    "correct_answer": "(a) Joseph took his pregnant wife, Mary, from Nazareth to Bethlehem in response to the emperor's order concerning the census. In Bethlehem, there was no more room in all the inns and Joseph, therefore, took Mary to a manger where she gave birth to her son, Jesus Christ. Angels of God proclaimed the birth to shepherds who went to the manger and saw the child. After eight days, the child was circumcised and named Jesus.\nHe was duly brought to the temple in Jerusalem for the rite of purification (of the mother) during which the appropriate sacrifice was offered. In the temple was a devout or righteous man, Simeon, to whom it was revealed that he would not see death until he had seen Christ. When the parents of Jesus came into the temple, Simeon took Jesus in his hands and blessed God. Then he said the \"Nunc Dimittis\", praising God for his glory which he was vouchsafed to behold. He prophesied that Jesus was set for the rise and fall of Israel but that a sword would pierce through many souls. The parents marvelled at all that Simeon said about the child, but kept it all in mind. There was also an old (widowed) prophetess, Anna, who came into the temple at that moment and gave thanks to God for the child, Jesus.\n(b) Reasons for the rituals of circumcision and the temple presentation are:\n(i) As a Jew by birth, Jesus was by law expected to be circumcised on the eighth day.\n(ii) This was in accordance with the covenant entered into by God and Abraham or a physical symbol of the covenant.\n(iii) It was also a Mosaic stipulation that a Jewish son who opened his mother's womb must be presented to God in the temple.\n(iv) Sacrifices of purification (for the mother) were to accompany this with a concessional provision for poor parents, of two turtle doves or two pigeons instead of the usual sheep or goat (Lev. 12 Vs 8)",
    "explanation": "(a) Joseph took his pregnant wife, Mary, from Nazareth to Bethlehem in response to the emperor's order concerning the census. In Bethlehem, there was no more room in all the inns and Joseph, therefore, took Mary to a manger where she gave birth to her son, Jesus Christ. Angels of God proclaimed the birth to shepherds who went to the manger and saw the child. After eight days, the child was circumcised and named Jesus.\nHe was duly brought to the temple in Jerusalem for the rite of purification (of the mother) during which the appropriate sacrifice was offered. In the temple was a devout or righteous man, Simeon, to whom it was revealed that he would not see death until he had seen Christ. When the parents of Jesus came into the temple, Simeon took Jesus in his hands and blessed God. Then he said the \"Nunc Dimittis\", praising God for his glory which he was vouchsafed to behold. He prophesied that Jesus was set for the rise and fall of Israel but that a sword would pierce through many souls. The parents marvelled at all that Simeon said about the child, but kept it all in mind. There was also an old (widowed) prophetess, Anna, who came into the temple at that moment and gave thanks to God for the child, Jesus.\n(b) Reasons for the rituals of circumcision and the temple presentation are:\n(i) As a Jew by birth, Jesus was by law expected to be circumcised on the eighth day.\n(ii) This was in accordance with the covenant entered into by God and Abraham or a physical symbol of the covenant.\n(iii) It was also a Mosaic stipulation that a Jewish son who opened his mother's womb must be presented to God in the temple.\n(iv) Sacrifices of purification (for the mother) were to accompany this with a concessional provision for poor parents, of two turtle doves or two pigeons instead of the usual sheep or goat (Lev. 12 Vs 8)",
    "year": "2000"
  },
  {
    "number": "207",
    "text": "(a) Relate the account of the Mission of the Twelve, according to the Synoptics.\n \n(b) State any four qualities required of today's evangelists.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51906?exam_type=waec&type=theory&page=42",
    "correct_answer": "(a)Jesus sent out the twelve with authority over unclean spirits and to heal all infirmities. He charged them to go nowhere among the Gentiles or enter no town of the Samariatans, but to go to the lost sheep of the house of Israel and to preach, saying \" the Kingdom of heaven is at hand\". They were to take no money, no bag nor two tunics, no sandals, no staff. Whatever town or house they entered, they should greet it with peace of the Lord. If the house was worthy, their peace remained, if not, their peace returned to them. He also charged them to remain in any house that received them, eating or drinking whatever was offered them, for the labourer deserved his wages. Whatever town that did not receive them, on getting out, they should wipe off the dust under their feet as a testimony against it, for it would be more tolerable, on the day of judgment, for Sodom and Gomorrah than for that hostile town. Jesus concluded by warning them that they were being sent out as sheep in the midst of wolves. Therefore, they had to be as wise as serpents and as innocent as doves.\n(b) Requirements for today's Evangelists are:\n(i) wisdom and knowledge from God,\n(ii) knowledge of the Bible,\n(iii) prayerful life and spiritual maturity,\n(iv) physical strength/ energy,\n(v) ability to address the public,\n(vi) sustainable income / means of livelihood,\n(vii) simple, patient, people-oriented personality or ability to interact with people and inspire them,\n(viii) personal discipline, neatness,\n(ix) leadership quality / role model,\n(x) knowledge of the language,\n(xi) technique of communication,\n(xii) inspiration.",
    "explanation": "(a)Jesus sent out the twelve with authority over unclean spirits and to heal all infirmities. He charged them to go nowhere among the Gentiles or enter no town of the Samariatans, but to go to the lost sheep of the house of Israel and to preach, saying \" the Kingdom of heaven is at hand\". They were to take no money, no bag nor two tunics, no sandals, no staff. Whatever town or house they entered, they should greet it with peace of the Lord. If the house was worthy, their peace remained, if not, their peace returned to them. He also charged them to remain in any house that received them, eating or drinking whatever was offered them, for the labourer deserved his wages. Whatever town that did not receive them, on getting out, they should wipe off the dust under their feet as a testimony against it, for it would be more tolerable, on the day of judgment, for Sodom and Gomorrah than for that hostile town. Jesus concluded by warning them that they were being sent out as sheep in the midst of wolves. Therefore, they had to be as wise as serpents and as innocent as doves.\n(b) Requirements for today's Evangelists are:\n(i) wisdom and knowledge from God,\n(ii) knowledge of the Bible,\n(iii) prayerful life and spiritual maturity,\n(iv) physical strength/ energy,\n(v) ability to address the public,\n(vi) sustainable income / means of livelihood,\n(vii) simple, patient, people-oriented personality or ability to interact with people and inspire them,\n(viii) personal discipline, neatness,\n(ix) leadership quality / role model,\n(x) knowledge of the language,\n(xi) technique of communication,\n(xii) inspiration.",
    "year": "2000"
  },
  {
    "number": "208",
    "text": "(a) Narrate the Synoptic account of the Resurrection of Jesus, bringing out the role played by the women.\n \n(b) In what two ways is the Resurrection significant to the Christian faith?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51908?exam_type=waec&type=theory&page=42",
    "correct_answer": "a) After the Sabbath, towards dawn on the first day of the week, Marry Magdalene and the other Mary went to the tomb to anoint Jesus with spices. There was an earthquake, as an angel rolled away the stone covering the tomb and sat on it. His appearance was like lightning. For fear of him, the guards trembled and froze up like dead men. The women were wondering who would roll away the stone for them, but when they looked up, they saw that it had been rolled away already. When they entered, they saw a young man in dazzling white who told them not to be amazed for he knew they were looking for the crucified Jesus. \"He has risen, he is not here ,see the place where they had laid him. Go and tell Peter and the others that he had gone to Galilee ahead of them they should go there to meet him. They fled from the tomb with fear and joy to inform his disciples, but, the disciples disbelieved them. On their way, Jesus met them and hailed them. Jesus asked them not to be afraid but to go and tell his disciples to meet him in Galilee.\n(b) Significance of the Resurrection to the Christian Faith are:\n(i) The resurrection of Jesus is central to Christian belief. To christians, the resurrection is an assurance of Christ's victory over sin and death.\n(ii) Christ's resurrection day became for christians the day of the Lord, the day of Salvation. Hence, the shift away from the Jewish Sabbath (Saturday) to the christian's first day of the week, Sunday — a day of devotion to God; the most memorable day.\n(iii) At baptisrri, christians die to sin, but with Christ's resurrection, christians rise in faith with Christ.\n(iv) Death is not the end of life; it is a transition to a new phase of life, eternal.",
    "explanation": "a) After the Sabbath, towards dawn on the first day of the week, Marry Magdalene and the other Mary went to the tomb to anoint Jesus with spices. There was an earthquake, as an angel rolled away the stone covering the tomb and sat on it. His appearance was like lightning. For fear of him, the guards trembled and froze up like dead men. The women were wondering who would roll away the stone for them, but when they looked up, they saw that it had been rolled away already. When they entered, they saw a young man in dazzling white who told them not to be amazed for he knew they were looking for the crucified Jesus. \"He has risen, he is not here ,see the place where they had laid him. Go and tell Peter and the others that he had gone to Galilee ahead of them they should go there to meet him. They fled from the tomb with fear and joy to inform his disciples, but, the disciples disbelieved them. On their way, Jesus met them and hailed them. Jesus asked them not to be afraid but to go and tell his disciples to meet him in Galilee.\n(b) Significance of the Resurrection to the Christian Faith are:\n(i) The resurrection of Jesus is central to Christian belief. To christians, the resurrection is an assurance of Christ's victory over sin and death.\n(ii) Christ's resurrection day became for christians the day of the Lord, the day of Salvation. Hence, the shift away from the Jewish Sabbath (Saturday) to the christian's first day of the week, Sunday — a day of devotion to God; the most memorable day.\n(iii) At baptisrri, christians die to sin, but with Christ's resurrection, christians rise in faith with Christ.\n(iv) Death is not the end of life; it is a transition to a new phase of life, eternal.",
    "year": "2000"
  },
  {
    "number": "209",
    "text": "(a) Give an account of how Philip preached the Gospel message to the Ethiopian Eunuch.\n \n(b) In what two ways was this episode important to Christianity?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51910?exam_type=waec&type=theory&page=42",
    "correct_answer": "(a) After Philip had completed his work in Samaria, the angel of the Lord directed him towards Gaza. There, he met an Ethiopian Eunuch returning home after worshipping in Jerusalem. The spirit of God directed Philip to join the Eunuch in his chariot and Philip heard the Eunuch reading from Isaiah. He asked him whether he understood the passage but the Eunuch answered that he could not, except somebody put him through. He, therefore, invited Philip into his chariot. The passage was about the sheep being led to the slaughter. He asked Philip whom the prophet was referring to: himself or to somebody else. Philip started from this passage and developed it to preach the good news of Jesus to him. When they came to a body of water, the Eunuch asked him what could prevent his baptism. They went down into the water and Philip baptized him. Thereafter, the spirit of the Lord caught up Philip and the Eunuch saw him no more. He went on his way rejoicing.\n(b) Philip's preaching of the Gospel message to the Ethiopian Eunuch is significant in many ways:\n(i) He took the Gospel beyond Jerusalem and Judea, through Samaria and into Gentile territory and beyond.\n(ii) The Holy Spirit received on the Day of Pentecost was active in the Church; Philip's activities bore eloquent testimony to this.\n(iii) The Ethiopian Eunuch, as the first African' convert to Christianity, probably initiated further evangelization into Africa.\n(iv) It shows the need for divine inspiration in understanding and interpreting the scripture.\n(v) Preachers and ministers of God should help in interpreting the word.\n(vi) All christians are obliged to evangelize.",
    "explanation": "(a) After Philip had completed his work in Samaria, the angel of the Lord directed him towards Gaza. There, he met an Ethiopian Eunuch returning home after worshipping in Jerusalem. The spirit of God directed Philip to join the Eunuch in his chariot and Philip heard the Eunuch reading from Isaiah. He asked him whether he understood the passage but the Eunuch answered that he could not, except somebody put him through. He, therefore, invited Philip into his chariot. The passage was about the sheep being led to the slaughter. He asked Philip whom the prophet was referring to: himself or to somebody else. Philip started from this passage and developed it to preach the good news of Jesus to him. When they came to a body of water, the Eunuch asked him what could prevent his baptism. They went down into the water and Philip baptized him. Thereafter, the spirit of the Lord caught up Philip and the Eunuch saw him no more. He went on his way rejoicing.\n(b) Philip's preaching of the Gospel message to the Ethiopian Eunuch is significant in many ways:\n(i) He took the Gospel beyond Jerusalem and Judea, through Samaria and into Gentile territory and beyond.\n(ii) The Holy Spirit received on the Day of Pentecost was active in the Church; Philip's activities bore eloquent testimony to this.\n(iii) The Ethiopian Eunuch, as the first African' convert to Christianity, probably initiated further evangelization into Africa.\n(iv) It shows the need for divine inspiration in understanding and interpreting the scripture.\n(v) Preachers and ministers of God should help in interpreting the word.\n(vi) All christians are obliged to evangelize.",
    "year": "2000"
  },
  {
    "number": "210",
    "text": "(a) What was Paul's exposition of the concept of justification by faith, in Romans?\n \n(b) Mention any four fruits to be derived from this concept.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51912?exam_type=waec&type=theory&page=42",
    "correct_answer": "(a) Paul says that all men have sinned and fallen short of God's glory and it was for this reason that Jesus came into the world to restore man to his former status of union with God. It is, therefore, incumbent on man to maintain his former status of union with God. It was incumbent on man to believe and have faith in Jesus in order to become acceptable to God. This acceptance, without conditions, is what Paul termed Justification'. By being justified, our sins are passed over because of the blood shed by Jesus, so that all who believe, Jews and Gentiles alike, are redeemed. God's righteousness is therefore proven by this unconditional acceptance of erstwhile sinners.\n(b) Fruits to be derived from the Concept of Justification by Faith leads to:\n(i) peace with God;\n(ii) sharing in the glory of God;\n(iii) love of God;\n(iv) expiation of sins through the blood of Jesus;\n(v) freedom from the wrath of God;\n(vi) reconciliation with God;\n(vii) salvation / eternal life through the life of Christ;\n(viii) salvation by grace not by self-effort or merit.",
    "explanation": "(a) Paul says that all men have sinned and fallen short of God's glory and it was for this reason that Jesus came into the world to restore man to his former status of union with God. It is, therefore, incumbent on man to maintain his former status of union with God. It was incumbent on man to believe and have faith in Jesus in order to become acceptable to God. This acceptance, without conditions, is what Paul termed Justification'. By being justified, our sins are passed over because of the blood shed by Jesus, so that all who believe, Jews and Gentiles alike, are redeemed. God's righteousness is therefore proven by this unconditional acceptance of erstwhile sinners.\n(b) Fruits to be derived from the Concept of Justification by Faith leads to:\n(i) peace with God;\n(ii) sharing in the glory of God;\n(iii) love of God;\n(iv) expiation of sins through the blood of Jesus;\n(v) freedom from the wrath of God;\n(vi) reconciliation with God;\n(vii) salvation / eternal life through the life of Christ;\n(viii) salvation by grace not by self-effort or merit.",
    "year": "2000"
  },
  {
    "number": "211",
    "text": "(a) Explain the concept New Life in Christ as taught by Paul.\n \n(b) What four necessary steps must a new member in the church take before initiation into the New Life",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51913?exam_type=waec&type=theory&page=43",
    "correct_answer": "Paul regards Christians as those who have been buried with Christ through baptism and risen with him through the resurrection. Such people are dead to sin; sin no longer reigns in their bodies. They must therefore live a new life, apply their minds to heavenly things and do away with their former life. Christians must do away with immorality such as impurity, passion, evil desires, greed, anger, bad temper, malice, slander and shameful language. Christians must not lie to one another because they have put on a new life. In the new life, there are no differences; Christ is all and in all. As God's chosen people, enjoying His love, Christians must show tenderness of heart, kindness, humility, gentleness, patience, endurance and bear one another's burden.\nThey should forgive one another as God has forgiven them and crown all their virtues with love which is the perfect bond of union. They should let the peace of Christ reign in their lives and be thankful. The enriching message of Christ should influence whatever they do. They should instruct and admonish one another in all wisdom with Psalms and hymns and spiritual songs, singing in thankful spirit. Anything they do should be done in the name of Jesus.\n(b) Steps to be taken before initiation into New Life in my Church are:\n(i) The word of God should first be preached and heard.\n(ii) Confession of sin by word of mouth then follows after conviction and belief in the word heard.\n(iii) The third step is baptism.\n(iv) Determination to lead a Christ-like life as a full member of the church\n(v) Confirmation by the Bishop of the Church, after which he is entitled to partake in the body and blood of Jesus during Holy communion.",
    "explanation": "Paul regards Christians as those who have been buried with Christ through baptism and risen with him through the resurrection. Such people are dead to sin; sin no longer reigns in their bodies. They must therefore live a new life, apply their minds to heavenly things and do away with their former life. Christians must do away with immorality such as impurity, passion, evil desires, greed, anger, bad temper, malice, slander and shameful language. Christians must not lie to one another because they have put on a new life. In the new life, there are no differences; Christ is all and in all. As God's chosen people, enjoying His love, Christians must show tenderness of heart, kindness, humility, gentleness, patience, endurance and bear one another's burden.\nThey should forgive one another as God has forgiven them and crown all their virtues with love which is the perfect bond of union. They should let the peace of Christ reign in their lives and be thankful. The enriching message of Christ should influence whatever they do. They should instruct and admonish one another in all wisdom with Psalms and hymns and spiritual songs, singing in thankful spirit. Anything they do should be done in the name of Jesus.\n(b) Steps to be taken before initiation into New Life in my Church are:\n(i) The word of God should first be preached and heard.\n(ii) Confession of sin by word of mouth then follows after conviction and belief in the word heard.\n(iii) The third step is baptism.\n(iv) Determination to lead a Christ-like life as a full member of the church\n(v) Confirmation by the Bishop of the Church, after which he is entitled to partake in the body and blood of Jesus during Holy communion.",
    "year": "2000"
  },
  {
    "number": "212",
    "text": "(a) Give the highlights of Paul's letter to Philemon.\n \n(b) Explain the term 'Forgiveness'.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51914?exam_type=waec&type=theory&page=43",
    "correct_answer": "(a) St. Paul's letter to Philemon is an appeal to forgive his erstwhile slave, Onesimus and take him back. Onesimus had wronged his master and escaped. In his self imposed exile, he had come in contact with Paul (imprisoned in Rome) and had become a convert. He became closely attached to Paul by rendering useful service to him. Paul, therefore, sent him back to his master with a letter of appeal with the love of Christ. Paul began by congratulating Philemon on his love and devotion in the service of God, pointing out his immense joy for Philemon's goodness to the saints in the Church.\nPaul claimed that, although as his mentor and benefactor, he had a right to command, but for God's sake, he preferred to appeal to Philemon's good sense, and urged him to take back Onesimus, not so much as a slave, but more importantly, as a Christian brother. Onesimus had formerly, by his action, been useless to Philemon so that by becoming a convert, he might become more useful and worthy to be taken back.\nPaul said that he would have preferred to retain Onesimus, but the decision must be taken by Philemon himself. If Onesimus had owed him anything or made him suffer any financial losses, he should charge Paul's account; he would surely pay it during his next visit. He concluded by asking Philemon to prepare a guest house for him in readiness for his next visit.\n(b) Forgiveness is that mental attitude by which one overlooks an injury or wrong done to one by another, whether physical, mental or moral. Forgiveness restores broken relationship, especially when it is accompanied by forgetting the injury suffered. In fact, forgiveness is more or less divine (Only God can truly forgive); human beings merely pardon.",
    "explanation": "(a) St. Paul's letter to Philemon is an appeal to forgive his erstwhile slave, Onesimus and take him back. Onesimus had wronged his master and escaped. In his self imposed exile, he had come in contact with Paul (imprisoned in Rome) and had become a convert. He became closely attached to Paul by rendering useful service to him. Paul, therefore, sent him back to his master with a letter of appeal with the love of Christ. Paul began by congratulating Philemon on his love and devotion in the service of God, pointing out his immense joy for Philemon's goodness to the saints in the Church.\nPaul claimed that, although as his mentor and benefactor, he had a right to command, but for God's sake, he preferred to appeal to Philemon's good sense, and urged him to take back Onesimus, not so much as a slave, but more importantly, as a Christian brother. Onesimus had formerly, by his action, been useless to Philemon so that by becoming a convert, he might become more useful and worthy to be taken back.\nPaul said that he would have preferred to retain Onesimus, but the decision must be taken by Philemon himself. If Onesimus had owed him anything or made him suffer any financial losses, he should charge Paul's account; he would surely pay it during his next visit. He concluded by asking Philemon to prepare a guest house for him in readiness for his next visit.\n(b) Forgiveness is that mental attitude by which one overlooks an injury or wrong done to one by another, whether physical, mental or moral. Forgiveness restores broken relationship, especially when it is accompanied by forgetting the injury suffered. In fact, forgiveness is more or less divine (Only God can truly forgive); human beings merely pardon.",
    "year": "2000"
  },
  {
    "number": "213",
    "text": "(a) State the main features of Peter's counsel to wives and husbands in their relationship.\n \n(b) List any three consequences of instability in the family",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51915?exam_type=waec&type=theory&page=43",
    "correct_answer": "(a) Peter devoted much of his counsel to wives. He advised them to be submissive to their husbands, for by their good behavior, unbelieving husbands might be won over to God, especially in response to the reverent and chaste nature which they exhibited. Wives should not attach too much importance to external adornments, characterized by much use of trinkets, gold ornaments, hair braiding and flamboyant dressing.\nInstead, they should lay greater premium on moral probity which, before God, is as precious as an imperishable jewel. Wives should look up to Sarah as their role model. She hoped in God and referred to her husband, in obedience, as her Lord. If, as wives, they maintained her standard, they would rightly be her children, by faith. Turning to the husbands, Peter advised them to live considerately with their wives in accordance with their knowledge of God's character and will, knowing that women are the weaker vessel who should be treated with love and honour so that as joint heirs of the grace of God, their prayers might not be hindered by any ungodly action on their part.\n(b) Instability in the family is usually caused by mutual misunderstanding or incompatibility of character between husband and wife, and this often has far-reaching consequences. These are:\n(i) juvenile delinquency among the children in the family: With parents always at daggers — drawn and no love, children's home-training becomes defective. This adversely affects their behaviour.\n(ii) Lack of love or unity in the home: Often, this leads to open physical confrontation and inevitable disaster.\n(iii) Divorce: Where the love of God is compromised or non-existent, husbands and wives may end up in divorce. The rate of divorce is on the rise today due to extreme materialism and selfishness which characterize relationships today. Instability of the family leads to instability in the nation.",
    "explanation": "(a) Peter devoted much of his counsel to wives. He advised them to be submissive to their husbands, for by their good behavior, unbelieving husbands might be won over to God, especially in response to the reverent and chaste nature which they exhibited. Wives should not attach too much importance to external adornments, characterized by much use of trinkets, gold ornaments, hair braiding and flamboyant dressing.\nInstead, they should lay greater premium on moral probity which, before God, is as precious as an imperishable jewel. Wives should look up to Sarah as their role model. She hoped in God and referred to her husband, in obedience, as her Lord. If, as wives, they maintained her standard, they would rightly be her children, by faith. Turning to the husbands, Peter advised them to live considerately with their wives in accordance with their knowledge of God's character and will, knowing that women are the weaker vessel who should be treated with love and honour so that as joint heirs of the grace of God, their prayers might not be hindered by any ungodly action on their part.\n(b) Instability in the family is usually caused by mutual misunderstanding or incompatibility of character between husband and wife, and this often has far-reaching consequences. These are:\n(i) juvenile delinquency among the children in the family: With parents always at daggers — drawn and no love, children's home-training becomes defective. This adversely affects their behaviour.\n(ii) Lack of love or unity in the home: Often, this leads to open physical confrontation and inevitable disaster.\n(iii) Divorce: Where the love of God is compromised or non-existent, husbands and wives may end up in divorce. The rate of divorce is on the rise today due to extreme materialism and selfishness which characterize relationships today. Instability of the family leads to instability in the nation.",
    "year": "2000"
  }
]