[
  {
    "number": "213",
    "text": "AFRICAN DRAMA\nAthol Fugard: Sizwe Bansi is Dead\n \nExamine the view that life is meaningless for the blacks in South Africa",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53334?exam_type=waec&type=theory&page=43",
    "correct_answer": "The first thing that attracts the reader is the separated family life of couples brought about by husbands or wives leaving their families to seek jobs in other townships. Sizwe's letter to his wife in King William's Town while he is in Port Elizabeth seeking a job brings out this fact. Buntun lives alone because his wife \"only comes home weekends.\" The cruel apartheid system which separates these families places them under great emotional stress.\nThere are constant police raids that, sometimes result in violence and the deportation of blacks from one township to another. Sizwe narrates one such raid when he is staying with Zola. He is ruthlessly dragged out when found hiding under a table and taken to the Labour Bureau where his passport is stamped. Sizwe has to move to Buntu's place to escape this constant police harassment. The police raids are an enforcement of the inhuman residential laws which seek to regulate the movement of blacks.\nThere is also the issue of the passbook. The passbook is the instrument used to destroy the blackman's identity, he becomes a mere figure on the computer. With the passbook, the blackman's sense of self-respect, dignity and pride is eroded and his dehumanization is complete. Buntu asks Sizwe:\n\"When whiteman looked at you at the Labour Bureau what did he see? A man with dignity or a bloody passbook with NI number?\" The truth of this dehumanization becomes all too clear when in his metamorphosis into his new identity as Robert Zwelinzima, Sizwe becomes psychologically confused and says: \"I am all mixed up. Who am I? This is the final fact of the predicament of the Blackman in South Africa.\nThe issue of the restrictive labour laws in white townships that make looking for a job a nightmare may be also considered. Buntu's story of the difficulty he has before securing a job even though he was born in Port Elizabeth is a case in point. Buntu talks of his tiring movements between King Williams town and Port Elizabeth, carrying letters back and forth to get Sizwe's passbook stamped. Even when the Blackman gets a job, he is used and dumped. The laborious life of Outa Jacob brings this fact out. Blacks are also exposed to the occupational hazard of working in the mines. Sizwe himself tells us working in the mines is not a well-paid job. Besides, \"many blackmen get killed when the rocks fall.\"\nThe unequal development between black and white townships is also hinted at. Sizwe tells us that in King Williams. There is the issue of segregation in education which limits the chances of blacks getting good and well-paid jobs. The reader gets the impression in Sizwe's letter.  This fact is brought into prominence by the stark illiteracy of Sizwe which makes it impossible for him to get a job even Jam( as a garden boy because that requires a knowledge in \"seasons and flowers\". The hopeless fact of Sizwe's situation qualifies is revealed in his bland statement \"I can't read.\" It is in these specific and general ways that life becomes meaningless for blacks in South Africa.",
    "explanation": "The first thing that attracts the reader is the separated family life of couples brought about by husbands or wives leaving their families to seek jobs in other townships. Sizwe's letter to his wife in King William's Town while he is in Port Elizabeth seeking a job brings out this fact. Buntun lives alone because his wife \"only comes home weekends.\" The cruel apartheid system which separates these families places them under great emotional stress.\nThere are constant police raids that, sometimes result in violence and the deportation of blacks from one township to another. Sizwe narrates one such raid when he is staying with Zola. He is ruthlessly dragged out when found hiding under a table and taken to the Labour Bureau where his passport is stamped. Sizwe has to move to Buntu's place to escape this constant police harassment. The police raids are an enforcement of the inhuman residential laws which seek to regulate the movement of blacks.\nThere is also the issue of the passbook. The passbook is the instrument used to destroy the blackman's identity, he becomes a mere figure on the computer. With the passbook, the blackman's sense of self-respect, dignity and pride is eroded and his dehumanization is complete. Buntu asks Sizwe:\n\"When whiteman looked at you at the Labour Bureau what did he see? A man with dignity or a bloody passbook with NI number?\" The truth of this dehumanization becomes all too clear when in his metamorphosis into his new identity as Robert Zwelinzima, Sizwe becomes psychologically confused and says: \"I am all mixed up. Who am I? This is the final fact of the predicament of the Blackman in South Africa.\nThe issue of the restrictive labour laws in white townships that make looking for a job a nightmare may be also considered. Buntu's story of the difficulty he has before securing a job even though he was born in Port Elizabeth is a case in point. Buntu talks of his tiring movements between King Williams town and Port Elizabeth, carrying letters back and forth to get Sizwe's passbook stamped. Even when the Blackman gets a job, he is used and dumped. The laborious life of Outa Jacob brings this fact out. Blacks are also exposed to the occupational hazard of working in the mines. Sizwe himself tells us working in the mines is not a well-paid job. Besides, \"many blackmen get killed when the rocks fall.\"\nThe unequal development between black and white townships is also hinted at. Sizwe tells us that in King Williams. There is the issue of segregation in education which limits the chances of blacks getting good and well-paid jobs. The reader gets the impression in Sizwe's letter.  This fact is brought into prominence by the stark illiteracy of Sizwe which makes it impossible for him to get a job even Jam( as a garden boy because that requires a knowledge in \"seasons and flowers\". The hopeless fact of Sizwe's situation qualifies is revealed in his bland statement \"I can't read.\" It is in these specific and general ways that life becomes meaningless for blacks in South Africa.",
    "year": "2008"
  },
  {
    "number": "214",
    "text": "AFRICAN DRAMA\nAthol Fugard: Sizwe Bansi is Dead\n \nDiscuss two dramatic techniques in the play",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53336?exam_type=waec&type=theory&page=43",
    "correct_answer": "Athol Fugard employs several dramatic techniques in his play, Sizwe Bansi is Dead, to portray the dark side of theexte illo-F apartheid system in South Africa. Among the dramatic techniques employed, the following are worthy of note:\nFugard employs this technique through the use of one principal character, Styles to unfold the evils of the apartheid This system in South Africa. Styles being the sole actor of most of the actions in the play speaks directly to the audience, thus revealing his fears, hopes and reactions against the apartheid system. The use of this technique gives the play the a bloody advantage of continuity of action. It also enables the reader to empathise with style in his sufferings, as well as form a friend Le office u picture of the general life of black people Maa Flashback Through flashback, the audience is introduced to past events. With styles on stage, the audience is not just witnessing with his c one of hi for whites at Ford's Motors.\nThrough flashback too, we see what happens in Style's photographic studio which has actions or events in the present but is also made aware of issues like land ownership and the plight of blacks who work home. The become a place where blacks realize their dreams. Bansi tells his own story too through flashback. This technique a allows the audience to empathise with the black South African whose life and that of his race is being ordered by the after all, Fine whites.\nThis technique also conveys the long time frustrations and degradation of the black majority. Symbolism n to Aar hearts' c Symbolism is yet another dramatic technique used in the play. Styles decision to resign from Ford's Motors is in itself 5. Hav symbolic. It shows that Styles is now a man of his own ready to take his own decisions for his own freedom. The photographic studio symbolizes a place where the blacks have their dreams realized in a ruthless system that has as the \" dashed their hopes and dreams. This, in itself, represents an avenue for blacks to escape, though temporarily, from the c° m The i harsh realities of the system. The cockroaches are symbolic of the intruding whites who have resisted the struggle of oppress. blacks for a long time. been m; This is further symbolized by Styles' use of 'Doom' an insecticide as an instrument for the elimination of the white soldiers oppressors.\nThe camera is equally a symbol. As an instrument it is used to capture and preserve the dreams of black people human rights. The pass book, and the white police symbolize the cruel system of apartheid that does not respect any form of that fail'\nHumour:\nStyles behaviour and actions often tend to be humorous and satirical as seen for example, in his interpretation of Baas Bradley's speech to his fellow blacks. As the audience laughs, the realities of black life are made manifest.\nMime :\nOther technique include miming which styles use in the same speech to his fellow blacks. Mime is used as a tool for while c  ridiculing white people. There is also the use of the epistolary style which reveals aspects of Styles' predicament as he goes looking for a job.",
    "explanation": "Athol Fugard employs several dramatic techniques in his play, Sizwe Bansi is Dead, to portray the dark side of theexte illo-F apartheid system in South Africa. Among the dramatic techniques employed, the following are worthy of note:\nFugard employs this technique through the use of one principal character, Styles to unfold the evils of the apartheid This system in South Africa. Styles being the sole actor of most of the actions in the play speaks directly to the audience, thus revealing his fears, hopes and reactions against the apartheid system. The use of this technique gives the play the a bloody advantage of continuity of action. It also enables the reader to empathise with style in his sufferings, as well as form a friend Le office u picture of the general life of black people Maa Flashback Through flashback, the audience is introduced to past events. With styles on stage, the audience is not just witnessing with his c one of hi for whites at Ford's Motors.\nThrough flashback too, we see what happens in Style's photographic studio which has actions or events in the present but is also made aware of issues like land ownership and the plight of blacks who work home. The become a place where blacks realize their dreams. Bansi tells his own story too through flashback. This technique a allows the audience to empathise with the black South African whose life and that of his race is being ordered by the after all, Fine whites.\nThis technique also conveys the long time frustrations and degradation of the black majority. Symbolism n to Aar hearts' c Symbolism is yet another dramatic technique used in the play. Styles decision to resign from Ford's Motors is in itself 5. Hav symbolic. It shows that Styles is now a man of his own ready to take his own decisions for his own freedom. The photographic studio symbolizes a place where the blacks have their dreams realized in a ruthless system that has as the \" dashed their hopes and dreams. This, in itself, represents an avenue for blacks to escape, though temporarily, from the c° m The i harsh realities of the system. The cockroaches are symbolic of the intruding whites who have resisted the struggle of oppress. blacks for a long time. been m; This is further symbolized by Styles' use of 'Doom' an insecticide as an instrument for the elimination of the white soldiers oppressors.\nThe camera is equally a symbol. As an instrument it is used to capture and preserve the dreams of black people human rights. The pass book, and the white police symbolize the cruel system of apartheid that does not respect any form of that fail'\nHumour:\nStyles behaviour and actions often tend to be humorous and satirical as seen for example, in his interpretation of Baas Bradley's speech to his fellow blacks. As the audience laughs, the realities of black life are made manifest.\nMime :\nOther technique include miming which styles use in the same speech to his fellow blacks. Mime is used as a tool for while c  ridiculing white people. There is also the use of the epistolary style which reveals aspects of Styles' predicament as he goes looking for a job.",
    "year": "2008"
  },
  {
    "number": "215",
    "text": "AFRICAN DRAMA\nJoe De Graft: Sons and Daughters\n \nDiscuss the character and the role of Aunt Fosuma in the play",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53337?exam_type=waec&type=theory&page=43",
    "correct_answer": "Fosuwa is paternal aunt to Aaron and Maanan, living together with James' (her brother) family in the family home. She is commonly referred to as Aunt.\nFosuwa is one of those in society who worship prestige and money.' Without ascertaining the actual type of igayoel relationship between Maanan and Awere, she shows dislike for Awere simply because Awere is a young man, not as rich as Lawyer Bonu that Fosuwa wants Maanan to marry.\nAs a result of her love for money, she subverts James' best intentions and encourages Lawyer Bonu blindly in his desire to have an affair with Maanan, \"Please don't leave, Lawyer, please. I know how angry you are, but please forgive Maanan, she's only a girl.\"\nFosuwa confirms her interest in the Lawyer having a relationship with Maanan when the Lawyer's wife goes to James' house to look for her husband. She insults her: if Lawyer was satisfied with you, he wouldn't be interested in Maanan.\"\nShe is a gossip and interferes in matters that do not concern her, in one instance, Hannah has to tell her to story interfering in her family affairs.\nFosuwa typifies an African sister-in-law. Anytime Hannah says something that Fosuwa perceives as limiting her influence on her family, Fosuwa flares-up. \"Whatever it is you have given him to eat, you only know\"\nFosuwa sees nothing wrong with polygamy as she proclaims. \"Why, a man can marry more than one!\" After all she has been married three times. That is why she encourages the Lawyer Bonue and Maanan relationship. The lasting impression which Aunt Fosuwa leaves is that of greedy, immoral woman who will not stop at anything achieve her selfish aims.",
    "explanation": "Fosuwa is paternal aunt to Aaron and Maanan, living together with James' (her brother) family in the family home. She is commonly referred to as Aunt.\nFosuwa is one of those in society who worship prestige and money.' Without ascertaining the actual type of igayoel relationship between Maanan and Awere, she shows dislike for Awere simply because Awere is a young man, not as rich as Lawyer Bonu that Fosuwa wants Maanan to marry.\nAs a result of her love for money, she subverts James' best intentions and encourages Lawyer Bonu blindly in his desire to have an affair with Maanan, \"Please don't leave, Lawyer, please. I know how angry you are, but please forgive Maanan, she's only a girl.\"\nFosuwa confirms her interest in the Lawyer having a relationship with Maanan when the Lawyer's wife goes to James' house to look for her husband. She insults her: if Lawyer was satisfied with you, he wouldn't be interested in Maanan.\"\nShe is a gossip and interferes in matters that do not concern her, in one instance, Hannah has to tell her to story interfering in her family affairs.\nFosuwa typifies an African sister-in-law. Anytime Hannah says something that Fosuwa perceives as limiting her influence on her family, Fosuwa flares-up. \"Whatever it is you have given him to eat, you only know\"\nFosuwa sees nothing wrong with polygamy as she proclaims. \"Why, a man can marry more than one!\" After all she has been married three times. That is why she encourages the Lawyer Bonue and Maanan relationship. The lasting impression which Aunt Fosuwa leaves is that of greedy, immoral woman who will not stop at anything achieve her selfish aims.",
    "year": "2008"
  },
  {
    "number": "216",
    "text": "AFRICAN DRAMA\nJoe De Graft: Sons and Daughters\n \nDiscuss the conflict between the two youngest children and their father in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53339?exam_type=waec&type=theory&page=44",
    "correct_answer": "in the play, James Ofosu is the father of four children and the youngest are Aaron and Maanan. As a rich transport owner with 'no more education than elementary level', his desire is to give all his children 'a professional education.'\nJames is fortunate to realize his dreams with the first two children -- he sends George. the eldest, overseas and he qualifies as a medical doctor, while Kofi is yet to return home as a qualified Chartered Accountant. James is convinced that these professions are more lucrative than teaching, since the community is prepared to pay for the services they offer. He believes that anybody who wants to get on in life must learn that money is what matters, that money is power. James, therefore, wishes his two youngest children to study Engineering and Law respectively.\nHe even goes to the extent of asking his friend, Lawyer Bonu, to secure admissions for them abroad. Contrary to the wishes of their father, Aaron and Maanan want to study painting and dancing respectively. They want to achieve their heart's desire, to pursue courses they would like most so that they can develop themselves. This rejection of their father's choice of profession for them results in a conflict with him. James does not consider painting as work because it will not make his son rich. He also does not approve of his daughter 'dancing half naked on a bloody stage.'\nJames laments the fact that he has been 'an indulgent father' and decides to seek further help from his friend Lawyer Bonu. Lawyer Bonu gets admission for Aaron at Manchester University and offers Maanan a job in his office until he gets admission for her abroad. Maanan and Aaron strongly reject their father's arrangement. However, subsequent events lead James to reconcile with his children and accept their choice of professions. Awere, Aaron's friend succeeds in his painting career and sells one of his paintings for £220. Another event is the discovery of Lawyer Bonu's sexual advances to Maanan in his own home.\nThe conflict is resolved when James realizes that even a lawyer can be mean and disappointing and that painting after all, does prove to be lucrative and rewarding. Finally, James announces the resolution of the conflict thus\" 'I've given in to Maanan, I'm prepared even now to give in to Aaron.' Awere further adds these conciliatory words: `And now may we each be given the strength to achieve our hearts' desire in our work.'",
    "explanation": "in the play, James Ofosu is the father of four children and the youngest are Aaron and Maanan. As a rich transport owner with 'no more education than elementary level', his desire is to give all his children 'a professional education.'\nJames is fortunate to realize his dreams with the first two children -- he sends George. the eldest, overseas and he qualifies as a medical doctor, while Kofi is yet to return home as a qualified Chartered Accountant. James is convinced that these professions are more lucrative than teaching, since the community is prepared to pay for the services they offer. He believes that anybody who wants to get on in life must learn that money is what matters, that money is power. James, therefore, wishes his two youngest children to study Engineering and Law respectively.\nHe even goes to the extent of asking his friend, Lawyer Bonu, to secure admissions for them abroad. Contrary to the wishes of their father, Aaron and Maanan want to study painting and dancing respectively. They want to achieve their heart's desire, to pursue courses they would like most so that they can develop themselves. This rejection of their father's choice of profession for them results in a conflict with him. James does not consider painting as work because it will not make his son rich. He also does not approve of his daughter 'dancing half naked on a bloody stage.'\nJames laments the fact that he has been 'an indulgent father' and decides to seek further help from his friend Lawyer Bonu. Lawyer Bonu gets admission for Aaron at Manchester University and offers Maanan a job in his office until he gets admission for her abroad. Maanan and Aaron strongly reject their father's arrangement. However, subsequent events lead James to reconcile with his children and accept their choice of professions. Awere, Aaron's friend succeeds in his painting career and sells one of his paintings for £220. Another event is the discovery of Lawyer Bonu's sexual advances to Maanan in his own home.\nThe conflict is resolved when James realizes that even a lawyer can be mean and disappointing and that painting after all, does prove to be lucrative and rewarding. Finally, James announces the resolution of the conflict thus\" 'I've given in to Maanan, I'm prepared even now to give in to Aaron.' Awere further adds these conciliatory words: `And now may we each be given the strength to achieve our hearts' desire in our work.'",
    "year": "2008"
  },
  {
    "number": "217",
    "text": "NON-AFRICAN DRAMA \nNIKOLAI GOGOL: The Government Inspector \n \nDiscuss the significance of the encounter between the protesters and Hlestakov in the Mayor's house.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53341?exam_type=waec&type=theory&page=44",
    "correct_answer": "Having accepted the offer of a delightful room in the Mayor's house Hlestakov is ready to carry out some responsibilities as the \"Government Inspector\". One of such is attending to the protesters who besiege the house of the Mayor to complain to Hlestakov and denounce his (Mayor's) actions.\nThe protesters, who belong to the business sector of the society, feel aggrieved at the way the Mayor has been oppressing them. Led by their spokesmen — the three merchants — they tell Hlestakov the ways in which the Mayor has been maltreating them, leaving them with no other option than to commit suicide.\nThey complain that the Mayor sends soldiers to harass them. He also intimidates them by pulling their beards and calling them \"Tartar\". According to the merchants, the Mayor expects too much from them. They have to provide dresses for his wife and daughter, presents at Easter, yards and rolls of nice cloth for himself and presents at several Saints' days. They say that failure to do all these earns them severe flogging or torture at the hands of soldiers. Ironically, however, they do not realize that they are making their complaints to a scoundrel who cannot change their situation but rather desires to make profit from them. Hlestakov's acceptance of the bribe of sugar and wine, as well as a \"loan\" of 500 roubles shows that the merchants' plight is far from over. This further highlights the theme of corruption.\nFurther complaints come from the wives of the locksmith and the sergeant. The locksmith's wife — Poshlyopkina — complains that the Mayor has conscripted her husband into the army while accepting bribes from others to free them. The sergeant's wife — lvanovna — claims she has been flogged on the orders of the Mayor and could not sit down for two days. To all these protesters, Hlestakov, who has his own trouble of how to get away to deal with, gives a promise. He drives the other protesters away. All these complaints reveal the extent to which corruption and injustice are entrenched in the society. Thus the Mayor's discomfiture at the mention of a government inspector becomes understandable.",
    "explanation": "Having accepted the offer of a delightful room in the Mayor's house Hlestakov is ready to carry out some responsibilities as the \"Government Inspector\". One of such is attending to the protesters who besiege the house of the Mayor to complain to Hlestakov and denounce his (Mayor's) actions.\nThe protesters, who belong to the business sector of the society, feel aggrieved at the way the Mayor has been oppressing them. Led by their spokesmen — the three merchants — they tell Hlestakov the ways in which the Mayor has been maltreating them, leaving them with no other option than to commit suicide.\nThey complain that the Mayor sends soldiers to harass them. He also intimidates them by pulling their beards and calling them \"Tartar\". According to the merchants, the Mayor expects too much from them. They have to provide dresses for his wife and daughter, presents at Easter, yards and rolls of nice cloth for himself and presents at several Saints' days. They say that failure to do all these earns them severe flogging or torture at the hands of soldiers. Ironically, however, they do not realize that they are making their complaints to a scoundrel who cannot change their situation but rather desires to make profit from them. Hlestakov's acceptance of the bribe of sugar and wine, as well as a \"loan\" of 500 roubles shows that the merchants' plight is far from over. This further highlights the theme of corruption.\nFurther complaints come from the wives of the locksmith and the sergeant. The locksmith's wife — Poshlyopkina — complains that the Mayor has conscripted her husband into the army while accepting bribes from others to free them. The sergeant's wife — lvanovna — claims she has been flogged on the orders of the Mayor and could not sit down for two days. To all these protesters, Hlestakov, who has his own trouble of how to get away to deal with, gives a promise. He drives the other protesters away. All these complaints reveal the extent to which corruption and injustice are entrenched in the society. Thus the Mayor's discomfiture at the mention of a government inspector becomes understandable.",
    "year": "2008"
  },
  {
    "number": "218",
    "text": "NON-AFRICAN DRAMA \nNIKOLAI GOGOL: The Government Inspector \n \nExamine the character of the Postmaster and his contribution to the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53342?exam_type=waec&type=theory&page=44",
    "correct_answer": "The Postmaster's contribution comes out clearly in the following ways:\n(I) He sets the play in motion by intercepting the mail.\nii) He plays a key role in the corrupt practices of the society.\n(iii) His conduct and utterances add to the humour in the play.\nHis name is Ivan Koosmith Shpyokin. He is the postmaster who becomes prominent at the height of the expectation of the Government Inspector's visit.\nThe Mayor instructed him to intercept and read mail apparently to avoid being taken unawares. For the Mayor and the other corrupt public officials, the visit of the Government Inspector  is an equivalent of war, which must be fully prepared for. Hence, all hands must have to be on deck. He is described by Hlestakov as smelling like the man in charge of the poultry. A thoroughly corrupt postmaster, he jumps at the offer of opening the mail that passes through his office and he assures the Mayor that he will live up to his expectation. According to him, he (the Mayor) \"is not teaching me anything. I've done it for years.\" He reveals to them his earlier escapades, items that he has had to gather from unsealed letters which he calls 'wonderful tit-bits.' He agrees to comply with the Mayor's instruction of keeping back any letter of 'complaint or denunciation, just for the purpose of self preservation.\nIronically, he intercepts Hlestakov's letter to his friend which denounces public officials for their ignorance and folly. The Charity Commissioner sees nothing good in the postmaster whom he accuses of negligence, doing absolutely nothing and running a disorganized department where the mail are delayed for days. He eagerly supports the idea to bribe the inspector so that he may not be found culpable. He has his eyes on Mary as a prospective wife, but the arrival of Hlestakov and the announcement of their proposed marriage unsettle him",
    "explanation": "The Postmaster's contribution comes out clearly in the following ways:\n(I) He sets the play in motion by intercepting the mail.\nii) He plays a key role in the corrupt practices of the society.\n(iii) His conduct and utterances add to the humour in the play.\nHis name is Ivan Koosmith Shpyokin. He is the postmaster who becomes prominent at the height of the expectation of the Government Inspector's visit.\nThe Mayor instructed him to intercept and read mail apparently to avoid being taken unawares. For the Mayor and the other corrupt public officials, the visit of the Government Inspector  is an equivalent of war, which must be fully prepared for. Hence, all hands must have to be on deck. He is described by Hlestakov as smelling like the man in charge of the poultry. A thoroughly corrupt postmaster, he jumps at the offer of opening the mail that passes through his office and he assures the Mayor that he will live up to his expectation. According to him, he (the Mayor) \"is not teaching me anything. I've done it for years.\" He reveals to them his earlier escapades, items that he has had to gather from unsealed letters which he calls 'wonderful tit-bits.' He agrees to comply with the Mayor's instruction of keeping back any letter of 'complaint or denunciation, just for the purpose of self preservation.\nIronically, he intercepts Hlestakov's letter to his friend which denounces public officials for their ignorance and folly. The Charity Commissioner sees nothing good in the postmaster whom he accuses of negligence, doing absolutely nothing and running a disorganized department where the mail are delayed for days. He eagerly supports the idea to bribe the inspector so that he may not be found culpable. He has his eyes on Mary as a prospective wife, but the arrival of Hlestakov and the announcement of their proposed marriage unsettle him",
    "year": "2008"
  },
  {
    "number": "219",
    "text": "NON-AFRICAN DRAMA\nROBERT BOLT: A Man For All Seasons \n \nDiscuss the decline of values in the play",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53344?exam_type=waec&type=theory&page=44",
    "correct_answer": "The society which Bolt presents is a morally decadent one in which the values normally associated with civilized society are destroyed. It is a cynical world in which 'every man has his price.' The king, who is the head of state, unsurps the power of the church because he now finds it convenient to do so. His lack of morals is clearly demonstrated in his desire to sacrifice correct behaviour on the altar of expediency.\nThe very dispensation which he persuades the Pope to give to allow him to marry his late brother's wife, he now tries to get the Pope to reverse, so that he can divorce his wife and marry another. When the Pope will not co-operate, he seeks through 'legal means, to strip him of all his power. Rather than serve as the fountain of honour and justice, the king perverts justice and debases honour. He is assertive and corrupt, determined to achieve his aims by any means possible. He does not find it difficult to garner support for his scheme because of the moral bankruptcy of the society. One of his most ardent supporters is Thomas Cromwell, an opportunist and an instrument of the King. He, like the King, will ignore all the niceties of conscience to achieve what he desires. The king also gets support from other officials whose primary aim is to keep themselves in comfortable positions. Richard Rich is one such character.\nHis lack of remorse after he has betrayed More points to the level to which society has degenerated. This is why More's sterling qualities radiate in the play. Social institutions also come in for scathing criticism in the play. The church is censured for allowing itself to be manipulated by the King. And the trial of More exposes the perversion of justice which has become characteristic of the judiciary. The ordinary people too, do not escape Bolt's censure. The woman who gives a \"gift\" to More in the form of a silver cup is a good example. We see therefore that corruption has become a way of life in the society and that values have been perverted.",
    "explanation": "The society which Bolt presents is a morally decadent one in which the values normally associated with civilized society are destroyed. It is a cynical world in which 'every man has his price.' The king, who is the head of state, unsurps the power of the church because he now finds it convenient to do so. His lack of morals is clearly demonstrated in his desire to sacrifice correct behaviour on the altar of expediency.\nThe very dispensation which he persuades the Pope to give to allow him to marry his late brother's wife, he now tries to get the Pope to reverse, so that he can divorce his wife and marry another. When the Pope will not co-operate, he seeks through 'legal means, to strip him of all his power. Rather than serve as the fountain of honour and justice, the king perverts justice and debases honour. He is assertive and corrupt, determined to achieve his aims by any means possible. He does not find it difficult to garner support for his scheme because of the moral bankruptcy of the society. One of his most ardent supporters is Thomas Cromwell, an opportunist and an instrument of the King. He, like the King, will ignore all the niceties of conscience to achieve what he desires. The king also gets support from other officials whose primary aim is to keep themselves in comfortable positions. Richard Rich is one such character.\nHis lack of remorse after he has betrayed More points to the level to which society has degenerated. This is why More's sterling qualities radiate in the play. Social institutions also come in for scathing criticism in the play. The church is censured for allowing itself to be manipulated by the King. And the trial of More exposes the perversion of justice which has become characteristic of the judiciary. The ordinary people too, do not escape Bolt's censure. The woman who gives a \"gift\" to More in the form of a silver cup is a good example. We see therefore that corruption has become a way of life in the society and that values have been perverted.",
    "year": "2008"
  },
  {
    "number": "220",
    "text": "NON-AFRICAN DRAMA\nROBERT BOLT: A Man For All Seasons \n \nDiscuss the theme of friendship and betrayal in the play.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53345?exam_type=waec&type=theory&page=44",
    "correct_answer": "The relationship between More and others like Rich, the Duke and Cromwell, defines the theme of friendship and betrayal in the play. These relationships determine the direction of the plot. Rich is a friend of More's. Very early in the play, More takes Rich's loyalty for granted and opens up considerably to Rich to his detriment. For the sake of friendship, More offers Rich valuable advice concerning a career: teaching is quiet, safe and devoid of temptation. Rich rebuffs the advice. More gives Rich a cup he has been offered as a \"gift\". Rich accepts this. However, Rich shows divided loyalty. He denies his friendship with More when Cromwell asks him about it. His switching of friendship from More to Cromwell for the sake of getting a good job and an enhanced life is under-standable. In befriending Cromwell, however, Rich betrays More. He provides damming evidence against More. At the trial, Rich's betrayal of More is complete when he turns star witness and lies on oath without compunction.\nThe Duke of Norfolk proves a steadfast friend to More. When the king is visiting after launching the Great Harry, More is nowhere to be found. This alarms his family and disturbs the Duke. Norfolk attempts to draw More to the side of what he sees as reason without success. But he supports More's candidature for the Chancellorship. However, Norfolk does not agree to clinging to his conscience as does More, so he stays on his job; and he does prosecute More only because it is his duty. Norfolk stands by his friend till the very end, careful to avoid More's steely adherence to his conscience.\nBetween Cromwell and More, there is no love lost. Cromwell bides his time for opportunities to hurt More. He holds More in spite. His insistence that the boatman take the correct fare is to give More up as one who overpays the boatman illegally. Cromwell is obviously not More's friend. He secures the most serious bits of evidence for condemning More through a friend of More's. However, he offers Rich a job for the opportunity to gain access to information and not because the two are friends. He intimidates, bullies and even cajoles Rich. He finally secures Rich's willingness to commit perjury. At the crucial moment, he contrives the evidence from alleged witnesses to incriminate More.\nIt is clear from the play that friendship is not based on a true and lasting relationship; rather. it depends very much on patronage, self interest and expediency and there-in lies the element of betrayal.",
    "explanation": "The relationship between More and others like Rich, the Duke and Cromwell, defines the theme of friendship and betrayal in the play. These relationships determine the direction of the plot. Rich is a friend of More's. Very early in the play, More takes Rich's loyalty for granted and opens up considerably to Rich to his detriment. For the sake of friendship, More offers Rich valuable advice concerning a career: teaching is quiet, safe and devoid of temptation. Rich rebuffs the advice. More gives Rich a cup he has been offered as a \"gift\". Rich accepts this. However, Rich shows divided loyalty. He denies his friendship with More when Cromwell asks him about it. His switching of friendship from More to Cromwell for the sake of getting a good job and an enhanced life is under-standable. In befriending Cromwell, however, Rich betrays More. He provides damming evidence against More. At the trial, Rich's betrayal of More is complete when he turns star witness and lies on oath without compunction.\nThe Duke of Norfolk proves a steadfast friend to More. When the king is visiting after launching the Great Harry, More is nowhere to be found. This alarms his family and disturbs the Duke. Norfolk attempts to draw More to the side of what he sees as reason without success. But he supports More's candidature for the Chancellorship. However, Norfolk does not agree to clinging to his conscience as does More, so he stays on his job; and he does prosecute More only because it is his duty. Norfolk stands by his friend till the very end, careful to avoid More's steely adherence to his conscience.\nBetween Cromwell and More, there is no love lost. Cromwell bides his time for opportunities to hurt More. He holds More in spite. His insistence that the boatman take the correct fare is to give More up as one who overpays the boatman illegally. Cromwell is obviously not More's friend. He secures the most serious bits of evidence for condemning More through a friend of More's. However, he offers Rich a job for the opportunity to gain access to information and not because the two are friends. He intimidates, bullies and even cajoles Rich. He finally secures Rich's willingness to commit perjury. At the crucial moment, he contrives the evidence from alleged witnesses to incriminate More.\nIt is clear from the play that friendship is not based on a true and lasting relationship; rather. it depends very much on patronage, self interest and expediency and there-in lies the element of betrayal.",
    "year": "2008"
  },
  {
    "number": "221",
    "text": "AFRICAN POETRY \n \nDiscuss contrast as a poetic device in \"In the navel of the soul.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53346?exam_type=waec&type=theory&page=45",
    "correct_answer": "The introductory reference to Pascal's quotation, sets the pattern of contrast in the poem, that between instinct and mind and by extension, between tradition and modern science. Contrast is used to bring out the two views on how pregnancy is detected by different cultures as represented by their medical practitioners.\nThe poet's diction clearly brings out the contrast. The traditional midwives are referred to as \"midwives of the spirit\" and are contrasted with the \"experts\" who rely on scientific methods and tests for pregnancy. The \"midwives of the spirit\" in their simple way of testing can \"feel\" the presence of life on the navel.\nThe Ironic tone of the poem heightens the contrast. The poet sarcastically notes that the \"experts\" through their urine test record negative, while the midwives \"feel a foetal throb\" \"on their finger upon our navel\".\nThe \"quizzical glare\" of the \"experts\" indicates that even though they may think that they are superior to traditional midwives, it is they that are very much confused. The poet concludes by contrasting the Western attitude to the traditionalist's and affirming the determination of the traditionalist not to allow the African way of life to be stifled or downgraded.",
    "explanation": "The introductory reference to Pascal's quotation, sets the pattern of contrast in the poem, that between instinct and mind and by extension, between tradition and modern science. Contrast is used to bring out the two views on how pregnancy is detected by different cultures as represented by their medical practitioners.\nThe poet's diction clearly brings out the contrast. The traditional midwives are referred to as \"midwives of the spirit\" and are contrasted with the \"experts\" who rely on scientific methods and tests for pregnancy. The \"midwives of the spirit\" in their simple way of testing can \"feel\" the presence of life on the navel.\nThe Ironic tone of the poem heightens the contrast. The poet sarcastically notes that the \"experts\" through their urine test record negative, while the midwives \"feel a foetal throb\" \"on their finger upon our navel\".\nThe \"quizzical glare\" of the \"experts\" indicates that even though they may think that they are superior to traditional midwives, it is they that are very much confused. The poet concludes by contrasting the Western attitude to the traditionalist's and affirming the determination of the traditionalist not to allow the African way of life to be stifled or downgraded.",
    "year": "2008"
  },
  {
    "number": "222",
    "text": "AFRICAN POETRY \n \nHow does Rubadiri use language to portray the effects of the storm in \"An African Thunderstorm\"?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53347?exam_type=waec&type=theory&page=45",
    "correct_answer": "The poem presents a picture of chaos and, destruction brought about by an African thunderstorm. Images abound - the poem to present an atmosphere of confusion at the approach of the storm.\nIn stanza one, the clouds are said to be \"hurrying with the wind\". This metaphor emphasizes the speed of the storm a-id the imminent destruction. The wind seems to be impatient in its mission. The destructive nature of the thunderstorm compared, in a powerful simile, to that of locusts.\nAnother simile compares the wind's indiscriminate movement in its path to that of a mad man. The metaphor \"pregnant clouds\" suggests the inevitability of a heavy downpour and the threat which it carries. The clouds are \"like dark sinister wings\" suggesting the evil which they portend. Trees bend in obeisance to the \"whistling The final stanza of the poem expresses the reactions of those who find themselves in the path of the storm. While the children are excited, the women \"dart about\" taking things out of the harm's way.\nThe effect of the storm on the women is graphically expressed. They are stripped almost naked by the force of the wind. The last four lines which climax the poem vividly present the atmosphere of fear which culminates in the arrival of the storm. The language used in the poem encapsulates the feeling of fear, chaos and uneasiness that the African thunderstorm\nOther examples of language use include alliteration and onomatopoeia, as in \"whistling wind\", \"rumble, tremble and :rack\" of the thunderstorm and the \"pelting march of the storm.\" Personification is used to describe the cloud as pregnant\" and the wind whistling as trees bend to let it pass. The entire poem is full of images of movement, hearing and sight.",
    "explanation": "The poem presents a picture of chaos and, destruction brought about by an African thunderstorm. Images abound - the poem to present an atmosphere of confusion at the approach of the storm.\nIn stanza one, the clouds are said to be \"hurrying with the wind\". This metaphor emphasizes the speed of the storm a-id the imminent destruction. The wind seems to be impatient in its mission. The destructive nature of the thunderstorm compared, in a powerful simile, to that of locusts.\nAnother simile compares the wind's indiscriminate movement in its path to that of a mad man. The metaphor \"pregnant clouds\" suggests the inevitability of a heavy downpour and the threat which it carries. The clouds are \"like dark sinister wings\" suggesting the evil which they portend. Trees bend in obeisance to the \"whistling The final stanza of the poem expresses the reactions of those who find themselves in the path of the storm. While the children are excited, the women \"dart about\" taking things out of the harm's way.\nThe effect of the storm on the women is graphically expressed. They are stripped almost naked by the force of the wind. The last four lines which climax the poem vividly present the atmosphere of fear which culminates in the arrival of the storm. The language used in the poem encapsulates the feeling of fear, chaos and uneasiness that the African thunderstorm\nOther examples of language use include alliteration and onomatopoeia, as in \"whistling wind\", \"rumble, tremble and :rack\" of the thunderstorm and the \"pelting march of the storm.\" Personification is used to describe the cloud as pregnant\" and the wind whistling as trees bend to let it pass. The entire poem is full of images of movement, hearing and sight.",
    "year": "2008"
  },
  {
    "number": "223",
    "text": "NON-AFRICAN POETRY \n \nWhat is the poet's attitude to affliction in \"On His Blindness\"?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53348?exam_type=waec&type=theory&page=45",
    "correct_answer": "Milton's major preoccupation in 'On his blindness' is blindness itself which prevents him from exploiting to the full :he talent that God has endowed him with. That is his affliction. Starting on a note of deep reflection, he laments his state of blindness: \"how my light is spent/ere half my days, in this dark world\". He regrets his loss of sight, which has not allowed him to serve God and humanity as he would have wished. For him, this talent (his sight) \"is death to hide/Lodeg with me useless\".\nThough my soul more bent/To serve therewith my maker.\" His fear is that he risks God's chastisement on his returning to Him without accomplishing much. Alluding to the biblical parable of the talent, the poet is worried that he may suffer the fate of the \"unprofitable\" servant who failed to utilize the talent given him by his master and was consequently condemned. However, he rationalizes that if it were God's wish that he achieved something in life, God would not have denied him :he necessary instrument with which to accomplish such a task. He asks rhetorically, \"doth God exact day labour, light denied?\" Upon further reflection, he quickly counsels patience \"to prevent that murmur.\"\nAgain, this is an allusion to the same \"unprofitable servant\" in the Bible who grumbles about the talent given to him and finds excuses to explain away his failure to trade and profit by it. For Milton, it is neither man's work nor his services that God requires, but that of those who, through patience have learnt to bear their yoke without murmur. Such people, to him, serve God best because they have a lot to teach humanity. He asserts that, after all, God is sovereign and royal.\nThere are thousands of servants 'at his bidding speed' who run his errands, both over land and sea without rest. This recognition allows Milton to celebrate the spirit over the flesh and mind over matter, as well as man's immense capacity to come to terms with the problems that beset him. Milton reiterates the point that man's effort alone is not enough to please God, rather, it is his resolve to refuse to bow to adversity and 'bear his mild yoke' for \"they also serve who only stand and wait\".",
    "explanation": "Milton's major preoccupation in 'On his blindness' is blindness itself which prevents him from exploiting to the full :he talent that God has endowed him with. That is his affliction. Starting on a note of deep reflection, he laments his state of blindness: \"how my light is spent/ere half my days, in this dark world\". He regrets his loss of sight, which has not allowed him to serve God and humanity as he would have wished. For him, this talent (his sight) \"is death to hide/Lodeg with me useless\".\nThough my soul more bent/To serve therewith my maker.\" His fear is that he risks God's chastisement on his returning to Him without accomplishing much. Alluding to the biblical parable of the talent, the poet is worried that he may suffer the fate of the \"unprofitable\" servant who failed to utilize the talent given him by his master and was consequently condemned. However, he rationalizes that if it were God's wish that he achieved something in life, God would not have denied him :he necessary instrument with which to accomplish such a task. He asks rhetorically, \"doth God exact day labour, light denied?\" Upon further reflection, he quickly counsels patience \"to prevent that murmur.\"\nAgain, this is an allusion to the same \"unprofitable servant\" in the Bible who grumbles about the talent given to him and finds excuses to explain away his failure to trade and profit by it. For Milton, it is neither man's work nor his services that God requires, but that of those who, through patience have learnt to bear their yoke without murmur. Such people, to him, serve God best because they have a lot to teach humanity. He asserts that, after all, God is sovereign and royal.\nThere are thousands of servants 'at his bidding speed' who run his errands, both over land and sea without rest. This recognition allows Milton to celebrate the spirit over the flesh and mind over matter, as well as man's immense capacity to come to terms with the problems that beset him. Milton reiterates the point that man's effort alone is not enough to please God, rather, it is his resolve to refuse to bow to adversity and 'bear his mild yoke' for \"they also serve who only stand and wait\".",
    "year": "2008"
  },
  {
    "number": "224",
    "text": "NON-AFRICAN POETRY \n \n Discuss the theme of change in Yeat's \"The Second Coming.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53349?exam_type=waec&type=theory&page=45",
    "correct_answer": "Change is an important theme in the poem. The poem is based on an allusion to the second coming of Christ as predicted in the Bible. (Matthew 24). The atmosphere of imminent change is established from the beginning. The opening image is of a falcon (a vicious bird of prey) Its flight symbolizes cycles in human history.\nAs the falcon circles in an ever— widening gyre and spins out of control, \"the falcon cannot hear the falconer\". There is chaos and anarchy, as \"things fall apart\" and \"the centre cannot hold.\" Images of doom follow in quick succession; first, there is confusion everywhere \"Mere anarchy is loosed upon the world\" and then wars: \"The blood dummed tide is loosed\" The changes are for the worse. Even the behaviour and attitudes of people undergo adverse changes —\"The ceremony of innocence is drowned\" as civilized behaviour is pushed aside by uncouth behaviour. Now, even those who lead \"the best\", are no longer sure of what is right, while \"the worst\" have taken full control of the world. The second stanza affirms that what is being witnessed is the end of an era and the start of another \"The Second Corning\". The image of the sphinx-like creature reinforces this impression of change. But this change is shrouded in uncertainty.\nThe creature with the shape of a lion and a man's head awakening slowly from sleep with \"A gaze blank and pitiless as the sun\" affirms the uncertainty. It is coming as Christ did to change the world. Frightening as it looks, the creature will bring about a change which may be positive. As the \"indignant desert birds \"are being swept away and the symbol of Bethlehem looms large, one can only hope that the change envisaged will be peaceful; but the poem's end does not guarantee it. There is no doubt therefore, that change is an important theme in the poem.",
    "explanation": "Change is an important theme in the poem. The poem is based on an allusion to the second coming of Christ as predicted in the Bible. (Matthew 24). The atmosphere of imminent change is established from the beginning. The opening image is of a falcon (a vicious bird of prey) Its flight symbolizes cycles in human history.\nAs the falcon circles in an ever— widening gyre and spins out of control, \"the falcon cannot hear the falconer\". There is chaos and anarchy, as \"things fall apart\" and \"the centre cannot hold.\" Images of doom follow in quick succession; first, there is confusion everywhere \"Mere anarchy is loosed upon the world\" and then wars: \"The blood dummed tide is loosed\" The changes are for the worse. Even the behaviour and attitudes of people undergo adverse changes —\"The ceremony of innocence is drowned\" as civilized behaviour is pushed aside by uncouth behaviour. Now, even those who lead \"the best\", are no longer sure of what is right, while \"the worst\" have taken full control of the world. The second stanza affirms that what is being witnessed is the end of an era and the start of another \"The Second Corning\". The image of the sphinx-like creature reinforces this impression of change. But this change is shrouded in uncertainty.\nThe creature with the shape of a lion and a man's head awakening slowly from sleep with \"A gaze blank and pitiless as the sun\" affirms the uncertainty. It is coming as Christ did to change the world. Frightening as it looks, the creature will bring about a change which may be positive. As the \"indignant desert birds \"are being swept away and the symbol of Bethlehem looms large, one can only hope that the change envisaged will be peaceful; but the poem's end does not guarantee it. There is no doubt therefore, that change is an important theme in the poem.",
    "year": "2008"
  },
  {
    "number": "225",
    "text": "AFRICAN PROSE \nBUCHI EMECHETA: The Joys of Motherhood \n \nDiscuss three instances of conflict in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53352?exam_type=waec&type=theory&page=45",
    "correct_answer": "There are many instances of conflict in the novel. One of the major conflicts emanates from marital relationships Nnu Ego's marriage to Amatokwu is fraught with conflict brought on by her childlessness. She is treated with contempt by her husband and his family because she cannot have a child. At the end, she is disgracefully thrown out of her matrimonial home. Conflict also arises from the practice of polygamy.\nThe relationship between Nnaife and Nnu-Ego, though it had its problems, is relatively cordial until the introduction of another woman into the household. The moment Adaku comes into the home the relationship between Nnaife and Nnu Ego degenerates. The women immediately become enemies and attempt to hurt each other.\nThere is also a conflict in the Ona-Agbadi relationship. Agbadi's insensitively to the feelings of his other wives as hE makes love to his mistress, Ona, breeds resentment in his wives and ultimately results in Agunwa's death. Ethnic conflict: is manifested in the relationship between the Ibo-Nnaife family and their proposed Yoruba suitors. This results in a near fatal machete attack which sees Nnaife ending up in jail.\nThere is a further conflict between the parents expectation of the male children's commitment to their families anc the realities of the situation. While Nnaife and Nnu-Ego expect Oshia and Adim to support them financially after the have gone overseas, the reality is that the children ignore them completely. This leads to resentment on the part of thE parents and an almost complete severance of family ties.",
    "explanation": "There are many instances of conflict in the novel. One of the major conflicts emanates from marital relationships Nnu Ego's marriage to Amatokwu is fraught with conflict brought on by her childlessness. She is treated with contempt by her husband and his family because she cannot have a child. At the end, she is disgracefully thrown out of her matrimonial home. Conflict also arises from the practice of polygamy.\nThe relationship between Nnaife and Nnu-Ego, though it had its problems, is relatively cordial until the introduction of another woman into the household. The moment Adaku comes into the home the relationship between Nnaife and Nnu Ego degenerates. The women immediately become enemies and attempt to hurt each other.\nThere is also a conflict in the Ona-Agbadi relationship. Agbadi's insensitively to the feelings of his other wives as hE makes love to his mistress, Ona, breeds resentment in his wives and ultimately results in Agunwa's death. Ethnic conflict: is manifested in the relationship between the Ibo-Nnaife family and their proposed Yoruba suitors. This results in a near fatal machete attack which sees Nnaife ending up in jail.\nThere is a further conflict between the parents expectation of the male children's commitment to their families anc the realities of the situation. While Nnaife and Nnu-Ego expect Oshia and Adim to support them financially after the have gone overseas, the reality is that the children ignore them completely. This leads to resentment on the part of thE parents and an almost complete severance of family ties.",
    "year": "2008"
  },
  {
    "number": "226",
    "text": "AFRICAN PROSE \nBUCHI EMECHETA: The Joys of Motherhood \n \nDiscuss Emecheta's narrative technique in the novel",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53353?exam_type=waec&type=theory&page=46",
    "correct_answer": "Emecheta uses the third person (omniscient) narrative technique. The story is told by a narrator who is not within the story, but the novelist is able to bridge the gap between the narrator and the reader which sometimes occurs ir these circumstances.\nShe does this by allowing the story to flow almost from the consciousness of her characters. The reader is thus able to empathize with the main character Nnu Ego, understand the motives for her actions and see the story from he perspective. Her aims and aspirations, her frustrations at her inability to bear a child, and her disappointment at thE treatment she receives from her male children are vividly captured through this narrative style. Nnu Ego's story does not begin in Lagos; nor is it a story that begins in child-bearing for Nnu Ego. Her initial painful experiences in life are not to do with her losing a child; rather she has been a childless woman.\nBuchi Emecheta adopt: the style 'in media res', that is, she starts the story from a point later in time according to the chronology of events. This technique of narration has the effect of surprising the reader when the earlier events begin to unfold. It also gives thE narrator room to shuttle between later and earlier events and roam in time. In starting the narrative from a certain point inside the order of the story, the narrator does not cut the story short The earlier events will be recalled and integrated in the course by means of flashback. In The Joys of Motherhood Emecheta uses flashback very successfully.\nThe novelist tells the earlier experiences of Nnu Ego in Ibuza in late chapters after opening the novel in Lagos. Indeed, Nnu Ego is not even born until towards the end of the second chapter which largely narrates her parentage. The real events that culminate in the Lagos episode are found in Chapter Four Mama Abby's story is not told and if we were to insist on being told how her daughter came to disgrace the family, oil medium would be a flashback.",
    "explanation": "Emecheta uses the third person (omniscient) narrative technique. The story is told by a narrator who is not within the story, but the novelist is able to bridge the gap between the narrator and the reader which sometimes occurs ir these circumstances.\nShe does this by allowing the story to flow almost from the consciousness of her characters. The reader is thus able to empathize with the main character Nnu Ego, understand the motives for her actions and see the story from he perspective. Her aims and aspirations, her frustrations at her inability to bear a child, and her disappointment at thE treatment she receives from her male children are vividly captured through this narrative style. Nnu Ego's story does not begin in Lagos; nor is it a story that begins in child-bearing for Nnu Ego. Her initial painful experiences in life are not to do with her losing a child; rather she has been a childless woman.\nBuchi Emecheta adopt: the style 'in media res', that is, she starts the story from a point later in time according to the chronology of events. This technique of narration has the effect of surprising the reader when the earlier events begin to unfold. It also gives thE narrator room to shuttle between later and earlier events and roam in time. In starting the narrative from a certain point inside the order of the story, the narrator does not cut the story short The earlier events will be recalled and integrated in the course by means of flashback. In The Joys of Motherhood Emecheta uses flashback very successfully.\nThe novelist tells the earlier experiences of Nnu Ego in Ibuza in late chapters after opening the novel in Lagos. Indeed, Nnu Ego is not even born until towards the end of the second chapter which largely narrates her parentage. The real events that culminate in the Lagos episode are found in Chapter Four Mama Abby's story is not told and if we were to insist on being told how her daughter came to disgrace the family, oil medium would be a flashback.",
    "year": "2008"
  },
  {
    "number": "227",
    "text": "AFRICAN PROSE \nISIDORE OKPEWHO: The Last Duty \n \nComment on the theme of rivalry in the novel",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53355?exam_type=waec&type=theory&page=46",
    "correct_answer": "Rivalry is one of the themes explored in the novel, 'The Last Duty' This is more pronounced in the character of Chie Toje, who, out of pride and sense of self-importance brooks no rivalry to both his person and his business. His name according to him, is one that brings credit to Urukpe. He is the next in rank to the traditional head and has made his mark in the rubber business.\nBoth his name and his business must therefore be protected because, according to him \"great names are rare and must not be wasted\" as it has attracted to him a lot of attention and great respect. This is from the onset, Chief Toje is envious of Oshevire's success in business. Rather than improve on the output of his products by way of transparent honesty and increasing his workers' salaries, he resolves to get rid of Oshevire, thus crippling his business. To achieve his aim, he gets Oshevire arrested on trumped-up charges and pays Rukeme people r bear false witness against him. He is not worried by the activities of other competitors. Though he refers to Oshevire as an upstart, Toje knows that -e is more organized, pays,his workers better salaries and enjoys better government patronage than he, Toje, does. He goes further to covet Oshevire's wife in his .absence, believing that he will be able to use her to revive his swindling virility. He therefore entices her with gifts of food, clothing and other commodities to make her yield to his advances.\nOdibo on his own part is deeply rankled by the constant abuse meted out to him by Chief Toje. He is always minded of his physical disability, which is seen by Toje as a weakness and sign of incapability. As a result, Odibo harbours a lot of resentment towards Toje and when he realizes his own feelings towards Aku, he begins to see Toje as a rival.\nHe goes all the way to having an affair with Aku, knowing the emotional and psychological effects this will have on Toje if it is discovered. He therefore does not hesitate to fight Toje almost to the point of death knowing that if he has the upper hand, he will be proving a point to himself and Toje at the same time he is not totally useless as assumed all As an extension, Okumagba, suffers from this unhealthy rivalry and feels cheated out of the action of the war.\nHe has joined the war believing he would be exposed to most of the action but he has been drafted to the menial job of having to merely watch over Aku and her son, more so as Aku is from the rebel tribe. He grudgingly carries out his assignment without enjoying it, being aware of Toje's moves on the one hand and that of Odibo on the other. There is also rivalry between the military personnel as demonstrated in the conflict over a girl between the sergeant and Private Sule leading to the shooting to death of the private.",
    "explanation": "Rivalry is one of the themes explored in the novel, 'The Last Duty' This is more pronounced in the character of Chie Toje, who, out of pride and sense of self-importance brooks no rivalry to both his person and his business. His name according to him, is one that brings credit to Urukpe. He is the next in rank to the traditional head and has made his mark in the rubber business.\nBoth his name and his business must therefore be protected because, according to him \"great names are rare and must not be wasted\" as it has attracted to him a lot of attention and great respect. This is from the onset, Chief Toje is envious of Oshevire's success in business. Rather than improve on the output of his products by way of transparent honesty and increasing his workers' salaries, he resolves to get rid of Oshevire, thus crippling his business. To achieve his aim, he gets Oshevire arrested on trumped-up charges and pays Rukeme people r bear false witness against him. He is not worried by the activities of other competitors. Though he refers to Oshevire as an upstart, Toje knows that -e is more organized, pays,his workers better salaries and enjoys better government patronage than he, Toje, does. He goes further to covet Oshevire's wife in his .absence, believing that he will be able to use her to revive his swindling virility. He therefore entices her with gifts of food, clothing and other commodities to make her yield to his advances.\nOdibo on his own part is deeply rankled by the constant abuse meted out to him by Chief Toje. He is always minded of his physical disability, which is seen by Toje as a weakness and sign of incapability. As a result, Odibo harbours a lot of resentment towards Toje and when he realizes his own feelings towards Aku, he begins to see Toje as a rival.\nHe goes all the way to having an affair with Aku, knowing the emotional and psychological effects this will have on Toje if it is discovered. He therefore does not hesitate to fight Toje almost to the point of death knowing that if he has the upper hand, he will be proving a point to himself and Toje at the same time he is not totally useless as assumed all As an extension, Okumagba, suffers from this unhealthy rivalry and feels cheated out of the action of the war.\nHe has joined the war believing he would be exposed to most of the action but he has been drafted to the menial job of having to merely watch over Aku and her son, more so as Aku is from the rebel tribe. He grudgingly carries out his assignment without enjoying it, being aware of Toje's moves on the one hand and that of Odibo on the other. There is also rivalry between the military personnel as demonstrated in the conflict over a girl between the sergeant and Private Sule leading to the shooting to death of the private.",
    "year": "2008"
  },
  {
    "number": "228",
    "text": "AFRICAN PROSE \nISIDORE OKPEWHO: The Last Duty \n \nComment on the theme of rivalry in the novel",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53356?exam_type=waec&type=theory&page=46",
    "correct_answer": "Rivalry is one of the themes explored in the novel, 'The Last Duty' This is more pronounced in the character of Chie Toje, who, out of pride and sense of self-importance brooks no rivalry to both his person and his business. His name according to him, is one that brings credit to Urukpe. He is the next in rank to the traditional head and has made his mark in the rubber business.\nBoth his name and his business must therefore be protected because, according to him \"great names are rare and must not be wasted\" as it has attracted to him a lot of attention and great respect. This is from the onset, Chief Toje is envious of Oshevire's success in business. Rather than improve on the output of his products by way of transparent honesty and increasing his workers' salaries, he resolves to get rid of Oshevire, thus crippling his business. To achieve his aim, he gets Oshevire arrested on trumped-up charges and pays Rukeme people r bear false witness against him. He is not worried by the activities of other competitors. Though he refers to Oshevire as an upstart, Toje knows that -e is more organized, pays,his workers better salaries and enjoys better government patronage than he, Toje, does. He goes further to covet Oshevire's wife in his .absence, believing that he will be able to use her to revive his swindling virility. He therefore entices her with gifts of food, clothing and other commodities to make her yield to his advances.\nOdibo on his own part is deeply rankled by the constant abuse meted out to him by Chief Toje. He is always minded of his physical disability, which is seen by Toje as a weakness and sign of incapability. As a result, Odibo harbours a lot of resentment towards Toje and when he realizes his own feelings towards Aku, he begins to see Toje as a rival.\nHe goes all the way to having an affair with Aku, knowing the emotional and psychological effects this will have on Toje if it is discovered. He therefore does not hesitate to fight Toje almost to the point of death knowing that if he has the upper hand, he will be proving a point to himself and Toje at the same time he is not totally useless as assumed all As an extension, Okumagba, suffers from this unhealthy rivalry and feels cheated out of the action of the war.\nHe has joined the war believing he would be exposed to most of the action but he has been drafted to the menial job of having to merely watch over Aku and her son, more so as Aku is from the rebel tribe. He grudgingly carries out his assignment without enjoying it, being aware of Toje's moves on the one hand and that of Odibo on the other. There is also rivalry between the military personnel as demonstrated in the conflict over a girl between the sergeant and Private Sule leading to the shooting to death of the private.",
    "explanation": "Rivalry is one of the themes explored in the novel, 'The Last Duty' This is more pronounced in the character of Chie Toje, who, out of pride and sense of self-importance brooks no rivalry to both his person and his business. His name according to him, is one that brings credit to Urukpe. He is the next in rank to the traditional head and has made his mark in the rubber business.\nBoth his name and his business must therefore be protected because, according to him \"great names are rare and must not be wasted\" as it has attracted to him a lot of attention and great respect. This is from the onset, Chief Toje is envious of Oshevire's success in business. Rather than improve on the output of his products by way of transparent honesty and increasing his workers' salaries, he resolves to get rid of Oshevire, thus crippling his business. To achieve his aim, he gets Oshevire arrested on trumped-up charges and pays Rukeme people r bear false witness against him. He is not worried by the activities of other competitors. Though he refers to Oshevire as an upstart, Toje knows that -e is more organized, pays,his workers better salaries and enjoys better government patronage than he, Toje, does. He goes further to covet Oshevire's wife in his .absence, believing that he will be able to use her to revive his swindling virility. He therefore entices her with gifts of food, clothing and other commodities to make her yield to his advances.\nOdibo on his own part is deeply rankled by the constant abuse meted out to him by Chief Toje. He is always minded of his physical disability, which is seen by Toje as a weakness and sign of incapability. As a result, Odibo harbours a lot of resentment towards Toje and when he realizes his own feelings towards Aku, he begins to see Toje as a rival.\nHe goes all the way to having an affair with Aku, knowing the emotional and psychological effects this will have on Toje if it is discovered. He therefore does not hesitate to fight Toje almost to the point of death knowing that if he has the upper hand, he will be proving a point to himself and Toje at the same time he is not totally useless as assumed all As an extension, Okumagba, suffers from this unhealthy rivalry and feels cheated out of the action of the war.\nHe has joined the war believing he would be exposed to most of the action but he has been drafted to the menial job of having to merely watch over Aku and her son, more so as Aku is from the rebel tribe. He grudgingly carries out his assignment without enjoying it, being aware of Toje's moves on the one hand and that of Odibo on the other. There is also rivalry between the military personnel as demonstrated in the conflict over a girl between the sergeant and Private Sule leading to the shooting to death of the private.",
    "year": "2008"
  },
  {
    "number": "229",
    "text": "NON-AFRICAN PROSE \nGEORGE ELIOT: Scilas Manner \n \nDiscuss the theme of betrayal in the novel.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53359?exam_type=waec&type=theory&page=46",
    "correct_answer": "Rukeme is a teacher in St. Martins Mission School, Urukpe. He is the son of Udefe Rukeme a rubber farmer whose Dlantation is next to Oshevire's. Rukeme's father Udefe stole latex from Oshevire's farm and the theft was reported to Tle Otota. To avenge his father's humiliation, he agrees to bear false witness against Oshevire. He acts as a front for Chief Toje who pays him in cash for the job. Rukeme ends up being an inconsistent witness. He mixes up details in the memorandum when cross examined. He serves as the major tool used by Toje to keep Oshevire in detention for the length of time he does.\nRukeme's witnessing against Oshevire portrays him as being very vengeful. He is a liar who wickedly agrees to arnish the reputation of an innocent man. Rukeme serves as a foil to Oshevire's character. Whereas Oshevire sees his last duty as honesty integrity and obeying the voice of conscience, Rukeme has no qualms in helping to indict a clearly innocent man. Rukeme's behaviour is an indication of the moral decadence which is the hallmark of a society such as theirs embroiled in war. It is a sad indictment on the absence of honesty and integrity. Rukeme also accentuates the atmosphere the insecurity pervading the society.\nHere a man can be locked up on spurious charges and made to face false accusations without anyone seeing anything wrong with this. The reconciliation between Oshevire and Rukeme resulting from Rukeme's apology is a vindication of Oshevire's stand in refusing to succumb to the pressures of the society.\nThe theme of betrayal in Silas Marner is revealed through some relationships. Both in Lantern Yard and Raveloe, friendship and trust are betrayed under various conditions. These instances of betrayal immensely enhance the plot. Silas Marner's experience of betrayal in Lantern Yard is lumped together as his reason for leaving the town. While there, Silas is an ardent member of the church assembly. He has absolute faith in God and trusts his friend William Dane completely. His engagement to Sarah is known to and approved by the church. Sarah and William, however, betray Silas, and in his view, God betrays Silas as well. By the nature of Silas's simple faith in God and trust in man, the effect of this betrayal is devastating. Silas is epileptic, He has an attack in church.\nThe congregation is prepared to put it down to a divine visitation. Nilliam bitterly opposes this interpretation and bitingly suggests that it is more likely to be a result of satan's hold on Silas. William steals church money and has Silas accused of it. He takes Silas's Sarah and marries her as well. -leading to William, Sarah betrays Silas by leaving the poor weaver in the lurch. When the lot cast shows that Silas is the thief, he is naturally beside himself with bitterness against this 'God of lies' who, he believed, will \"clear\" him. In despair, Silas relocates to Raveloe.\nIn Raveloe, the spotlight is on Godfrey Cass. By his concealing his secret marriage to Molly Farren, and also his fatherhood of Eppie, Godfrey betrays the love of Nancy. Godfrey betrays his own family and their status by marrying Molly. By his neglect of Molly, Godfrey betrays Molly and the Farren family. This betrayal is added to by Godfrey's not owning up as Eppie father when Silas take the child to the Red House. In succumbing to Dunstan's threats and not being open in his management of the estate, he betrays Squire Cass's trust as well.",
    "explanation": "Rukeme is a teacher in St. Martins Mission School, Urukpe. He is the son of Udefe Rukeme a rubber farmer whose Dlantation is next to Oshevire's. Rukeme's father Udefe stole latex from Oshevire's farm and the theft was reported to Tle Otota. To avenge his father's humiliation, he agrees to bear false witness against Oshevire. He acts as a front for Chief Toje who pays him in cash for the job. Rukeme ends up being an inconsistent witness. He mixes up details in the memorandum when cross examined. He serves as the major tool used by Toje to keep Oshevire in detention for the length of time he does.\nRukeme's witnessing against Oshevire portrays him as being very vengeful. He is a liar who wickedly agrees to arnish the reputation of an innocent man. Rukeme serves as a foil to Oshevire's character. Whereas Oshevire sees his last duty as honesty integrity and obeying the voice of conscience, Rukeme has no qualms in helping to indict a clearly innocent man. Rukeme's behaviour is an indication of the moral decadence which is the hallmark of a society such as theirs embroiled in war. It is a sad indictment on the absence of honesty and integrity. Rukeme also accentuates the atmosphere the insecurity pervading the society.\nHere a man can be locked up on spurious charges and made to face false accusations without anyone seeing anything wrong with this. The reconciliation between Oshevire and Rukeme resulting from Rukeme's apology is a vindication of Oshevire's stand in refusing to succumb to the pressures of the society.\nThe theme of betrayal in Silas Marner is revealed through some relationships. Both in Lantern Yard and Raveloe, friendship and trust are betrayed under various conditions. These instances of betrayal immensely enhance the plot. Silas Marner's experience of betrayal in Lantern Yard is lumped together as his reason for leaving the town. While there, Silas is an ardent member of the church assembly. He has absolute faith in God and trusts his friend William Dane completely. His engagement to Sarah is known to and approved by the church. Sarah and William, however, betray Silas, and in his view, God betrays Silas as well. By the nature of Silas's simple faith in God and trust in man, the effect of this betrayal is devastating. Silas is epileptic, He has an attack in church.\nThe congregation is prepared to put it down to a divine visitation. Nilliam bitterly opposes this interpretation and bitingly suggests that it is more likely to be a result of satan's hold on Silas. William steals church money and has Silas accused of it. He takes Silas's Sarah and marries her as well. -leading to William, Sarah betrays Silas by leaving the poor weaver in the lurch. When the lot cast shows that Silas is the thief, he is naturally beside himself with bitterness against this 'God of lies' who, he believed, will \"clear\" him. In despair, Silas relocates to Raveloe.\nIn Raveloe, the spotlight is on Godfrey Cass. By his concealing his secret marriage to Molly Farren, and also his fatherhood of Eppie, Godfrey betrays the love of Nancy. Godfrey betrays his own family and their status by marrying Molly. By his neglect of Molly, Godfrey betrays Molly and the Farren family. This betrayal is added to by Godfrey's not owning up as Eppie father when Silas take the child to the Red House. In succumbing to Dunstan's threats and not being open in his management of the estate, he betrays Squire Cass's trust as well.",
    "year": "2008"
  },
  {
    "number": "230",
    "text": "NON-AFRICAN PROSE \nGEORGE ELIOT: Scilas Manner \n \nWith evidence from the novel, show that \"One reaps what one sows.\"",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53360?exam_type=waec&type=theory&page=46",
    "correct_answer": "There is ample evidence in the novel that one reaps what one sows. Many of the characters get what may be termed as just rewards for their conduct. Silas Marner, at the end of the novel, reaps tons of love and goodwill because he has sown love all his life. A simple weaver, he has loved his God, his church and brethren and his friends in Lantern Yard. Though these appear to have him down, he had to have returns on his investment in love. At Raveloe, he does not attempt to integrate himself into community.\nHowever, the loss of his money, closely followed by the appearance of Eppie, sets the stage for his halo of love. The unrestrained love that he showers on the child opens the floodgates of others' love to flow towards him Godfrey Cass, on the other hand, sows rejection and reaps just that. He abandons Molly and her little child. M attempts to get a Godfrey but is overtaken by the snow and her drunkenness. Godfrey, however, throws away the c opportunity to remove the curse of his shabby treatment of Molly when he fails to accept Eppie in the girl's childho Years later, when his new marriage is childless, he seeks to become father to Eppie but is pointedly rejected by Epl just as he has rejected her and her mother.\nMrs. Dolly Withrop is a compassionate woman. She cares about and desires \"to give comfort\" to Silas Merrier. tries to draw Silas back to God, and in the moments when his money has been stolen, Dolly is his good friend. With coming of Eppie, Dolly is drawn closer to Silas as she pours attention and affection on the child and its father in the ifc of gifts, companionship and good will. It is not surprising that, in the end, her son Aaron should marry Eppie, the ap of Silas' eye. A firm bond now exists between Dolly and Silas and they share the fruits of the love and affection that D reaps.\nDunstan Cass sows vice. He is treacherous, spiteful and callous. In the end he reaps treachery, spite and callousness, While Godfrey is weighed down by his past indiscretions and is preoccupied with getting on the right side of his fat Dunstan blackmails him with threats of exposure. Dustan steals Sila's gold and compels his brother to sell his hor In the end, Dunstan kills the horse, thus losing the price that Bryce has offered for it and falls into the treacherous p of water that takes his life. Even before we know his whereabouts, he is disowned by his father.",
    "explanation": "There is ample evidence in the novel that one reaps what one sows. Many of the characters get what may be termed as just rewards for their conduct. Silas Marner, at the end of the novel, reaps tons of love and goodwill because he has sown love all his life. A simple weaver, he has loved his God, his church and brethren and his friends in Lantern Yard. Though these appear to have him down, he had to have returns on his investment in love. At Raveloe, he does not attempt to integrate himself into community.\nHowever, the loss of his money, closely followed by the appearance of Eppie, sets the stage for his halo of love. The unrestrained love that he showers on the child opens the floodgates of others' love to flow towards him Godfrey Cass, on the other hand, sows rejection and reaps just that. He abandons Molly and her little child. M attempts to get a Godfrey but is overtaken by the snow and her drunkenness. Godfrey, however, throws away the c opportunity to remove the curse of his shabby treatment of Molly when he fails to accept Eppie in the girl's childho Years later, when his new marriage is childless, he seeks to become father to Eppie but is pointedly rejected by Epl just as he has rejected her and her mother.\nMrs. Dolly Withrop is a compassionate woman. She cares about and desires \"to give comfort\" to Silas Merrier. tries to draw Silas back to God, and in the moments when his money has been stolen, Dolly is his good friend. With coming of Eppie, Dolly is drawn closer to Silas as she pours attention and affection on the child and its father in the ifc of gifts, companionship and good will. It is not surprising that, in the end, her son Aaron should marry Eppie, the ap of Silas' eye. A firm bond now exists between Dolly and Silas and they share the fruits of the love and affection that D reaps.\nDunstan Cass sows vice. He is treacherous, spiteful and callous. In the end he reaps treachery, spite and callousness, While Godfrey is weighed down by his past indiscretions and is preoccupied with getting on the right side of his fat Dunstan blackmails him with threats of exposure. Dustan steals Sila's gold and compels his brother to sell his hor In the end, Dunstan kills the horse, thus losing the price that Bryce has offered for it and falls into the treacherous p of water that takes his life. Even before we know his whereabouts, he is disowned by his father.",
    "year": "2008"
  },
  {
    "number": "231",
    "text": "NON-AFRICAN PROSE \nRICHARD WRIGHT: Black Boy \n \nExamine the factors that make Richard a distinct personality.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53361?exam_type=waec&type=theory&page=47",
    "correct_answer": "Right from the beginning of the novel, we are introduced to a four year old boy who does not intend to maintain status quo — obedience to parental and social rule. Richard has a peculiar childhood full of all sorts of experience t a boy of his age should not have been exposed to. He admits that it is an early life without a father around.\nThis is because his father deserts his family and runs off with another woman. In order to make ends meet, his mother sei him to live with one relation or the other. At one time Richard is taken to an orphanage. All these afford Richard opportunity to come to term with the harsh realities of racial hatred and mistrust. Richard now gets to understand that the average Black American is faced with the struggle to find his footing i society full of hatred for his type. Thus Richard determines to strive against all odds in order to assert his human wo He rejects the advice of a friend, Griggs, to pretend before any white man. He stubbornly rejects the speech prepared him by the Principal at a Speech Day Ceremony. He becomes all the more ready to ready to improve his lot. These readings including Bluebeard and his Se, Wives deepen Richard's view of life and the world around him.\nThrough the national dailies, he gets to look for I-Mencken's works, especially 'Prejudices'. This books opens Richard's eyes to racial discrimination and prejudices gives him a \"new way of feeling and thinking\". As a result, these books help to shape his attitude to life. He now si that after all, his thoughts and fears concerning life are as real as life itself. The results of reading such books r encourage him to fight white codes of superiority complex. The more he reads, the more he discovers something 'terribly important' in what goes on around him until he finally makes up his mind to challenge authorities.\nThis explains his fights with Aunt Addle, the street gangsters and rejection of a gift of a dollar from a white man. How can he, a black boy take lightly all forces against his race? All these factors make Richard a peculiar personality full of intelligence, adventure and sharp imagination i \"barren\" culture.",
    "explanation": "Right from the beginning of the novel, we are introduced to a four year old boy who does not intend to maintain status quo — obedience to parental and social rule. Richard has a peculiar childhood full of all sorts of experience t a boy of his age should not have been exposed to. He admits that it is an early life without a father around.\nThis is because his father deserts his family and runs off with another woman. In order to make ends meet, his mother sei him to live with one relation or the other. At one time Richard is taken to an orphanage. All these afford Richard opportunity to come to term with the harsh realities of racial hatred and mistrust. Richard now gets to understand that the average Black American is faced with the struggle to find his footing i society full of hatred for his type. Thus Richard determines to strive against all odds in order to assert his human wo He rejects the advice of a friend, Griggs, to pretend before any white man. He stubbornly rejects the speech prepared him by the Principal at a Speech Day Ceremony. He becomes all the more ready to ready to improve his lot. These readings including Bluebeard and his Se, Wives deepen Richard's view of life and the world around him.\nThrough the national dailies, he gets to look for I-Mencken's works, especially 'Prejudices'. This books opens Richard's eyes to racial discrimination and prejudices gives him a \"new way of feeling and thinking\". As a result, these books help to shape his attitude to life. He now si that after all, his thoughts and fears concerning life are as real as life itself. The results of reading such books r encourage him to fight white codes of superiority complex. The more he reads, the more he discovers something 'terribly important' in what goes on around him until he finally makes up his mind to challenge authorities.\nThis explains his fights with Aunt Addle, the street gangsters and rejection of a gift of a dollar from a white man. How can he, a black boy take lightly all forces against his race? All these factors make Richard a peculiar personality full of intelligence, adventure and sharp imagination i \"barren\" culture.",
    "year": "2008"
  },
  {
    "number": "232",
    "text": "NON-AFRICAN PROSE \nRICHARD WRIGHT: Black Boy \n \nDiscuss the contributions of Mr. Crane and Mr Olin to the development of the plot.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/literature-in-english/53364?exam_type=waec&type=theory&page=47",
    "correct_answer": "Both Mr. Crane arid Mr. Olin are Richard's bosses in two different optics shop that Richard works in. Mr. Crane is a Yankee from Illinois. He represents those whites who are unbiased and vibrant to blacks but can nothing to change the harsh attitudes of whites towards black Americans. Mr Crane wants to give Richard a chance to train at his optical factory and thereby acquiring a useful life- long trade. But Mr. Crane's white employees, Reync and Pease, to whom he assigns the duty of training Richard, are not ready to train any \"nigger\" in a trade they se€ purely a white man's. Mr. Crane's good intentions are therefore seen by these two wicked whites as uncalled for.\nThey are determined to send Richard out of the job. Reynolds one day frames Richard up that he has referred to Pei without respect. At this allegation, poor Richard cannot defend himself against two whites who are determined to thi him out of a job from which he hopes to save money to get back to school. Even when Mr. Crane asks Richard to nary the incident the next day, he cannot. Mr. Crane on his part cannot help Richard. This experience as Richard sal slapped out the human race\" in him. In another part of South America. Richard is employed as an errand boy and charged with the duty of washing polishing eye glasses. His previous experience with Reynolds and Pease now teach him to be cautious with all wh including the one who willingly offers him a dollar to buy food.\nHere Richard's immediate supervisor Mr. Olin for apparent reason installs hatred between Richard and Harrison, another black boy who works in a nearby jewelery sh Mr. Olin takes delight in seeing two \"niggers\" hurt each other. It takes Richard and Harrison time to be able to uric stand Mr. Olin's plot against the black race in general. These two experiences convey the impression that most whites hate blacks and do not mind if the blacks go each other's throat. The blood-thirstiness of the whites is revealed in the comments they make during the fight: \"cry that nigger's guts!, \"Hit that nigger\", \"make him bleed\". These experiences further portray that blacks are seen as sub-human, merely tolerated for services they render.",
    "explanation": "Both Mr. Crane arid Mr. Olin are Richard's bosses in two different optics shop that Richard works in. Mr. Crane is a Yankee from Illinois. He represents those whites who are unbiased and vibrant to blacks but can nothing to change the harsh attitudes of whites towards black Americans. Mr Crane wants to give Richard a chance to train at his optical factory and thereby acquiring a useful life- long trade. But Mr. Crane's white employees, Reync and Pease, to whom he assigns the duty of training Richard, are not ready to train any \"nigger\" in a trade they se€ purely a white man's. Mr. Crane's good intentions are therefore seen by these two wicked whites as uncalled for.\nThey are determined to send Richard out of the job. Reynolds one day frames Richard up that he has referred to Pei without respect. At this allegation, poor Richard cannot defend himself against two whites who are determined to thi him out of a job from which he hopes to save money to get back to school. Even when Mr. Crane asks Richard to nary the incident the next day, he cannot. Mr. Crane on his part cannot help Richard. This experience as Richard sal slapped out the human race\" in him. In another part of South America. Richard is employed as an errand boy and charged with the duty of washing polishing eye glasses. His previous experience with Reynolds and Pease now teach him to be cautious with all wh including the one who willingly offers him a dollar to buy food.\nHere Richard's immediate supervisor Mr. Olin for apparent reason installs hatred between Richard and Harrison, another black boy who works in a nearby jewelery sh Mr. Olin takes delight in seeing two \"niggers\" hurt each other. It takes Richard and Harrison time to be able to uric stand Mr. Olin's plot against the black race in general. These two experiences convey the impression that most whites hate blacks and do not mind if the blacks go each other's throat. The blood-thirstiness of the whites is revealed in the comments they make during the fight: \"cry that nigger's guts!, \"Hit that nigger\", \"make him bleed\". These experiences further portray that blacks are seen as sub-human, merely tolerated for services they render.",
    "year": "2008"
  }
]