[
  {
    "number": "2075",
    "text": "Which of the following is not a factor of production?",
    "options": {
      "A": "Capital",
      "B": "Staffing",
      "C": "Labour",
      "D": "Land"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69110?exam_type=waec&type=obj&page=415",
    "correct_answer": "B",
    "explanation": "In economics, the four main factors of production are land, labor, capital, and entrepreneurship. Staffing is not considered a factor of production. It is rather a function of management that involves recruiting, selecting, training and developing employees.",
    "year": "2023"
  },
  {
    "number": "2076",
    "text": "The excess value of total assets over total liabilites is",
    "options": {
      "A": "capital owned",
      "B": "borrowed capital",
      "C": "paid-up capital",
      "D": "paid-up capital"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69111?exam_type=waec&type=obj&page=416",
    "correct_answer": "A",
    "explanation": "The excess of the assets over liabilites is called net assets or worth and it is equivalent to total equity, owner's equity or capital owned.",
    "year": "2023"
  },
  {
    "number": "2077",
    "text": "An element of a valid contract is",
    "options": {
      "A": "operation of law",
      "B": "performance",
      "C": "breach",
      "D": "capacity to contract"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69116?exam_type=waec&type=obj&page=416",
    "correct_answer": "D",
    "explanation": "The elements of a valid contract are: offer, consideration, acceptance, capacity to create legal intention and consent.",
    "year": "2023"
  },
  {
    "number": "2078",
    "text": "Industrial, commercial and service are types of",
    "options": {
      "A": "specialization",
      "B": "occupation",
      "C": "manufacturing",
      "D": "extraction"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69119?exam_type=waec&type=obj&page=416",
    "correct_answer": "B",
    "explanation": "Industrial, commercial, and service are types of occupations. An occupation is a job or profession. Industrial occupations involve the production of goods, commercial occupations involve trade, and service occupations involve providing services to others.",
    "year": "2023"
  },
  {
    "number": "2079",
    "text": "Operating a state owned enterprise with the intention of making more profit is",
    "options": {
      "A": "nationalization",
      "B": "deregulation",
      "C": "privatization",
      "D": "commercialization"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69121?exam_type=waec&type=obj&page=416",
    "correct_answer": "D",
    "explanation": "Commercialisation is a policy geared towards making state-owned enterprises to become more efficient and profit-oriented. The policy makes it possible for public enterprises to become more viable and effective.",
    "year": "2023"
  },
  {
    "number": "2080",
    "text": "An example of after-sales services is",
    "options": {
      "A": "sorting and grading of goods",
      "B": "granting of discount",
      "C": "provision of price list and terms",
      "D": "free replacement of parts"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69122?exam_type=waec&type=obj&page=416",
    "correct_answer": "D",
    "explanation": "After sale services are extra services sometimes made available to a customer after he has purchased the product in order to ensure continous patronage. These include: servicing, repairs and maintenance, provision of spare part, free replacement of faulty parts under guarantee etc.",
    "year": "2023"
  },
  {
    "number": "2081",
    "text": "An organization that could strive for improvement in electricity and telephone services to users is",
    "options": {
      "A": "a trade association",
      "B": "a manufacturers' association",
      "C": "a manufacturers' association",
      "D": "a consumers'association"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69134?exam_type=waec&type=obj&page=417",
    "correct_answer": "D",
    "explanation": "A consumer association is an organization that examines and compares products in oder to advise people on them as well as giving support to people who have problems with the things they buy or businesses they use.",
    "year": "2023"
  },
  {
    "number": "2082",
    "text": "A bill of lading that is tagged clean means that the goods being delivered are",
    "options": {
      "A": "on credit",
      "B": "not damaged",
      "C": "paid for",
      "D": "duty free"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69136?exam_type=waec&type=obj&page=417",
    "correct_answer": "B",
    "explanation": "A bill of lading is a legal document issued by a carrier (such as a shipping company or a freight forwarder) to acknowledge the receipt of goods for shipment. It serves as evidence of the contract of carriage and provides information about the goods, the parties involved, and the terms of transportation.When a bill of lading is tagged as \"clean,\" it indicates that the goods have been received by the carrier in apparent good condition. In other words, there are no visible signs of damage or discrepancies noted at the time of shipment. It implies that the goods are being delivered in the same condition as they were received by the carrier.The \"clean\" tag on a bill of lading does not necessarily indicate that the goods have been paid for, that they are on credit, or that they are duty-free. These aspects are typically handled separately and may depend on the terms of the underlying sale or agreement between the buyer and the seller.",
    "year": "2023"
  },
  {
    "number": "2083",
    "text": "The function of money that makes it generally acceptable is",
    "options": {
      "A": "unit of account",
      "B": "store of value",
      "C": "medium of exchange",
      "D": "standard of deferred payment"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69138?exam_type=waec&type=obj&page=417",
    "correct_answer": "C",
    "explanation": "Money can serve as a medium through which people can exchange goods and services. Money can be used to buy different variety of goods and services. This facilitates the means of exchange.",
    "year": "2023"
  },
  {
    "number": "2084",
    "text": "Dissolution of a partnership could arise from",
    "options": {
      "A": "fall in output",
      "B": "death of a member",
      "C": "non access to capital",
      "D": "increase in market share"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69139?exam_type=waec&type=obj&page=417",
    "correct_answer": "B",
    "explanation": "The following reasons can give rise to dissolution of partnership are: admission of new partner, insanity of partner, death of a partner, withdrawal or retirement of partner etc.",
    "year": "2023"
  },
  {
    "number": "2085",
    "text": "A problem associated with barter is",
    "options": {
      "A": "poor road network delaying transportation of goods",
      "B": "inability to measure what is to be exchanged",
      "C": "difficulty in collecting debt",
      "D": "inability to produce enough goods"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69140?exam_type=waec&type=obj&page=417",
    "correct_answer": "B",
    "explanation": "The problems or disadvantages of barter system are: no fixed exchange rate, problem of divisibility, double coincidence of want, it waste time and energy etc.",
    "year": "2023"
  },
  {
    "number": "2086",
    "text": "A voluntary association of businessmen who are not in the same line of business is a",
    "options": {
      "A": "bureau de change",
      "B": "trade association",
      "C": "chamber of commerce",
      "D": "trade union"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69142?exam_type=waec&type=obj&page=418",
    "correct_answer": "C",
    "explanation": "Chamber of commerce is an association of merchants, manufacturers and businessmen from different fields or various line of business who agree to come together in a town or city with the aim of representing and protecting their business interest.",
    "year": "2023"
  },
  {
    "number": "2087",
    "text": "A disadvantage of privatization is that",
    "options": {
      "A": "there is decline in the supply of goods",
      "B": "public interest outweighs the profit motive",
      "C": "income is unevenly distributed",
      "D": "there is less efficiency in the production of goods"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69144?exam_type=waec&type=obj&page=418",
    "correct_answer": "C",
    "explanation": "Income is often unevenly distributed as few individuals are now in control of the industries and also there will be reduction in employment.",
    "year": "2023"
  },
  {
    "number": "2088",
    "text": "A reduction in the value of a country's currency in relation to that of other countries is",
    "options": {
      "A": "revaluation",
      "B": "inflation",
      "C": "devaluation",
      "D": "deflation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69145?exam_type=waec&type=obj&page=418",
    "correct_answer": "C",
    "explanation": "Devaluation is the reduction in the value of the country's currency in terms of other currencies of the world. It is also a fall in the exchange value of a country's currency in relation to the currencies of other currencies.",
    "year": "2023"
  },
  {
    "number": "2089",
    "text": "The means by which a firm obtains information before introducing new products is",
    "options": {
      "A": "market segmentation",
      "B": "advertising",
      "C": "promotion",
      "D": "market research"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69146?exam_type=waec&type=obj&page=418",
    "correct_answer": "D",
    "explanation": "Market research is the study of consumers' demand by a firm in order to assist it in expanding its output and the marketing of its product. It is the systematic and objective search for and the analysis of information to guide managers in production and marketing.",
    "year": "2023"
  },
  {
    "number": "2090",
    "text": "A factor to be considered in selecting a means of transporting fish is the",
    "options": {
      "A": "demand for fish",
      "B": "supply of fish",
      "C": "cost of fish",
      "D": "nature of the fish"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69147?exam_type=waec&type=obj&page=418",
    "correct_answer": "D",
    "explanation": "The nature of the goods to be transported will determine the means of transportation to be used. Perishable and fragile goods for example, are better handled by fast means of transportation like aircraft while bulky goods are better handled by ship or rail.",
    "year": "2023"
  },
  {
    "number": "2091",
    "text": "A business that can obtain capital through of sale of shares is a",
    "options": {
      "A": "demurrage",
      "B": "freight",
      "C": "charge",
      "D": "dock due"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69148?exam_type=waec&type=obj&page=419",
    "correct_answer": "A",
    "explanation": "A public company, also known as a joint stock company or public liability company, is a business entity that can obtain capital by selling shares to the public through a process called initial public offering (IPO) or subsequent offerings. This allows the company to raise funds from a wide range of investors by offering ownership shares or equity in the company.",
    "year": "2023"
  },
  {
    "number": "2092",
    "text": "Which of the following countries is not a member of the European Union?",
    "options": {
      "A": "Greece",
      "B": "France",
      "C": "Denmark",
      "D": "Bolivia"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69156?exam_type=waec&type=obj&page=419",
    "correct_answer": "D",
    "explanation": "European union consist of 27 countries which are: Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherland, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden.",
    "year": "2023"
  },
  {
    "number": "2093",
    "text": "Advertising designed to sell more of a company's products than other brands is",
    "options": {
      "A": "persuasive",
      "B": "indirect",
      "C": "competitive",
      "D": "informative"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69158?exam_type=waec&type=obj&page=419",
    "correct_answer": "C",
    "explanation": "Competitive advertising is a type of advertising which is aimed at persuading customers to buy one brand of product in preference to another brand by another producer. It tries to woo customers to consume a product at the expense of another.",
    "year": "2023"
  },
  {
    "number": "2094",
    "text": "The reward for capital is",
    "options": {
      "A": "rent",
      "B": "interest",
      "C": "profit",
      "D": "dividend"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69298?exam_type=waec&type=obj&page=419",
    "correct_answer": "B",
    "explanation": "The reward for capital is interest.Interest: Interest is the reward or compensation paid to lenders or investors for the use of their capital. It is commonly associated with loans, bonds, or other debt instruments. Lenders or investors receive interest payments as a percentage of the principal amount lent or invested.",
    "year": "2023"
  },
  {
    "number": "2095",
    "text": "Divesting government interest in a business to the public is",
    "options": {
      "A": "commercialization",
      "B": "deregulation",
      "C": "privatization",
      "D": "nationalization"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69299?exam_type=waec&type=obj&page=419",
    "correct_answer": "C",
    "explanation": "Privatisation is a policy designed to enable individuals and private or corporate organisations take over the ownership and control of government business such as public companies and corporations.",
    "year": "2023"
  },
  {
    "number": "2096",
    "text": "Which of the following activities does not belong to the extractive industry?",
    "options": {
      "A": "Drilling",
      "B": "Mining",
      "C": "Barbing",
      "D": "Farming"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69300?exam_type=waec&type=obj&page=420",
    "correct_answer": "C",
    "explanation": "Barbing does not belong to the extractive industry. The extractive industry involves the extraction of natural resources from the earth such as oil, minerals, and gas. Barbing, on the other hand, is a service industry.",
    "year": "2023"
  },
  {
    "number": "2097",
    "text": "The use of brand names and trademarks is to",
    "options": {
      "A": "control the supply of goods",
      "B": "prevent imitation by competitors",
      "C": "stabilize the prices of goods",
      "D": "make after-sale service possible"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69301?exam_type=waec&type=obj&page=420",
    "correct_answer": "B",
    "explanation": "Brand names and trademarks allow companies to establish and control their brand identity and reputation. By creating a distinct brand name or trademark, a company can differentiate its products or services from competitors, ensuring that customers can identify and choose their offerings.",
    "year": "2023"
  },
  {
    "number": "2098",
    "text": "One of the aim of ECOWAS is to",
    "options": {
      "A": "ensure production of quality goods",
      "B": "encourage foreign investments",
      "C": "improve transportation and communication",
      "D": "promote privatization policies"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69302?exam_type=waec&type=obj&page=420",
    "correct_answer": "B",
    "explanation": "The main goal of ECOWAS is to promote economic cooperation among member states in order to raise living standards and promote economic development.",
    "year": "2023"
  },
  {
    "number": "2099",
    "text": "When a seller wishes to be paid before supplying goods, he would send the buyer a",
    "options": {
      "A": "consular invoice",
      "B": "consignment note",
      "C": "proforma invoice",
      "D": "credit note"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69303?exam_type=waec&type=obj&page=420",
    "correct_answer": "C",
    "explanation": "A proforma invoice is a preliminary or provisional invoice sent by a seller to the buyer before the actual delivery of goods or services. It provides detailed information about the goods or services to be supplied, including the quantity, description, price, and any terms or conditions of the sale. Unlike a regular invoice, a proforma invoice is not a request for payment but serves as a quotation or estimate that allows the buyer to review the proposed transaction and make payment arrangements before the actual delivery or completion of the order.By sending a proforma invoice, the seller communicates the terms and conditions of the sale to the buyer, including the payment requirements and expectations. It enables the buyer to assess the costs, terms, and other details of the transaction before making a commitment.",
    "year": "2023"
  },
  {
    "number": "2100",
    "text": "A similarity of private and public company is that they",
    "options": {
      "A": "sell shares on the stock exchange",
      "B": "have equal number of members",
      "C": "receive certificate of incorporation",
      "D": "are required to publish their final accounts"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69304?exam_type=waec&type=obj&page=420",
    "correct_answer": "C",
    "explanation": "They both raise capital through the sales of share, they both require more than one person to start, they are controlled by a board of directors and they have separate legal status.A certificate of incorporation is a legal document issued by the government or relevant authority that confirms the formation and registration of a company as a legal entity. Both private and public companies go through the process of obtaining a certificate of incorporation, which grants them the status of a legally recognized business entity.",
    "year": "2023"
  },
  {
    "number": "2101",
    "text": "The term 2%/15 net 30 represents a",
    "options": {
      "A": "seasonal discount",
      "B": "quantity discount",
      "C": "cash discount",
      "D": "trade discount"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69305?exam_type=waec&type=obj&page=421",
    "correct_answer": "C",
    "explanation": "2%/15 net 30 means that if the customer pays within 15 days of receiving the goods, he may take 2% off the amount stated in the invoice, if does not, he will have to pay the full stated in the invoice within 30 days.",
    "year": "2023"
  },
  {
    "number": "2102",
    "text": "Buying and selling products through a network of digital devices is",
    "options": {
      "A": "e-commerce",
      "B": "e-payment",
      "C": "e-transfer",
      "D": "e-mail"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69306?exam_type=waec&type=obj&page=421",
    "correct_answer": "A",
    "explanation": "E-commerce, also known as electronic commerce, refers to the buying and selling of goods or services using the internet, and the transfer of money and data to execute these transactions. It is conducted on computers, tablets, smartphones, and other digital devices. It includes online shopping, electronic payments, online auctions, internet banking, and online ticketing.",
    "year": "2023"
  },
  {
    "number": "2103",
    "text": "A document in which the internal regulations of a company are stated is",
    "options": {
      "A": "Certificate of Incoporation",
      "B": "Articles of Association",
      "C": "Memorandum of Association",
      "D": "Partnership Deed"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69307?exam_type=waec&type=obj&page=421",
    "correct_answer": "B",
    "explanation": "Articles of Association form a document that specifies the regulations for a company's operations and defines the company's purpose. The document lays out how tasks are to be accomplished within the organization, including the process for appointing directors and the handling of financial records.",
    "year": "2023"
  },
  {
    "number": "2104",
    "text": "Which of the following is not a type of security?",
    "options": {
      "A": "Stock",
      "B": "Overdraft",
      "C": "Share",
      "D": "Debenture"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69308?exam_type=waec&type=obj&page=421",
    "correct_answer": "B",
    "explanation": "A security is a financial instrument, typically and financial asset that can be traded e.g bonds, debenture, stock, shares etc.",
    "year": "2023"
  },
  {
    "number": "2105",
    "text": "An advantage of road transport over other means of transport is that",
    "options": {
      "A": "packing and loading is easy as activities are handled by experts",
      "B": "canteen services are provided during the course of transportation",
      "C": "specific vehicles could be used to carry certain loads",
      "D": "terminal handling is eliminated by door-to-door delivery"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69309?exam_type=waec&type=obj&page=421",
    "correct_answer": "D",
    "explanation": "Road transport offers the convenience of delivering goods directly from the origin to the destination without the need for intermediate handling at terminals. This is known as door-to-door delivery. Unlike other means of transport, such as rail or air transport, where goods often need to be transferred and handled at terminals, road transport allows for seamless transportation from the shipper's location to the recipient's location.",
    "year": "2023"
  },
  {
    "number": "2106",
    "text": "Which of the following modes of transport could be used to convey both liquid and gas?",
    "options": {
      "A": "Aeroplane",
      "B": "Tanker",
      "C": "Tramp",
      "D": "Ferry"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69310?exam_type=waec&type=obj&page=422",
    "correct_answer": "B",
    "explanation": "A tanker is a specialized type of vessel or vehicle designed for the transportation of liquids or gases in bulk. Tankers are constructed with storage tanks specifically designed to safely transport and store various substances, including liquids and gases.Tankers can transport a wide range of materials, such as crude oil, petroleum products, chemicals, liquefied natural gas (LNG), liquefied petroleum gas (LPG), and other liquid or gaseous commodities.",
    "year": "2023"
  },
  {
    "number": "2107",
    "text": "Which of the following is not a form of sales promotion?",
    "options": {
      "A": "Cash on delivery",
      "B": "Cash on delivery",
      "C": "Free samples",
      "D": "Buy one get one free"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69311?exam_type=waec&type=obj&page=422",
    "correct_answer": "B",
    "explanation": "The forms of sales promotion are: free sample, special price sales, premium offer, competitions, trade fairs, special discounts, co-operative advert, free goods.",
    "year": "2023"
  },
  {
    "number": "2108",
    "text": "The business in which sale of goods involves use of vehicles is a",
    "options": {
      "A": "mobile shop",
      "B": "chain store",
      "C": "shopping mail",
      "D": "tied shop"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69313?exam_type=waec&type=obj&page=422",
    "correct_answer": "A",
    "explanation": "Mobile shops are where goods are arranged in a motor van and are moved from one place to another to reach the final consumers. They are moved from one place to another in lorries, wheelbarrows, motor vans, bicycles, or motor bikes to sell goods and different advertising techniques are used to create awareness for the wares.",
    "year": "2023"
  },
  {
    "number": "2109",
    "text": "The arrangement for the conveyance of goods abroad is performed by the",
    "options": {
      "A": "customs and excise authority",
      "B": "ports authority",
      "C": "clearing and forwarding agents",
      "D": "chamber of commerce"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69314?exam_type=waec&type=obj&page=422",
    "correct_answer": "C",
    "explanation": "Clearing and forwarding agents are experts who provide assistance to get goods cleared through customs formalities, coordinate with the carrier and handle shipping and delivery.",
    "year": "2023"
  },
  {
    "number": "2110",
    "text": "An organizational chart is used to",
    "options": {
      "A": "determine the departmental objectives and targets",
      "B": "show the hierarchy of staff",
      "C": "measure variation on staff performance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69316?exam_type=waec&type=obj&page=422",
    "correct_answer": "B",
    "explanation": "Organisational chart is also known as ORGANOGRAM. It is a chart is a diagrammatic representation of the relationship between the various organs of the organisation, i.e the structure of the organisation. It shows the line of authority and responsibility.",
    "year": "2023"
  },
  {
    "number": "2111",
    "text": "The rate at which a country's export exchange for its imports is",
    "options": {
      "A": "terms of payment",
      "B": "terms of trade",
      "C": "balance of payment",
      "D": "balance of trade"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69317?exam_type=waec&type=obj&page=423",
    "correct_answer": "B",
    "explanation": "The rate at which a country's export exchange for its imports is known as the 'terms of trade'. The terms of trade are the ratio of an index of a country's export prices to an index of its import prices. It shows the quantity of import goods an economy can purchase per unit of export goods.",
    "year": "2023"
  },
  {
    "number": "2112",
    "text": "A source of capital to a cooperative society is",
    "options": {
      "A": "contribution",
      "B": "debenture",
      "C": "retained profit",
      "D": "ordinary share"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69318?exam_type=waec&type=obj&page=423",
    "correct_answer": "A",
    "explanation": "Deposits of members, loans obtained from financial institutions, part of dividend called retained earning etc.",
    "year": "2023"
  },
  {
    "number": "2113",
    "text": "The department that ensures that products are made available to consumers is",
    "options": {
      "A": "purchases",
      "B": "finance",
      "C": "marketing",
      "D": "production"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69319?exam_type=waec&type=obj&page=423",
    "correct_answer": "C",
    "explanation": "The marketing department focuses on promoting and distributing products to ensure they reach consumers effectively.",
    "year": "2023"
  },
  {
    "number": "2114",
    "text": "An advantage of advertising is that",
    "options": {
      "A": "prices of products are reduced",
      "B": "awareness is created on the existence of products",
      "C": "quality of products is improved",
      "D": "distribution channels for products are improved"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69321?exam_type=waec&type=obj&page=423",
    "correct_answer": "B",
    "explanation": "One of the advantage of advertising is that, it helps in creating awarenes for a product and also advertising provides information about the existence of a product.",
    "year": "2023"
  },
  {
    "number": "2115",
    "text": "The management function that is concerned with coordinating business resources efficiently is",
    "options": {
      "A": "organizing",
      "B": "controlling",
      "C": "planning",
      "D": "motivation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69323?exam_type=waec&type=obj&page=423",
    "correct_answer": "A",
    "explanation": "Organising is a function which involves the bringing together or arranging whatever resources that are available, e.g people, time, money, equipment to achieve the objectives of an organisation. organising involves the division of work into different sections, allocating responsibilities and authority to all components of the organisations in order to achieve the objectives.",
    "year": "2023"
  },
  {
    "number": "2116",
    "text": "Use the diagram to answer the question\n\n\nThe instrument in the diagram is a",
    "options": {
      "A": "cheque",
      "B": "money order",
      "C": "deposit slip",
      "D": "warrant"
    },
    "diagram_url": "https://myschool.ng/storage/classroom/Tt7tkav22Opr1dMIL9Qz2wCBPFmDxTQNRNnkxNGk.png",
    "answer_url": "https://myschool.ng/classroom/commerce/69326?exam_type=waec&type=obj&page=424",
    "correct_answer": "A",
    "explanation": "The instrument in the diagram is a cheque.",
    "year": "2023"
  },
  {
    "number": "2117",
    "text": "Use the diagram to answer the question\n\n\nThe two lines on the instrument shows that it is",
    "options": {
      "A": "altered",
      "B": "crossed",
      "C": "cancelled",
      "D": "paid"
    },
    "diagram_url": "https://myschool.ng/storage/classroom/YzoVpQb2KaOiNMtgNHFM3LgAS5QilEF5Jb1DF2cK.png",
    "answer_url": "https://myschool.ng/classroom/commerce/69327?exam_type=waec&type=obj&page=424",
    "correct_answer": "B",
    "explanation": "Crossed cheque is a cheque having two parallel lines drawn across the its face. It cannot be cashed at the counter; it must be paid into a current account.",
    "year": "2023"
  },
  {
    "number": "2118",
    "text": "Use the diagram to answer the question\n\n\nThe instrument will not be valid on",
    "options": {
      "A": "September 25, 2023",
      "B": "July 25, 2023",
      "C": "October 25, 2023",
      "D": "June 25, 2023"
    },
    "diagram_url": "https://myschool.ng/storage/classroom/reTOvdyaBBmkjRepFOzH82nVYBXUd3T1Th2iJ5R4.png",
    "answer_url": "https://myschool.ng/classroom/commerce/69328?exam_type=waec&type=obj&page=424",
    "correct_answer": "D",
    "explanation": "The instrument will not ba valid when it is over 60 or 90 days. Therefore, the instrument will be valid on June 25, 2023.",
    "year": "2023"
  },
  {
    "number": "2119",
    "text": "The bank that conducts research on an economy, thereby identifying obstacles to growth is the",
    "options": {
      "A": "commercial bank",
      "B": "mortgage bank",
      "C": "development bank",
      "D": "central bank"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69331?exam_type=waec&type=obj&page=424",
    "correct_answer": "C",
    "explanation": "Development banks are financial institutions that focus on providing long-term financing and support for economic development projects and initiatives. They play a vital role in promoting economic growth and addressing various obstacles to development within an economy.One of the key functions of a development bank is to conduct research and analysis on the economy it operates in. This research helps identify obstacles or challenges to economic growth, such as infrastructure gaps, financing needs, industry bottlenecks, regulatory hurdles, and other barriers that hinder development.",
    "year": "2023"
  },
  {
    "number": "2120",
    "text": "A duty of the principal to his agent is to",
    "options": {
      "A": "stop the sale of good in transit",
      "B": "pay the agent for services rendered",
      "C": "disclose confidential information",
      "D": "renegotiate agreements made by the agent"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69332?exam_type=waec&type=obj&page=424",
    "correct_answer": "B",
    "explanation": "The duties include: he must provide all necessary facilities to the agent for proper execution of the contract, pay the agent the commission or other agreed remuneration and also indemnify the agent for any expenses or losses incurred by the agents.",
    "year": "2023"
  },
  {
    "number": "2121",
    "text": "One of the barriers to foreign trade is",
    "options": {
      "A": "imposition of embargo",
      "B": "removal of tarrif",
      "C": "trade liberalization",
      "D": "memorandum of understanding"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69333?exam_type=waec&type=obj&page=425",
    "correct_answer": "A",
    "explanation": "Flexible customs regulations and tariff limit the extent of foreign trade i.e imposition of tariff - quotas, exchange rates control.",
    "year": "2023"
  },
  {
    "number": "2122",
    "text": "In a contract of sale, the amount deposited with the seller for a particular product by a buyer is",
    "options": {
      "A": "consideration",
      "B": "warranty",
      "C": "counter offer",
      "D": "acceptance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/69334?exam_type=waec&type=obj&page=425",
    "correct_answer": "A",
    "explanation": "Consideration is a legal term used to describe the benefit each party to a contract receives. This is often payment in exchange for goods or services.",
    "year": "2023"
  }
]