[
  {
    "number": "17",
    "text": "(a) Stat three ways in which specimen A (Tapeworm) is of economic importance.\n(b) State four ways of controlling specimen A\n(c) List three nutrients contained in specimen B (Fish meal)\n(d) Name two ectoparasites that could infest the farm animal from which specimen C (Hide of cattle) was obtained.\n(e) Mention three uses of specimen C",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59784?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "18",
    "text": "(a) Mention three nutrients that could be found in specimen G.\n(b) List three ways of preserving specimen G.\n(c) State two functions of specimen H in farm animals.\n(d) Describe two features of specimen H which enables it to perform the functions stated in 2(c) above.\n(e) Name three farm animals which possess specimen H.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59790?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "19",
    "text": "(a) State three disadvantages of using specimen J (Hurricane Lantern) in a poultry house.\n(b) Mention two precautions that should be taken using specimen J.\n(c) State three uses of specimen K (Snail).\n(d) Mention three feedstuffs that could be used in feeding specimen K.\n(e) Enumerate four uses of specimen L (knife) on an animal farm.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59792?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "20",
    "text": "(a) Outline the steps involved in processing specimen P into blood meal.\n(b) Name two nutrients supplied by blood meal.\n(c) Name two types of housing units for keeping specimen Q.\n(d) Mention four products that could be obtained from specimen Q.\n(e) Name two ectoparasites that could infest specimen Q.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/animal-husbandry/59826?exam_type=waec&type=practical&page=4",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  }
]