[
  {
    "number": "32",
    "text": "Describe the role of Zayd b. Thabit in the preservation of the Qur;ān.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56438?exam_type=waec&type=theory&page=7",
    "correct_answer": "According to Islamic traditions,Zayd bin Thabit(Arabic: زيد بن ثابت‎) was the personalscribeof the Islamic prophetMuhammad, and was from theansar(helpers). He joined the ranks of the Muslim army at age 19. After Muhammad's passing, he was ordered to collect the Quran into a single volume from various written and oral sources. He was a noted expert on theQuranand spent much time reciting it.\nWhen Zayd was 6 years old his father died in theBattle of Bu'ath. Zayd was 11 years old when he asked permission to participate in theBattle of Badr. Since he was younger than 15 years old, Muhammad did not allow him to do so and sent him back. He then decided to try to win favour with Muhammad by learning theQuran. He was later appointed to write letters to non-Muslims and to collect and keep a record of the Qur'anic verses. Zayd was among those chosen by Muhammad to write down the verses of the Quran. He used to spend most of his time reciting the Quran and continued to learn the Quranic verses as they were recited by Muhammad. Zayd later volunteered to fight when he was 19 years old. This time he was accepted in the ranks of the Muslim army. Zayd's time to fight had come nine years after the establishment of the Muslim community in Medina.\nZayd had the role of writing down the Quranic verses that Muslims believe were sent to Muhammad from Allah through the AngelJibrail.\nAfter Muhammad's death, Zayd, who by this time had become an expert in the Quran, was assigned the role of authenticating and collecting the oral and textual Quranic revelation into a single bounded volume. This initiative was high on the CaliphAbu Bakr's agenda, especially after theRidda wars, and theBattle of Yamamahin particular, in which a large number of Quran memorizers perished. Umar convinced Abu Bakr that the Quran should be collected in one manuscript. During Abu Bakr's reign as caliph, he was given the task of collecting the Quranic verses from all over the Muslim communities. Zayd finally accepted the task and, according to him, started locating the Quranic material and collecting it from parchments, scapula, leafstalks of date palms and from the memories of men. When Zayd had completed his task, he left the prepared sheets with Abu Bakr. Before he died, Abu Bakr left the sheets with Umar who in turn left it with his daughter Hafsah. Hafsah, Umm Salamah and Aishah were wives of Muhammad who memorized the Quran.\nZayd ibn Thabit thus became one of the foremost authorities on the Quran.Umar ibn al-Khattabonce addressed the Muslims and said: \"O people, whoever wants to ask about the Quran, let him go to Zayd ibn Thabit.\"",
    "explanation": "According to Islamic traditions,Zayd bin Thabit(Arabic: زيد بن ثابت‎) was the personalscribeof the Islamic prophetMuhammad, and was from theansar(helpers). He joined the ranks of the Muslim army at age 19. After Muhammad's passing, he was ordered to collect the Quran into a single volume from various written and oral sources. He was a noted expert on theQuranand spent much time reciting it.\nWhen Zayd was 6 years old his father died in theBattle of Bu'ath. Zayd was 11 years old when he asked permission to participate in theBattle of Badr. Since he was younger than 15 years old, Muhammad did not allow him to do so and sent him back. He then decided to try to win favour with Muhammad by learning theQuran. He was later appointed to write letters to non-Muslims and to collect and keep a record of the Qur'anic verses. Zayd was among those chosen by Muhammad to write down the verses of the Quran. He used to spend most of his time reciting the Quran and continued to learn the Quranic verses as they were recited by Muhammad. Zayd later volunteered to fight when he was 19 years old. This time he was accepted in the ranks of the Muslim army. Zayd's time to fight had come nine years after the establishment of the Muslim community in Medina.\nZayd had the role of writing down the Quranic verses that Muslims believe were sent to Muhammad from Allah through the AngelJibrail.\nAfter Muhammad's death, Zayd, who by this time had become an expert in the Quran, was assigned the role of authenticating and collecting the oral and textual Quranic revelation into a single bounded volume. This initiative was high on the CaliphAbu Bakr's agenda, especially after theRidda wars, and theBattle of Yamamahin particular, in which a large number of Quran memorizers perished. Umar convinced Abu Bakr that the Quran should be collected in one manuscript. During Abu Bakr's reign as caliph, he was given the task of collecting the Quranic verses from all over the Muslim communities. Zayd finally accepted the task and, according to him, started locating the Quranic material and collecting it from parchments, scapula, leafstalks of date palms and from the memories of men. When Zayd had completed his task, he left the prepared sheets with Abu Bakr. Before he died, Abu Bakr left the sheets with Umar who in turn left it with his daughter Hafsah. Hafsah, Umm Salamah and Aishah were wives of Muhammad who memorized the Quran.\nZayd ibn Thabit thus became one of the foremost authorities on the Quran.Umar ibn al-Khattabonce addressed the Muslims and said: \"O people, whoever wants to ask about the Quran, let him go to Zayd ibn Thabit.\"",
    "year": "2015"
  },
  {
    "number": "33",
    "text": "Discuss the life of īsa b. Maryam from the Islamic point of view.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56439?exam_type=waec&type=theory&page=7",
    "correct_answer": "Mary (Arabic: مَرْيَم‎,Maryam), themotherofIsa(Jesus), holds a singularly exalted place inIslamas the only woman named in theQuran, which refers to her seventy times and explicitly identifies her as the greatest of all women,[1][2][3]stating, with reference to the angelic saluation during theannunciation, \"O Mary, God has chosen you, and purified you; He has chosen you above all the women of creation.\"[4]In the Quran, her story is related in threeMeccan chapters(19, 21, 23) and fourMedinan chapters(3, 4, 5, 66), and the nineteenth chapter (sūrah) of the scripture, titled \"Mary\" (Maryam), is named after her. The Quran refers to Mary more often than theBible.[5]\nMary and Jesus in aPersian miniature[6]\nAccording to the Quran, divine grace surrounded Mary from birth, and, as a young woman, she received a message from God through thearchangel Gabrielthat God had chosen her, purified her, and had preferred her above all \"the women of the worlds.\"[7]This event, according to the same narrative, was followed by theannunciationof a child who was to be miraculously conceived by her through the intervention of thedivine spiritwhile she was stillvirgin, whose name would beJesusand who would be the \"anointed one,\" thePromised Messiah. As such, orthodox Islamic belief \"has upheld the tenet of thevirgin birth of Jesus,\"[7]and although the classical Islamic thinkers never dwelt on the question of theperpetual virginity of Maryat any great length,[7]it was generally agreed in traditional Islam that Mary remained a virgin throughout her life, with the Quran's mention of Mary's purification “from the touch of men” implying perpetual virginity in the minds of many of the most prominent Islamic fathers.",
    "explanation": "Mary (Arabic: مَرْيَم‎,Maryam), themotherofIsa(Jesus), holds a singularly exalted place inIslamas the only woman named in theQuran, which refers to her seventy times and explicitly identifies her as the greatest of all women,[1][2][3]stating, with reference to the angelic saluation during theannunciation, \"O Mary, God has chosen you, and purified you; He has chosen you above all the women of creation.\"[4]In the Quran, her story is related in threeMeccan chapters(19, 21, 23) and fourMedinan chapters(3, 4, 5, 66), and the nineteenth chapter (sūrah) of the scripture, titled \"Mary\" (Maryam), is named after her. The Quran refers to Mary more often than theBible.[5]\nMary and Jesus in aPersian miniature[6]\nAccording to the Quran, divine grace surrounded Mary from birth, and, as a young woman, she received a message from God through thearchangel Gabrielthat God had chosen her, purified her, and had preferred her above all \"the women of the worlds.\"[7]This event, according to the same narrative, was followed by theannunciationof a child who was to be miraculously conceived by her through the intervention of thedivine spiritwhile she was stillvirgin, whose name would beJesusand who would be the \"anointed one,\" thePromised Messiah. As such, orthodox Islamic belief \"has upheld the tenet of thevirgin birth of Jesus,\"[7]and although the classical Islamic thinkers never dwelt on the question of theperpetual virginity of Maryat any great length,[7]it was generally agreed in traditional Islam that Mary remained a virgin throughout her life, with the Quran's mention of Mary's purification “from the touch of men” implying perpetual virginity in the minds of many of the most prominent Islamic fathers.",
    "year": "2015"
  },
  {
    "number": "34",
    "text": "Enumerate four rights of children in Islam and explain how they could be abused.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56440?exam_type=waec&type=theory&page=7",
    "correct_answer": "Children have the right to be fed, clothed, and protected until they reach adulthood.Children must have the respect, to enjoy love and affection from their parents.Children have the right to be treated equally, vis-a-vis their siblings in terms of financial gifts.\nImam Ahmad bin Hanbal said that preferential treatment of a child is permitted if he or she is handicapped while others are not. (In Al-Mughni, vol. 5, p. 605, it is stated that special treatment of a child is permissible due to a need, a handicap, blindness, his or her being from a large family, being engaged in studies, or something of the sort, as it is also permitted to withhold from a child who would spend what he is given on sinful or wicked things.)\nThe child has the right to be not forced by its step parents or its birth parents.",
    "explanation": "Children have the right to be fed, clothed, and protected until they reach adulthood.Children must have the respect, to enjoy love and affection from their parents.Children have the right to be treated equally, vis-a-vis their siblings in terms of financial gifts.\nImam Ahmad bin Hanbal said that preferential treatment of a child is permitted if he or she is handicapped while others are not. (In Al-Mughni, vol. 5, p. 605, it is stated that special treatment of a child is permissible due to a need, a handicap, blindness, his or her being from a large family, being engaged in studies, or something of the sort, as it is also permitted to withhold from a child who would spend what he is given on sinful or wicked things.)\nThe child has the right to be not forced by its step parents or its birth parents.",
    "year": "2015"
  },
  {
    "number": "35",
    "text": "Examine the activities of Prophet Muhammad (S.A.W.) in the first two years of his stay in Yathrib.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56441?exam_type=waec&type=theory&page=7",
    "correct_answer": "On September 24, 622, the prophet Muhammad completes hisHegira,or “flight,” from Mecca to Medina to escape persecution. In Medina, Muhammad set about building the followers of his religion—Islam—into an organized community and Arabian power. The Hegira would later mark the beginning (year 1) of the Muslim calendar.\nMuhammad, one of the most influential religious and political leaders in history, was born in Mecca around 570. His father died before he was born, and Muhammad was put under the care of his grandfather, head of the prestigious Hashim clan. His mother died when he was six, and his grandfather when he was eight, leaving him under the care of his uncle Abu Talib, the new head of the clan. When he was 25, Muhammad married a wealthy widow 15 years his senior. He lived the next 15 years as a merchant, and his wife gave birth to six children: two sons, who died in childhood, and four daughters.\nFrom time to time, Muhammad spent nights in a cave in Mount Hira north of Mecca, ruminating on the social ills of the city. Around 610, he had a vision in the cave in which he heard the voice of a majestic being, later identified as the angel Gabriel, say to him, “You are the Messenger of God.” Thus began a lifetime of religious revelations, which he and others collected as the Qur’an, or Koran. Muhammad regarded himself as the last prophet of the Judaic-Christian tradition, and he adopted aspects of these older religions’ theologies while introducing new doctrines. Muhammad’s monotheistic religion came to be calledIslam,meaning “surrender [to God],” and its followers wereMuslims,meaning “those who have surrendered.” His inspired teachings would bring unity to the Arabian peninsula, an event that had sweeping consequences for the rest of the world.\nBy 615, Muhammad had gained about 100 converts in Mecca. He spoke out against rich merchants, who he criticized as immoral in their greed, and he denounced the worshipping of idols and multiple gods, saying, “There is no god but God.” City leaders became hostile to him, and in 619 his uncle Abu Talib died and was succeeded as head of the Hashim clan by another one of Muhammad’s uncles, Abu Lahib. Abu Lahib refused to protect Muhammad, and persecution of the prophet and his Muslims increased.\nIn the summer of 621, an entourage of 12 men came to Mecca from Medina, an oasis community 200 miles to the north. They were ostensibly making a pilgrimage to Mecca’s pagan shrines, but they had actually come to meet with Muhammad and profess themselves as Muslims. In 622, a larger group of converts from Medina came to Mecca and took an oath to Muhammad to defend him as their own kin. Muhammad immediately encouraged his Meccan followers to make their way to Medina in small groups. When city authorities learned that the Muslims had begun an exodus, they plotted to have the prophet killed. Under this threat, Muhammad slipped away unnoticed with a chief disciple and made his way to Medina, using unfrequented paths. He completed the celebrated Hegira (Hijrahin uncorrupted Arabic) on September 24, 622. The history of Islam had begun.\nAt Medina, Muhammad built a theocratic state and led raids on trading caravans from Mecca. Attempts by Meccan armies to defeat the Muslim forces failed, and several leading Meccans immigrated to Medina and became Muslims. Muhammad later become more conciliatory to Mecca, and in 629 he was allowed to lead a pilgrimage there in exchange for a peace treaty. Shortly after, he was attacked by allies of the Meccans, and Muhammad denounced the treaty. In January 630, he returned to his birthplace with 10,000 men, and the Meccans swore allegiance to its Muslim conquerors. He was now the strongest man in Arabia. During the next few years, most of the peninsula’s disparate Arab tribes came to him to ask for alliance and to convert to his religion. By his death, on June 8, 632, Muhammad was the effective ruler of most of Arabia, and his rapidly growing empire was poised for expansion into Syria and Iraq.\nWithin 20 years, the Byzantine and Persian empires had fallen to the prophet’s successors, and during the next two centuries vast Arab conquests continued. The Islamic empire grew into one of the largest the world has ever seen, stretching from India, across the Middle East and Africa, and up through Western Europe’s Iberian peninsula. The spread of Islam continued after the fragmentation of the Arab empire, and many societies in Africa and Asia voluntarily adopted Muhammad’s religion. Today, Islam is the world’s second-largest religion.",
    "explanation": "On September 24, 622, the prophet Muhammad completes hisHegira,or “flight,” from Mecca to Medina to escape persecution. In Medina, Muhammad set about building the followers of his religion—Islam—into an organized community and Arabian power. The Hegira would later mark the beginning (year 1) of the Muslim calendar.\nMuhammad, one of the most influential religious and political leaders in history, was born in Mecca around 570. His father died before he was born, and Muhammad was put under the care of his grandfather, head of the prestigious Hashim clan. His mother died when he was six, and his grandfather when he was eight, leaving him under the care of his uncle Abu Talib, the new head of the clan. When he was 25, Muhammad married a wealthy widow 15 years his senior. He lived the next 15 years as a merchant, and his wife gave birth to six children: two sons, who died in childhood, and four daughters.\nFrom time to time, Muhammad spent nights in a cave in Mount Hira north of Mecca, ruminating on the social ills of the city. Around 610, he had a vision in the cave in which he heard the voice of a majestic being, later identified as the angel Gabriel, say to him, “You are the Messenger of God.” Thus began a lifetime of religious revelations, which he and others collected as the Qur’an, or Koran. Muhammad regarded himself as the last prophet of the Judaic-Christian tradition, and he adopted aspects of these older religions’ theologies while introducing new doctrines. Muhammad’s monotheistic religion came to be calledIslam,meaning “surrender [to God],” and its followers wereMuslims,meaning “those who have surrendered.” His inspired teachings would bring unity to the Arabian peninsula, an event that had sweeping consequences for the rest of the world.\nBy 615, Muhammad had gained about 100 converts in Mecca. He spoke out against rich merchants, who he criticized as immoral in their greed, and he denounced the worshipping of idols and multiple gods, saying, “There is no god but God.” City leaders became hostile to him, and in 619 his uncle Abu Talib died and was succeeded as head of the Hashim clan by another one of Muhammad’s uncles, Abu Lahib. Abu Lahib refused to protect Muhammad, and persecution of the prophet and his Muslims increased.\nIn the summer of 621, an entourage of 12 men came to Mecca from Medina, an oasis community 200 miles to the north. They were ostensibly making a pilgrimage to Mecca’s pagan shrines, but they had actually come to meet with Muhammad and profess themselves as Muslims. In 622, a larger group of converts from Medina came to Mecca and took an oath to Muhammad to defend him as their own kin. Muhammad immediately encouraged his Meccan followers to make their way to Medina in small groups. When city authorities learned that the Muslims had begun an exodus, they plotted to have the prophet killed. Under this threat, Muhammad slipped away unnoticed with a chief disciple and made his way to Medina, using unfrequented paths. He completed the celebrated Hegira (Hijrahin uncorrupted Arabic) on September 24, 622. The history of Islam had begun.\nAt Medina, Muhammad built a theocratic state and led raids on trading caravans from Mecca. Attempts by Meccan armies to defeat the Muslim forces failed, and several leading Meccans immigrated to Medina and became Muslims. Muhammad later become more conciliatory to Mecca, and in 629 he was allowed to lead a pilgrimage there in exchange for a peace treaty. Shortly after, he was attacked by allies of the Meccans, and Muhammad denounced the treaty. In January 630, he returned to his birthplace with 10,000 men, and the Meccans swore allegiance to its Muslim conquerors. He was now the strongest man in Arabia. During the next few years, most of the peninsula’s disparate Arab tribes came to him to ask for alliance and to convert to his religion. By his death, on June 8, 632, Muhammad was the effective ruler of most of Arabia, and his rapidly growing empire was poised for expansion into Syria and Iraq.\nWithin 20 years, the Byzantine and Persian empires had fallen to the prophet’s successors, and during the next two centuries vast Arab conquests continued. The Islamic empire grew into one of the largest the world has ever seen, stretching from India, across the Middle East and Africa, and up through Western Europe’s Iberian peninsula. The spread of Islam continued after the fragmentation of the Arab empire, and many societies in Africa and Asia voluntarily adopted Muhammad’s religion. Today, Islam is the world’s second-largest religion.",
    "year": "2015"
  },
  {
    "number": "36",
    "text": "(a) Distinguish between Hadith and Sunnah.\n(b) Outline six benefits of Sunnah.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56442?exam_type=waec&type=theory&page=8",
    "correct_answer": "(a)- Sunnah is always an act of the prophet, alaihissalaam, while a hadith is a report of his statement, act, silent approval or an incident that took place in his life.- Sunnah has come down to us from generation to generation while hadith has been reported, in most cases, by one individual to another. Thus the act that qualifies as sunnah is undoubtedly authentic - quite as authentic as the Quran itself - while hadith, at best, carries a strong probability that it may have been correctively reported. This is because God Almighty arranged the two sources to be the way they are: He arranged sunnah to remain completed beyond doubt, because it was to be a part of His last message and allowed hadith to be a human effort at preserving information about the prophet.-Sunnah is clear in what it stands for where as the context of a hadith had to be understood (and therefore interpreted) by all the narrators involved in the chain of transmission. The process of interpretation has also got to be done now by whoever is to benefit from a hadith.\n(b) Benefits of following Prophet's SunnahThere are great benefits of following Prophet's Sunnah in this life as well as in the life hereafter too. By following Prophet's Sunnah we can lead a happy and healthy life which we are going to discuss below:- Sleeping and Waking up Early: Sleeping early results in rising early and it has the great impact on our daily routine and also in our body functioning. A sleeping pattern that is the time of sleeping plays a great role in our ability to function properly and effectively during daily activities. Starting the day off by praying the morning Salah sets you in the right frame of mind to be the best you can be throughout the day. It was the Sunnah of our beloved Prophet Muhammad (PBUH) to rise early and offer prayers, which helps in reshaping a person at the start of the day into his proper frame. Hazrat Aisha (R.A) narrated Prophet (SAW) sleeping habit that: \"He used to sleep early at night, and get up in its last part to pray, and then return to his bed.\" (Al Bukhari). Wake up early and sleep early to be the strong, successful you that you want to be and Insha Allah you will get all these things.- Use of Miswak: Miswak comes from the \"Salvadora persica\" tree and has many anti-bacterial qualities, making it a great way to maintain hygiene of the mouth. Prophet (SAW) used to do Miswak and we all should also do it because it is very important to maintain oral hygiene. This Sunnah introduces preventative measures against a problem that can have you rolled up in bed for days. Miswak is easily purchasable and relatively cheap, making it an easy Sunnah to uphold. It keeps the mouth clean and fresh naturally and effortlessly all the time. Hadith related to Miswak usage is as follows: \"If it were not that it would be difficult on my nation, then I would have ordered them to use the siwak for each pray.\" [Al Tirmidhi]- Having always a pleasant smile: Smiling is a simple way to looks like happy and also try to do other's happy. With the help of smile, you can lift up someone's mood that is sad and worried. By doing so you can make someone be more grateful and relief from sadness. Our beloved Prophet (PBUH) frequently doing it and all of us should follow his Sunnah of having always a pleasant smile. Ibn Jaz reports: \"I have not seen anyone who smiled more than the Messenger of Allah (SAW).\" (Tirmidhi). Try to smile more often and spread joy and peace around you as our beloved Prophet (SAW) instructed to do so.- Having Hijama (Cupping): Cupping therapy is the modern form of regulating blood flow via putting suctions on human skin to mobilize the flow of blood for healing the wide range of medical ailments. This form of treatment has been used throughout history in a number of countries. The benefits of cupping are vast, including the removal of toxins from the blood. Hadith narrates: \"I there is any healing in your medicines, then it is in cupping, a gulp of honey or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) branded with fire.\" (Al Bukhari). Cupping on daily basis helps in removal of hazardous toxins that human body accumulates on daily basis along effectiveness for fertility, migraine, and joint pains. So for getting cure from diseases, we should try to follow this act of Sunnah of Prophet Muhammad (SAW).",
    "explanation": "(a)- Sunnah is always an act of the prophet, alaihissalaam, while a hadith is a report of his statement, act, silent approval or an incident that took place in his life.- Sunnah has come down to us from generation to generation while hadith has been reported, in most cases, by one individual to another. Thus the act that qualifies as sunnah is undoubtedly authentic - quite as authentic as the Quran itself - while hadith, at best, carries a strong probability that it may have been correctively reported. This is because God Almighty arranged the two sources to be the way they are: He arranged sunnah to remain completed beyond doubt, because it was to be a part of His last message and allowed hadith to be a human effort at preserving information about the prophet.-Sunnah is clear in what it stands for where as the context of a hadith had to be understood (and therefore interpreted) by all the narrators involved in the chain of transmission. The process of interpretation has also got to be done now by whoever is to benefit from a hadith.\n(b) Benefits of following Prophet's SunnahThere are great benefits of following Prophet's Sunnah in this life as well as in the life hereafter too. By following Prophet's Sunnah we can lead a happy and healthy life which we are going to discuss below:- Sleeping and Waking up Early: Sleeping early results in rising early and it has the great impact on our daily routine and also in our body functioning. A sleeping pattern that is the time of sleeping plays a great role in our ability to function properly and effectively during daily activities. Starting the day off by praying the morning Salah sets you in the right frame of mind to be the best you can be throughout the day. It was the Sunnah of our beloved Prophet Muhammad (PBUH) to rise early and offer prayers, which helps in reshaping a person at the start of the day into his proper frame. Hazrat Aisha (R.A) narrated Prophet (SAW) sleeping habit that: \"He used to sleep early at night, and get up in its last part to pray, and then return to his bed.\" (Al Bukhari). Wake up early and sleep early to be the strong, successful you that you want to be and Insha Allah you will get all these things.- Use of Miswak: Miswak comes from the \"Salvadora persica\" tree and has many anti-bacterial qualities, making it a great way to maintain hygiene of the mouth. Prophet (SAW) used to do Miswak and we all should also do it because it is very important to maintain oral hygiene. This Sunnah introduces preventative measures against a problem that can have you rolled up in bed for days. Miswak is easily purchasable and relatively cheap, making it an easy Sunnah to uphold. It keeps the mouth clean and fresh naturally and effortlessly all the time. Hadith related to Miswak usage is as follows: \"If it were not that it would be difficult on my nation, then I would have ordered them to use the siwak for each pray.\" [Al Tirmidhi]- Having always a pleasant smile: Smiling is a simple way to looks like happy and also try to do other's happy. With the help of smile, you can lift up someone's mood that is sad and worried. By doing so you can make someone be more grateful and relief from sadness. Our beloved Prophet (PBUH) frequently doing it and all of us should follow his Sunnah of having always a pleasant smile. Ibn Jaz reports: \"I have not seen anyone who smiled more than the Messenger of Allah (SAW).\" (Tirmidhi). Try to smile more often and spread joy and peace around you as our beloved Prophet (SAW) instructed to do so.- Having Hijama (Cupping): Cupping therapy is the modern form of regulating blood flow via putting suctions on human skin to mobilize the flow of blood for healing the wide range of medical ailments. This form of treatment has been used throughout history in a number of countries. The benefits of cupping are vast, including the removal of toxins from the blood. Hadith narrates: \"I there is any healing in your medicines, then it is in cupping, a gulp of honey or branding with fire (cauterization) that suits the ailment, but I don't like to be (cauterized) branded with fire.\" (Al Bukhari). Cupping on daily basis helps in removal of hazardous toxins that human body accumulates on daily basis along effectiveness for fertility, migraine, and joint pains. So for getting cure from diseases, we should try to follow this act of Sunnah of Prophet Muhammad (SAW).",
    "year": "2015"
  },
  {
    "number": "37",
    "text": "Analyse the lessons contained in Sūratul-Fātiḥah.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56443?exam_type=waec&type=theory&page=8",
    "correct_answer": "- Teach myself how to be grateful in many ways- Work on building attitude of gratitude all life long- If you want barakah in blessings...be grateful- You've got to say and show gratitude to people as well- Rabbil Alameen... this puts me in my place, gives me perspectives on things. i am just a tiny particle in many huge alameen (worlds), so aur jhuk kar chalain (be more humble)- And yet Allah pays attention to me as He only can to each and every minute detail and smallest creature.....so Allah is my/our Rabb- Rahman, Raheem... lots of hope for me in this world and akhira- Mercy and Kindness are necessary if I want to convey this message of Islam to anyone, as even Allah mentions it in this opening surah. So be gentle and kind on many levels, again and again, as much as you can.- Reality is that accountability does come one day....(like in yawm id deen or in this world too) so for instance when dealing with myself or my kids, spell out the consequences of actions along with the gentle and kind reminders....- Life is simplified by iyyaka na'budu wa iyyaka nastaeen...clear cut simple solution to all issues....worship/obey only Him and seek only His help- However, i find it very hard to even practice the above simple concept everyday. Why?- Alhamdulilah for the sirat mustaqeem given to us by Allah in Quran/HAdth/ Deen- I feel Rushk (praiseworthy envy) for those whom Allah Himself has called AnAmta Alayhim, ....they have already Passed the tests of life with flying colors, how great they were...they tread a difficult path.but where will I stand? I slip everyday. But Allah is my Rabb who gives hope for guidance.- Maghdoob and Dawleen....i must keep a watch out for these people's characteristics in myself....rather than only in others- Allah has given us a life plan in Surah Fatiha.....at the risk of copying (from Weight Watchers) i think we can call this plan Worth Watchers....likewhat is my Worth, and the Worth of my actions in front of Allah and on Yawm id Deen- Read surah Fatiha in namaz like the strong dua it is....not just rush it- The Quran now enfolds after surah fatiha..... and the journey of self discovery will begin, inshaAllah. So, Pay Attention and Follow in deeds.",
    "explanation": "- Teach myself how to be grateful in many ways- Work on building attitude of gratitude all life long- If you want barakah in blessings...be grateful- You've got to say and show gratitude to people as well- Rabbil Alameen... this puts me in my place, gives me perspectives on things. i am just a tiny particle in many huge alameen (worlds), so aur jhuk kar chalain (be more humble)- And yet Allah pays attention to me as He only can to each and every minute detail and smallest creature.....so Allah is my/our Rabb- Rahman, Raheem... lots of hope for me in this world and akhira- Mercy and Kindness are necessary if I want to convey this message of Islam to anyone, as even Allah mentions it in this opening surah. So be gentle and kind on many levels, again and again, as much as you can.- Reality is that accountability does come one day....(like in yawm id deen or in this world too) so for instance when dealing with myself or my kids, spell out the consequences of actions along with the gentle and kind reminders....- Life is simplified by iyyaka na'budu wa iyyaka nastaeen...clear cut simple solution to all issues....worship/obey only Him and seek only His help- However, i find it very hard to even practice the above simple concept everyday. Why?- Alhamdulilah for the sirat mustaqeem given to us by Allah in Quran/HAdth/ Deen- I feel Rushk (praiseworthy envy) for those whom Allah Himself has called AnAmta Alayhim, ....they have already Passed the tests of life with flying colors, how great they were...they tread a difficult path.but where will I stand? I slip everyday. But Allah is my Rabb who gives hope for guidance.- Maghdoob and Dawleen....i must keep a watch out for these people's characteristics in myself....rather than only in others- Allah has given us a life plan in Surah Fatiha.....at the risk of copying (from Weight Watchers) i think we can call this plan Worth Watchers....likewhat is my Worth, and the Worth of my actions in front of Allah and on Yawm id Deen- Read surah Fatiha in namaz like the strong dua it is....not just rush it- The Quran now enfolds after surah fatiha..... and the journey of self discovery will begin, inshaAllah. So, Pay Attention and Follow in deeds.",
    "year": "2015"
  },
  {
    "number": "38",
    "text": "Write on the Qur;ān from revelation to compilation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56444?exam_type=waec&type=theory&page=8",
    "correct_answer": "Revelation of QuranHoly Quran was revealed to last Prophet Muhammad (SAW) in the form of wahi. In Islamic terminology, wahi can be literally defined as \"Allah's divine message conveyed to Allah's chosen persons (Prophets).\" Descriptions of wahi are also given in the Holy Quran:\"So we sent this inspiration to the mother of Musa.\" (Quran, 28:7).\"This is part of the tidings of the unseen which we reveal unto thee (oh Prophet) by inspiration\". (Quran, 3:44)Quran revealed in form of Wahi which was made open to Prophet Muhammad (SAW) by Allah Almighty in different forms, either during sleep, while awake, with imprint on His heart, or Gabriel brought the verses in his original or humanly forms from time to time.The process of revelation of Quran started in the month of Ramadan as Allah (SWT) mentioned in Quran: \"Ramadan is the (month) in which we sent down the Quran.\" (Quran, 2:185)The Quran was not revealed in one instance but through a gradual process with small numbers of Ayahs revealed at any one time. Allah Almighty also explains the reason behind the in-parts revelation of Quran over a period of 23 years. Allah says in Quran:\"(It is) a Quran which we have divided (into parts from time to time), in order that thou mightiest recite it to men. At intervals we have revealed it by stages.\" (Quran, 17:106)Hence there was a step by step process of revelation where the verses were revealed at specific instances to Prophet Muhammad (SAW) making it easy to circulate and propagate the information to the followers of Islam. So the divine message of Allah (SWT) was revealed slowly to allow the new Muslim Arabs to change and accept the new faith Islam and live their lives according to teachings of Islam.Revelation in stages also created a constant link between Allah Almighty and His beloved Prophet (SAW) giving moral support in times of need and distress:\"Thus (it is revealed), that We may strengthen thy heart.\" (Al-Furqan, 25:106)Thus we can conclude from this we have a solution of every problem which we are facing in our lives in the Holy Book Quran.Compilation of QuranIn the beginning, Quran was recorded in form of memorizing the verses of Holy Quran. But later the process of compilation of Quran started to preserve it in form of Book. When it comes to the compilation of Quran, it has been divided into specific parts and time in the history where different Muslim rulers at different times made different contributions to make the compilation of Quran better and more reliable. We will discuss the different stages of the compilation of Quran throughout the Islamic history which has made it possible to view and read Quran in its present form.First Stage during the time of Prophet Muhammad (SAW): First time the compilation process of Quran was started in the life of Prophet Muhammad (SAW). In this stage, the arrangement and order of the Surahs and Ayahs were specified by the Prophet (SAW) and the text was written down. However, at this stage, the Quran was not compiled into a single book, comparatively was available in separate sheepskin and was memorized in its integrity by several companions of Prophet Muhammad (SAW).So, the initial compilation was started in the life of Prophet Muhammad (PBUH).Second Stage during the Reign of Hazrat Abu Bakar (R.A): The second stage of compilation took place during the caliphate of Hazrat Abu Bakar (R.A). In the battle of Yamama a large number of sahaba, who had memorized Quran, were martyred. This became a source of quiet concern for many companions of the Prophet (SAW) and they feared about the preservation of Quran. Therefore Hazrat Umer (R.A)suggested to the Caliph that the Quran should be collected and compiled into a single book in order to ensure its preservation. Hazrat Abu Bakar (R.A) liked the idea but was afraid because the Prophet (SAW) himself had never taken this step and He (R.A) feared that this action might be considered a discrepancy from the However, later on, he had a change of heart and ordered Hazrat Zain bin Saabit (R.A) to be the chief scriber and work on compiling the Quran in a book form. All of the members of the commission were renowned Haffaz (memorizers) of the Quran, i.e. they had already memorized it in its entirety. After listening to various Haffaz, cross-referencing it with the different written verses of Quran found on tree leaves, scorch and leather skins, he compiled a final copy of Quran which was then presented to Hazrat Abu Bakar (R.A). Once the whole text was collected and compiled, the commission carefully proofread it and certified that it was correct and present in its entirety. So, the first Book version of Quran was compiled in the life of Hazrat Abu Bakar (R.A) the first caliph of Islam.Third Stage during the Reign of Hazrat Usman (R.A): During the era of the third Caliph Usman (R.A) a serious issue related to the recitation of the Quran raised. Despite the text of the Quran was universally accepted, Arabs from different parts of the Islamic state recited it according to their dialect. These presented two problems: firstly that everybody considered their dialect to be correct which gave rise to disputes; and secondly, it was feared that if this went on, there will be no universally accepted version of Quran left. From overcoming these problems Hazrat Usman (R.A) requested Hazrat Hafsa (R.A) to provide the earlier compilation of Quran so that more copies could be made out of it. Moreover, He also formed a committee consisting of Hazrat Zain bin Haris (R.A) and a few other Companions to make sure that they agree on the pronunciation of the original copy and produce more versions of that copy in the very same way. The commission prepared the text accordingly and then several copies were made and sent to different parts of the Islamic state with the instructions that only this should be considered the official and authentic text of Quran. Since that day the Holy Quran has remained in its original intact form and will remain as such in the future by the Grace and Blessings of Allah Almighty.In spite of Allah Almighty Himself took the responsibility of preserving Quran, however, He had the work done by humans where different rulers in different times made efforts to make sure that Quran was preserved and it was in a form that was universal with no deviation whatsoever in terms of its textual content which we have nowadays from which we recite.",
    "explanation": "Revelation of QuranHoly Quran was revealed to last Prophet Muhammad (SAW) in the form of wahi. In Islamic terminology, wahi can be literally defined as \"Allah's divine message conveyed to Allah's chosen persons (Prophets).\" Descriptions of wahi are also given in the Holy Quran:\"So we sent this inspiration to the mother of Musa.\" (Quran, 28:7).\"This is part of the tidings of the unseen which we reveal unto thee (oh Prophet) by inspiration\". (Quran, 3:44)Quran revealed in form of Wahi which was made open to Prophet Muhammad (SAW) by Allah Almighty in different forms, either during sleep, while awake, with imprint on His heart, or Gabriel brought the verses in his original or humanly forms from time to time.The process of revelation of Quran started in the month of Ramadan as Allah (SWT) mentioned in Quran: \"Ramadan is the (month) in which we sent down the Quran.\" (Quran, 2:185)The Quran was not revealed in one instance but through a gradual process with small numbers of Ayahs revealed at any one time. Allah Almighty also explains the reason behind the in-parts revelation of Quran over a period of 23 years. Allah says in Quran:\"(It is) a Quran which we have divided (into parts from time to time), in order that thou mightiest recite it to men. At intervals we have revealed it by stages.\" (Quran, 17:106)Hence there was a step by step process of revelation where the verses were revealed at specific instances to Prophet Muhammad (SAW) making it easy to circulate and propagate the information to the followers of Islam. So the divine message of Allah (SWT) was revealed slowly to allow the new Muslim Arabs to change and accept the new faith Islam and live their lives according to teachings of Islam.Revelation in stages also created a constant link between Allah Almighty and His beloved Prophet (SAW) giving moral support in times of need and distress:\"Thus (it is revealed), that We may strengthen thy heart.\" (Al-Furqan, 25:106)Thus we can conclude from this we have a solution of every problem which we are facing in our lives in the Holy Book Quran.Compilation of QuranIn the beginning, Quran was recorded in form of memorizing the verses of Holy Quran. But later the process of compilation of Quran started to preserve it in form of Book. When it comes to the compilation of Quran, it has been divided into specific parts and time in the history where different Muslim rulers at different times made different contributions to make the compilation of Quran better and more reliable. We will discuss the different stages of the compilation of Quran throughout the Islamic history which has made it possible to view and read Quran in its present form.First Stage during the time of Prophet Muhammad (SAW): First time the compilation process of Quran was started in the life of Prophet Muhammad (SAW). In this stage, the arrangement and order of the Surahs and Ayahs were specified by the Prophet (SAW) and the text was written down. However, at this stage, the Quran was not compiled into a single book, comparatively was available in separate sheepskin and was memorized in its integrity by several companions of Prophet Muhammad (SAW).So, the initial compilation was started in the life of Prophet Muhammad (PBUH).Second Stage during the Reign of Hazrat Abu Bakar (R.A): The second stage of compilation took place during the caliphate of Hazrat Abu Bakar (R.A). In the battle of Yamama a large number of sahaba, who had memorized Quran, were martyred. This became a source of quiet concern for many companions of the Prophet (SAW) and they feared about the preservation of Quran. Therefore Hazrat Umer (R.A)suggested to the Caliph that the Quran should be collected and compiled into a single book in order to ensure its preservation. Hazrat Abu Bakar (R.A) liked the idea but was afraid because the Prophet (SAW) himself had never taken this step and He (R.A) feared that this action might be considered a discrepancy from the However, later on, he had a change of heart and ordered Hazrat Zain bin Saabit (R.A) to be the chief scriber and work on compiling the Quran in a book form. All of the members of the commission were renowned Haffaz (memorizers) of the Quran, i.e. they had already memorized it in its entirety. After listening to various Haffaz, cross-referencing it with the different written verses of Quran found on tree leaves, scorch and leather skins, he compiled a final copy of Quran which was then presented to Hazrat Abu Bakar (R.A). Once the whole text was collected and compiled, the commission carefully proofread it and certified that it was correct and present in its entirety. So, the first Book version of Quran was compiled in the life of Hazrat Abu Bakar (R.A) the first caliph of Islam.Third Stage during the Reign of Hazrat Usman (R.A): During the era of the third Caliph Usman (R.A) a serious issue related to the recitation of the Quran raised. Despite the text of the Quran was universally accepted, Arabs from different parts of the Islamic state recited it according to their dialect. These presented two problems: firstly that everybody considered their dialect to be correct which gave rise to disputes; and secondly, it was feared that if this went on, there will be no universally accepted version of Quran left. From overcoming these problems Hazrat Usman (R.A) requested Hazrat Hafsa (R.A) to provide the earlier compilation of Quran so that more copies could be made out of it. Moreover, He also formed a committee consisting of Hazrat Zain bin Haris (R.A) and a few other Companions to make sure that they agree on the pronunciation of the original copy and produce more versions of that copy in the very same way. The commission prepared the text accordingly and then several copies were made and sent to different parts of the Islamic state with the instructions that only this should be considered the official and authentic text of Quran. Since that day the Holy Quran has remained in its original intact form and will remain as such in the future by the Grace and Blessings of Allah Almighty.In spite of Allah Almighty Himself took the responsibility of preserving Quran, however, He had the work done by humans where different rulers in different times made efforts to make sure that Quran was preserved and it was in a form that was universal with no deviation whatsoever in terms of its textual content which we have nowadays from which we recite.",
    "year": "2015"
  },
  {
    "number": "39",
    "text": "Describe the political life of pre-Islamic Arabs",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56445?exam_type=waec&type=theory&page=8",
    "correct_answer": "Arabia before IslamIn writing the history of Islam, it is customary to begin with a survey of the political, economic, social and religious conditions of Arabia on the eve of the Proclamation by Muhammad (may God bless him and his Ahlul-Bait) of his mission as Messenger of God.It is the second convention of the historians (the first being to give a geographical description of the region). I shall also abide by this convention, and will review briefly, the general conditions in Arabia in the late sixth and early seventh century A.D.Political Conditions in ArabiaThe most remarkable feature of the political life of Arabia before Islam was the total absence of political organization in any form. With the exception of Yemen in the south-west, no part of the Arabian peninsula had any government at any time, and the Arabs never acknowledged any authority other than the authority of the chiefs of their tribes. The authority of the tribal chiefs, however, rested, in most cases, on their character and personality, and was moral rather than political.The modern student of history finds it incredible that the Arabs lived, generation after generation, century after century, without a government of any kind. Since there was no government, there was no law and no order.The only law of the land was lawlessness. In the event a crime was committed, the injured party took law in its own hands, and tried to administer \"justice\" to the offender. This system led very frequently to acts of horrendous cruelty.If the Arab ever exercised any modicum of restraint, it was not because of any susceptibility he had to questions of right or wrong but because of the fear of provoking reprisals and vendetta. Vendetta consumed whole generations of Arabs.Since there were no such things as police, courts or judges, the only protection a man could find from his enemies, was in his own tribe. The tribe had an obligation to protect its members even if they had committed crimes. Tribalism or 'asabiyya (the clan spirit) took precedence over ethics. A tribe that failed to protect its members from their enemies, exposed itself to ridicule, obloquy and contempt. Ethics, of course, did nggot enter the picture anywhere.Since Arabia did not have a government, and since the Arabs were anarchists by instinct, they were locked up in ceaseless warfare. War was a permanent institution of the Arabian society. The desert could support only a limited number of people, and the state of inter-tribal war maintained a rigid control over the growth of population. But the Arabs themselves did not see war in this light.To them, war was a pastime or rather a dangerous sport, or a species of tribal drama, waged by professionals, according to old and gallant codes, while the \"audience\" cheered. Eternal peace held no appeal for them, and war provided an escape from drudgery and from the monotony of life in the desert.They, therefore, courted the excitement of the clash of arms. War gave them an opportunity to display their skills at archery, fencing and horsemanship, and also, in war, they could distinguish themselves by their heroism and at the same time win glory and honor for their tribes. In many cases, the Arabs fought for the sake of fighting, whether or not there was a cause belli.G. E. Grunebaum\"In the century before the rise of Islam the tribes dissipated all their energies in tribal guerrilla fighting, all against all.\" (Classical Islam - A History 600-1258 - 1970)The nomadic tribes ranged over the peninsula and plundered the caravans and the small settlements. Many caravans and villages bought immunity from these raids by paying a fixed amount of money to the nomadic freebooters.It is important to grasp the fact that on the eve of the birth of Islam there was no government at any level in Arabia, and this fact may even have affected the rise of Islam itself.The total absence of government, even in its most rudimentary form, was a phenomenon so extraordinary that it has been noted and commented upon by many orientalists, among them:D. S. Margoliouth\"Arabia would have remained pagan had there been a man in Mecca who could strike a blow; who would act. But many as were Mohammed's ill-wishers, there was not one of them who had this sort of courage; and (as has been seen) there was no magistracy by which he could be tried.\" (Mohammed and the Rise of Islam, 1931)Maxime Rodinson\"Manslaughter carried severe penalties according to the unwritten law of the desert. In practice the free Arabs were bound by no written code of law, and no state existed to enforce its statutes with the backing of a police force.The only protection for a man's life was the certainty established by custom, that it would be dearly bought. Blood for blood and a life for a life. The vendetta, tha'r in Arabic, is one of the pillars of Bedouin society.\" (Mohammed, 1971)Herbert J. Muller\"In Mohammed's Arabia there was no state - there were only scattered independent tribes and towns. The Prophet formed his own state, and he gave it a sacred law prescribed by Allah.\" (The Loom of History, 1958)The population of Arabia consisted of two main divisions, sedentary and nomadic. Hijaz and South Arabia were dotted with many small and a few large towns. The rest of the country had a floating population composed of Bedouins.They were backward in the civil and political sense but they were also a source of anxiety and fear for the sedentary population. They lived as pirates of the desert, and they were notorious for their unrestrained individualism and anarchic tribal particularism.The more important tribes exercised a certain amount of authority in their respective areas. In Makkah the dominant tribe was the Quraysh; in Yathrib, the dominant tribes were the Arab tribes of Aus and Khazraj, and the Jewish tribes of Nadheer, Qaynuqaa and Qurayza. The Quraysh of Makkah considered themselves superior to the Bedouins but the latter had only contempt for the town-dwellers who for them were only a \"nation of shopkeepers.\"All Arabs were notorious for certain characteristics such as arrogance, conceit, boastfulness, vindictiveness and excessive love of plunder. Their arrogance was partly responsible for their failure to establish a state of their own. They lacked political discipline, and until the rise of Islam, never acknowledged any authority as paramount in Arabia.They acknowledged the authority of a man who led them into a foray but he could command their obedience only if they had an assurance of receiving a fair share of the booty, and his authority lapsed as soon as the expedition was over.",
    "explanation": "Arabia before IslamIn writing the history of Islam, it is customary to begin with a survey of the political, economic, social and religious conditions of Arabia on the eve of the Proclamation by Muhammad (may God bless him and his Ahlul-Bait) of his mission as Messenger of God.It is the second convention of the historians (the first being to give a geographical description of the region). I shall also abide by this convention, and will review briefly, the general conditions in Arabia in the late sixth and early seventh century A.D.Political Conditions in ArabiaThe most remarkable feature of the political life of Arabia before Islam was the total absence of political organization in any form. With the exception of Yemen in the south-west, no part of the Arabian peninsula had any government at any time, and the Arabs never acknowledged any authority other than the authority of the chiefs of their tribes. The authority of the tribal chiefs, however, rested, in most cases, on their character and personality, and was moral rather than political.The modern student of history finds it incredible that the Arabs lived, generation after generation, century after century, without a government of any kind. Since there was no government, there was no law and no order.The only law of the land was lawlessness. In the event a crime was committed, the injured party took law in its own hands, and tried to administer \"justice\" to the offender. This system led very frequently to acts of horrendous cruelty.If the Arab ever exercised any modicum of restraint, it was not because of any susceptibility he had to questions of right or wrong but because of the fear of provoking reprisals and vendetta. Vendetta consumed whole generations of Arabs.Since there were no such things as police, courts or judges, the only protection a man could find from his enemies, was in his own tribe. The tribe had an obligation to protect its members even if they had committed crimes. Tribalism or 'asabiyya (the clan spirit) took precedence over ethics. A tribe that failed to protect its members from their enemies, exposed itself to ridicule, obloquy and contempt. Ethics, of course, did nggot enter the picture anywhere.Since Arabia did not have a government, and since the Arabs were anarchists by instinct, they were locked up in ceaseless warfare. War was a permanent institution of the Arabian society. The desert could support only a limited number of people, and the state of inter-tribal war maintained a rigid control over the growth of population. But the Arabs themselves did not see war in this light.To them, war was a pastime or rather a dangerous sport, or a species of tribal drama, waged by professionals, according to old and gallant codes, while the \"audience\" cheered. Eternal peace held no appeal for them, and war provided an escape from drudgery and from the monotony of life in the desert.They, therefore, courted the excitement of the clash of arms. War gave them an opportunity to display their skills at archery, fencing and horsemanship, and also, in war, they could distinguish themselves by their heroism and at the same time win glory and honor for their tribes. In many cases, the Arabs fought for the sake of fighting, whether or not there was a cause belli.G. E. Grunebaum\"In the century before the rise of Islam the tribes dissipated all their energies in tribal guerrilla fighting, all against all.\" (Classical Islam - A History 600-1258 - 1970)The nomadic tribes ranged over the peninsula and plundered the caravans and the small settlements. Many caravans and villages bought immunity from these raids by paying a fixed amount of money to the nomadic freebooters.It is important to grasp the fact that on the eve of the birth of Islam there was no government at any level in Arabia, and this fact may even have affected the rise of Islam itself.The total absence of government, even in its most rudimentary form, was a phenomenon so extraordinary that it has been noted and commented upon by many orientalists, among them:D. S. Margoliouth\"Arabia would have remained pagan had there been a man in Mecca who could strike a blow; who would act. But many as were Mohammed's ill-wishers, there was not one of them who had this sort of courage; and (as has been seen) there was no magistracy by which he could be tried.\" (Mohammed and the Rise of Islam, 1931)Maxime Rodinson\"Manslaughter carried severe penalties according to the unwritten law of the desert. In practice the free Arabs were bound by no written code of law, and no state existed to enforce its statutes with the backing of a police force.The only protection for a man's life was the certainty established by custom, that it would be dearly bought. Blood for blood and a life for a life. The vendetta, tha'r in Arabic, is one of the pillars of Bedouin society.\" (Mohammed, 1971)Herbert J. Muller\"In Mohammed's Arabia there was no state - there were only scattered independent tribes and towns. The Prophet formed his own state, and he gave it a sacred law prescribed by Allah.\" (The Loom of History, 1958)The population of Arabia consisted of two main divisions, sedentary and nomadic. Hijaz and South Arabia were dotted with many small and a few large towns. The rest of the country had a floating population composed of Bedouins.They were backward in the civil and political sense but they were also a source of anxiety and fear for the sedentary population. They lived as pirates of the desert, and they were notorious for their unrestrained individualism and anarchic tribal particularism.The more important tribes exercised a certain amount of authority in their respective areas. In Makkah the dominant tribe was the Quraysh; in Yathrib, the dominant tribes were the Arab tribes of Aus and Khazraj, and the Jewish tribes of Nadheer, Qaynuqaa and Qurayza. The Quraysh of Makkah considered themselves superior to the Bedouins but the latter had only contempt for the town-dwellers who for them were only a \"nation of shopkeepers.\"All Arabs were notorious for certain characteristics such as arrogance, conceit, boastfulness, vindictiveness and excessive love of plunder. Their arrogance was partly responsible for their failure to establish a state of their own. They lacked political discipline, and until the rise of Islam, never acknowledged any authority as paramount in Arabia.They acknowledged the authority of a man who led them into a foray but he could command their obedience only if they had an assurance of receiving a fair share of the booty, and his authority lapsed as soon as the expedition was over.",
    "year": "2015"
  },
  {
    "number": "40",
    "text": "Write on the significance of the first pillar of Islam.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56447?exam_type=waec&type=theory&page=8",
    "correct_answer": "The prophet said that Islam was established on five pillars. These pillars are the groundwork of Islam as a religious scheme of faith, worship, and devotion. \"Islam was built upon five (pillars): `The testimony that none has the right to be worshipped but Allah and that Muhammad is the Messenger of Allah; the establishment of the prayer; paying the obligatory charity (Zakat); pilgrimage to the House (Hajj to the Ka'bah in Makkah) and fasting (the month of) Ramadan\" (Qur'an). Although, the prophet said that Islam was established on five pillars, it is very clear that the most important pillar is the shahadah. The shahadah states that, \"one must declare, or bear witness, that there is no God except God, and that Muhammad is the Messenger of God\" (A Concise Introduction to World Religions). The shahadah is the most important pillar, because without the declaration that there is no god except God and that Muhammad is the Messenger of God the other pillars cannot be practiced and in declaring this it also show how they believe in the religion of Islam as a whole. While all the pillars are crucial to the religion, this essay will dive into each pillar and show why the shahadah is the most important of them all.6.Describe how Hajj is performedTOPIC: TAWHID AND FIQHThe Hajj ritual can be traced back to the time of the Prophet Abraham by Muslims. It is a religious obligation for all able-bodied Muslims who can afford it at least once in their lifetime. Hajj is observed for five days in the last month of the Islamic lunar calendar and is one of the five pillars of Islam.Male pilgrims wear two white seamless cloths called the Ihram, which is meant to show equality before Allah. One of the cloths is wrapped around the waist reaching below the knee while the other is draped over the left shoulder and tied at the right side.Female pilgrims are allowed to wear any white, modest dresses when they reach the Miqat (a destination where the intent to perform Hajj is declared).The pilgrims perform ablution at the Miqat, declare their intention for Hajj and then refrain from all prohibited activities, including sexual relations, using perfumes, cutting nails, shaving and slaughtering animals during the duration of the Hajj.Day 1:On the first day of Hajj, pilgrims will walk seven times around the Kaaba for the welcoming tawaf (also called the circumambulation of the Kaaba) and kiss the black stone.This is followed by prayers inside the mosque near the Kaaba and then drinking water from the Zamzam well which is believed to have gushed out when Abraham's crying son Ishmael was placed when his mother went out looking for water for him.The pilgrims then move to the Safa and Marwah hills near the Kaaba where they either run or walk seven times between the hills, to symbolically emulate the run Ishmael's mother Hajjar did in search of water for her son.Day 2:After the morning prayer, the pilgrims proceed to Mina where they spend the whole day in prayer.Day 3:All pilgrims then move to Arafat the next day and stand in vigil from noon to sunset to offer supplications, seek repentance and listen to sermons from where it is believed Islam's Prophet Mohammed delivered his final sermon ever. The ritual at Arafat is the ultimate day of Hajj and is considered compulsory if the pilgrimage is to be considered successful.After sunset prayers, all pilgrims will leave the hills of Arafat for Muzdalifah where they will combine two prayers and spend the night in the open fields and gather small pebbles and stones for the next day's ritual.Day 4, 5 and 6:All pilgrims will move to Mina to perform the symbolic stoning of the devil by throwing seven pebbles or stones at the largest of three pillars.On this day, animals like sheep or goats are slaughtered after the 'stoning of the devil' to commemorate Abraham's sacrifice to God when he obeyed the command to sacrifice his son. This day is also the day Muslims worldwide will celebrate the Eid al-Adha festival.Male pilgrims will completely shave their hairs after the sacrifice and females will clip pieces of their hair. They then head to the holy mosque at Mecca for another circumambulation of the Kaaba.Pilgrims will do another round of 'stoning the devil' at each of the three pillars. The same ritual will be done on the fifth day and the sixth if the pilgrim is not able to return to Mecca.Before leaving Mecca, the pilgrims perform another circumambulation of the Kaaba called the 'farewell tawaf' for seven times.After this tawaf, the Hajj pilgrimage is finally completed.",
    "explanation": "The prophet said that Islam was established on five pillars. These pillars are the groundwork of Islam as a religious scheme of faith, worship, and devotion. \"Islam was built upon five (pillars): `The testimony that none has the right to be worshipped but Allah and that Muhammad is the Messenger of Allah; the establishment of the prayer; paying the obligatory charity (Zakat); pilgrimage to the House (Hajj to the Ka'bah in Makkah) and fasting (the month of) Ramadan\" (Qur'an). Although, the prophet said that Islam was established on five pillars, it is very clear that the most important pillar is the shahadah. The shahadah states that, \"one must declare, or bear witness, that there is no God except God, and that Muhammad is the Messenger of God\" (A Concise Introduction to World Religions). The shahadah is the most important pillar, because without the declaration that there is no god except God and that Muhammad is the Messenger of God the other pillars cannot be practiced and in declaring this it also show how they believe in the religion of Islam as a whole. While all the pillars are crucial to the religion, this essay will dive into each pillar and show why the shahadah is the most important of them all.6.Describe how Hajj is performedTOPIC: TAWHID AND FIQHThe Hajj ritual can be traced back to the time of the Prophet Abraham by Muslims. It is a religious obligation for all able-bodied Muslims who can afford it at least once in their lifetime. Hajj is observed for five days in the last month of the Islamic lunar calendar and is one of the five pillars of Islam.Male pilgrims wear two white seamless cloths called the Ihram, which is meant to show equality before Allah. One of the cloths is wrapped around the waist reaching below the knee while the other is draped over the left shoulder and tied at the right side.Female pilgrims are allowed to wear any white, modest dresses when they reach the Miqat (a destination where the intent to perform Hajj is declared).The pilgrims perform ablution at the Miqat, declare their intention for Hajj and then refrain from all prohibited activities, including sexual relations, using perfumes, cutting nails, shaving and slaughtering animals during the duration of the Hajj.Day 1:On the first day of Hajj, pilgrims will walk seven times around the Kaaba for the welcoming tawaf (also called the circumambulation of the Kaaba) and kiss the black stone.This is followed by prayers inside the mosque near the Kaaba and then drinking water from the Zamzam well which is believed to have gushed out when Abraham's crying son Ishmael was placed when his mother went out looking for water for him.The pilgrims then move to the Safa and Marwah hills near the Kaaba where they either run or walk seven times between the hills, to symbolically emulate the run Ishmael's mother Hajjar did in search of water for her son.Day 2:After the morning prayer, the pilgrims proceed to Mina where they spend the whole day in prayer.Day 3:All pilgrims then move to Arafat the next day and stand in vigil from noon to sunset to offer supplications, seek repentance and listen to sermons from where it is believed Islam's Prophet Mohammed delivered his final sermon ever. The ritual at Arafat is the ultimate day of Hajj and is considered compulsory if the pilgrimage is to be considered successful.After sunset prayers, all pilgrims will leave the hills of Arafat for Muzdalifah where they will combine two prayers and spend the night in the open fields and gather small pebbles and stones for the next day's ritual.Day 4, 5 and 6:All pilgrims will move to Mina to perform the symbolic stoning of the devil by throwing seven pebbles or stones at the largest of three pillars.On this day, animals like sheep or goats are slaughtered after the 'stoning of the devil' to commemorate Abraham's sacrifice to God when he obeyed the command to sacrifice his son. This day is also the day Muslims worldwide will celebrate the Eid al-Adha festival.Male pilgrims will completely shave their hairs after the sacrifice and females will clip pieces of their hair. They then head to the holy mosque at Mecca for another circumambulation of the Kaaba.Pilgrims will do another round of 'stoning the devil' at each of the three pillars. The same ritual will be done on the fifth day and the sixth if the pilgrim is not able to return to Mecca.Before leaving Mecca, the pilgrims perform another circumambulation of the Kaaba called the 'farewell tawaf' for seven times.After this tawaf, the Hajj pilgrimage is finally completed.",
    "year": "2015"
  },
  {
    "number": "41",
    "text": "Describe how Ḥajj is performed.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/islamic-religious-knowledge-irk/56449?exam_type=waec&type=theory&page=9",
    "correct_answer": "There are three forms of Hajj:Tamattu,IfraadandQiran. For the purpose of this Hajj guide, we will use theTamattuform of Hajj, which is what the Prophet Muhammad (SAW) encouraged his followers to perform.\nBefore you arrive at Makkah to start Hajj, it’s important to make your intention (niyah) within your heart. The intention must be to perform the Hajj for the sake of Allah alone, with a desire for the Hereafter. It should not be done with the intention of being seen among others or for worldly gain.\nNext, you’ll enter into the state ofihram(ritual purity). For men, this means wearing the designated white cloth with one piece wrapped around your shoulder and one around your waist. Ladies can wear any clothing of their choice but should ensure they observe the rules of hijab. Face coverings, however, are not permitted. Fully-covering shoes are also not permitted. Footwear must be in the form of sandals for both men and women.\nIn Ihram designated white cloth\nIhram is the spiritual state you enter once you have made the intention to go to Hajj. When over three million pilgrims descend into Makkah, there should not be any outwardly distinction between pilgrims. Everyone stands equal in the eyes of Allah (SWT), whether you’re rich or poor and irrespective of ethnicity. Hence, the rules around the clothing of Ihram are extremely simple, yet strict andmustbe adhered to.\nThroughout these holy days, we should also be particularly mindful of our behaviour and words. We should avoid smoking, engaging in sexual relations, swearing, shaving our hair and cutting our nails. We must also not use perfume or scented soaps.\nOnce you arrive at the holy Masjid al-Haram, in Makkah, you’re then ready to start the biggest spiritual journey of your life!\nTip: Carry a spare set of ihram if you can. As for sandals, I recommend investing in a decent pair of trekking sandals. They tend to be the most comfortable and practical, given that you will be walking long distances on tarmac as well as gravel. Try to get used to your sandals before you depart for Saudi so that you don’t break out in blisters or face discomfort once there.",
    "explanation": "There are three forms of Hajj:Tamattu,IfraadandQiran. For the purpose of this Hajj guide, we will use theTamattuform of Hajj, which is what the Prophet Muhammad (SAW) encouraged his followers to perform.\nBefore you arrive at Makkah to start Hajj, it’s important to make your intention (niyah) within your heart. The intention must be to perform the Hajj for the sake of Allah alone, with a desire for the Hereafter. It should not be done with the intention of being seen among others or for worldly gain.\nNext, you’ll enter into the state ofihram(ritual purity). For men, this means wearing the designated white cloth with one piece wrapped around your shoulder and one around your waist. Ladies can wear any clothing of their choice but should ensure they observe the rules of hijab. Face coverings, however, are not permitted. Fully-covering shoes are also not permitted. Footwear must be in the form of sandals for both men and women.\nIn Ihram designated white cloth\nIhram is the spiritual state you enter once you have made the intention to go to Hajj. When over three million pilgrims descend into Makkah, there should not be any outwardly distinction between pilgrims. Everyone stands equal in the eyes of Allah (SWT), whether you’re rich or poor and irrespective of ethnicity. Hence, the rules around the clothing of Ihram are extremely simple, yet strict andmustbe adhered to.\nThroughout these holy days, we should also be particularly mindful of our behaviour and words. We should avoid smoking, engaging in sexual relations, swearing, shaving our hair and cutting our nails. We must also not use perfume or scented soaps.\nOnce you arrive at the holy Masjid al-Haram, in Makkah, you’re then ready to start the biggest spiritual journey of your life!\nTip: Carry a spare set of ihram if you can. As for sandals, I recommend investing in a decent pair of trekking sandals. They tend to be the most comfortable and practical, given that you will be walking long distances on tarmac as well as gravel. Try to get used to your sandals before you depart for Saudi so that you don’t break out in blisters or face discomfort once there.",
    "year": "2015"
  }
]