[
  {
    "number": "1819",
    "text": "Apart from globalization, what other factor to a large extent affects the sovereignty of a state?",
    "options": {
      "A": "Right of a franchise",
      "B": "System of government",
      "C": "International laws",
      "D": "Inalienability"
    },
    "answer_url": "https://myschool.ng/classroom/government/68603?exam_type=waec&type=obj&page=364",
    "correct_answer": "C",
    "explanation": "International laws can significantly affect the sovereignty of a state. Sovereignty refers to the full right and power of a governing body to govern itself without any interference from outside sources or bodies. However, international laws, which are designed to regulate relations between states, can limit this sovereignty to some extent. The other options do not have as large an impact on state sovereignty.",
    "year": "2023"
  },
  {
    "number": "1820",
    "text": "A public declaration of policy and aims especially one issued before an election by a political party or candidate is commonly called",
    "options": {
      "A": "steps to govern",
      "B": "Policy paper",
      "C": "guide to government",
      "D": "manifesto"
    },
    "answer_url": "https://myschool.ng/classroom/government/68604?exam_type=waec&type=obj&page=364",
    "correct_answer": "D",
    "explanation": "A public declaration of policy and aims, especially one issued before an election by a political party or candidate, is commonly called a manifesto. A manifesto outlines the party's or candidate's proposed policies and goals for the government.",
    "year": "2023"
  },
  {
    "number": "1821",
    "text": "The media, commonly referred to as the fourth estate of the realm , monitors the activities of government on behalf of the",
    "options": {
      "A": "people",
      "B": "executive",
      "C": "civil society",
      "D": "media organisation"
    },
    "answer_url": "https://myschool.ng/classroom/government/68605?exam_type=waec&type=obj&page=365",
    "correct_answer": "A",
    "explanation": "The media, commonly referred to as the fourth estate of the realm, monitors the activities of government on behalf of the people. This is because the media's role is to inform the public about what the government is doing and to hold the government accountable to the people.",
    "year": "2023"
  },
  {
    "number": "1822",
    "text": "Bicameral legislature contributes to the democratic process by",
    "options": {
      "A": "recommending the use of force on policy",
      "B": "suppressing minority rights",
      "C": "imposing programmes and policies on the executive",
      "D": "widening the scope of political participation"
    },
    "answer_url": "https://myschool.ng/classroom/government/68606?exam_type=waec&type=obj&page=365",
    "correct_answer": "D",
    "explanation": "A bicameral legislature, which is a legislature with two chambers, contributes to the democratic process by widening the scope of political participation. This is because it allows for more representation and more viewpoints to be considered in the legislative process. The other options do not accurately describe the role of a bicameral legislature in a democratic process.",
    "year": "2023"
  },
  {
    "number": "1823",
    "text": "Maintenance of law and order in a state is the function of the",
    "options": {
      "A": "citizens of the state",
      "B": "executive arm of government",
      "C": "legislative arm of government",
      "D": "judicial service"
    },
    "answer_url": "https://myschool.ng/classroom/government/68608?exam_type=waec&type=obj&page=365",
    "correct_answer": "B",
    "explanation": "The maintenance of law and order in a state is the function of the executive arm of government. The executive branch is responsible for implementing and enforcing laws, maintaining peace and order, and protecting the citizens.",
    "year": "2023"
  },
  {
    "number": "1824",
    "text": "The official routine observed in carrying out functions in the civil service is commonly known as",
    "options": {
      "A": "official order",
      "B": "bureaucracy",
      "C": "standard order",
      "D": "command"
    },
    "answer_url": "https://myschool.ng/classroom/government/68609?exam_type=waec&type=obj&page=365",
    "correct_answer": "B",
    "explanation": "The official routine observed in carrying out functions in the civil service is commonly known as bureaucracy. Bureaucracy refers to the administrative system governing any large institution, whether publicly owned or privately owned.",
    "year": "2023"
  },
  {
    "number": "1825",
    "text": "The Economic Community of West African State (ECOWAS) is now confronted with a new security threat which is",
    "options": {
      "A": "extremism",
      "B": "smuggling of illegal goods across states",
      "C": "weak national armies",
      "D": "proportional  representation"
    },
    "answer_url": "https://myschool.ng/classroom/government/68611?exam_type=waec&type=obj&page=365",
    "correct_answer": "A",
    "explanation": "The Economic Community of West African States (ECOWAS) is a regional group of fifteen West African countries. In recent years, it has been confronted with a new security threat: extremism. This includes terrorist activities and violent extremism, which pose a significant threat to peace and security in the region. The other options do not accurately describe the new security threats faced by ECOWAS.",
    "year": "2023"
  },
  {
    "number": "1826",
    "text": "The art of maintaining peaceful relationships between states, groups or individuals mostly comes about as a result of the activities and functions of",
    "options": {
      "A": "the legislature",
      "B": "security agencies",
      "C": "diplomats",
      "D": "the media"
    },
    "answer_url": "https://myschool.ng/classroom/government/68613?exam_type=waec&type=obj&page=366",
    "correct_answer": "C",
    "explanation": "Diplomats are primarily responsible for maintaining peaceful relationships between states, groups, or individuals. They represent their home country abroad and work on negotiations, peace treaties, trade agreements, and other forms of international cooperation. While the media, the legislature, and security agencies can contribute to peaceful relationships, it is the diplomats who are primarily involved in these activities.",
    "year": "2023"
  },
  {
    "number": "1827",
    "text": "The following issues are some of the challenges the United Nations (UN) addresses except",
    "options": {
      "A": "oligarchical regimes",
      "B": "humanitarian aids",
      "C": "human rights",
      "D": "climate change"
    },
    "answer_url": "https://myschool.ng/classroom/government/68614?exam_type=waec&type=obj&page=366",
    "correct_answer": "A",
    "explanation": "The United Nations (UN) is an international organization that addresses a wide range of global issues, including human rights, humanitarian aid, and climate change. However, it does not specifically address oligarchical regimes. An oligarchy is a form of government in which power is held by a small group of people. While the UN promotes democratic governance, it does not directly intervene in the internal affairs of sovereign states unless there is a threat to international peace and security.",
    "year": "2023"
  },
  {
    "number": "1828",
    "text": "Which system of government allows for and guarantees maximum competition?",
    "options": {
      "A": "Feudalism",
      "B": "Capitalism",
      "C": "Communism",
      "D": "Social Democracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/68616?exam_type=waec&type=obj&page=366",
    "correct_answer": "B",
    "explanation": "Capitalism is an economic system where private entities own the factors of production. It allows for maximum competition as businesses compete for the same resources and customers in a free market to achieve profit maximization.",
    "year": "2023"
  },
  {
    "number": "1829",
    "text": "The overriding consideration for the creation of the New Partnership for Africa's Development (NEPAD) was to place Africa on the path to",
    "options": {
      "A": "capitalist government",
      "B": "non-alignment",
      "C": "growth and development",
      "D": "military might"
    },
    "answer_url": "https://myschool.ng/classroom/government/68618?exam_type=waec&type=obj&page=366",
    "correct_answer": "C",
    "explanation": "The New Partnership for Africa's Development (NEPAD) was created with the primary aim of placing Africa on the path to growth and development. It seeks to address the challenges of poverty, underdevelopment, and the marginalization of Africa in the global economy. The other options like military might, non-alignment, and capitalist governance were not the overriding considerations for the creation of NEPAD.",
    "year": "2023"
  },
  {
    "number": "1830",
    "text": "The French Colonial policies in her West African colonies were different from the British in many ways except in",
    "options": {
      "A": "discriminatory laws",
      "B": "citizenship",
      "C": "imperialism",
      "D": "cultural imposition"
    },
    "answer_url": "https://myschool.ng/classroom/government/68619?exam_type=waec&type=obj&page=366",
    "correct_answer": "C",
    "explanation": "The French and British colonial policies were different in many ways, but both were forms of imperialism, which is the policy or ideology of extending a nation's rule over foreign nations. The other options are areas where the French and British colonial policies differed.",
    "year": "2023"
  },
  {
    "number": "1831",
    "text": "The reason for which the government should take a key interest in the activities of pressure groups is that, they",
    "options": {
      "A": "provide valuable feedback on government policies and programmes",
      "B": "force coalition among political parties for election",
      "C": "blackmail political leaders",
      "D": "dictate the path and direction for government programmes"
    },
    "answer_url": "https://myschool.ng/classroom/government/68621?exam_type=waec&type=obj&page=367",
    "correct_answer": "A",
    "explanation": "Pressure groups provide valuable feedback on government policies and programmes. They represent specific interests and try to influence public policy in their favour. By doing so, they provide a form of checks and balances on the government, ensuring that a wide range of interests are considered in policy-making. The other options do not accurately describe the role of pressure groups.",
    "year": "2023"
  },
  {
    "number": "1832",
    "text": "The rigid nature of a constitution makes it",
    "options": {
      "A": "accessible to all",
      "B": "infallible and standard",
      "C": "easy for quick review",
      "D": "complicated for amendment"
    },
    "answer_url": "https://myschool.ng/classroom/government/68622?exam_type=waec&type=obj&page=367",
    "correct_answer": "D",
    "explanation": "The rigid nature of a constitution makes it complicated for amendment. A rigid constitution is one that requires a special process for its amendment, usually involving a higher degree of difficulty than for ordinary laws.",
    "year": "2023"
  },
  {
    "number": "1833",
    "text": "The Fundamental Human Rights and Liberties must be entrenched in a constitution to",
    "options": {
      "A": "serve majority interest",
      "B": "show concern for the people",
      "C": "make it difficult to tamper with",
      "D": "espouse love for the country"
    },
    "answer_url": "https://myschool.ng/classroom/government/68623?exam_type=waec&type=obj&page=367",
    "correct_answer": "C",
    "explanation": "Fundamental Human Rights and Liberties are entrenched in a constitution to make it difficult to tamper with. This is because the constitution is the supreme law of the land and any changes to it require a rigorous process. This ensures that these rights and liberties are protected and not easily violated.",
    "year": "2023"
  },
  {
    "number": "1834",
    "text": "Unitary system of government is adopted by some states because",
    "options": {
      "A": "of homogeneity",
      "B": "it guarnatees democracy",
      "C": "it builds the capacity of citizens in good time",
      "D": "of mineral resources"
    },
    "answer_url": "https://myschool.ng/classroom/government/68624?exam_type=waec&type=obj&page=367",
    "correct_answer": "A",
    "explanation": "A unitary system of government is often adopted by states that are homogeneous. In a unitary system, the central government holds most of the power, and this system works best in nations where the population has a lot in common, such as shared culture, language, and values. The other options do not directly relate to the reasons for adopting a unitary system.",
    "year": "2023"
  },
  {
    "number": "1835",
    "text": "The public Service Commission performs the following functions except",
    "options": {
      "A": "advisory body",
      "B": "imposition of income tax",
      "C": "welfare of personnel",
      "D": "discipline of personnel"
    },
    "answer_url": "https://myschool.ng/classroom/government/68626?exam_type=waec&type=obj&page=367",
    "correct_answer": "B",
    "explanation": "The Public Service Commission does not have the power to impose income tax. This function is typically performed by the revenue or tax collection agency of the government. The Public Service Commission is responsible for the discipline of personnel, welfare of personnel, and serves as an advisory body.",
    "year": "2023"
  },
  {
    "number": "1836",
    "text": "What type of right enables citizens to participate in state affairs?",
    "options": {
      "A": "judicial right",
      "B": "social right",
      "C": "habeas corpus",
      "D": "political right"
    },
    "answer_url": "https://myschool.ng/classroom/government/68627?exam_type=waec&type=obj&page=368",
    "correct_answer": "D",
    "explanation": "Political rights are rights that allow citizens to participate in state affairs. These include the right to vote, the right to freedom of speech and assembly, and the right to hold public office.",
    "year": "2023"
  },
  {
    "number": "1837",
    "text": "What is commonly referred to as the association of the government and the governed?",
    "options": {
      "A": "confederation",
      "B": "state",
      "C": "federation",
      "D": "monarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/68628?exam_type=waec&type=obj&page=368",
    "correct_answer": "B",
    "explanation": "The association of the government and the governed is commonly referred to as the State. A state is a political entity represented by its government and population.",
    "year": "2023"
  },
  {
    "number": "1838",
    "text": "The local government system assists best in mentoring and grooming people for",
    "options": {
      "A": "military oprations",
      "B": "leadership positions",
      "C": "citizenship and justice",
      "D": "large-scale farming"
    },
    "answer_url": "https://myschool.ng/classroom/government/68630?exam_type=waec&type=obj&page=368",
    "correct_answer": "B",
    "explanation": "The local government system is the closest level of government to the people. It is a training ground for politicians and individuals who aspire to hold leadership positions at higher levels of government. Therefore, it assists best in mentoring and grooming people for leadership positions.",
    "year": "2023"
  },
  {
    "number": "1839",
    "text": "Which of the following systems of government does not practice collective responsibility?",
    "options": {
      "A": "Communalism system",
      "B": "Non-centralised system",
      "C": "Executive system",
      "D": "Cabinet system"
    },
    "answer_url": "https://myschool.ng/classroom/government/68632?exam_type=waec&type=obj&page=368",
    "correct_answer": "B",
    "explanation": "Collective responsibility is a concept in which members of a group are considered responsible for the actions of the group as a whole. In the context of government, this often applies to cabinet systems where all members of the cabinet are collectively responsible for the decisions made. Non-Centralized system does not practice collective responsibility as power and decision-making are not concentrated in a central authority.or individualsmostlycomes",
    "year": "2023"
  },
  {
    "number": "1840",
    "text": "One of the formidable challenges the New Partnership for Africa's Development (NEPAD) is confronted with is the",
    "options": {
      "A": "absence of a common platform for debate",
      "B": "over reliance on foreign aid",
      "C": "absence of technology transfer",
      "D": "arms race among member states"
    },
    "answer_url": "https://myschool.ng/classroom/government/68633?exam_type=waec&type=obj&page=368",
    "correct_answer": "B",
    "explanation": "One of the major challenges faced by the New Partnership for Africa's Development (NEPAD) is the over-reliance on foreign aid. This dependence often comes with conditions that may not align with the development goals of the African countries. It also creates a dependency syndrome that hinders self-sustained growth and development. The other options like absence of a common platform for debate, arms race among member states, and absence of technology transfer, while they may be challenges, are not as formidable as the over-reliance on foreign aid.",
    "year": "2023"
  },
  {
    "number": "1841",
    "text": "The biggest obstacle which also slowed down nationalist activities in French West African Colonies was the",
    "options": {
      "A": "assimilation policy",
      "B": "constitutional reforms and entrenchment of human rights",
      "C": "assassination of chiefs",
      "D": "deportation of Africans to France"
    },
    "answer_url": "https://myschool.ng/classroom/government/68635?exam_type=waec&type=obj&page=369",
    "correct_answer": "A",
    "explanation": "The biggest obstacle which also slowed down nationalist activities in French West African Colonies was the assimilation policy. This policy aimed to make Africans in French colonies 'French' in culture and citizenship, which undermined local cultures and identities and hindered the development of nationalist movements.",
    "year": "2023"
  },
  {
    "number": "1842",
    "text": "A state that has two levels of government is commonly referred to as",
    "options": {
      "A": "concurrent states",
      "B": "cooperative government",
      "C": "federal state",
      "D": "coalition government"
    },
    "answer_url": "https://myschool.ng/classroom/government/68636?exam_type=waec&type=obj&page=369",
    "correct_answer": "C",
    "explanation": "A state that has two levels of government is commonly referred to as a federal state. In a federal state, power is divided between a central government and individual states, provinces, or other territorial units. Each level of government has its own set of responsibilities and powers.",
    "year": "2023"
  },
  {
    "number": "1843",
    "text": "One of the major criticisms levelled against the United Nations (UN) is its inability to",
    "options": {
      "A": "ensure fair permanent representation",
      "B": "enforce affirmative action and equal wealth",
      "C": "adopt a universal language for its operation",
      "D": "ensure universal access to education"
    },
    "answer_url": "https://myschool.ng/classroom/government/68638?exam_type=waec&type=obj&page=369",
    "correct_answer": "A",
    "explanation": "One of the major criticisms levelled against the United Nations (UN) is its inability to ensure fair permanent representation. The UN Security Council, for example, has five permanent members with veto power, which many countries argue is not representative of the international community.",
    "year": "2023"
  },
  {
    "number": "1844",
    "text": "One of the function of the electoral management body is to",
    "options": {
      "A": "conduct training programmes for presidential candidates",
      "B": "look for external sources besides the government to fund its operations",
      "C": "interpret the electoral laws fairly",
      "D": "engage in business to increase its financial capacity"
    },
    "answer_url": "https://myschool.ng/classroom/government/68639?exam_type=waec&type=obj&page=369",
    "correct_answer": "C",
    "explanation": "One of the functions of the electoral management body is to interpret the electoral laws fairly. This is to ensure that elections are conducted in a free, fair, and transparent manner. The electoral management body does not engage in business or look for external sources of funding.",
    "year": "2023"
  },
  {
    "number": "1845",
    "text": "The civil service is different from the public service in terms of",
    "options": {
      "A": "educational qualification",
      "B": "political affiliation",
      "C": "conditions of service",
      "D": "personality and stature"
    },
    "answer_url": "https://myschool.ng/classroom/government/68640?exam_type=waec&type=obj&page=369",
    "correct_answer": "C",
    "explanation": "The civil service is different from the public service in terms of conditions of service. The civil service is a part of the public service, but it is distinguished by its different conditions of service, which include things like pay scales, working hours, and benefits.",
    "year": "2023"
  },
  {
    "number": "1846",
    "text": "The judiciary occupies an important place in every state because it is",
    "options": {
      "A": "mandated to supervise the functions of the executive",
      "B": "a unique profession of intellectuals",
      "C": "protector of the rights of the people",
      "D": "a body of upright and just people in society"
    },
    "answer_url": "https://myschool.ng/classroom/government/68642?exam_type=waec&type=obj&page=370",
    "correct_answer": "C",
    "explanation": "The judiciary is important in every state because it serves as the protector of the rights of the people. It interprets the law and ensures that everyone, including the government, adheres to it. The other options do not accurately describe the primary role of the judiciary.",
    "year": "2023"
  },
  {
    "number": "1847",
    "text": "An executive president is one who wields the powers of a",
    "options": {
      "A": "head of state and government",
      "B": "ceremonial president only",
      "C": "leader of government business only",
      "D": "despot and benevolent dictator"
    },
    "answer_url": "https://myschool.ng/classroom/government/68644?exam_type=waec&type=obj&page=370",
    "correct_answer": "A",
    "explanation": "An executive president is one who wields the powers of both the head of state and government. This means that the president has the highest executive authority and is responsible for the implementation and enforcement of all laws and the operation of all government services.",
    "year": "2023"
  },
  {
    "number": "1848",
    "text": "There are two types of committee system in the House of parliament as part of their operations and one of such is",
    "options": {
      "A": "parliamentary service board",
      "B": "expert committee",
      "C": "Committee of the Whole House",
      "D": "Leadership Committee"
    },
    "answer_url": "https://myschool.ng/classroom/government/68646?exam_type=waec&type=obj&page=370",
    "correct_answer": "C",
    "explanation": "There are two types of committee systems in the House of Parliament as part of their operations. One of such is the Committee of the Whole House. This is a committee that includes all members of the House and meets in the House chamber.",
    "year": "2023"
  },
  {
    "number": "1849",
    "text": "A democratic country is one in which the people have the right to",
    "options": {
      "A": "participate in decision making",
      "B": "disregard laws they abhor",
      "C": "violently overthrow a government",
      "D": "punish government by not honouring tax obligation"
    },
    "answer_url": "https://myschool.ng/classroom/government/68647?exam_type=waec&type=obj&page=370",
    "correct_answer": "A",
    "explanation": "A democratic country is one in which the people have the right to participate in decision making. This is a fundamental principle of democracy, which is government of the people, by the people, and for the people. The other options like disregarding laws they abhor, violently overthrowing a government, and punishing government by not honouring tax obligation are not democratic rights and can lead to anarchy and instability.",
    "year": "2023"
  },
  {
    "number": "1850",
    "text": "The best way to keep the military at bay from interfering in politics is by ensuring",
    "options": {
      "A": "high pay rise every year",
      "B": "their inclusion in government",
      "C": "good governance",
      "D": "effective control of their day to day operations"
    },
    "answer_url": "https://myschool.ng/classroom/government/68649?exam_type=waec&type=obj&page=370",
    "correct_answer": "C",
    "explanation": "The best way to keep the military at bay from interfering in politics is by ensuring good governance. Good governance, which includes things like transparency, accountability, and respect for the rule of law, can help to prevent the conditions that might lead to a military coup.",
    "year": "2023"
  },
  {
    "number": "1851",
    "text": "The African Union (AU) is saddled with one of these challenges and that is",
    "options": {
      "A": "absence of rich natural resources",
      "B": "tensions and political discord among member states",
      "C": "inter-ethnic extinction and poor social cohesion",
      "D": "weak labour force"
    },
    "answer_url": "https://myschool.ng/classroom/government/68651?exam_type=waec&type=obj&page=371",
    "correct_answer": "B",
    "explanation": "The African Union (AU) is an organization that promotes unity and cooperation among African countries. One of the challenges it faces is tensions and political discord among member states. This can hinder cooperation and the achievement of the AU's objectives. The other options do not accurately describe the challenges faced by the AU.",
    "year": "2023"
  },
  {
    "number": "1852",
    "text": "The reluctance of military regimes to hand over power to civilian administration is because they",
    "options": {
      "A": "negotiate better loan terms for the country than the civilian government",
      "B": "have the backing of traditional rulers, their subjects and the clergy",
      "C": "feel a sense of entitlement",
      "D": "perceive civilians and politicians as evil doers and backward"
    },
    "answer_url": "https://myschool.ng/classroom/government/68654?exam_type=waec&type=obj&page=371",
    "correct_answer": "C",
    "explanation": "Military regimes often feel a sense of entitlement to power due to their control over the armed forces and the state's security apparatus. This sense of entitlement can make them reluctant to hand over power to civilian administrations. The other options do not accurately capture the primary reason for this reluctance.",
    "year": "2023"
  },
  {
    "number": "1853",
    "text": "The exercise of power can arise from any of the following sources except",
    "options": {
      "A": "ideological power",
      "B": "legitimate power",
      "C": "expert power",
      "D": "charismatic power"
    },
    "answer_url": "https://myschool.ng/classroom/government/68655?exam_type=waec&type=obj&page=371",
    "correct_answer": "A",
    "explanation": "The exercise of power can arise from legitimate power, charismatic power, and expert power. However, ideological power is not a source of power. It is rather a tool or mechanism through which power can be exercised.",
    "year": "2023"
  },
  {
    "number": "1854",
    "text": "A social, political and economic arrangement in which landed property and other natural resources are collectively owned is referred to as",
    "options": {
      "A": "Federalism",
      "B": "Liberalism",
      "C": "Communalism",
      "D": "Feudalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/68656?exam_type=waec&type=obj&page=371",
    "correct_answer": "C",
    "explanation": "Communalism refers to a social, political and economic arrangement in which landed property and other natural resources are collectively owned. It is a system that emphasizes the common good rather than individual profit.",
    "year": "2023"
  },
  {
    "number": "1855",
    "text": "Public opinion is formed through the following channels except",
    "options": {
      "A": "Cabinet",
      "B": "Elections",
      "C": "Mass media",
      "D": "Political parties"
    },
    "answer_url": "https://myschool.ng/classroom/government/68657?exam_type=waec&type=obj&page=371",
    "correct_answer": "A",
    "explanation": "Public opinion is formed through various channels such as mass media, elections, and political parties. However, the cabinet, which is a body of high-ranking state officials, typically consisting of the top leaders of the executive branch, is not a channel through which public opinion is formed. Rather, it is a body that makes decisions based on public opinion and other factors.",
    "year": "2023"
  },
  {
    "number": "1856",
    "text": "The function of the Diplomatic Missions include the following except",
    "options": {
      "A": "project the culture of the people",
      "B": "woo investors",
      "C": "pay salaries of workers of the mission",
      "D": "gather intelligence information"
    },
    "answer_url": "https://myschool.ng/classroom/government/68659?exam_type=waec&type=obj&page=372",
    "correct_answer": "C",
    "explanation": "The function of the Diplomatic Missions include gathering intelligence information, projecting the culture of the people, and wooing investors. However, paying salaries of workers of the mission is an administrative function, not a diplomatic one.",
    "year": "2023"
  },
  {
    "number": "1857",
    "text": "One of the factors that influences decentralization of power in a state is",
    "options": {
      "A": "weak central authority",
      "B": "widening political participation",
      "C": "maximum allegiance to the state",
      "D": "maximum loyalty"
    },
    "answer_url": "https://myschool.ng/classroom/government/68661?exam_type=waec&type=obj&page=372",
    "correct_answer": "B",
    "explanation": "Decentralization of power in a state is influenced by the need to widen political participation. This is because decentralization allows for the distribution of authority away from a central authority to regional or local authorities, thereby allowing more people to participate in governance.",
    "year": "2023"
  },
  {
    "number": "1858",
    "text": "One of the high points of the activities of the National Congress of British West Africa (NCBWA) led to the",
    "options": {
      "A": "proposal for African unity",
      "B": "creation of the African High Command",
      "C": "Africanization of the Executive Council",
      "D": "introduction of the elective principles"
    },
    "answer_url": "https://myschool.ng/classroom/government/68663?exam_type=waec&type=obj&page=372",
    "correct_answer": "D",
    "explanation": "One of the high points of the activities of the National Congress of British West Africa (NCBWA) led to the introduction of the elective principles. The NCBWA was a political organization that advocated for the rights of Africans in British West Africa, and one of its major achievements was the introduction of the elective principle, which allowed Africans to vote for their own representatives.",
    "year": "2023"
  },
  {
    "number": "1859",
    "text": "The pattern of rule by the French in her West African colonies was highly",
    "options": {
      "A": "decentralized",
      "B": "proportional",
      "C": "consultative",
      "D": "centralized"
    },
    "answer_url": "https://myschool.ng/classroom/government/68664?exam_type=waec&type=obj&page=372",
    "correct_answer": "D",
    "explanation": "The French colonial rule in West Africa was highly centralized. This means that the power and decision-making were concentrated in a central authority, often in the hands of the colonial governor. The other options do not accurately describe the pattern of French colonial rule.",
    "year": "2023"
  },
  {
    "number": "1860",
    "text": "The Commonwealth of Nations is committed to one of the following principles",
    "options": {
      "A": "human rights and democracy",
      "B": "supervise political activities of member states",
      "C": "draft constitution for member states",
      "D": "finance budget of member states"
    },
    "answer_url": "https://myschool.ng/classroom/government/68665?exam_type=waec&type=obj&page=372",
    "correct_answer": "A",
    "explanation": "The Commonwealth is an intergovernmental organization of 54 member states that are mostly former territories of the British Empire. It is committed to promoting human rights and democracy among its member states. The other options do not accurately describe the principles to which the Commonwealth is committed.",
    "year": "2023"
  },
  {
    "number": "1861",
    "text": "The cornerstone of a functioning democracy is the",
    "options": {
      "A": "foreign policy and military alliances",
      "B": "appropriation bill",
      "C": "free and fair elections",
      "D": "expenditure pattern of the executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/68667?exam_type=waec&type=obj&page=373",
    "correct_answer": "C",
    "explanation": "The cornerstone of a functioning democracy is free and fair elections. This is because in a democracy, the power to govern comes from the people who are governed. They express their will through voting in elections. If the elections are not free and fair, then the government does not truly represent the people, and the system is not a true democracy.",
    "year": "2023"
  },
  {
    "number": "1862",
    "text": "The issues that are at the core of a country's foreign policy are referred to as",
    "options": {
      "A": "globalisation",
      "B": "state area",
      "C": "national interest",
      "D": "diplomacy"
    },
    "answer_url": "https://myschool.ng/classroom/government/68668?exam_type=waec&type=obj&page=373",
    "correct_answer": "C",
    "explanation": "The issues that are at the core of a country's foreign policy are referred to as national interest. National interest is a country's goals and ambitions whether economic, military, or cultural. It is a key concept in international relations where it refers to a country's goals and ambitions.",
    "year": "2023"
  },
  {
    "number": "1863",
    "text": "The underlying principle of the concept of seperation of powers is mainly to",
    "options": {
      "A": "educate people on their rights",
      "B": "tame the executive",
      "C": "prevent arbitrariness",
      "D": "ensure constitutional review"
    },
    "answer_url": "https://myschool.ng/classroom/government/68670?exam_type=waec&type=obj&page=373",
    "correct_answer": "C",
    "explanation": "The principle of separation of powers is primarily to prevent arbitrariness. This principle is a model for the governance of a state, where the state's government is divided into branches, each with separate and independent powers and areas of responsibility so that the powers of one branch are not in conflict with the powers associated with the other branches.",
    "year": "2023"
  },
  {
    "number": "1864",
    "text": "Secret voting assists the voter in making a decision without",
    "options": {
      "A": "coercion",
      "B": "pondering over issues",
      "C": "national interest",
      "D": "public good"
    },
    "answer_url": "https://myschool.ng/classroom/government/68671?exam_type=waec&type=obj&page=373",
    "correct_answer": "A",
    "explanation": "Secret voting is a method of voting that ensures the voter's privacy in the election process. The key idea is to ensure the voter's choice is confidential which helps to prevent attempts of influence, coercion, or retaliation",
    "year": "2023"
  },
  {
    "number": "1865",
    "text": "Elections plays a major role in the democratic process because, it",
    "options": {
      "A": "ensures only good people rule",
      "B": "manipulates the electoral process",
      "C": "confers legitimacy",
      "D": "projects the class system"
    },
    "answer_url": "https://myschool.ng/classroom/government/68673?exam_type=waec&type=obj&page=373",
    "correct_answer": "C",
    "explanation": "Elections play a major role in the democratic process because they confer legitimacy. By participating in elections, citizens give their consent to be governed by the elected officials, which is a key aspect of democratic legitimacy. The other options do not accurately describe the major role of elections in the democratic process.",
    "year": "2023"
  },
  {
    "number": "1866",
    "text": "Which one among the following is a significant factor that influences the foreign policy of a country?",
    "options": {
      "A": "Gender of the political leader",
      "B": "Educational system",
      "C": "Recruitment policy",
      "D": "political system"
    },
    "answer_url": "https://myschool.ng/classroom/government/68674?exam_type=waec&type=obj&page=374",
    "correct_answer": "D",
    "explanation": "The foreign policy of a country is significantly influenced by its political system. The political system of a country determines its governance structure, ideologies, and international relations. It shapes the country's approach to international diplomacy, alliances, and conflicts. The other options like educational system, gender of the political leader, and recruitment policy do not have a direct and significant influence on a country's foreign policy.",
    "year": "2023"
  },
  {
    "number": "1867",
    "text": "One of the negative effects of colonial rule on West African states was the",
    "options": {
      "A": "building of roads and rail network",
      "B": "social interventions",
      "C": "western education",
      "D": "dependency syndrome"
    },
    "answer_url": "https://myschool.ng/classroom/government/68675?exam_type=waec&type=obj&page=374",
    "correct_answer": "D",
    "explanation": "One of the negative effects of colonial rule on West African states was the dependency syndrome. This refers to the condition where the colonized states become heavily dependent on the colonial powers for economic, political, and social needs. The other options are generally considered as positive effects of colonial rule.",
    "year": "2023"
  },
  {
    "number": "1868",
    "text": "One of the low points in the cabinet system of government is that, the",
    "options": {
      "A": "divided loyalty of the cabinet ministers is strong",
      "B": "centre of power in the system is stable",
      "C": "Prime Minister does not regard the Head of State",
      "D": "tenure of government is always not stable"
    },
    "answer_url": "https://myschool.ng/classroom/government/68679?exam_type=waec&type=obj&page=374",
    "correct_answer": "D",
    "explanation": "In a cabinet system of government, one of the low points is that the tenure of government is not always stable. This is because the government is dependent on the confidence of the parliament, and a vote of no confidence can lead to the dissolution of the government.",
    "year": "2023"
  }
]