[
  {
    "number": "1869",
    "text": "The ultimate source of power and authority which sets the state apart from other forms of political organisations is referred to as",
    "options": {
      "A": "constitutionalism",
      "B": "checks and balances",
      "C": "rule of law",
      "D": "sovereignty"
    },
    "answer_url": "https://myschool.ng/classroom/government/71814?exam_type=waec&type=obj&page=374",
    "correct_answer": "D",
    "explanation": "Sovereignty is the supreme power and authority of a state to govern itself without external interference. It is what distinguishes a state from other political organisations, as it grants the state ultimate control over its internal and external affairs.",
    "year": "2024"
  },
  {
    "number": "1870",
    "text": "The institution through which leaders exercise power to make and enforce laws is the",
    "options": {
      "A": "government",
      "B": "judiciary",
      "C": "political party",
      "D": "security agency"
    },
    "answer_url": "https://myschool.ng/classroom/government/71815?exam_type=waec&type=obj&page=374",
    "correct_answer": "A",
    "explanation": "The government is the institution through which leaders exercise their power to make and enforce laws. It is responsible for creating policies, maintaining order, and ensuring that laws are followed within a state. The judiciary, political parties and security agencies are integral parts of the political system, but the government is the overarching institution that exercises the authority to legislate and enforce laws.",
    "year": "2024"
  },
  {
    "number": "1871",
    "text": "The fundamental principles by which a state is ordered and governed are usually outlined in a",
    "options": {
      "A": "bill",
      "B": "constitution",
      "C": "parliamentary proceedings",
      "D": "state manual"
    },
    "answer_url": "https://myschool.ng/classroom/government/71816?exam_type=waec&type=obj&page=375",
    "correct_answer": "B",
    "explanation": "Aconstitutionis a set of fundamental principles or established precedents that govern the state. It outlines the structure of government, the distribution of powers, the rights of citizens and the laws that guide the functioning of the state. It serves as the supreme legal document that shapes how a state is ordered and governed.",
    "year": "2024"
  },
  {
    "number": "1872",
    "text": "Which one among the following factors greatly restrains the government in a democratic society?",
    "options": {
      "A": "Consent of the governed",
      "B": "Consent of the civil society organisation",
      "C": "Ideology of the party",
      "D": "Parliamentary debates"
    },
    "answer_url": "https://myschool.ng/classroom/government/71817?exam_type=waec&type=obj&page=375",
    "correct_answer": "A",
    "explanation": "In a democratic society, the government is greatly restrained by theconsent of the governed. This principle means that the legitimacy of the government and its actions are based on the approval or consent of the people. If the government fails to meet the expectations of the people, they have the power to challenge it, through elections or other democratic means, thus limiting its authority and actions.",
    "year": "2024"
  },
  {
    "number": "1873",
    "text": "The following factors are challenges faced by the judiciary under the doctrine of Separation of Powers except",
    "options": {
      "A": "appointment of judges",
      "B": "financial autonomy",
      "C": "removal of judges from office",
      "D": "poor legal infrastructure"
    },
    "answer_url": "https://myschool.ng/classroom/government/71818?exam_type=waec&type=obj&page=375",
    "correct_answer": "D",
    "explanation": "Thedoctrine of Separation of Powersdivides government responsibilities into three branches —Executive, Legislature, and Judiciary— to prevent abuse of power and ensure checks and balances. When discussingchallenges faced by the judiciary under this doctrine, the focus is on issues that affectjudicial independence and balance of power.\nJudges are often appointed by the executive (e.g. President or Governor), which can compromise judicial independence if the process lacks transparency. If the judiciary does not control its own finances but depends on the executive for funding, it undermines its independence. When the executive or legislature has excessive influence over how judges are removed, it threatens judicial independence.\nBut, while poor legal infrastructure is areal challengefor the judiciary, it isnot directly relatedto the doctrine of separation of powers. It is more of alogistical or administrative issue.",
    "year": "2024"
  },
  {
    "number": "1874",
    "text": "Accountability in constitutional democracy is best enforced through a system of",
    "options": {
      "A": "checks and balances",
      "B": "civil society organisations",
      "C": "subversion of the law",
      "D": "selection of the right leaders"
    },
    "answer_url": "https://myschool.ng/classroom/government/71819?exam_type=waec&type=obj&page=375",
    "correct_answer": "A",
    "explanation": "In aconstitutional democracy, accountability is best enforced through a system ofchecks and balances. This system ensures that no single branch of government (executive, legislature, or judiciary) becomes too powerful. Each branch has the ability to limit the actions of others, preventing abuses of power and promoting accountability. While civil society organizations and the selection of the right leaders are important, checks and balances are the primary mechanism for enforcing accountability within the structure of government.",
    "year": "2024"
  },
  {
    "number": "1875",
    "text": "The application of the common principles that are important to improve decision-making processes and ultimately strengthen democracy and improve social and economic development is best described as",
    "options": {
      "A": "fundamental human rights",
      "B": "good governance",
      "C": "separation of powers",
      "D": "social democracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/71820?exam_type=waec&type=obj&page=375",
    "correct_answer": "B",
    "explanation": "Good governancerefers to the application of principles such as transparency, accountability, participation, rule of law and effectiveness in the decision-making processes. These principles are crucial for strengthening democracy, improving social and economic development and ensuring that governments operate in a way that serves the best interests of the people.",
    "year": "2024"
  },
  {
    "number": "1876",
    "text": "One of the reasons for having two legislative chambers in the governance structure of a country is to ensure the",
    "options": {
      "A": "executive is kept under check and control",
      "B": "powers of the lower chamber is suppressed",
      "C": "strict control of the affairs of the state",
      "D": "thorough scrutiny of legislation"
    },
    "answer_url": "https://myschool.ng/classroom/government/71821?exam_type=waec&type=obj&page=376",
    "correct_answer": "D",
    "explanation": "Having two legislative chambers, commonly known as abicameral legislature, allows for athorough scrutiny of legislation. This structure ensures that proposed laws are carefully reviewed and debated by both chambers, providing a system of checks and balances. The process allows for more comprehensive consideration of issues, preventing hasty decisions and ensuring that legislation is in the best interest of the country.",
    "year": "2024"
  },
  {
    "number": "1877",
    "text": "Which one of the following factors has contributed largely to the weakened and poor performance of state institutions in most West African States?",
    "options": {
      "A": "corruption",
      "B": "globalisation",
      "C": "low remuneration and wages",
      "D": "weak institutional memory"
    },
    "answer_url": "https://myschool.ng/classroom/government/71833?exam_type=waec&type=obj&page=376",
    "correct_answer": "A",
    "explanation": "Corruption is one of themajorfactors contributing to the weak and poor performance of state institutions in most West African states. It undermines governance, leads to the misallocation of resources, weakens public trust and reduces efficiency in service delivery. Corruption manifests in various ways, including bribery, embezzlement, nepotism and mismanagement of public funds.",
    "year": "2024"
  },
  {
    "number": "1878",
    "text": "One of the paramount roles to play as a citizen in sustaining the democratic system of governance is to",
    "options": {
      "A": "avoid criticism of government",
      "B": "play the partisan card",
      "C": "pray for a good leader",
      "D": "register and vote in elections"
    },
    "answer_url": "https://myschool.ng/classroom/government/71835?exam_type=waec&type=obj&page=376",
    "correct_answer": "D",
    "explanation": "One of the most fundamental responsibilities of a citizen in a democracy isparticipating in elections. By registering and voting, citizens actively shape the government, hold leaders accountable and influence policies that affect their lives. Voting ensures that leaders are chosen through a legitimate, democratic process rather than through undemocratic means.",
    "year": "2024"
  },
  {
    "number": "1879",
    "text": "The responsibility of citizens towards nation-building is to",
    "options": {
      "A": "encourage civil disobedience in the face of hardship",
      "B": "participate and contribute to decision making",
      "C": "stampede government policies and programmes",
      "D": "boycott and withdraw services to the state"
    },
    "answer_url": "https://myschool.ng/classroom/government/71836?exam_type=waec&type=obj&page=376",
    "correct_answer": "B",
    "explanation": "Citizens play a crucial role innation-buildingby actively engaging in governance and contributing to decision-making processes. This includes voting, engaging in policy discussions, advocating for good governance and holding leaders accountable. A participatory democracy ensures that policies reflect the needs and interests of the people.",
    "year": "2024"
  },
  {
    "number": "1880",
    "text": "By competing in general elections, political parties ultimately offer citizens",
    "options": {
      "A": "a choice in government",
      "B": "automatic membership of a party",
      "C": "opportunity to be extremely to one party",
      "D": "opportunity to vilify the government"
    },
    "answer_url": "https://myschool.ng/classroom/government/71837?exam_type=waec&type=obj&page=376",
    "correct_answer": "A",
    "explanation": "Political parties compete in general elections to provide citizens withdifferent policy options, leadership choices and governance approaches. By doing so, they give voters thepower to decidewhich party or candidates best represent their interests. This competition is essential for democracy, as it ensures that governance is based on thewill of the peoplerather than a single dominant group.",
    "year": "2024"
  },
  {
    "number": "1881",
    "text": "Public opinion is an essential element in a democracy because it can act as a",
    "options": {
      "A": "check on leadership and government activities",
      "B": "mouthpiece for the opposition only",
      "C": "news outlet for the media and government only",
      "D": "propaganda tool for the government at all material times"
    },
    "answer_url": "https://myschool.ng/classroom/government/71839?exam_type=waec&type=obj&page=377",
    "correct_answer": "A",
    "explanation": "Public opinion is a fundamental aspect of democracy because it helpshold leaders accountableand ensures that government actions reflect thewill of the people. Through protests, petitions, elections and the media, citizens express their views, influencing policy decisions and governance. Governments that ignore public opinion risk losing legitimacy and public trust.",
    "year": "2024"
  },
  {
    "number": "1882",
    "text": "The media serve a useful purpose in a democracy by",
    "options": {
      "A": "connecting the government and the people",
      "B": "ensuring government plays to their dictates",
      "C": "assisting in the formation of political parties",
      "D": "manipulating political leaders in government"
    },
    "answer_url": "https://myschool.ng/classroom/government/71841?exam_type=waec&type=obj&page=377",
    "correct_answer": "A",
    "explanation": "In a democracy, themediaplays a crucial role by acting as abridge between the government and the people. They provide information about government policies, decisions and activities while also amplifying the voices of citizens. This helps create transparency, accountability and informed public participation in governance.",
    "year": "2024"
  },
  {
    "number": "1883",
    "text": "One of the pivotal roles played by pressure groups in a functioning democracy is the",
    "options": {
      "A": "implementation of public policy by them",
      "B": "influence on public policy decisions",
      "C": "trumpeting of good deeds of a government always",
      "D": "blackmailing of the government to act in their favour"
    },
    "answer_url": "https://myschool.ng/classroom/government/71843?exam_type=waec&type=obj&page=377",
    "correct_answer": "B",
    "explanation": "Pressure groups play a crucial role in a democracy byadvocating for specific interestsandinfluencing government policies. They achieve this by lobbying, organizing protests, engaging in public campaigns and using the media to shape public opinion. Their goal is to ensure thatgovernment decisions reflect the needs and concerns of different segments of society.",
    "year": "2024"
  },
  {
    "number": "1884",
    "text": "Promoting electoral integrity is the crucial function of which institution of state?",
    "options": {
      "A": "the civil society organisations",
      "B": "executive arm of government",
      "C": "electoral management body",
      "D": "security services"
    },
    "answer_url": "https://myschool.ng/classroom/government/71844?exam_type=waec&type=obj&page=377",
    "correct_answer": "C",
    "explanation": "The electoral management body is the institution responsible for organising, conducting and overseeing elections to ensure they are free, fair, and credible. It establishes electoral guidelines, monitors compliance, and ensures transparency in the electoral process. In Nigeria, for example, the Independent National Electoral Commission (INEC) performs this role.",
    "year": "2024"
  },
  {
    "number": "1885",
    "text": "These rights which are explicitly protected by the Constitution are referred to as",
    "options": {
      "A": "checks and balances",
      "B": "constitutional clauses",
      "C": "entrenched clauses",
      "D": "separation of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/71846?exam_type=waec&type=obj&page=377",
    "correct_answer": "C",
    "explanation": "Entrenched clauses refer to provisions in the Constitution that are explicitly protected and cannot be easily altered or abolished without following a special procedure. It usually requires a supermajority vote or a referendum for amendment. These clauses protect fundamental rights and liberties.",
    "year": "2024"
  },
  {
    "number": "1886",
    "text": "Constitutionally, the local government administration is controlled by the state through",
    "options": {
      "A": "administrators",
      "B": "legislation",
      "C": "native laws",
      "D": "state bureau"
    },
    "answer_url": "https://myschool.ng/classroom/government/71847?exam_type=waec&type=obj&page=378",
    "correct_answer": "B",
    "explanation": "In most countries, including Nigeria, local government administrations are constitutionally controlled by the state throughlegislation. This means that state governments have the authority to pass laws that define and regulate the operations, functions and powers of local government areas within their jurisdiction.",
    "year": "2024"
  },
  {
    "number": "1887",
    "text": "Which state institution is referred to as the bureaucratic wing responsible for the running of government offices, agencies and departments?",
    "options": {
      "A": "Bureau of National Affairs",
      "B": "Civil Service",
      "C": "Controller of state services",
      "D": "Public services board"
    },
    "answer_url": "https://myschool.ng/classroom/government/71848?exam_type=waec&type=obj&page=378",
    "correct_answer": "B",
    "explanation": "TheCivil Serviceis the bureaucratic wing responsible for the administration and management of government offices, agencies and departments. It comprises non-political, permanent government employees who are tasked with implementing government policies and ensuring the smooth functioning of public services.",
    "year": "2024"
  },
  {
    "number": "1888",
    "text": "The local government administration in many West African countries is faced with a myriad of problems one of which is",
    "options": {
      "A": "employment retention",
      "B": "illiterate traditional authorities",
      "C": "unavailability of land",
      "D": "weak institution"
    },
    "answer_url": "https://myschool.ng/classroom/government/71849?exam_type=waec&type=obj&page=378",
    "correct_answer": "A",
    "explanation": "One of the key challenges faced by local government administrations in many West African countries isemployment retention. This refers to the difficulty of maintaining a stable and motivated workforce within local government institutions, due to factors such as low wages, lack of career development opportunities and political interference.",
    "year": "2024"
  },
  {
    "number": "1889",
    "text": "One of the following options  does not pass as a means of ensuring the independence of the judiciary which is",
    "options": {
      "A": "immunity from prosecution",
      "B": "promotion on merit",
      "C": "security of tenure",
      "D": "salary determined by the executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/71850?exam_type=waec&type=obj&page=378",
    "correct_answer": "D",
    "explanation": "For the judiciary to remain independent, its members must be free from undue influence or control, especially from the executive or legislative branches.Salary determined by the executivecompromises this independence, as it could lead to political pressure or manipulation. In contrast,immunity from prosecution,promotion on merit, andsecurity of tenureare all important safeguards to ensure that judges can carry out their duties impartially and without fear of reprisal.",
    "year": "2024"
  },
  {
    "number": "1890",
    "text": "As part of its constitutional mandate, the Public Service Commission operates to",
    "options": {
      "A": "appoint the head of the commission",
      "B": "carry out the order of the presidency only",
      "C": "recruit high ranking personnel for the civil service",
      "D": "review salaries and allowances of staff of the executive only"
    },
    "answer_url": "https://myschool.ng/classroom/government/71851?exam_type=waec&type=obj&page=378",
    "correct_answer": "C",
    "explanation": "ThePublic Service Commissionis responsible for overseeing the recruitment, promotion and discipline of personnel within the public service, including the civil service. One of its key functions is torecruit high-ranking personneland ensure that appointments are made based on merit. This is crucial for maintaining professionalism and efficiency within the public sector.",
    "year": "2024"
  },
  {
    "number": "1891",
    "text": "The impartiality of the civil servants is important to the governance structure because they work for the interest of the",
    "options": {
      "A": "bureaucrat",
      "B": "executive",
      "C": "presidency",
      "D": "state"
    },
    "answer_url": "https://myschool.ng/classroom/government/71853?exam_type=waec&type=obj&page=379",
    "correct_answer": "D",
    "explanation": "The impartiality of civil servants is crucial to the governance structure because they are meant to serve thestateand the public, not individual political figures or parties. Civil servants must carry out their duties professionally and impartially, ensuring the continuity of government functions and the effective delivery of public services, regardless of political changes in leadership. Their primary responsibility is to serve the nation and its citizens, rather than any specific individual or political group.",
    "year": "2024"
  },
  {
    "number": "1892",
    "text": "Which one of the following cannot be considered as a factor that influences the delimitation of a country into constituencies?",
    "options": {
      "A": "administrative convenience",
      "B": "geographical proximity",
      "C": "historical experience",
      "D": "political socialisation"
    },
    "answer_url": "https://myschool.ng/classroom/government/71854?exam_type=waec&type=obj&page=379",
    "correct_answer": "D",
    "explanation": "Political socialisationrefers to the process by which individuals learn and develop political values, attitudes, and behaviours. While it influences political participation and opinions, it does not impact thedelimitation of constituencies.\nOn the other hand, factors such asadministrative convenience,geographical proximityandhistorical experienceare directly involved in how constituencies are drawn. These factors help ensure constituencies are created in a way that makes governance efficient, manageable and reflective of existing geographic or historical boundaries.",
    "year": "2024"
  },
  {
    "number": "1893",
    "text": "A type of constitution suitable for the governance of a federal state is a",
    "options": {
      "A": "flexible constitution",
      "B": "rigid constitution",
      "C": "republican constitution",
      "D": "parliamentary constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/71856?exam_type=waec&type=obj&page=379",
    "correct_answer": "B",
    "explanation": "Arigid constitutionis one that is difficult to amend because it requires a special procedure or approval from multiple levels of government. This type of constitution is suitable for federal states because it ensures that the division of powers between the central government and the states is protected from frequent or arbitrary changes. It provides stability and safeguards the autonomy of the constituent states. In contrast, aflexible constitutionis easier to amend and might not provide the same level of protection for the federal structure.",
    "year": "2024"
  },
  {
    "number": "1894",
    "text": "A set of principles enshrined in a constitution that guide the government in making laws and policies for the welfare of the people is referred to as",
    "options": {
      "A": "directive principle of state policy",
      "B": "constitutional provisions",
      "C": "Human Rights and Administrative Justice",
      "D": "edicts, customs and traditions"
    },
    "answer_url": "https://myschool.ng/classroom/government/71857?exam_type=waec&type=obj&page=379",
    "correct_answer": "A",
    "explanation": "Directive Principles of State Policyare a set of principles enshrined in a constitution that guide the government in making laws and policies aimed at promoting the welfare of the people. These principles are not necessarily enforceable by courts but serve as fundamental guidelines for governance. InNigeriaandIndia, theDirective Principles of State Policy (DPSP)emphasise economic welfare and good governance and ensure that the government works towards improving the lives of the citizens.",
    "year": "2024"
  },
  {
    "number": "1895",
    "text": "Which situation in a democratic state can create an environment where military intervention is perceived as the only option to restore order, protect the population or address grievances?",
    "options": {
      "A": "boycott of elections",
      "B": "economic crises",
      "C": "political crises",
      "D": "youth unemployent"
    },
    "answer_url": "https://myschool.ng/classroom/government/71858?exam_type=waec&type=obj&page=379",
    "correct_answer": "C",
    "explanation": "In a democratic state,political crisessuch as political instability, government corruption, lack of effective governance or the breakdown of democratic processes can create an environment where military intervention is perceived as the only option to restore order, protect the population or address grievances. When political leaders fail to resolve issues through democratic means, people may lose faith in the political system, leading to the perception that military intervention is necessary to restore stability. While other factors likeeconomic crisesandyouth unemploymentcan contribute to instability,political crisesdirectly challenge the functioning of democratic institutions and can make military intervention seem like the last resort.",
    "year": "2024"
  },
  {
    "number": "1896",
    "text": "Despite the many challenges bedevilling the Economic Community of West African States (ECOWAS), it has managed over the years in promoting",
    "options": {
      "A": "collective will against globalisation",
      "B": "trade tariffs and self-reliance",
      "C": "regional integration and cooperation"
    },
    "answer_url": "https://myschool.ng/classroom/government/71860?exam_type=waec&type=obj&page=380",
    "correct_answer": "C",
    "explanation": "Despite the many challenges faced by theEconomic Community of West African States (ECOWAS), it has successfully promotedregional integration and cooperationamong its member countries. This has been achieved through efforts to foster economic collaboration, reduce trade barriers, promote peace and security and enhance political cooperation across the West African region.\nECOWAS aims to strengthen ties between member states, making them more resilient and better able to address collective challenges. This focus on integration and cooperation has been one of its central goals, despite the various hurdles it faces.",
    "year": "2024"
  },
  {
    "number": "1897",
    "text": "One of the reasons for which the United Nations (UN) is considered as the only influential world body is the fact that it",
    "options": {
      "A": "plays a crucial role in international diplomacy",
      "B": "supports the war mission of member countries",
      "C": "influences regime change by supporting the opposition",
      "D": "withholds humanitarian support to military regimes"
    },
    "answer_url": "https://myschool.ng/classroom/government/71861?exam_type=waec&type=obj&page=380",
    "correct_answer": "A",
    "explanation": "TheUnited Nations (UN)is considered the most influential global body because it plays a crucial role ininternational diplomacy.It acts as a platform for dialogue and negotiations among member states. The UN helps resolve conflicts, facilitates peacekeeping operations, coordinates humanitarian aid and sets international norms and standards. This ability to bring countries together to discuss and resolve global issues is a key reason for its influence.",
    "year": "2024"
  },
  {
    "number": "1898",
    "text": "The African Union (AU) aims at ensuring the following developments in member countries except for",
    "options": {
      "A": "equal distribution of wealth",
      "B": "governance and democracy",
      "C": "peace and security",
      "D": "social development"
    },
    "answer_url": "https://myschool.ng/classroom/government/71862?exam_type=waec&type=obj&page=380",
    "correct_answer": "B",
    "explanation": "While theAfrican Union (AU)works to promotepeace and security,social developmentandequal distribution of wealthin its member states,governance and democracyare more about the political systems within individual countries, and the AU’s focus is often on addressing broader issues like conflict, poverty and economic development. The AU does advocate for democratic principles, but its direct aim is not always to enforce or ensure democracy in each member state.",
    "year": "2024"
  },
  {
    "number": "1899",
    "text": "The Commonwealth of Nations concerns itself with one of the following activities in member countries which is",
    "options": {
      "A": "assisting in the overthrow of unpopular government",
      "B": "conducting elections in member countries",
      "C": "operating the financial sector of poor countries",
      "D": "promotion of peace and security"
    },
    "answer_url": "https://myschool.ng/classroom/government/71864?exam_type=waec&type=obj&page=380",
    "correct_answer": "D",
    "explanation": "TheCommonwealth of Nationsis primarily focused on promotingpeace and securityamong its member countries, along with fostering cooperation in areas such as democracy, development and human rights.",
    "year": "2024"
  },
  {
    "number": "1900",
    "text": "The African Union (AU) aims to promote gender equality and women's empowerment through the strategic framework organ of the",
    "options": {
      "A": "African Peer Review Mechanism (APRM)",
      "B": "African Development Bank (ADB)",
      "C": "New Partnership for Africa's Development (NEPAD)",
      "D": "Specialised Commission of Women Empowerment (SCWE)"
    },
    "answer_url": "https://myschool.ng/classroom/government/71866?exam_type=waec&type=obj&page=380",
    "correct_answer": "D",
    "explanation": "TheAfrican Union (AU)works to promote gender equality and women's empowerment through various mechanisms, including theSpecialised Commission of Women Empowerment (SCWE). This body focuses on advancing the rights of women, advocating for gender equality and empowering women across the African continent.",
    "year": "2024"
  },
  {
    "number": "1901",
    "text": "What encompasses a range of diplomatic, political, economic and security decisions and actions that a state embarks on to protect and promote sovereignty on the global stage?",
    "options": {
      "A": "Alliances",
      "B": "Foreign policy",
      "C": "National interest",
      "D": "constitutionalism"
    },
    "answer_url": "https://myschool.ng/classroom/government/71868?exam_type=waec&type=obj&page=381",
    "correct_answer": "B",
    "explanation": "Foreign policyrefers to the range ofdiplomatic, political, economic and security decisions and actionsthat a state undertakes to protect and promote its sovereignty, interests and position on the global stage. It encompasses how a country interacts with other nations and addresses global challenges, including negotiations, treaties, trade agreements, and military actions.",
    "year": "2024"
  },
  {
    "number": "1902",
    "text": "What colonial policy worked against the sovereign power and authority and the traditional political authority and institutions?",
    "options": {
      "A": "Crown Colony Edict",
      "B": "Expatriate Edict",
      "C": "Indirect Rule",
      "D": "Protectorate Colony Edict"
    },
    "answer_url": "https://myschool.ng/classroom/government/71870?exam_type=waec&type=obj&page=381",
    "correct_answer": null,
    "explanation": "Indirect Rulewas a colonial policy implemented by the British in many parts of Africa, including Nigeria, where colonial powers governed through existing local leaders and traditional political structures. While this system appeared to preserve some local authority, it often undermined the sovereignty and true political power of the traditional institutions.\nColonial rulers maintained ultimate control and could override traditional systems when necessary, thus weakening the authority of indigenous governance.",
    "year": "2024"
  },
  {
    "number": "1903",
    "text": "The surge in nationalism and its related activities was fueled by oppressive colonial experiences and",
    "options": {
      "A": "partition of West African territories",
      "B": "the strong desire for civilisation",
      "C": "ideology and activities of Pan-Africanism",
      "D": "monopoly of mineral resources and land degradation"
    },
    "answer_url": "https://myschool.ng/classroom/government/71872?exam_type=waec&type=obj&page=381",
    "correct_answer": "C",
    "explanation": "The surge in nationalism in many African countries, particularly in West Africa, was fueled by oppressive colonial experiences and theideology and activities of Pan-Africanism. Pan-Africanism promoted solidarity among Africans and advocated for the liberation of African nations from colonial rule. It emphasised the unity of all people of African descent, which played a significant role in galvanizing nationalist movements across the continent. Pan-African leaders, such as Kwame Nkrumah and W.E.B. Du Bois, inspired many to seek independence and resist colonial domination.",
    "year": "2024"
  },
  {
    "number": "1904",
    "text": "Which institution of state enables different groups and interests to be represented as well as actively participate in the political space?",
    "options": {
      "A": "Advocate Groups",
      "B": "Democracy",
      "C": "Judiciary",
      "D": "Political party"
    },
    "answer_url": "https://myschool.ng/classroom/government/71875?exam_type=waec&type=obj&page=381",
    "correct_answer": "D",
    "explanation": "Apolitical partyenables different groups and interests to be represented and actively participate in the political space. Political parties serve as platforms through which citizens with similar ideologies, values and interests can organise and voice their concerns.\nThey play a crucial role in the political process by contesting elections, forming governments and influencing public policy. Political parties provide the means for citizens to engage in the democratic process and ensure that various societal interests are represented in governance.",
    "year": "2024"
  },
  {
    "number": "1905",
    "text": "Nationalism played a crucial role in the struggle for independence in West Africa by way of fostering a sense of community among the people and",
    "options": {
      "A": "abhorrence of the Western style of governance",
      "B": "civil disobedience and the killings of white officials",
      "C": "dismantling of artificial borders",
      "D": "political consciousness"
    },
    "answer_url": "https://myschool.ng/classroom/government/71877?exam_type=waec&type=obj&page=381",
    "correct_answer": "D",
    "explanation": "Nationalism in West Africa played a crucial role in the struggle for independence by fosteringpolitical consciousnessamong the people. This heightened awareness helped citizens recognise the importance of self-rule, the need to challenge colonial powers, and the desire to reclaim their sovereignty.\nNationalist movements encouraged people to unite against colonial rule, promoting ideas of self-determination and self-governance. Political consciousness helped galvanize the masses to demand independence and participate actively in the struggle for freedom, leading to the eventual decolonization of many West African nations.",
    "year": "2024"
  },
  {
    "number": "1906",
    "text": "The Crown Colony policy introduced some progressive institutions of governance in West Africa such as the",
    "options": {
      "A": "creation of the rigid class system",
      "B": "education of the traditional rulers",
      "C": "introduction of the Western legal system",
      "D": "introduction of military academy"
    },
    "answer_url": "https://myschool.ng/classroom/government/71886?exam_type=waec&type=obj&page=382",
    "correct_answer": "C",
    "explanation": "Under theCrown Colony policy, which was implemented by the British in various parts of their colonies in West Africa, one of the key features was theintroduction of the Western legal system. This system replaced or modified many of the traditional laws and customs that existed before colonial rule. The British introduced their own legal frameworks, courts, and procedures, which were based on English law, to govern the colonies. This was part of the broader colonial policy of imposing British systems of governance, law, and administration.",
    "year": "2024"
  },
  {
    "number": "1907",
    "text": "The following influential nationalist leaders contributed significantly to shaping the political destiny and nation-states of West Africa except",
    "options": {
      "A": "Dawda Kairaba Jawara",
      "B": "Kwame Nkrumah",
      "C": "Nnamdi Azikwe",
      "D": "Oliver Tambo"
    },
    "answer_url": "https://myschool.ng/classroom/government/71928?exam_type=waec&type=obj&page=382",
    "correct_answer": "D",
    "explanation": "Oliver Tambo was a South African anti-apartheid activist and leader of the African National Congress (ANC). While he played a major role in the struggle against apartheid in South Africa, he was not directly involved in the nationalist movements that led to the independence of West African nations.",
    "year": "2024"
  },
  {
    "number": "1908",
    "text": "Diplomacy plays a vital role in shaping the interactions between states and by extension maintaining",
    "options": {
      "A": "bipolar world",
      "B": "global stability",
      "C": "power blocks",
      "D": "unipolar world"
    },
    "answer_url": "https://myschool.ng/classroom/government/71929?exam_type=waec&type=obj&page=382",
    "correct_answer": "B",
    "explanation": "Diplomacy is essential in maintainingglobal stabilitybecause it helps resolve conflicts, fosters cooperation, and promotes peaceful interactions between states. Through negotiations, treaties, and international relations, diplomacy prevents wars, encourages economic ties, and ensures that disputes are settled through dialogue rather than force.",
    "year": "2024"
  },
  {
    "number": "1909",
    "text": "Military rule does not only pose a threat to democracy but also to",
    "options": {
      "A": "fundamental human rights",
      "B": "national borders",
      "C": "nationalism and patriotism",
      "D": "state sovereignty"
    },
    "answer_url": "https://myschool.ng/classroom/government/71930?exam_type=waec&type=obj&page=382",
    "correct_answer": "A",
    "explanation": "Military rule often leads to thesuspension of fundamental human rights, such as freedom of speech, political participation, and the right to a fair trial. Military governments typically enforce strict control, limit civil liberties, and suppress opposition through censorship, arrests, or even violence.",
    "year": "2024"
  },
  {
    "number": "1910",
    "text": "The following constitute the key features of most independent constitutions in West African States except",
    "options": {
      "A": "nationalist leaders became army commanders",
      "B": "democratic principles of governance",
      "C": "national unity and diversity",
      "D": "socio-economic rights and development"
    },
    "answer_url": "https://myschool.ng/classroom/government/71931?exam_type=waec&type=obj&page=382",
    "correct_answer": "A",
    "explanation": "Most independent constitutions in West African states were designed to promotedemocratic governance, national unity and socio-economic development. They established frameworks for multi-party democracy, civil rights and economic progress. However, they didnotmake provisions for nationalist leaders to becomearmy commanders.",
    "year": "2024"
  },
  {
    "number": "1911",
    "text": "The grave effect of the French Colonial Policy of Assimilation in her West African Colonies was the",
    "options": {
      "A": "aggressive development of nationalism",
      "B": "shortfall in the essential needs of the colonies",
      "C": "slow pace in their political fortunes",
      "D": "waging war on neighbouring colonial territories"
    },
    "answer_url": "https://myschool.ng/classroom/government/71934?exam_type=waec&type=obj&page=383",
    "correct_answer": "C",
    "explanation": "TheFrench policy of Assimilationaimed to turn Africans into “Frenchmen” by imposing French culture, laws and governance structures on them. However, this policy had anegative impact on the political developmentof the colonies.",
    "year": "2024"
  },
  {
    "number": "1912",
    "text": "The British Colonial policy in her West African territories was marked by the following strategies and structures except",
    "options": {
      "A": "divide and rule",
      "B": "economic exploitation",
      "C": "indirect rule",
      "D": "investments in the colonies"
    },
    "answer_url": "https://myschool.ng/classroom/government/71935?exam_type=waec&type=obj&page=383",
    "correct_answer": "D",
    "explanation": "The British didnot prioritise major investmentsin infrastructure unless they directly benefited colonial administration and trade (e.g., railways to transport goods to ports). Mostprofits from West African resourceswere sent to Britain rather than reinvested in local development. Education and healthcare systems wereunderdevelopedcompared to what was available in Britain.",
    "year": "2024"
  },
  {
    "number": "1913",
    "text": "Globalisation impacts the development and progress of West African States by way of",
    "options": {
      "A": "manipulation of economics of states",
      "B": "propping of regimes",
      "C": "protecting state sovereignty",
      "D": "technology transfer"
    },
    "answer_url": "https://myschool.ng/classroom/government/71936?exam_type=waec&type=obj&page=383",
    "correct_answer": "D",
    "explanation": "Globalisation has significantly influencedWest African developmentthrough thetransfer of technology, which has:\nImprovedcommunication and information access(e.g., mobile phones, the internet).Enhancedindustrial and agricultural productivitythrough modern tools and equipment.Boostededucation and healthcarewith advanced research, digital learning, and medical innovations.Strengthenedeconomic growthby facilitating trade, banking, and digital financial services.",
    "year": "2024"
  },
  {
    "number": "1914",
    "text": "Power, authority, legitimacy and sovereignty are described in the study of government as what?",
    "options": {
      "A": "Basic Concepts and Principles",
      "B": "Constitutionalism and Meanings",
      "C": "Principles and Structures",
      "D": "Structure of Governance"
    },
    "answer_url": "https://myschool.ng/classroom/government/71937?exam_type=waec&type=obj&page=383",
    "correct_answer": "A",
    "explanation": "In the study of government,Power, Authority, Legitimacy, and Sovereigntyare regarded asbasic concepts and principlesbecause they form the foundation of political science and governance.\nPower– The ability to influence or control people and decisions.Authority– The legitimate right to exercise power, often backed by law or tradition.Legitimacy– The acceptance of authority by the people, giving it credibility.Sovereignty– The supreme power of a state to govern itself without external interference.",
    "year": "2024"
  },
  {
    "number": "1915",
    "text": "A government with corrupt rulers who use their power to exploit the people and natural resources of their own territory to extend their personal wealth and political power is described as",
    "options": {
      "A": "autocracy",
      "B": "capitalism",
      "C": "kleptocracy",
      "D": "oligarchy"
    },
    "answer_url": "https://myschool.ng/classroom/government/71939?exam_type=waec&type=obj&page=383",
    "correct_answer": "C",
    "explanation": "Akleptocracyis a government where rulersexploit national resources and use their power for personal gainrather than for the welfare of the people. In such regimes:\nCorrupt leadersembezzle public fundsand mismanage resources.Government policies benefitthe ruling classrather than the citizens.Public institutions are weakened due tocorruption and nepotism.The state’s wealth is oftenhidden in offshore accounts or foreign investments.",
    "year": "2024"
  },
  {
    "number": "1916",
    "text": "In what way can the local government system assist in national development? By",
    "options": {
      "A": "aligning local efforts with broader national goals",
      "B": "depending on the central government for basic needs and development",
      "C": "encouraging youth movement to the industrial centres",
      "D": "ensuring only top-bottom policies of government are supported"
    },
    "answer_url": "https://myschool.ng/classroom/government/71940?exam_type=waec&type=obj&page=384",
    "correct_answer": "A",
    "explanation": "Local governments play a crucial role innational developmentby ensuring thatgrassroots efforts align with national objectives. This is done through:\nImplementing national policies at the local level– Ensuring that development plans reach rural and urban communities.Encouraging local economic growth– Supporting small businesses, agriculture, and local industries to contribute to national progress.Providing essential services– Education, healthcare, infrastructure, and public utilities are crucial for national stability and growth.Promoting democratic participation– Allowing citizens to engage in governance and decision-making enhances accountability and national unity.",
    "year": "2024"
  },
  {
    "number": "1917",
    "text": "The perceived perennial problem of the United Nations (UN) since its inception is the",
    "options": {
      "A": "Directive Principles of State Policy",
      "B": "deep-seated diversity among member states",
      "C": "nature of political leaders and their ages",
      "D": "poor constitutional provisions of member states"
    },
    "answer_url": "https://myschool.ng/classroom/government/71941?exam_type=waec&type=obj&page=384",
    "correct_answer": "B",
    "explanation": "Since its inception in 1945, theUnited Nations (UN)has faced challenges due to thevast political, economic and cultural differences among its member states. This diversity creates obstacles in:\nDecision-making– Member states often have conflicting national interests, making it difficult to reach a consensus on global issues.Peacekeeping efforts– Different political ideologies and regional conflicts hinder collective action.Economic disparities– Developing nations struggle to have equal influence in global affairs.Veto power of permanent Security Council members– The interests of powerful nations (e.g., the U.S., China, Russia) often override global concerns.",
    "year": "2024"
  },
  {
    "number": "1918",
    "text": "For the executive to enjoy the goodwill of the people in a democratic state, it must adhere to the tenets of",
    "options": {
      "A": "the Council of State",
      "B": "exercise of unrestrained power",
      "C": "laissez-faire government",
      "D": "political equality"
    },
    "answer_url": "https://myschool.ng/classroom/government/71942?exam_type=waec&type=obj&page=384",
    "correct_answer": "D",
    "explanation": "For a government to gain and maintain thegoodwill of the people in a democratic state, it must upholdpolitical equality, which ensures that:\nAll citizens have equal political rights– Every individual, regardless of background, has the right to vote, run for office, and participate in governance.Laws and policies apply equally– No group should be favoured over another in decision-making.Fair representation exists– Public offices and government policies should reflect the diversity of the population.Transparency and accountability– A government that respects political equality listens to its citizens and remains accountable.",
    "year": "2024"
  }
]