[
  {
    "number": "37",
    "text": "(a) State the major elements contained in each of specimens A, B and C.\n(b) Give three uses of specimens A and B.\n(c) Explain three ways in which specimen C is important in agriculture.\n(d) Describe three physical differences between specimens B and C.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59782?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "38",
    "text": "(a)(i) Mention the field operation that could be performed Using specimens G, H, I and J\n(ii) Name three other pieces of equipment that may be added to specimens G, H, l, and J to perform the operation you have mentioned in (a)(i).\n(iii) State one precaution that should be taken when using specimen J.\n \n(b). State two uses of each specimen K and L.\nSpecimen K;        Specimen L;\n           \n(ii) State two structural differences between specimens K and L.\n(iii) Mention two problems that could result from leaving specimen L on the field after use.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59783?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "39",
    "text": "(a) ldentify specimens M, N, and O by their common names and their scientific names.\nSpecimen M;             Specimen N;              Specimen O;\n                       \n \n(b)(i) Name one pest and one disease that attack the crop from which specimen O is obtained.\n(ii) State one control measure for each of the pests and diseases mentioned in (b)(i).\n \n(c) Mention three uses of specimen M.\n \n(d) State two methods of preserving specimen N.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59785?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "40",
    "text": "(a) ldentify specimen P, Q, and R.\nSpecimen P;                Specimen Q;            Specimen R;\n                      \n(b) Name the part of the host where each of specimens P, Q and R can be found.\n(c) Mention three ways by which specimen P is adapted to survive in the host.\n(d) State three effects of specimen Q on the host.\n(e) List four diseases transmitted by specimen R.\n(f) State four control measures of specimen R.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59788?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  }
]