[
  {
    "number": "82",
    "text": "(a) Study carefully specimens A, B, C, and D. copy and complete the table below\n\n\n\nSpecimen\nPart modified to form specimen\nMode of propagation\nStored material\n\n\nA\n \n \n \n\n\nB\n \n \n \n\n\nC\n \n \n \n\n\nD\n \n \n \n\n\n\n(b) In a tabular form state four observable differences between specimens A and C.\n(c) Crush a small portion of specimen D and divide it into three equal parts. (i) Place a portion on a white tile and add two (2) drops of iodine solution.\n(ii) Place another portion in a test tube and add one (1) ml of distilled water and shake. Add few drops of sodium hydroxide solution and shake again. Slowly add a few drop of 1% Copper (ii) sulphate solution. (iii) Smear the third part on a filter paper, leave for about five (5) minutes and observe carefully",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60744?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "83",
    "text": "Study carefully specimen E and F and use them to answer questions 2(a) to 2(d).\n(a) (i) What class of organism do specimen E and F belong to?\n(ii) State three similarities between specimen E and F.\n(iii) In a tabular form, state three differences between specimens E and F;\n(b) State two ways each in which: (i) Specimen E (ii) Specimen F are of economic importance.\n(C)(i) State one observable feature each of specimens E and F and how these features adapt the specimens against predation.\n(ii) Name the habitats of specimens E and F.\n(d) Remove all the wings of specimen E. Make a drawing 8-10 cm long of the dorsal view of specimen E and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60746?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "84",
    "text": "Carefully study specimens J and K and answer questions 4(a) to 4(d).\n(a) Name the type of refuse in specimens: (i) J (ii) K.\n(b) List three animal vectors of disease causing organisms that breed on a each of specimens J ana K.\n(ii) Name four diseases each caused by animal vectors associated with each or specimen J and K.\n(c) Name one method of disposal of each of specimens J and K in: (i) rural areas (ii) urban areas.\n(d)(i)State four effects of improper disposal of specimen K\n(ii) In a tabular form. state five differences between specimens J and K.\n(iii) outline one way in which specimen J is of importance to farmers.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60748?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  }
]