[
  {
    "number": "55",
    "text": "1 (a) (i) identify specimens A and B without reasons  (ii) Give four differences between specimens A and B .\nUsing a sharp knife, scalpel or blade, cut specimen B into two equal halves to expose the internal structures.\nb. (i) Make a labeled drawing of 8 cm to 10cm long to show the observable internal structures of specimen B.\n(ii) State the dispersal mechanism of specimen B.\n(C)(i) Identify  C, D and E without reasons. (ii) State two features, each of specimen C, D and E which adapt  to their habitats. \n2. The height (cm) of 20 students in a class are as follows:.155, 157, 151 169, 162, 151, 149, 165, 169,176.169, 179,173, 179, 173, 169, 157, 155, 165, 157, 197 and 162.\nUse them to answer the following questions:\n(a) Make a frequency distribution table of class interval of five of the different heights  (b) what is the modal height? (ii) median height? (ii) mean height? \n (c) (i) Construct a histogram showing the variation of height, amongst the students with the heights on the horizontal number of students on the vertical axis.\n (ii) How many students fall into each or the height axis and number of students on the vertical axis.\n (iii) How many students have height between 155 and 179?\n (iv) Find the difference in height between shortest and the tallest students. \n(d) (i)What type of variation is height? (ii) Mention three other examples of the type of variation in (d) (i) above.\n3.(a) identify specimen F, G, H, I, J, and K without reasons. (b)(i) State one observable feature by which each of specimens F,G and H obtain their food. \n(ii) State three observable features which contribute to the survival of specimen I. \n(c)Mention two observable characteristics each, of specimens J and K. (ii) Name the two bones, each, which articulates with specimens J and K \n(iii) Make a labeled drawing of 8cm to 10 cm long of specimens K.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60205?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "No official explanation is available for this question at this time. Please check contributions posted by others below. If you can provide an explanation to help other student learn, please",
    "year": "2000"
  }
]