[
  {
    "number": "40",
    "text": "You are provided with a retort stand, clamp and boss, a pendulum bob, a piece of thread, and other necessary apparatus. Carry out the fo lowing experiment:\n\nSet up the apparatus as shown in the diagram above:\nmeasure and record the distance = 130cm from the centre of the bob to the point of suspension of the pendulum\ndisplace the pendulum through a small angle and release. Allow the pendulum to oscillate freely;\ndetermine the time t for 20 complete oscillations;\nalso, determine the period T of the oscillations\nevaluate T\\(^{2}\\) and L = -30;\nrepeat the procedure for four other values of l = 110, 90, 70, and 50 cm\nin each case, determine t and evaluate T,T\\(^{2}\\) and L. Tabulate your readings.\nplot of a graph of T\\(^{2}\\) on the vertical axis against L on the horizontal axis, starting both axes from the origin (0,0)\ndetermine the slope, s, of the graph. Also determine the intercept, C, of the graph on the T\\(^{2}\\) axis;\nevaluate: i. k\\(_{1}\\) = \\(\\frac{4\\pi^{2}}{s_{1}}\\),\n\t               ii.  k\\(_{2}\\) = \\(\\frac{c}{8}\\) [Take \\(\\pi\\) = \\(\\frac{22}{7}\\)]\nstate two precautions taken to ensure accurate results.\n\n(b)i. What is meant by the period of oscillation of an oscillating body?\ni. Explain the acceleration of free fall due to gravity.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60039?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  },
  {
    "number": "41",
    "text": "Using the above diagram as a guide, carry out the following experiment:\n\nPlace the equilateral triangular glass prism on the drawing paper. Trace the outline ABC of the prism.\nremove the prism. Draw a line NO such that it makes an angle i = 25º with the normal at point O on side AB\nfix two pins R\\(_{1}\\) and R\\(_{2}\\) vertically on line N0. Replace the prism on its outline;\nplace the reflecting surface of the plane mirror in contact with the face AC of the prism;\nlooking through the face BC of the prism, fix two other pins at R\\(_{3}\\) and R\\(_{4}\\) such that the pins appear to be in a straight line with the images of the pins at R\\(_{1}\\) and R\\(_{2}\\);\nremove the prism, the mirror, and the pins. Draw a line to join points R\\(_{4}\\) and R\\(_{3}\\)\nproduce line R\\(_{4}\\)R\\(_{3}\\) to meet line NO produced at T;\nmeasure and record the angle \\(\\theta\\) at T and e at D;\nrepeat the procedure for four other values of i = 30°, 35°, 40°, and 45°. In each case, measure and record the corresponding values of \\(\\theta\\) and e. Tabulate your readings;\nplot a graph of e on the vertical axis and \\(\\theta\\) on the horizontal axis;\nevaluate k = s\\(^{-1}\\) \nstate two precautions taken to ensure accurate results. [Attach your traces to your answer booklet]\n\n(b)i. State four characteristics of the image of an object formed by a plane mirror.\nii. State two Conditions necessary for total internal reflection to occur in a medium.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60041?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  },
  {
    "number": "42",
    "text": "You have been provided with an accumulator E, a standard resistor Rx, two resistance boxes RB\\(_{1}\\) and RB\\(_{2}\\), two keys K\\(_{1}\\) and K\\(_{2}\\) and other necessary apparatus.\n\nMeasure and record the e.m.f of the accumulator.\nConnect a circuit as shown above.\nSet the resistance R, in the resistance box such that R in RB\\(_{1}\\) = R in RB\\(_{2}\\) = 1\\(\\Omega\\).\nWith K\\(_{1}\\) open and K\\(_{2}\\) closed, measure and record the potential difference V across the standard resistor Rx. (v) Close K, and K,. Read and record the potential difference V\\(_{o}\\) across Rx.\nEvaluate V\\(_{1}^{-1}\\)\nRepeat procedure (v) for four other values of R = 2, 3, 4 and 5\\(\\Omega\\) respectively. In each case, ensure that the value of R in RB\\(_{1}\\) is equal to the value of R in RB\\(_{2}\\).\nEvaluate V\\(_{1}^{-1}\\) in each case. Tabulate your readings.\nPlot a graph of V\\(_{1}^{-1}\\) on the vertical axis against R on the horizontal axis starting both axes from the origin (0,0).\nDetermine the slope, s, of the graph and the intercept on the vertical axis.\nEvaluate y = \\(\\frac{1}{s}\\)\n State two precautions taken to ensure accurate results\n\n(b)i. Explain what is meant by the potential difference between two points in an electric circuit\nii. A cell has an e.m.f. of 3 V. When it is connected across a resistor of resistance 4\\(\\Omega\\), a current 0.5A passes through the circuit. Calculate the internal resistance of the cell.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60043?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  }
]