[
  {
    "number": "28",
    "text": "You are provided with a wooden block to which a hook is fixed, a set of masses, spring balance, and other necessary materials. Using the diagram above as a guide, carry out the following instructions.\n\nRecord the mass m\\(_{0}\\), indicated on the wooden block.\nPlace the block on the table.\nAttach the spring balance to the hook.\nPull the spring balance horizontally with a gradual increase in force until the block just starts to move Record the spring balance reading F.\nRepeat the procedure by placing in turn mass m=200, 400, 600, and 800g on top of the block. In each case, read and record the corresponding value of F.\nEvaluate M = m\\(_{0}\\) + m and R = \\(\\frac{m}{100}\\) in each case\nTabulate your readings.\nPlot a graph with F on the vertical axis and R on the horizontal axis\nDetermine the slope, s, of the graph.\nState two precautions taken to ensure accurate results.\n\n(b)i. Define coefficient of static friction. \nii. A block of wood of mass 0.5 kg is pulled horizontally on a table by a force of 2.5 N. Calculate the coefficient of static friction between the two surfaces.(g = 10ms\\(^{-2}\\))",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60006?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "29",
    "text": "Use the diagram above as a guide to carry out the following experiment.\n\nTrace the outline ABCD of the rectangular glass prism on the drawing paper provided.\nRemove the prism. Select a point N on AB such that AN is about one-quarter of AB.\nDraw the normal LNM. Also, draw a line RN to make an angle \\(\\theta\\) = 75° with AB at N.\nFix two pins at P\\(_{1}\\) and P\\(_{2}\\) on line RN. Replace the prism on its outline.\nFix two other pins at P\\(_{3}\\) and P\\(_{4}\\) such that they appear to be in a straight line with the images of the pins at P\\(_{1}\\) and P\\(_{2}\\) when viewed through the prism from DC.\n(vi) Remove the prism and the pins at P\\(_{3}\\) and P\\(_{4}\\). Draw a line to join P\\(_{3}\\) and P\\(_{4}\\) \nProduce line P\\(_{4}\\) P\\(_{3}\\) to meet the line DC at O. Draw a line to join NO.\nMeasure and record the values of MO and NO.\nEvaluate \\(\\theta\\) = \\(\\frac{MO}{NO}\\) and cos \\(\\theta\\).\nRepeat the procedure for four other values of \\(\\theta\\) = 65° 55°, 45°, and 35°. In each case, evaluate \\(\\theta\\) and cos \\(\\theta\\).\nTabulate your readings.\nPlot a graph with cos \\(\\theta\\) on the vertical axis and \\(\\theta\\) on the horizontal axis.\nDetermine the slope, s, of the graph.\nState two precautions taken to ensure accurate results\n\n(b)i. State Snell's law of refraction.\nii. Calculate the critical angle for the glass prism used in the experiment above if its refractive index is 1.5.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60007?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  },
  {
    "number": "30",
    "text": "You are provided with cells, a potentiometer, an ammeter, a voltmeter, a bulb, a key, a jockey, and other necessary materials.\n\nMeasure and record the emf E of the battery. \nSet up a circuit as shown in the diagram above.\nClose the key K and use the jockey to make a firm contact at J on the potentiometer wire such that PJ = x = 10cm.\nTake the record of the voltmeter reading V and the corresponding ammeter reading I.\nEvaluate log V and log I.\nRepeat the procedure for other values of x =20, 30. 40, 50, and 60cm.\nTabulate your readings.\nPlot a graph with the log I on the vertical axis and log V on the horizontal axis.\nDetermine the slope, s, of the graph.\nDetermine the intercept, c, on the vertical axis.\nState two precautions taken to ensure accurate results.\n\n(b)i. How is the brightness of the bulb affected as x increases? Give a reason for your answer.\nii. List two electrical devices whose actions do not obey ohm's law",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60015?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2011"
  }
]