[
  {
    "number": "1272",
    "text": "The study of government is important because it",
    "options": {
      "A": "directs people's attention to development of non-state institutions",
      "B": "enables citizens to understand the processes for managing state affairs",
      "C": "encourages individuals to take decisions that satisfy their aspirations",
      "D": "encourages the elite to remain in power"
    },
    "answer_url": "https://myschool.ng/classroom/government/21934?exam_type=waec&type=obj&page=255",
    "correct_answer": "B",
    "explanation": "The purpose of studying government  as found in the Preamble of the Constitution, is to \"establish Justice, insure domestic Tranquility, provide for the common defense, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our posterity.\" this will enable citizens to understand their rights and avoid abuse of those rights by people whom they had choose to represent them.",
    "year": "2012"
  },
  {
    "number": "1273",
    "text": "A system of government where political powers are inherited is called",
    "options": {
      "A": "monarchy",
      "B": "diarchy",
      "C": "democracy",
      "D": "aristocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/21946?exam_type=waec&type=obj&page=255",
    "correct_answer": "A",
    "explanation": "A monarchy is a form of government in which a single person holds supreme authority in ruling a country, also performing ceremonial duties and embodying the country's national identity. Although some monarchs are elected, in most cases, the monarch's position is inherited and lasts until death or abdication. In these cases, the royal family or members of the dynasty usually serve in official capacities as well. The governing power of the monarch may vary from purely symbolic (crowned republic), to partial and restricted (constitutional monarchy), to completely autocratic (absolute monarchy).",
    "year": "2012"
  },
  {
    "number": "1274",
    "text": "Democracy can be promoted through",
    "options": {
      "A": "genymandering",
      "B": "slander",
      "C": "accountability",
      "D": "lobbying"
    },
    "answer_url": "https://myschool.ng/classroom/government/21947?exam_type=waec&type=obj&page=255",
    "correct_answer": "C",
    "explanation": "Without a good and workable constitution, democracy cannot be promoted. A constitution is the set of rules that a country is governed by. with this, accountability can used as a tool to checkmate leaders who may get overboard with the power vested on them.",
    "year": "2012"
  },
  {
    "number": "1275",
    "text": "The ability to command obedience is called",
    "options": {
      "A": "authority",
      "B": "influence",
      "C": "legitimacy",
      "D": "mobilization"
    },
    "answer_url": "https://myschool.ng/classroom/government/21948?exam_type=waec&type=obj&page=255",
    "correct_answer": "A",
    "explanation": "Authority the power or right to give orders, make decisions, and enforce obedience. It is the right to exercise power, which can be formalized by a state and exercised by way of judges, appointed executives of government, or the ecclesiastical or priestly appointed representatives of a God or other deities.",
    "year": "2012"
  },
  {
    "number": "1276",
    "text": "Legitimacy is determined mainly by",
    "options": {
      "A": "charisma",
      "B": "influence",
      "C": "acceptance",
      "D": "desire"
    },
    "answer_url": "https://myschool.ng/classroom/government/21950?exam_type=waec&type=obj&page=256",
    "correct_answer": "C",
    "explanation": "legitimacy is the right and acceptance of an authority, usually a governing law or a regime.",
    "year": "2012"
  },
  {
    "number": "1277",
    "text": "Which of the following is a feature of democracy?",
    "options": {
      "A": "Majority rule",
      "B": "Election by selected adults",
      "C": "Quick decision making",
      "D": "Rule by wealth  men"
    },
    "answer_url": "https://myschool.ng/classroom/government/21954?exam_type=waec&type=obj&page=256",
    "correct_answer": "A",
    "explanation": "All the major decisions are taken by the candidates elected by people.Elections provide with fair opportunity to the people to change the present government.The opportunity of dissolving the government is equal for all.Regular elections and the option of dissolution makes up the government",
    "year": "2012"
  },
  {
    "number": "1278",
    "text": "Which of the following is a source of political power?",
    "options": {
      "A": "Gerrymandering",
      "B": "Election",
      "C": "filibuster",
      "D": "Immunity"
    },
    "answer_url": "https://myschool.ng/classroom/government/21964?exam_type=waec&type=obj&page=256",
    "correct_answer": "B",
    "explanation": "Political power rests with the citizens. In turn, citizens grant political power to their leaders through elections.",
    "year": "2012"
  },
  {
    "number": "1279",
    "text": "Laws made by the legislative bodies are called",
    "options": {
      "A": "judiciary review",
      "B": "statutory laws",
      "C": "criminal laws",
      "D": "case law"
    },
    "answer_url": "https://myschool.ng/classroom/government/21966?exam_type=waec&type=obj&page=256",
    "correct_answer": "B",
    "explanation": "Legislation (or \" statutory law \") is law which has been promulgated (or \" enacted \") by a legislature or other governing body or the process of making it. Before an item of legislation becomes law it may be known as a bill, and may be broadly referred to as \"legislation\", while it remains under consideration to distinguish it from other business.\n...A legislature is the law-making body of a political unit, usually a national government, that has power to amend and repeal public policy. Laws enacted by legislatures are known as delegated legislation",
    "year": "2012"
  },
  {
    "number": "1280",
    "text": "Delegated legislation is unpopular because it",
    "options": {
      "A": "quickens the lawmaking process",
      "B": "receives wide publicity",
      "C": "is not made by the legislature",
      "D": "calters for emergency situations"
    },
    "answer_url": "https://myschool.ng/classroom/government/21967?exam_type=waec&type=obj&page=256",
    "correct_answer": "C",
    "explanation": "Delegated legislation is law that is not passed by an Act of Parliament but by a government minister, a delegated person or an entity",
    "year": "2012"
  },
  {
    "number": "1281",
    "text": "Political socialization begins from",
    "options": {
      "A": "adulthood",
      "B": "childhood",
      "C": "old age",
      "D": "manhood"
    },
    "answer_url": "https://myschool.ng/classroom/government/21969?exam_type=waec&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "In children.Political socialization begins in childhood. Some research suggests that family and school teachers are the most influential factors in socializing children, but recent research designs have more accurately estimated the high influence of the media in the process of political socialization.",
    "year": "2012"
  },
  {
    "number": "1282",
    "text": "A.V.Dicey popularized the principle of",
    "options": {
      "A": "rule of law",
      "B": "democracy",
      "C": "political culture",
      "D": "separation of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/21970?exam_type=waec&type=obj&page=257",
    "correct_answer": "A",
    "explanation": "The formulation of the rule of law is founded by A.V. Dicey over 100 years ago. It is therefore not surprising that his theory is used as a reference in the rule of law of many countries around the world nowadays.",
    "year": "2012"
  },
  {
    "number": "1283",
    "text": "Which of the following is the lowest in the hierarchy of feudal system?",
    "options": {
      "A": "Kinights",
      "B": "Serfs",
      "C": "Nobles",
      "D": "Lords"
    },
    "answer_url": "https://myschool.ng/classroom/government/21975?exam_type=waec&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "Serfdom is the status of many peasants under feudalism, specifically relating to manorialism. It was a condition of debt bondage.",
    "year": "2012"
  },
  {
    "number": "1284",
    "text": "The ratification of major executive decisions by the legislature is in line with the application of",
    "options": {
      "A": "separation of powers",
      "B": "rule of law",
      "C": "checks and balances",
      "D": "fusion of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/21995?exam_type=waec&type=obj&page=257",
    "correct_answer": "C",
    "explanation": "Checks and balances, principle of government under which separate branches are empowered to prevent actions by other branches and are induced to share power. Checks and balances are applied primarily in constitutional governments.",
    "year": "2012"
  },
  {
    "number": "1285",
    "text": "In which of the following political systems is rule of law most enhanced?",
    "options": {
      "A": "Cabinet system",
      "B": "Feudal system",
      "C": "Fascist system",
      "D": "Communist system"
    },
    "answer_url": "https://myschool.ng/classroom/government/21996?exam_type=waec&type=obj&page=257",
    "correct_answer": "A",
    "explanation": "The cabinet system emphasises the rule of law by ensuring that government actions are subject to legal frameworks and accountability. It promotes equality before the law and safeguards individual rights, which are fundamental to the principle of the rule of law.\nCommunist systems, though, emphasise equal opportunities and equal distribution of wealth, often struggle to uphold the rule of law in practice. While the ideology of communism emphasizes equality and fairness, the legal systems in many communist states have historically been used as tools for state control rather than as frameworks for ensuring justice and accountability. For example, the judiciary in such systems is often subordinated to the ruling party, which undermines the independence of the law.",
    "year": "2012"
  },
  {
    "number": "1286",
    "text": "A constitution is the",
    "options": {
      "A": "written document of traditional practices",
      "B": "functional aspect of government activities",
      "C": "supreme document of the government",
      "D": "fundamental laws of the land"
    },
    "answer_url": "https://myschool.ng/classroom/government/21997?exam_type=waec&type=obj&page=258",
    "correct_answer": "D",
    "explanation": "A constitution is an aggregate of fundamental principles or established precedents that constitute the legal basis of a polity, organisation or other type of entity, and commonly determine how that entity is to be governed.",
    "year": "2012"
  },
  {
    "number": "1287",
    "text": "A constitution is important because it",
    "options": {
      "A": "teaches moral values of the society",
      "B": "prescribes rules for those who govern",
      "C": "serves as a source of conflict in society",
      "D": "describes the laws and admonishes obedience"
    },
    "answer_url": "https://myschool.ng/classroom/government/21998?exam_type=waec&type=obj&page=258",
    "correct_answer": "D",
    "explanation": "The Constitution is important because it protects individual freedom, and its fundamental principles govern the United States. The Constitution places the government's power in the hands of the citizens. It limits the power of the government and establishes a system of checks and balances.",
    "year": "2012"
  },
  {
    "number": "1288",
    "text": "Which of the following cannot be found in a constitution?",
    "options": {
      "A": "Fundamental Human Rights",
      "B": "Manifestoes of political parties",
      "C": "Organs of government",
      "D": "Duties and obligations of citizens"
    },
    "answer_url": "https://myschool.ng/classroom/government/21999?exam_type=waec&type=obj&page=258",
    "correct_answer": "B",
    "explanation": "A manifesto is a published declaration of the intentions, motives, or views of the issuer, be it an individual, group, political party or government. A manifesto usually accepts a previously published opinion or public consensus or promotes a new idea with prescriptive notions for carrying out changes the author believes should be made. It is usually issued by political parties during elections to sell their candidature to the general public.",
    "year": "2012"
  },
  {
    "number": "1289",
    "text": "A rigid constitution is a feature of",
    "options": {
      "A": "unitary system",
      "B": "monarchical system",
      "C": "confederal system",
      "D": "federal system"
    },
    "answer_url": "https://myschool.ng/classroom/government/22000?exam_type=waec&type=obj&page=258",
    "correct_answer": "D",
    "explanation": "Rigid Constitution is a constitution which stands above the other laws of the country, while flexible constitutions do not. A. V. Dicey defines a rigid constitution as one under which certain laws, called constitutional laws or fundamental laws \"cannot be changed in the same manner as ordinary laws.\" A rigid constitution set forth \"specific legal/constitutional obstacles to be overcome\" before it may be amended, such as special approval of the people by referendum, a supermajority or special majority in the legislature, or both. In contrast, a flexible constitution is one in which the legislature may amended the constitution's content and principles through use of the ordinary legislative process. For example, the Constitution of Nigeria is rigid, while the British Constitution and the Israeli Constitution are flexible. Nigeria practices the federal system of government.",
    "year": "2012"
  },
  {
    "number": "1290",
    "text": "In a parliamentary system the executive is weak because it is",
    "options": {
      "A": "accountable to parliament",
      "B": "responsible for its own actions",
      "C": "headed by a prime minister",
      "D": "the head of state that controls  the government"
    },
    "answer_url": "https://myschool.ng/classroom/government/22001?exam_type=waec&type=obj&page=258",
    "correct_answer": "A",
    "explanation": "A parliamentary system is a system of democratic governance of a state where the executive derives its democratic legitimacy from its ability to command the confidence of the legislature, typically a parliament, and is also held accountable to that parliament. In a parliamentary system, the head of state is usually a person distinct from the head of government. This is in contrast to a presidential system, where the head of state often is also the head of government and, most importantly, the executive does not derive its democratic legitimacy from the legislature.",
    "year": "2012"
  },
  {
    "number": "1291",
    "text": "An advantage of a confederation over a federation is that the component units",
    "options": {
      "A": "have the right to secede",
      "B": "share resources equally",
      "C": "are politically stable",
      "D": "co-operate fully with the centre"
    },
    "answer_url": "https://myschool.ng/classroom/government/22002?exam_type=waec&type=obj&page=259",
    "correct_answer": "A",
    "explanation": "secedemeans to withdraw formally from membership of a federal union, an alliance, or a political or religious organization. if the union or alliance becomes unfavourable in future, a member can pull out of it.\nA confederationis a union ofsovereignstates, united for purposes of common action often in relation to other states. Usually created by a treaty, confederations of states tend to be established for dealing with critical issues, such as defense, foreign relations, internal trade or currency, with the general government being required to provide support for all its members. if the union or alliance becomes unfavourable in future, a member can pull out of it.\nwhile A federation (also known as a federal state) is a political entity characterized by a union of partially self-governing provinces, states, or other regions under a central federal government (federalism). The partially self governing states/province do not have sovereignty and as such, are tied to the federation.",
    "year": "2012"
  },
  {
    "number": "1292",
    "text": "Confederalism was once practised in",
    "options": {
      "A": "Nigeria and Ghana",
      "B": "Senegal and The Gambia",
      "C": "Mali and Cole d'lvoire",
      "D": "Ghana and Benin"
    },
    "answer_url": "https://myschool.ng/classroom/government/22003?exam_type=waec&type=obj&page=259",
    "correct_answer": "B",
    "explanation": "Senegambia, officially the Senegambia Confederation, was a loose confederation in the late 20th century between the West African countries of Senegal and its neighbour The Gambia, which is almost completely surrounded by Senegal. The confederation was founded on 1 February 1982 following an agreement between the two countries signed on 12 December 1981.",
    "year": "2012"
  },
  {
    "number": "1293",
    "text": "Which of the following acts as a check on the Executive in the control of the finances of a state? The",
    "options": {
      "A": "judiciary",
      "B": "civil service",
      "C": "press",
      "D": "legislature"
    },
    "answer_url": "https://myschool.ng/classroom/government/22004?exam_type=waec&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "Check and approve Government spending and taxation The Budget and Parliament Parliament looks closely at the Government's tax and spending plans on our behalf and tries to make sure that public money is being spent fairly and efficiently.",
    "year": "2012"
  },
  {
    "number": "1294",
    "text": "In legislature, carpel-crossing means",
    "options": {
      "A": "make rules",
      "B": "formulate decisions",
      "C": "arrest offenders",
      "D": "adjudicate cases"
    },
    "answer_url": "https://myschool.ng/classroom/government/22005?exam_type=waec&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2012"
  },
  {
    "number": "1295",
    "text": "The responsibility of the judiciary is to",
    "options": {
      "A": "make rules",
      "B": "formulate decisions",
      "C": "arrest offenders",
      "D": "adjudicate cases"
    },
    "answer_url": "https://myschool.ng/classroom/government/22009?exam_type=waec&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "The judiciary is the system of courts that interprets and applies the law in the name of the state. The judiciary can also be thought of as the mechanism for the resolution of disputes. Under the doctrine of the separation of powers, the judiciary generally does not make statutory law or enforce law, but rather interprets law and applies it to the facts of each case",
    "year": "2012"
  },
  {
    "number": "1296",
    "text": "One of the limitations on freedom of speech is",
    "options": {
      "A": "libel",
      "B": "trespassing",
      "C": "bye-laws",
      "D": "unlawful defention"
    },
    "answer_url": "https://myschool.ng/classroom/government/22010?exam_type=waec&type=obj&page=260",
    "correct_answer": "A",
    "explanation": "Libel is a published false statement that is damaging to a person's reputation; a written defamation.",
    "year": "2012"
  },
  {
    "number": "1297",
    "text": "A citizen's duties do not include",
    "options": {
      "A": "defending the nation",
      "B": "obeying the laws",
      "C": "paying taxes",
      "D": "giving alms to the poor"
    },
    "answer_url": "https://myschool.ng/classroom/government/22015?exam_type=waec&type=obj&page=260",
    "correct_answer": "D",
    "explanation": "The following are some of the duties of a citizen. Arms giving is a voluntary act of kindness and not a duty.\nRespect the Rights, Beliefs and Opinions of Others:Stay Informed of the Issues That Affect Your Community:Serve in a Jury When Called Upon:Participate in the Democratic Process:Defend the Country, if Need Should Arise:",
    "year": "2012"
  },
  {
    "number": "1298",
    "text": "One-party system leads to",
    "options": {
      "A": "dictatorship",
      "B": "democracy",
      "C": "diarchy",
      "D": "theocracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/22016?exam_type=waec&type=obj&page=260",
    "correct_answer": "A",
    "explanation": "The disadvantage of a one party system is that there is no check on the power of the Party. This inevitably leads to corruption and abuses of power. What's more, a one-party state cannot be maintained without secret police, repression, and suppression of the free flow of information. This can lead to a dictatorship, which is a form of government in which one person or a small group possesses absolute power without effective constitutional limitations.",
    "year": "2012"
  },
  {
    "number": "1299",
    "text": "In a democratic state the party system that usually operates is",
    "options": {
      "A": "Mass pathy",
      "B": "multi-party",
      "C": "one-party",
      "D": "elite party"
    },
    "answer_url": "https://myschool.ng/classroom/government/22017?exam_type=waec&type=obj&page=260",
    "correct_answer": "B",
    "explanation": "A multi-party system is a system in which multiple political parties across the political spectrum run for national election, and all have the capacity to gain control of government offices, separately or in coalition.",
    "year": "2012"
  },
  {
    "number": "1300",
    "text": "The coming together of two or more political parties to form a government is",
    "options": {
      "A": "coalition",
      "B": "merger",
      "C": "unification",
      "D": "co-operation"
    },
    "answer_url": "https://myschool.ng/classroom/government/22019?exam_type=waec&type=obj&page=260",
    "correct_answer": "A",
    "explanation": "A political coalition or political alliance or political bloc is an agreement for cooperation between different political parties on common political agenda often for purposes of contesting an election to mutually benefit by collectively clearing election thresholds or otherwise benefiting from characteristics of the voting system or for government formation after elections.",
    "year": "2012"
  },
  {
    "number": "1301",
    "text": "Universal Adult Suffrage is associated with a",
    "options": {
      "A": "democratic governmnet",
      "B": "political culture",
      "C": "public accountabilty",
      "D": "political socialization"
    },
    "answer_url": "https://myschool.ng/classroom/government/22022?exam_type=waec&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "The concept of universal suffrage, also known as general suffrage or common suffrage, consists of the right to vote of all adult citizens, regardless of property ownership, income, race, or ethnicity, subject only to minor exceptions.",
    "year": "2012"
  },
  {
    "number": "1302",
    "text": "A major advantage of the Secret Ballot System of voting is that",
    "options": {
      "A": "it is faster than other systems",
      "B": "it ensures the anonymity of the voter",
      "C": "it extends the franchise to all adults",
      "D": "nobody can be prevented from voting"
    },
    "answer_url": "https://myschool.ng/classroom/government/22023?exam_type=waec&type=obj&page=261",
    "correct_answer": "B",
    "explanation": "The secret ballot,  is a voting method in which a voter's choices in an election or a referendum are anonymous, forestalling attempts to influence the voter by intimidation, blackmailing, and potential vote buying. The system is one means of achieving the goal of political privacy.",
    "year": "2012"
  },
  {
    "number": "1303",
    "text": "The 'first-past-the-post system of voting is also called",
    "options": {
      "A": "second ballot system",
      "B": "proportional representation",
      "C": "simple majority system",
      "D": "alternative vote system"
    },
    "answer_url": "https://myschool.ng/classroom/government/22024?exam_type=waec&type=obj&page=261",
    "correct_answer": "C",
    "explanation": "A first-past-the-post (FPTP and sometimes abbreviated to FPP) electoral system is one in which voters indicate on a ballot the candidate of their choice, and the candidate who receives the most votes wins. This is sometimes described as winner takes all. First-past-the-post voting is a plurality voting method. FPTP is a common, but not universal, feature of electoral systems with single-member electoral divisions, and is practiced in close to one third of countries. Notable examples include Canada, India, the United Kingdom, and the United States, as well as most of their current or former colonies and protectorates.\nSimple majority may refer to: Majority, a voting requirement of more than half of all ballots cast.",
    "year": "2012"
  },
  {
    "number": "1304",
    "text": "Restricted franchise violates the idea of",
    "options": {
      "A": "political equality",
      "B": "political culture",
      "C": "public accountability",
      "D": "political socialization"
    },
    "answer_url": "https://myschool.ng/classroom/government/22027?exam_type=waec&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "political equality refers to the equality of each citizen's individual rights and liberty.",
    "year": "2012"
  },
  {
    "number": "1305",
    "text": "Which of the following can aid in the formation of public opinion?",
    "options": {
      "A": "Order-in-council",
      "B": "free press",
      "C": "Existence of one party system",
      "D": "Existence of pree censorship"
    },
    "answer_url": "https://myschool.ng/classroom/government/22028?exam_type=waec&type=obj&page=261",
    "correct_answer": "B",
    "explanation": "free press is critical to sustaining the rule of law. Along with free speech, a free press is indispensable for people to be informed and to participate in a democracy. On these points, lawyers and journalists are united.",
    "year": "2012"
  },
  {
    "number": "1306",
    "text": "The civil service is an institution for",
    "options": {
      "A": "carrying out private organization goals",
      "B": "effecting civil society policies",
      "C": "formulating and executing public policies",
      "D": "intiating bureaucratic private agenda"
    },
    "answer_url": "https://myschool.ng/classroom/government/22029?exam_type=waec&type=obj&page=262",
    "correct_answer": "C",
    "explanation": "The civil service is independent of government and is also composed mainly of career bureaucrats hired on professional merit rather than appointed or elected, whose institutional tenure typically survives transitions of political leadership. A civil servant or public servant is a person employed in the public sector on behalf of a government department or agency. A civil servant or public servant's first priority is to represent the interests of citizens.",
    "year": "2012"
  },
  {
    "number": "1307",
    "text": "The recruitment of personnel into civil service by the public/civil service commission prevents",
    "options": {
      "A": "political patronage",
      "B": "bribery and corruption",
      "C": "overstaffing",
      "D": "bureaucracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/22031?exam_type=waec&type=obj&page=262",
    "correct_answer": "A",
    "explanation": "Political patronage  is often defined as public office awarded in payment for political support.",
    "year": "2012"
  },
  {
    "number": "1308",
    "text": "Which of following manages a public corporation?",
    "options": {
      "A": "Chambers of Commerce",
      "B": "Board of Directors",
      "C": "An Accountant-General",
      "D": "An Auditor-General"
    },
    "answer_url": "https://myschool.ng/classroom/government/22032?exam_type=waec&type=obj&page=262",
    "correct_answer": "B",
    "explanation": "A board of directors is a group of people who jointly supervise the activities of an organization, which can be either a for-profit business, nonprofit organization, or a government agency. Such a board's powers, duties, and responsibilities are determined by government regulations (including the jurisdiction's corporations law) and the organization's own constitution and bylaws. These authorities may specify the number of members of the board, how they are to be chosen, and how often they are to meet.",
    "year": "2012"
  },
  {
    "number": "1309",
    "text": "Local governments are essential because they",
    "options": {
      "A": "encourage division in a country",
      "B": "implement government policies at national levels",
      "C": "make laws for a nation",
      "D": "train local people in the art of governing"
    },
    "answer_url": "https://myschool.ng/classroom/government/22033?exam_type=waec&type=obj&page=262",
    "correct_answer": "D",
    "explanation": "1. Local Government is important for National Development for many reasons\n2. Local Government helps in avoiding local oppositions to Plan\n3.Local Government contributes to the Political Stability\n4. Local Government provides a sense of participation on the part of people",
    "year": "2012"
  },
  {
    "number": "1310",
    "text": "Which of the following delayed nationalist movements in French West Africa?",
    "options": {
      "A": "Presence of educated elite",
      "B": "The policy of Assimilation",
      "C": "The use of local chiefs",
      "D": "Granting of freedom to Africans"
    },
    "answer_url": "https://myschool.ng/classroom/government/22034?exam_type=waec&type=obj&page=262",
    "correct_answer": "B",
    "explanation": "The policy of assimilation was the official colonialpolicyof the French administration in West Africa. The system involved the imposition of French culture on the West African culture. It was meant to substitute the culture, language, religion, law, mode of dressing, etc. It delayed the rise of natiolaist movement",
    "year": "2012"
  },
  {
    "number": "1311",
    "text": "The National Congress of British West Africa (NCBWA) was founded in",
    "options": {
      "A": "Sierra Leone",
      "B": "Liberia",
      "C": "Ghana",
      "D": "Nigeria"
    },
    "answer_url": "https://myschool.ng/classroom/government/22036?exam_type=waec&type=obj&page=263",
    "correct_answer": "C",
    "explanation": "The National Congress of British West Africa ( NCBWA ), founded in 1917, was one of the earliest nationalist organizations in West Africa, and one of the earliest formal organizations working toward African emancipation. It was largely composed of an educated elite in the Gold Coast , who felt under threat from the incorporation of 'traditional authorities' in the colonial system.",
    "year": "2012"
  },
  {
    "number": "1312",
    "text": "The west Africa Students Union (WASU) was formed by",
    "options": {
      "A": "Siaka Stevents",
      "B": "KA Gbedemah",
      "C": "E.F.Smail",
      "D": "Oladipo Solanke"
    },
    "answer_url": "https://myschool.ng/classroom/government/22037?exam_type=waec&type=obj&page=263",
    "correct_answer": "D",
    "explanation": "The West African Students' Union (WASU), founded in London in 1925 and active into the 1960s, was an association of students from various West African countries who were studying in the United Kingdom .WASU was founded on 7 August 1925 by twenty-one law students, led by Ladipo Solanke and Herbert Bankole-Bright.",
    "year": "2012"
  },
  {
    "number": "1313",
    "text": "Military government usually rule through",
    "options": {
      "A": "bye-laws",
      "B": "decrees",
      "C": "parliament",
      "D": "statutes"
    },
    "answer_url": "https://myschool.ng/classroom/government/22038?exam_type=waec&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "Rule by decree is a style of governance allowing quick, unchallenged creation of law by a single person or group, and is used primarily by dictators, absolute monarchs and military leaders.",
    "year": "2012"
  },
  {
    "number": "1314",
    "text": "A military coup détat is followed by",
    "options": {
      "A": "enforcement of fundamental human rights",
      "B": "suspension of the constitution",
      "C": "breaking of diplomatic relations with foreign countries",
      "D": "mass importation of fire arms"
    },
    "answer_url": "https://myschool.ng/classroom/government/22039?exam_type=waec&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "In a coup, it is the military, paramilitary, or opposing political faction that deposes the current government and assumes power. This coup is followed by suspension of the constitution by the military. this means that, the affairs of the state is no longer governed with respect to the constitution. the rule of law, separation of power and checks and balances that make up a democratic government is totally displaced.",
    "year": "2012"
  },
  {
    "number": "1315",
    "text": "Which of the following factors influences a country's foreign policy?",
    "options": {
      "A": "Size of the country's civil service",
      "B": "Overall national interest of the country",
      "C": "Capacity of the police force",
      "D": "Type of traditional rulers in the country"
    },
    "answer_url": "https://myschool.ng/classroom/government/22041?exam_type=waec&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "Foreign policy of any country is shaped of multiple internal and external factors. The major internal factors that influence the foreign policy are geographical factors, culture and history, economic factors, technology, national capability, leadership, political accountability, bureau of press and bureaucracy.",
    "year": "2012"
  },
  {
    "number": "1316",
    "text": "The Organization of African Unity (OAU) was set up in",
    "options": {
      "A": "Accra",
      "B": "Harare",
      "C": "Cairo",
      "D": "Addis Ababa"
    },
    "answer_url": "https://myschool.ng/classroom/government/22042?exam_type=waec&type=obj&page=264",
    "correct_answer": "D",
    "explanation": "OAU was set up in Addis Ababa in may 25 1963. To co-ordinate and intensify the co-operation of African states in order to achieve a better life for the people of Africa .",
    "year": "2012"
  },
  {
    "number": "1317",
    "text": "The organ of the Organization of African Unity (OAU)established for peaceful settlement of disputes is the",
    "options": {
      "A": "Commission of Mediation Conciliation and Arbitration",
      "B": "Council of Ministers",
      "C": "Secretariat",
      "D": "Assembly of Heads of State and Government"
    },
    "answer_url": "https://myschool.ng/classroom/government/22044?exam_type=waec&type=obj&page=264",
    "correct_answer": "A",
    "explanation": "Commission of Mediation Conciliation and Arbitration try to resolve disputes through conciliation (finding a compromise between the two parties) or arbitration (acting as the objective third party to resolve the dispute)",
    "year": "2012"
  },
  {
    "number": "1318",
    "text": "The head of the Commonwealth of Nations is the",
    "options": {
      "A": "Prime Minister",
      "B": "High Commissioner",
      "C": "British Foreign Secretary",
      "D": "British Monarch"
    },
    "answer_url": "https://myschool.ng/classroom/government/22045?exam_type=waec&type=obj&page=264",
    "correct_answer": "D",
    "explanation": "Queen Elizabeth II\nThe Head of the Commonwealth, currently Queen Elizabeth II, is recognised by the members of the Commonwealth of Nations as the \"symbol of their free association\" and serves as a leader, alongside the Commonwealth Secretary-General and Commonwealth Chair-in-Office.",
    "year": "2012"
  },
  {
    "number": "1319",
    "text": "Which of the following organs of the United Nations Organization has outlived its usefulness? The",
    "options": {
      "A": "General Assembly",
      "B": "Trusteeship Council",
      "C": "International Court of Justice",
      "D": "Economic and Social Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/22047?exam_type=waec&type=obj&page=264",
    "correct_answer": "B",
    "explanation": "The United Nations Trusteeship Council  is one of the six principal organs of the United Nations, established to help ensure that trust territories were administered in the best interests of their inhabitants and of international peace and security.",
    "year": "2012"
  }
]