[
  {
    "number": "45",
    "text": "(a) ldentify specimens A, B, and C. \nSpecimen A:                              Specimen B;                       Specimen C;\n                           \n(b) In a tabular form, compare three physical characteristics of specimens A and B.\n(c) (i) Which of specimens A and B would you recommend for pond construction?\n(ii) Give one reason for your answer in (c)(i).\n(d) List two ways of improving specimen A for crop production.\n(e) State two ways by which specimen C is of economic importance in agriculture.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59882?exam_type=waec&type=practical&page=9",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  },
  {
    "number": "46",
    "text": "(a) For each of specimens H (SPADE), l (SECATEURS) and J (OPEN ENDED SPANNER) name two farm tools that can perform functions similar to those of the specimens.\n(b) Describe how each of specimens I and J is used.\n(c) Describe each of specimens H and J. \n(d) Enumerate four advantages of using farm tools for farm work.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59885?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  },
  {
    "number": "47",
    "text": "(a) Identify specimens K and L.\nSpecimen K;                       Specimen L;\n             \n(b) List three crops commonly attacked by each of specimens K and L\n\n(c) State three types of damage to crops caused by each of specimens K and L. \n(d) Mention two ways of controlling each of specimens K and L 4 marks]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59886?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  },
  {
    "number": "48",
    "text": "(a) ldentify specimens O and P. \nSpecimen O;             Specimen P;\n          \n(b) State three farm animals which do not possess specimen O\n(c) (i) Name two farm animals in which both sexes possess specimen O.\n(ii) State one farm animal in which only one sex of the species possesses specimen O. \n(d) State two functions of each of the specimens O and P to the animals that possess them. \n(e) Mention three problems that a farmer may encounter in the management of animals which possess specimen O.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59888?exam_type=waec&type=practical&page=10",
    "correct_answer": null,
    "explanation": "",
    "year": "2009"
  }
]