[
  {
    "number": "66",
    "text": "(a)(i) Cut a pieces of specimen A, place it on the white tile. Add a few drops of iodine solution. Record the observation and result in a tabular form.\n(ii) Squeeze a few drops of specimen E on another clean white tile provided, add a few dre Record the observation and result in a tabular form.\n(b)(i) State two observables differences between specimens A and B. (ii) Suggest two factors that are likely to be responsible for the state of specimen B.\n(iii) With the aid of hand lens/magnifying lens, observe.specimen B. and name an organism that is likely growing on it. (iv) State the mode of feeding of the organism on specimen B (c) ) Make a drawing 6cm-8 cm long, of specimen C and label fully. one function each of any three parts labeled.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60295?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "67",
    "text": "Study specimens H, K, L and M and answer questions 2 (a) to 2 (e).\n(a) Name the location of each of the specimens H, K and M in the body of a mammal.\n(b)(i) Name the fluid in specimen L (ii) State two functions of the fluid named in 2 (b) (i). (iii) Which of the other specimens is specimen L associated with?\n(c)(i) State two observable differences between specimens H and K. (i) State two observable features of specimen K that adapt it to its function.\nState one biological importance each of specimens K and M.\n(d) Make a drawing 8 cm -10 cm long, of specimen M and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60296?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  },
  {
    "number": "68",
    "text": "Answer all the questions in this section.\nStudy specimen S, T, U, V and Wand answer questions 4 (a) to 4(e).\n (a) (i) Name the habitats of each of specimens S, U and W.\n(ii) Name the class to which each of specimens S, U and W belong.\n(b) State: (i) Four observable similarities between specimens S and U. (ii) five observable differences between specimens S and U.\n(c)(i) identify the sex of specimen U. (i) State two reasons for the answer in 4 (c)(i).\n(d)State four observable features that adapt specimen S to its habitat.\n(e) Construct a food chain using at least three of the given specimens.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60297?exam_type=waec&type=practical&page=14",
    "correct_answer": null,
    "explanation": "",
    "year": "2016"
  }
]