[
  {
    "number": "88",
    "text": "(a)(i) Specimen A is a flower. Remove all the stamens and three petals from specimen A leaving the special petal.\nMake a drawing 10-12cm long of the remaining parts of specimen A and label fully.\n(ii) what type of ovary is present in specimen A?\n(ii) Give one reason for your answer in 1(a) (i) above.\n(iv) Describe the petals and sepals of specimen A. \n(v) What is the function of the special petal?\n(vi) State three features of specimen A which have led to the success of flowering plants.\n(b)(i) What type of fruit is specimen B?\n(ii) Give two other examples of the fruit type.\n(iil) State the mode of dispersal of specimen B.\n (iv) State two biological importance of the class of fruit to which specimen B belongs.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61323?exam_type=waec&type=practical&page=18",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  },
  {
    "number": "89",
    "text": "observe specimen C carefully and answer the following questions.\n(a)(i) State tne class to which specimen C belongs.\n(ii) Give three reasons for placing Specimen C in that class.\n(iii)State two food items which specimen C feeds on.\n(b) State two observation of each of specimen C which adapt it to: (i) its mode of feeding (ii) locomotion \n(c) List three observable characters of specimen C which can be inherited.\n(ii) If white feather colour (W) Is dominant in chickens over black feather colour (w),\nwith the aid of qenetic.diagrams show how it can be determined whether specimen C is homozygous dominant or heterozygous dominant.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61324?exam_type=waec&type=practical&page=18",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  },
  {
    "number": "90",
    "text": "Study carerully Specimens H, J, Kand L and use them to answer the following question:\n(a) Make a drawing 8-10cm long of the longitudinal section of specimen H and label fully.\n(ii) What type of fruit is specimen H?\n(ii) State two other examples of the type of fruit to wnich specimen H belongs.\n(iv) Is specimen H a true fruit or a false fruit?\n (v) Give one reason for your answer in  a(iv) above.\n(vi) State the food classes present in specimen H.\n(b)(i) State one(1) feature common to specimens J, K and L.\n(ii) State two observable characteristic features each of specimens J, K and L.\n(iii) State the mode of vegetative propagation of specimens K and L.\n(C) State the biological significance of specimens K.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/61325?exam_type=waec&type=practical&page=18",
    "correct_answer": null,
    "explanation": "",
    "year": "2008"
  }
]