[
  {
    "number": "63",
    "text": "Study specimens F and G carefully and answer questions 2(a) and 2(b).\n(a) State three observable features of biological importance in: (i) specimen F; (ii) Specimen G.\n(b) (i) Classify specimens F and G as either stem tuber or root tuber. (ii) Give two reasons each for the answer in 2(b)(i).\nStudy specimens H and J and answer questions 2(c) to 2(e).\n(C) Classify specimens H and J into the class to which both belong.\n(d) (i) state four observable differences between specimens H and J. (ii) State four observable similarities between specimens H and J.\n (e) (i) State the feeding habits of each of specimens H and J. (ii) Name two observable features used for feeding in specimen J.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60289?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "64",
    "text": "Study specimens C, D and E carefully and answer questions 1(a) to 1(C).\n(a) (i) Name the phylum to which specimens C and E belong. (ii) State two reasons for the answer in 1(a)(i).\n(b) State three observable structural differences between the following specimens. (i)C and D (ii) C and E.\n(C) What is the relationship between specimens C and D?\n(d)(i)) Name the habitat of specimen D. (ii) State two ways in which specimen D is adapted to its habitat.\n(C) Make a drawing, 8cm - 10cm long of the dorsal view of specimen C and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60290?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  },
  {
    "number": "65",
    "text": "Study specimen R and answer questions 4(a) to 4(c).\n(a) (i) Name the phylum of specimen R. (ii) State two reasons for the answer in 4(a)(i).\n(iii) State the habitat of specimen R. (b) (i) State two structural features that adapt specimen R to its habitat. (ii) State three ways in which specimen R is of economic importance.\n(c) Make a drawing,8cm- 10cm long of the dorsal view of specimen R and label fully.\nStudy specimens S and T and answer questions 4(d) to 4(e).\n(d) What type of fruits are specimens S and T?\n(e) (i) State four observable differences between specimens S and T.\n(ii) State three observable similarities between specimens S and T.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60294?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2017"
  }
]