[
  {
    "number": "31",
    "text": "(a) An aqueous solution of salt Q was added to excess Sodium trioxocarbonate (V) solution in a test tube. There was effervescence, the test tube became warm and a white precipitate was observed. State three inferences that could be drawn from these observations.\n(b) Consider the following salts: NH\\(_4\\)CI; PbSO\\(_4\\); NaHCO\\(_3\\), Cu(NO\\(_3\\))\\(_2\\) and ZnCO\\(_3\\). Select from the list, the salt(s) which;\n(i) do not/does not readily dissolve in water;\n(i) produce(s) effervescence with dilute mineral acids;\n(ii) decompose(s) on heating\n(iv) dissolves(s) in water to form an alkaline solution;\n(v) sublime(s) on heating.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60023?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2010"
  },
  {
    "number": "32",
    "text": "Credit will be given for strict adherence to the instructions, for observations precisely recorded, and for accurate inferences. All tests, observations, and inferences must be clearly entered in your answer book, in ink, at the time they are made.\nC and D are inorganic salts. X is a solution of an inorganic compound. Carry out the following exercises on C, D and X. Record your observations and identity any gas(es) involved. State the conclusion drawn from the result or each test.\n(a)(i) Add about 5 cm\\(_3\\) of distilled water to C in a test tube and shake thoroughly, Divide the resulting solution into two portions.\n(ii) Put about 2cm\\(^3\\) of X into a separate test tube and add the first portion of solution in (a)(i) To the second portion of the resulting solution in (a)(i), add few drops of BaCl\\(_{2(aq)}\\) followed by excess dil. HCI.\n(b) Add about 10 cm of distilled water to D in a boiling tube and shake thoroughly.\n(i) To about 2 cm\\(^3\\) portion of the resulting solution in a test tube, add NaOH\\(_{(aq)}\\) in drops and then in excess\n(ii) To another 2 cm\\(^3\\) portion of the resulting solution add few drops of K\\(_2\\)CrO\\(_{4(aq)}\\)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60024?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2010"
  },
  {
    "number": "33",
    "text": "Burette readings (initial and final) must be given to two decimal places. Volume or pipete used must also be recorded but no account of experimental procedure is required. All calculations must be done in your answer book.\nA is a solution containing 12.0g dm\\(^{-3}\\) NaHSO\\(_4\\) NaHSO\\(_4\\) P is a solution containing NaOH\n(a) Put A into the burette and titrate it against 20.0cm\\(^3\\) or 25.0m\\(^3\\) portions of B using methyl orange as an indicator. Repeat the titration to obtain consistent titres. Tabulate your readings and calculate the average volume A used. The equation for the reaction involved in the titration is ;\nNaHSO\\(_{4(aq)}\\) + NaOH\\(_{(aq)}\\) \\(\\to\\)  Na\\(_2\\)SO\\(_{4(aq)}\\) + H\\(_2\\)O\\(_{(l)}\\)\n[H 1.00, O = 16.0; Na = 23.0, S = 32.0]\n \n(b) From your results and the information provided above calculate the:\n(i) concentration of A in mol dm\\(^{-3}\\) \n(ii) concentration of B in mol dm\\(^{-3}\\)\n(iii) mass of Na\\(^+\\) formed in solution during the titration.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/60025?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2010"
  }
]