[
  {
    "number": "4",
    "text": "All your burette readings (initials and final) as well as the size of your pipette must be recorded but no account of experimental procedure is required. All calculations must be done in your answer booklet.\n A is a solution containing 15.8 g dm\\(^3\\) of Na\\(_2\\)S\\(_2\\)O\\(_3\\). B was obtained by dissolving 9.0 g of an impure sample of I\\(_2\\) in aqueous Kl and the solution made up to 1 dm\\(^3\\).\n(a) Put A into the burette and titrate it against 20.0 cm\\(^3\\) or 25.0 cm\\(^3\\) portions of B. Use starch solution as indicator. Repeat the titration to obtain concordant titre values. Tabulate your results and calculate the average volume of A used. The equation for the reaction involved in the titration is I\\(_2\\) + 2S\\(_2\\)O\\(_3\\) \\(\\to\\) 2I\\(^-\\) + S\\(_4\\)O\\(_6^{2-}\\).\n(b) From your results and the information provided, calculate the:\n(i) concentration of A in mol dm\\(^{-3}\\) \n(ii) concentration of I\\(_2\\) in B in mol dm\\(^{-3}\\);\n(iii) percentage by mass of I\\(_2\\) in the sample\n(c) Give reasons why the starch indicator was not added to the titration mixture at the beginning of the titration. [O = 16.0, Na = 23.0, S = 32.0, 1 = 127.0] Credit will be given for strict adherence to the instructions for observations precisely recorded and for accurate inferences. AIl tests, observations and inferences must be clearly entered in the booklet in ink at the time they are made.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/59949?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "5",
    "text": "All your burette readings (initials and final) as well as the size of your pipette must be recorded but no account of experimental procedure is required. All calculations must be done in your answer booklet.\nC is a mixture of two inorganic compounds. Carry out the following exercises on C. Record your observations and identify any gas(es) evolved. State the conclusions you draw from the result of each test.\n(a) Put all of C in a boiling tube and add about 10 cm\\(^3\\) of distilled water. Shake thoroughly and filter. Keep both the residue and the filtrate.\n(b)(i) To about 2 cm\\(^3\\) of the filtrate add a few drops of Silver trioxoitrate (V) followed by dilute HNO\\(_{3}\\)\n(ii)  Add excess NH\\(_3\\) solution to the resulting mixture in (b)(i).\n(C)(i) Put the residue in a test tube, add about 2 cm\\(^3\\) of dilute HCl and shake.\n(ii) Add NH\\(_3\\) Solution in drops to the mixture from (c)(i) and then in excess.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/59951?exam_type=waec&type=practical",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  },
  {
    "number": "6",
    "text": "All your burette readings (initials and final), as well as the size of your pipette, must be recorded but no account of experimental procedure is required. All calculations must be done in your answer booklet.\n(a) State what would be observed when \\(BaCl_2\\) solution is a portion of a saturated Na\\(_2\\)CO\\(_2\\) followed by dilute HCI in excess.\n(ii) A gas Q decolorized acidified kMnO\\(_4\\) Solution. Suggest what Q could be\n \n(b) Name one substance used in the laboratory for drying each of the following substances:\n(i) ammonia gas:\n(ii) carbon (IV) oxide. \n \n(c) Give a reason why a given mass of sodium hydroxide pellets cannot be used to prepare a standard solution.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/chemistry/59953?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2019"
  }
]