[
  {
    "number": "79",
    "text": "(a) Study carefully specimens A and B and use them to answer questions 1(a) to 1(c).\n(a)(i) Name the types of fruit in specimens A and B with reasons.\n(ii) Make a drawing, 8-10cm long of the lateral view of specimen B and label fully.\n(b) Describe the modes of dispersal of specimens A and B.\n(c) In a tabular form, state five differences between specimens A and B.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60308?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "80",
    "text": "Study carefully specimens C, D and E and use them to answer questions 2(a) to 2(c).\n(a) (i) State the mode of nutrition of specimen D.\n(ii) State one way by which each of specimens C, D and E is of economic importance.\n(b)(i) Classify specimens C, D and E into their phyla and classes.\n(ii) List three observable characteristic features of each of the classes to which specimens C, D and E belong. \n(iii) In a tabular form, state two observable differences between C and D.\n(C) List four observable features of specimen E that are sensory in nature.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60742?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "81",
    "text": "Study carefully specimens J, K and L and use them to answer questions 4(a) to 4(d).\n(a)(i) State the class of each of specimens J, K and L\n(ii) State three reasons each for placing each of specimens J, K and L in their classes.\n(b) State two structural adaptations possessed by each of specimens K and L for escaping predators.\n(c) Make a drawing, 8 - 10cm long of the lateral view of specimen J.\n(d) State: (i) two similarities; (ii) two observable differences between specimens J and L.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/60743?exam_type=waec&type=practical&page=17",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  }
]