[
  {
    "number": "84",
    "text": "(a) Define human rights.\n(b) Suggest four conditions under which human rights can be violated in Nigeria.\n(c) Explain three reasons for which it is necessary to entrench citizens' rights in the Nigerian constitution.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/65942?exam_type=waec&type=theory&page=17",
    "correct_answer": "(a) Human rights are commonly understood as being those rights which are inherent in the mere fact of being human. Human rights are universal and inalienable; indivisible; interdependent and interrelated.\nThey are universal because everyone is born with and possesses the same rights, regardless of where they live, their gender or race, or their religious, cultural or ethnic background. Inalienable because people's rights can never be taken away.\nIndivisible and interdependent because all rights – political, civil, social, cultural and economic, are equal in importance and none can be fully enjoyed without the others. They apply to all equally, and all have the right to participate in decisions that affect their lives. They are upheld by the rule of law and strengthened through legitimate claims for duty-bearers to be accountable to international standards.\n(b). - The police in enforcing law and order can ban public assembly and demonstrations which will deny a citizen his right to freedom of association and assembly.\n- Rights to the freedom of expression and press are restricted by the law preventing individuals from saying or publishing statement that could damage the personality of others (laws of slander and libel).\n- A citizen may be denied his rights to free movement if he is detained on medical ground in order not to spread contagious disease if such citizen is suffering from a contagious disease.\n- Right to private property may be restricted by the right of the state to compulsorily acquire private property for public use.\n(c) - Stability/Organization: Citizens' rights are entrenched in the constitution in order to have a well-arranged documentation of the rights of citizens in a country and since the constitution is the body of regulation that guides the affairs of a country, it is the most appropriate to house human rights.\n- Understanding specifics of human rights: Human rights are entrenched in the constitution so that everyone can access them and understand the conditions surrounding these rights as well as their limitations.\n- Rule of Law: The rule of law is a liberty centred constitutional concept which stipulates that everything must be done in accordance with the law. It encapsulates such ideals as government according to the law, equality before the law and the independence, and autonomy of the judiciary among others. This helps to make human rights applicable and efficient.",
    "explanation": "(a) Human rights are commonly understood as being those rights which are inherent in the mere fact of being human. Human rights are universal and inalienable; indivisible; interdependent and interrelated.\nThey are universal because everyone is born with and possesses the same rights, regardless of where they live, their gender or race, or their religious, cultural or ethnic background. Inalienable because people's rights can never be taken away.\nIndivisible and interdependent because all rights – political, civil, social, cultural and economic, are equal in importance and none can be fully enjoyed without the others. They apply to all equally, and all have the right to participate in decisions that affect their lives. They are upheld by the rule of law and strengthened through legitimate claims for duty-bearers to be accountable to international standards.\n(b). - The police in enforcing law and order can ban public assembly and demonstrations which will deny a citizen his right to freedom of association and assembly.\n- Rights to the freedom of expression and press are restricted by the law preventing individuals from saying or publishing statement that could damage the personality of others (laws of slander and libel).\n- A citizen may be denied his rights to free movement if he is detained on medical ground in order not to spread contagious disease if such citizen is suffering from a contagious disease.\n- Right to private property may be restricted by the right of the state to compulsorily acquire private property for public use.\n(c) - Stability/Organization: Citizens' rights are entrenched in the constitution in order to have a well-arranged documentation of the rights of citizens in a country and since the constitution is the body of regulation that guides the affairs of a country, it is the most appropriate to house human rights.\n- Understanding specifics of human rights: Human rights are entrenched in the constitution so that everyone can access them and understand the conditions surrounding these rights as well as their limitations.\n- Rule of Law: The rule of law is a liberty centred constitutional concept which stipulates that everything must be done in accordance with the law. It encapsulates such ideals as government according to the law, equality before the law and the independence, and autonomy of the judiciary among others. This helps to make human rights applicable and efficient.",
    "year": "2022"
  },
  {
    "number": "85",
    "text": "(a). Identify five qualities an individual must possess to be qualified as a responsible parent.\n(b). In what five ways do the roles of responsible parenting contribute to the upbringing of good citizens in the society?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66282?exam_type=waec&type=theory&page=17",
    "correct_answer": "(a). - The first quality of a responsible parent is marrying the right person yhat the children can emulate.\n- The ability to provide the basic necessities for the family is another quality of a responsible parent.\n- A responsible parent must be able to notice and solve whatever emotional imbalance arising in their children.\n- A responsible parent must be able to plan the nymber of children to have and are capable of catering for.\n- A responsible parent must be able to adopt peaceful strategies to always keep the family going.\n(b). - Teaching morality: Good citizens need to be people who act according to moral principles. Rather than being selfish or trying to deceive each other, they ought to deal in a kind and upright way with each other. Part of a parent's responsibility is ensuring that they bring up the next generation of citizens properly.-Teaching social interactions: Being polite, making friends, and reaching out to others are all important things in society. Parents can teach children to be comfortable when socializing from an early age.-Encouraging independent thought: In a democratic society, or indeed in any society, good citizenship involves expressing one's opinions, and also respecting the opinions of others. This is seen not least in the voting process. Responsible parenthood, then, also involves teaching children to respect others' opinions – and to develop their own opinions too. Tolerance of others is a true civic virtue.-Appreciating the society: Children will not grow up to become responsible citizens unless they appreciate the society in which they live. Thus, part of responsible parenting may well include taking children out to enjoy public parks, theatre productions and so on in the city.-Becoming responsible parents too: Our parenting style will often inspire our children when they become parents in their turn. So, being responsible parents is so important if we want our children to become responsible parents in their own right. In so doing, we become part of an established tradition of good parenting that helps to shape our society to get better and better.",
    "explanation": "(a). - The first quality of a responsible parent is marrying the right person yhat the children can emulate.\n- The ability to provide the basic necessities for the family is another quality of a responsible parent.\n- A responsible parent must be able to notice and solve whatever emotional imbalance arising in their children.\n- A responsible parent must be able to plan the nymber of children to have and are capable of catering for.\n- A responsible parent must be able to adopt peaceful strategies to always keep the family going.\n(b). - Teaching morality: Good citizens need to be people who act according to moral principles. Rather than being selfish or trying to deceive each other, they ought to deal in a kind and upright way with each other. Part of a parent's responsibility is ensuring that they bring up the next generation of citizens properly.-Teaching social interactions: Being polite, making friends, and reaching out to others are all important things in society. Parents can teach children to be comfortable when socializing from an early age.-Encouraging independent thought: In a democratic society, or indeed in any society, good citizenship involves expressing one's opinions, and also respecting the opinions of others. This is seen not least in the voting process. Responsible parenthood, then, also involves teaching children to respect others' opinions – and to develop their own opinions too. Tolerance of others is a true civic virtue.-Appreciating the society: Children will not grow up to become responsible citizens unless they appreciate the society in which they live. Thus, part of responsible parenting may well include taking children out to enjoy public parks, theatre productions and so on in the city.-Becoming responsible parents too: Our parenting style will often inspire our children when they become parents in their turn. So, being responsible parents is so important if we want our children to become responsible parents in their own right. In so doing, we become part of an established tradition of good parenting that helps to shape our society to get better and better.",
    "year": "2022"
  },
  {
    "number": "86",
    "text": "(a). Identify five reasons for which it has become increasingly difficult to maintain low rate of accidents on Nigerian roads.\n(b). Highlight five measures that can be adopted by the Nigerian government to reduce the rate of accidents on Nigerian roads.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66285?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a). - Poor functional roads: Many accidental occurance while driving in Nigeria is as a result of bad roads. Many of our roads are inaccessible, too narrow, not developed, full of potholes.-Bad vehicle/motor maintenance culture in Nigeria: Many people fail to engage in simple maintenance check and servicing of their vehicle such as the break, tires, steering etc.-Poor driving behaviour: Many Nigerians usually throw caution into the wind when driving. They drive recklessly trying to overtake other's vehicle like it's a car racing competition, and also fail to adhere to simple traffic and driving rules and regulations.-Lack of proper driving education: Many drivers didn't attend driving school, so they are not well-informed about certain driving rules, skills and safety tips.-Use of mobile devices and gadgets while driving: Even with several warnings from government agencies concerning transportation, people still engage in dangerous behaviours such as making calls when driving, reading and replying text messages, driving while watching videos from the car.\n(b). - Sanitation of motor parks from alcohol sales and consumptionShops where alcoholic beverages are sold are visibly present in most if not all Nigerian motor parks today without recourse to the very negative effects of drunk drinking by drivers who are the main consumers. The resultant effect is reckless driving on our Highways. There needs to be proper enactment of legislations to address this issue and thorough enforcement of legislations already put in place forbidding the sales of alcoholic drinks or beverages in our motor parks.- Routine maintenance and rehabilitation of road pavements.Bad road pavement conditions in Nigeria are one of the principal causes of road accidents. These roads are poorly constructed and rarely managed or rehabilitated. When these roads are not maintained and rehabilitated, they tend to deteriorate. Therefore a remote way of ensuring accident reduction/prevention is for the government, which is charged with the responsibility for good maintenance to draw up and implement to the later on regular basis, budgets that match the demands of the road network and its infrastructure.- Total prohibiting the use of mobile phones while drivingWhile there is little concrete evidence yet on how to reduce mobile phone use while driving, the Nigerian government needs to be proactive. Actions that can be taken to address this ill tradition by Nigerians include enacting, adopting and fully enforcing legislative measures prohibiting the use of mobile phones while driving.- Training and retraining/public enlightenmentThe road traffic system itself is dynamic in nature. Hence training and retraining of drivers constitute a formidable means of effectively dealing with the issue of road traffic accident reduction. In Nigeria today, major road traffic accident scenes have been noticed to involve commercial transporters/vehicles. To this end, there is urgent need for public transport operators to ensure that their drivers are trained and retrained in collaboration with the Federal Road Safety Commission, FRSC.- Diligence of duty by government established agenciesGovernment should ensure that all established agencies such as Federal Road Safety Commission, FRSC and Vehicle Inspection Offices, VIO must carry out their jobs effectively and thoroughly; checking the conditions of vehicles that ply on our road, without extorting money or collecting bribes from drivers.",
    "explanation": "(a). - Poor functional roads: Many accidental occurance while driving in Nigeria is as a result of bad roads. Many of our roads are inaccessible, too narrow, not developed, full of potholes.-Bad vehicle/motor maintenance culture in Nigeria: Many people fail to engage in simple maintenance check and servicing of their vehicle such as the break, tires, steering etc.-Poor driving behaviour: Many Nigerians usually throw caution into the wind when driving. They drive recklessly trying to overtake other's vehicle like it's a car racing competition, and also fail to adhere to simple traffic and driving rules and regulations.-Lack of proper driving education: Many drivers didn't attend driving school, so they are not well-informed about certain driving rules, skills and safety tips.-Use of mobile devices and gadgets while driving: Even with several warnings from government agencies concerning transportation, people still engage in dangerous behaviours such as making calls when driving, reading and replying text messages, driving while watching videos from the car.\n(b). - Sanitation of motor parks from alcohol sales and consumptionShops where alcoholic beverages are sold are visibly present in most if not all Nigerian motor parks today without recourse to the very negative effects of drunk drinking by drivers who are the main consumers. The resultant effect is reckless driving on our Highways. There needs to be proper enactment of legislations to address this issue and thorough enforcement of legislations already put in place forbidding the sales of alcoholic drinks or beverages in our motor parks.- Routine maintenance and rehabilitation of road pavements.Bad road pavement conditions in Nigeria are one of the principal causes of road accidents. These roads are poorly constructed and rarely managed or rehabilitated. When these roads are not maintained and rehabilitated, they tend to deteriorate. Therefore a remote way of ensuring accident reduction/prevention is for the government, which is charged with the responsibility for good maintenance to draw up and implement to the later on regular basis, budgets that match the demands of the road network and its infrastructure.- Total prohibiting the use of mobile phones while drivingWhile there is little concrete evidence yet on how to reduce mobile phone use while driving, the Nigerian government needs to be proactive. Actions that can be taken to address this ill tradition by Nigerians include enacting, adopting and fully enforcing legislative measures prohibiting the use of mobile phones while driving.- Training and retraining/public enlightenmentThe road traffic system itself is dynamic in nature. Hence training and retraining of drivers constitute a formidable means of effectively dealing with the issue of road traffic accident reduction. In Nigeria today, major road traffic accident scenes have been noticed to involve commercial transporters/vehicles. To this end, there is urgent need for public transport operators to ensure that their drivers are trained and retrained in collaboration with the Federal Road Safety Commission, FRSC.- Diligence of duty by government established agenciesGovernment should ensure that all established agencies such as Federal Road Safety Commission, FRSC and Vehicle Inspection Offices, VIO must carry out their jobs effectively and thoroughly; checking the conditions of vehicles that ply on our road, without extorting money or collecting bribes from drivers.",
    "year": "2022"
  },
  {
    "number": "87",
    "text": "(a). Outline five negative consequences of cultism on its members in the society.\n(b). In what five ways can responsible parenting assist in reducing high rate of cultism in the society?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66286?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a). - Untimely DeathOne of the pathetic effects of cultism is the loss of lives prematurely. The government through its law enforcement agencies on a constant effort, fights crime such as armed robbery, kidnapping, drug abuse, murder etc. carried out by the cult members.The outcome of such operations often results in exchange of fire, arrest, detention, imprisonment and death. Many young people who indulge in these heinous acts have lost their lives either in the course of a shootout confrontation or through inter-cult clashes.- Loss of Moral ValuesCultism leads to loss of values in young people. This is because the belief system and ideologies of most of these cult groups are against the objective morality of life.- Incomplete EducationMost cultists end up not completing their academic programme. Today, school authorities in a bid to curb the rate of cultism and its activities, have adopted strict penalties for it which include expulsion of students involved irrespective of the academic level they are.- Drug and substance AddictionFurthermore, drug addiction can be as a result of influence of cultism among our youths. Within the circle of fellow cult members, they are constantly exposed to drugs through the network of dealers on such substances who are regularly patronized by these cultists.- Unrealizable Life AmbitionsAlso cultism can lead to termination of ambitions and goals in youths. Most young people with bright future and potentials, end up not pursuing their career or goals because of the negative influence of cultism.\n(b). - Parents should pay more attention to their children's upbringing and educatethem properly on acceptable standards of behaviour.- Parents should encourage their children to join religious groups and develop the fear ofGod because the fear of God is the beginning of wisdom.- Parents should show good examples to their children.- Parents should keep an eye on the company that their children keep so that they can know when they start keeping bad company and keep them in check.- Parents should join hands with other concerned individuals in the country to put measures in place to curb cultism.",
    "explanation": "(a). - Untimely DeathOne of the pathetic effects of cultism is the loss of lives prematurely. The government through its law enforcement agencies on a constant effort, fights crime such as armed robbery, kidnapping, drug abuse, murder etc. carried out by the cult members.The outcome of such operations often results in exchange of fire, arrest, detention, imprisonment and death. Many young people who indulge in these heinous acts have lost their lives either in the course of a shootout confrontation or through inter-cult clashes.- Loss of Moral ValuesCultism leads to loss of values in young people. This is because the belief system and ideologies of most of these cult groups are against the objective morality of life.- Incomplete EducationMost cultists end up not completing their academic programme. Today, school authorities in a bid to curb the rate of cultism and its activities, have adopted strict penalties for it which include expulsion of students involved irrespective of the academic level they are.- Drug and substance AddictionFurthermore, drug addiction can be as a result of influence of cultism among our youths. Within the circle of fellow cult members, they are constantly exposed to drugs through the network of dealers on such substances who are regularly patronized by these cultists.- Unrealizable Life AmbitionsAlso cultism can lead to termination of ambitions and goals in youths. Most young people with bright future and potentials, end up not pursuing their career or goals because of the negative influence of cultism.\n(b). - Parents should pay more attention to their children's upbringing and educatethem properly on acceptable standards of behaviour.- Parents should encourage their children to join religious groups and develop the fear ofGod because the fear of God is the beginning of wisdom.- Parents should show good examples to their children.- Parents should keep an eye on the company that their children keep so that they can know when they start keeping bad company and keep them in check.- Parents should join hands with other concerned individuals in the country to put measures in place to curb cultism.",
    "year": "2022"
  },
  {
    "number": "88",
    "text": "(a). Outline five reasons for which those who tested positive to HIV/AIDS are being discriminated against in the society.\n(b).  In what five ways does the contraction of HIV/AIDS Impact on the socio-economic life of the victim?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66289?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a). - Fear is a common cause of discrimination. This may be fear of catching the disease as it is infectious (or perceived to be so).- Discrimination by association is also known as 'symbolic stigma'. This may occur when a health condition is associated with a condition that is perceived to be undesirable. HIV/AIDS is an example of such as it is usually associated with illicit sex.- Values and beliefs can play a powerful role in creating or sustaining stigma. Examples are beliefs regarding the cause of a condition. Religious values regarding sexual relationships and marriage may cause HIV/AIDS discrimination if they are perceived to be the result of marital infidelity.- Lack of awareness and education on the nature of HIV/AIDS is another reason for the discrimination.- In accurate and misleading representation even by some health workers is a cause of the discrimination of HIV/AIDS patients.\n(b). - Loss of income and livelihood.\n- It makes them dependent on others as they cannot be fully effective.\n- Liable to become poor as they have to spend more even after losing their means of livelihood.\n- The HID/AIDS patient becomes depressed while the family goes through emotional and psychological torture.\n- The parents and relations who are shouldering the big financial responsibility of caring for the HID/AIDS patient may not be able to send other members of the family to school. In other words, the family is badly affected economically.",
    "explanation": "(a). - Fear is a common cause of discrimination. This may be fear of catching the disease as it is infectious (or perceived to be so).- Discrimination by association is also known as 'symbolic stigma'. This may occur when a health condition is associated with a condition that is perceived to be undesirable. HIV/AIDS is an example of such as it is usually associated with illicit sex.- Values and beliefs can play a powerful role in creating or sustaining stigma. Examples are beliefs regarding the cause of a condition. Religious values regarding sexual relationships and marriage may cause HIV/AIDS discrimination if they are perceived to be the result of marital infidelity.- Lack of awareness and education on the nature of HIV/AIDS is another reason for the discrimination.- In accurate and misleading representation even by some health workers is a cause of the discrimination of HIV/AIDS patients.\n(b). - Loss of income and livelihood.\n- It makes them dependent on others as they cannot be fully effective.\n- Liable to become poor as they have to spend more even after losing their means of livelihood.\n- The HID/AIDS patient becomes depressed while the family goes through emotional and psychological torture.\n- The parents and relations who are shouldering the big financial responsibility of caring for the HID/AIDS patient may not be able to send other members of the family to school. In other words, the family is badly affected economically.",
    "year": "2022"
  },
  {
    "number": "89",
    "text": "(a). Highlight five major empowerment skills that youths require for self-reliance in Nigerian society?\n(b). State five reasons for the establishment of the National Youth Service Corps (NYSC) in Nigeria.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66291?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a). - Life Coping SkillsThese are natural skills which every organism including man, acquires from birth to adapt fittingly in his or its environment. They are survival Instincts or skills. They are natural things we do to survive, avert dander and assert our individuality, e.g., crude farming, running on an errand, hunting, learning to make shelter, fishing, obeying laws and authorities, avoiding conflicts, etc these skills graduate from simple crude form to a more complex, learned and modernized forms.- Manipulative SkillsThese skills are seen in skills acquisition centres as it involves economic activities that inculcate skills such as technical education. Computer, field events, mining, manufacturing, technological works, scientific experiments, construction, engineering, productive ventures, gadgets and machine manipulations (whether digital or analogue), building, wielding, carpentry, mechanics etc.- Intellectual SkillsThese skills are coordinates in character. It is the literary or theoretical frameworks that guide the practical aspects of the works, economic and scientific undertakings. In the primary sense, it is called brain work. Without the intellectual skills, no other skills can function as they are the master minds, motivators and co-coordinators. It is the engine of all activities generating the initiative and innovations in all their designs.- Communicative SkillsCommunication is a very important aspect of our life. Man evolved communications skills as a social being to enable him pass or send information from one person to the other or from place to place. Communicative skills assist the intellectual skills to be expressed adequately and specifically.- Artistic Skills:These are close to communicative skills and are more complex. Includes they art of good writing, fine and applied arts, music and drama. These skills make effective use of all the other four kinds of skills where necessary. Those who employ or have these skills are said to be adepts or experts, examples: Artists, Graphic designers, Musicians, Comedians, Actors, Actresses, etc. life coping skills agree with the artisan identity, the intellectual skills agree with the manager identity while the rest agree with the classical entrepreneur identity. Skills can be generally divided into two, namely, craftsman and entrepreneurial skills which tally with the life coping skills, manipulative skills and opportunistic entrepreneurial skills which match with the intellectual, artistic and communicative skills.\n(b). - To develop common ties among the Nigerian youths and promote national unity and integration.\n- To raise the moral tone of the Nigerian youths by giving them the opportunity to learn about higher ideals of national achievement, social and cultural improvement.\n- To develop in the Nigerian youths the attitudes of mind, acquired through shared experience and suitable training. which will make them more amenable to mobilisation in the national interest.\n- The equitable distribution of members of the service corps and the effective utilization of their skills in area of national needs.\n- To encourage corps members to eschew religious intolerance by accommodating religious differences.",
    "explanation": "(a). - Life Coping SkillsThese are natural skills which every organism including man, acquires from birth to adapt fittingly in his or its environment. They are survival Instincts or skills. They are natural things we do to survive, avert dander and assert our individuality, e.g., crude farming, running on an errand, hunting, learning to make shelter, fishing, obeying laws and authorities, avoiding conflicts, etc these skills graduate from simple crude form to a more complex, learned and modernized forms.- Manipulative SkillsThese skills are seen in skills acquisition centres as it involves economic activities that inculcate skills such as technical education. Computer, field events, mining, manufacturing, technological works, scientific experiments, construction, engineering, productive ventures, gadgets and machine manipulations (whether digital or analogue), building, wielding, carpentry, mechanics etc.- Intellectual SkillsThese skills are coordinates in character. It is the literary or theoretical frameworks that guide the practical aspects of the works, economic and scientific undertakings. In the primary sense, it is called brain work. Without the intellectual skills, no other skills can function as they are the master minds, motivators and co-coordinators. It is the engine of all activities generating the initiative and innovations in all their designs.- Communicative SkillsCommunication is a very important aspect of our life. Man evolved communications skills as a social being to enable him pass or send information from one person to the other or from place to place. Communicative skills assist the intellectual skills to be expressed adequately and specifically.- Artistic Skills:These are close to communicative skills and are more complex. Includes they art of good writing, fine and applied arts, music and drama. These skills make effective use of all the other four kinds of skills where necessary. Those who employ or have these skills are said to be adepts or experts, examples: Artists, Graphic designers, Musicians, Comedians, Actors, Actresses, etc. life coping skills agree with the artisan identity, the intellectual skills agree with the manager identity while the rest agree with the classical entrepreneur identity. Skills can be generally divided into two, namely, craftsman and entrepreneurial skills which tally with the life coping skills, manipulative skills and opportunistic entrepreneurial skills which match with the intellectual, artistic and communicative skills.\n(b). - To develop common ties among the Nigerian youths and promote national unity and integration.\n- To raise the moral tone of the Nigerian youths by giving them the opportunity to learn about higher ideals of national achievement, social and cultural improvement.\n- To develop in the Nigerian youths the attitudes of mind, acquired through shared experience and suitable training. which will make them more amenable to mobilisation in the national interest.\n- The equitable distribution of members of the service corps and the effective utilization of their skills in area of national needs.\n- To encourage corps members to eschew religious intolerance by accommodating religious differences.",
    "year": "2022"
  },
  {
    "number": "90",
    "text": "(a). Define political party as a pillar of democracy.\n(b). Give five conditions necessary for conducting free and fair elections.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66294?exam_type=waec&type=theory&page=18",
    "correct_answer": "(a). Political parties are a group of persons organized to acquire and exercise political power. Citizens vote for the party of their choice and, in this way, influence government policy. The presence of the political party is actually a healthy situation for the nation. It gives people a choice to make a more evolved and effective decision. Political parties are essential institutions of democracy. By competing in elections parties offer citizens a choice in governance, and while in opposition they can hold governments accountable.\n(b). - In order for citizens to make informed choices at the ballot box, they need accurate information about the candidates and political platforms they're choosing between. This means that governments can't prevent the media from covering opposition candidates or parties, and it also means that parties don't intentionally spread misinformation. So access to reliable information is a key requirement for credibility of democratic elections.- In a democracy with free and fair elections, governments exist for the people, are empowered by the people, and are made up of the people. A citizen who is eligible to vote should also be eligible to run for office. Governments cannot attack or prevent people who want to run for office, assuming they meet the same eligibility criteria as other politicians and candidates.- Even if voters are given the right to vote, and are able to register to vote, an election is not free and fair unless they are then able to actually cast their ballot. Governments need to make voting reasonably possible for citizens. They must not be overly burdened to reach polling places, and reasonable accommodation should be made to ensure that citizens with a disability or other health condition, or lack of transportation, are still able to vote.- Nobody should be intimidated or threatened at any point during an election. This includes outside and inside the polling station, but also before election day. The threat of violence can make people afraid to vote their preference. The threat of violence also does not need to be overt to violate this standard. If the government staffs polling places with poll watchers who are intentionally intimidating looking, or even armed, this can intimidate voters. So too can having people observe the actual process of voting. This is why secret ballots are important to ensure that voters feel safe and secure while voting.-Every eligible voter should be able to cast one ballot, and it should be counted the same as every other ballot. When illegal ballots are counted along with legal ballots, the result does not reflect the will of voters.- Counting all ballots and giving an accurate reporting of that count are essential parts of a free and fair election. Ballots must not be altered or thrown out after they are cast. And when a fair count is done, the government cannot refuse to release it, or release a different result.",
    "explanation": "(a). Political parties are a group of persons organized to acquire and exercise political power. Citizens vote for the party of their choice and, in this way, influence government policy. The presence of the political party is actually a healthy situation for the nation. It gives people a choice to make a more evolved and effective decision. Political parties are essential institutions of democracy. By competing in elections parties offer citizens a choice in governance, and while in opposition they can hold governments accountable.\n(b). - In order for citizens to make informed choices at the ballot box, they need accurate information about the candidates and political platforms they're choosing between. This means that governments can't prevent the media from covering opposition candidates or parties, and it also means that parties don't intentionally spread misinformation. So access to reliable information is a key requirement for credibility of democratic elections.- In a democracy with free and fair elections, governments exist for the people, are empowered by the people, and are made up of the people. A citizen who is eligible to vote should also be eligible to run for office. Governments cannot attack or prevent people who want to run for office, assuming they meet the same eligibility criteria as other politicians and candidates.- Even if voters are given the right to vote, and are able to register to vote, an election is not free and fair unless they are then able to actually cast their ballot. Governments need to make voting reasonably possible for citizens. They must not be overly burdened to reach polling places, and reasonable accommodation should be made to ensure that citizens with a disability or other health condition, or lack of transportation, are still able to vote.- Nobody should be intimidated or threatened at any point during an election. This includes outside and inside the polling station, but also before election day. The threat of violence can make people afraid to vote their preference. The threat of violence also does not need to be overt to violate this standard. If the government staffs polling places with poll watchers who are intentionally intimidating looking, or even armed, this can intimidate voters. So too can having people observe the actual process of voting. This is why secret ballots are important to ensure that voters feel safe and secure while voting.-Every eligible voter should be able to cast one ballot, and it should be counted the same as every other ballot. When illegal ballots are counted along with legal ballots, the result does not reflect the will of voters.- Counting all ballots and giving an accurate reporting of that count are essential parts of a free and fair election. Ballots must not be altered or thrown out after they are cast. And when a fair count is done, the government cannot refuse to release it, or release a different result.",
    "year": "2022"
  },
  {
    "number": "91",
    "text": "Explain the following forms of civic society.\n\n(a) Pro-democracy groups\n(b). Labour groups\n(c). Professional groups\n(d). Religious groups\n(e). Student groups\n(f). Gender groups\n(g). Human rights groups",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66303?exam_type=waec&type=theory&page=19",
    "correct_answer": "(a). These are groups that do everything withing their legal capacity to uphold the democratic principles of a state. They achieve their goals through protest most times and have a sole aim of keeping the will of the people.\n(b). A labour union/group is an organization of employees that is created for the purpose of dealing with employers concerning employee-employer relations, including grievances, labor disputes, wages, rates of pay, hours of employment, and other conditions of work. A labor union negotiates on behalf of its members in a process known as collective bargaining. They are also usually active in the political process and in lobbying about issues of importance to their members.\n(c). A professional association/group is an organization with members who work in or share an interest in a specific job field or industry. Members of professional associations will often meet regularly to discuss upcoming news in their field or will host events for other members to meet and network.\n(d). A religious group is a set of individuals whose identity as such is distinctive in terms of common religious creed, beliefs and doctrines. They are gatherings of individuals who have common religious beliefs, habits, and practices and ideologies about the negotiated order of these gatherings.\n(e). A​ ​student​ ​organization​ ​is defined as a group of undergraduate or graduate students who unite to promote or celebrate a common interest. The purpose of a student organization is to bring everyone together based on their interests and build relations. Student organization recognitions purpose is to create connections, expand skills, and explore different elements of university life while making lifelong friends.\n(f). The Gender Group is a closed support/social group for people who self-identify as male or female, or may be identified by others, as transgender, genderqueer, bigender, crossdresser, or any other identity that may fall under the umbrella of trans.\n(g). Human rights are rights inherent to all human beings, regardless of race, sex, nationality, ethnicity, language, religion, or any other status. A human rights group, or human rights organization, is a non-governmental organization which advocates for human rights through identification of their violation, collecting incident data, its analysis and publication, promotion of public awareness while conducting institutional advocacy, and lobbying to halt these violations.",
    "explanation": "(a). These are groups that do everything withing their legal capacity to uphold the democratic principles of a state. They achieve their goals through protest most times and have a sole aim of keeping the will of the people.\n(b). A labour union/group is an organization of employees that is created for the purpose of dealing with employers concerning employee-employer relations, including grievances, labor disputes, wages, rates of pay, hours of employment, and other conditions of work. A labor union negotiates on behalf of its members in a process known as collective bargaining. They are also usually active in the political process and in lobbying about issues of importance to their members.\n(c). A professional association/group is an organization with members who work in or share an interest in a specific job field or industry. Members of professional associations will often meet regularly to discuss upcoming news in their field or will host events for other members to meet and network.\n(d). A religious group is a set of individuals whose identity as such is distinctive in terms of common religious creed, beliefs and doctrines. They are gatherings of individuals who have common religious beliefs, habits, and practices and ideologies about the negotiated order of these gatherings.\n(e). A​ ​student​ ​organization​ ​is defined as a group of undergraduate or graduate students who unite to promote or celebrate a common interest. The purpose of a student organization is to bring everyone together based on their interests and build relations. Student organization recognitions purpose is to create connections, expand skills, and explore different elements of university life while making lifelong friends.\n(f). The Gender Group is a closed support/social group for people who self-identify as male or female, or may be identified by others, as transgender, genderqueer, bigender, crossdresser, or any other identity that may fall under the umbrella of trans.\n(g). Human rights are rights inherent to all human beings, regardless of race, sex, nationality, ethnicity, language, religion, or any other status. A human rights group, or human rights organization, is a non-governmental organization which advocates for human rights through identification of their violation, collecting incident data, its analysis and publication, promotion of public awareness while conducting institutional advocacy, and lobbying to halt these violations.",
    "year": "2022"
  },
  {
    "number": "92",
    "text": "Enumerate five reasons for which the public service in Nigeria has not been proficient.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/civic-education/66306?exam_type=waec&type=theory&page=19",
    "correct_answer": "- Bribery and Corruption: The quick, smooth operation of the civil service is often handicapped by bribery and corruption. Some public servants no longer do their official duty, rather they are looking forward to being bribed before doing their duties.- Mode of employment: MOST (not all) employment into the public service is not mainly on merit. Employment is given to those that are highly connected or those that are ready to pay for the employment. Some of these people may not be qualified for the job and these will affect the level of productivity. Sometimes, the unqualified person is appointed or promoted to a position he cannot perform well, while the qualified person is passed over due to favoritism.- Bottleneck in Administrative procedure: The Nigerian Public Service is govern by its constitution (Public Service Rules), employment, retirement and sacking of Civil Servants are done by or with the permission of the Federal Civil Service Commision (FCSC). This means that as an employee, your boss cannot sack you. He can only give you a query or make complains to the FCSC. This makes most workers to misbehave and engage in different misconduct.- Duplication of offices and position: The public service is often criticized for wasting financial and manpower resources, and retaining unproductive workers with the creation of ministries, departments and positions with similar functions.- Ineffective organization: The public service has been touted as being ineffectively organized, and improperly managed. For instance, records, documents, files and other sources of information are not well arranged nor properly coordinated. This may be due to frequent movement of workers or non-delineation of responsibilities.",
    "explanation": "- Bribery and Corruption: The quick, smooth operation of the civil service is often handicapped by bribery and corruption. Some public servants no longer do their official duty, rather they are looking forward to being bribed before doing their duties.- Mode of employment: MOST (not all) employment into the public service is not mainly on merit. Employment is given to those that are highly connected or those that are ready to pay for the employment. Some of these people may not be qualified for the job and these will affect the level of productivity. Sometimes, the unqualified person is appointed or promoted to a position he cannot perform well, while the qualified person is passed over due to favoritism.- Bottleneck in Administrative procedure: The Nigerian Public Service is govern by its constitution (Public Service Rules), employment, retirement and sacking of Civil Servants are done by or with the permission of the Federal Civil Service Commision (FCSC). This means that as an employee, your boss cannot sack you. He can only give you a query or make complains to the FCSC. This makes most workers to misbehave and engage in different misconduct.- Duplication of offices and position: The public service is often criticized for wasting financial and manpower resources, and retaining unproductive workers with the creation of ministries, departments and positions with similar functions.- Ineffective organization: The public service has been touted as being ineffectively organized, and improperly managed. For instance, records, documents, files and other sources of information are not well arranged nor properly coordinated. This may be due to frequent movement of workers or non-delineation of responsibilities.",
    "year": "2022"
  }
]