[
  {
    "number": "60",
    "text": "Using the spring balance provided, determine the weight of object of mass M = 5.0g. Record this weight as W\\(_{1}\\).\nDetermine the weight of the object when completely immersed in water contained in a beaker as shown in the diagram. Record the weight as W\\(_{2}\\)\nDetermine the weight of the object when it is completely immersed in the liquid labelled 'L'. Record the weight as W\\(_{3}\\). Evaluate, u = (W\\(_{1}\\) -W\\(_{3}\\)) and v = (W\\(_{1}\\) - W\\(_{3}\\)).\nRepeat the procedure with the objects of masses M = 10, 15, 20, and 25g. In each case, evaluate u = (W\\(_{1}\\) - W\\(_{3}\\)) and v = (W\\(_{1}\\) - W\\(_{3}\\)) on the vertical axis against u = (W\\(_{1}\\) - W\\(_{2}\\) on the horizontal axis.\nDetermine the slope, s, of the graph. (vii) State two precautions taken to ensure accurate results.\n\n(b)i. A piece of brass of mass 20.0g is hung on a spring balance from a rigid support and completely immersed in kerosine of density 8.0 x 10\\(^{2}\\)kg m\\(^{-3}\\). Determine the reading on the spring balance. [g= 10ms\\(^{-2}\\)], density of brass = 8.0 x 10\\(^{3}\\) kg m\\(^{-3}\\) J\nii. State Archimede's principle and the law of floatation.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60128?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "61",
    "text": "Fix a metre rule on the bench with the graduated face up.\nPlace the illuminated object at the zero end of the rule and the screen at the other end as illustrated in the diagram above.\nMeasure and record D, the distance between the object and the screen. Evaluate D\\(^{2}\\).\nPlace and move the converging lens between the illuminated object and the screen until a diminished sharp image of the object is formed on the screen. Read and record the position, X\\(_{1}\\), of the lens. From this position, move the lens towards the object until another sharp image of the object is formed on the screen. Read and record the new position x\\(_{2}\\), of the lens.\nEvaluate and record L (x\\(_{1}\\) - x\\(_{2}\\)), L\\(^{2}\\)) and (D\\(^{2}\\) - L\\(^{2}\\))\nRepeat the procedure for D = 90, 80, 70 and 60 cm. In each case, evaluate, L L\\(^{2}\\) and (D\\(^{2}\\) - L\\(^{2}\\)). Tabulate your readings.\nPlot a graph of D\\(^{2}\\) - L\\(^{2}\\) on the vertical axis against D on the horizontal axis.\nDetermine the slope, S, of the graph and evaluate K = \\(\\frac{s}{4}\\). State two precautions taken to ensure accurate results.\n\n(b)i. Distinguish between a real image and a virtual image.\nDraw a ray diagram to show how a converging lens may be used to form a real diminished image of an object.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60129?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  },
  {
    "number": "62",
    "text": "Measure and record the e.m.f. of the accumulator provided.\nConnect a circuit as shown in the diagram. S is a standard resistor and R is a resistance box.\nWith R = 0\\(\\Omega\\), close the key K. Read and record the ammeter reading I. Evaluate 1\\(^{-1}\\).\nRepeat the procedure for R=1,2, 3, 4, and 5\\(\\Omega\\). Tabulate your readings.\nPlot a graph of R on the vertical axis and 1\\(^{-1}\\) on the horizontal axis, starting both axis from the origin (0,0).\nDetermine the slope s of the graph and find the intercept C on the vertical axis.\nState two precautions taken to ensure accurate results.\n\n(b)i. State two advantages of a lead-acid accumulator over a Leclanche cell.\nii. A parallel combination of 3\\(\\Omega\\) and 4\\(\\Omega\\) resistors is connected in series with a resistor of 4\\(\\Omega\\) and a battery of negligible internal resistance. Calculate the effective resistance in the circuit.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60130?exam_type=waec&type=practical&page=13",
    "correct_answer": null,
    "explanation": "",
    "year": "2000"
  }
]