[
  {
    "number": "1173",
    "text": "Government as a subject refers to the study of",
    "options": {
      "A": "territotrial expansion",
      "B": "political leaders",
      "C": "the various nations of the World",
      "D": "the institutions of the state"
    },
    "answer_url": "https://myschool.ng/classroom/government/21324?exam_type=waec&type=obj&page=235",
    "correct_answer": "D",
    "explanation": "A government is the system or group of people governing an organized community, often a state. In the case of its broad associative definition, government normally consists of legislature, executive, and judiciary. Government is a means by which organizational policies are enforced, as well as a mechanism for determining policy. Each government has a kind of constitution, a statement of its governing principles and philosophy. Typically the philosophy chosen is some balance between the principle",
    "year": "2010"
  },
  {
    "number": "1174",
    "text": "Government is distinguished from the state because it",
    "options": {
      "A": "can be changed periodically",
      "B": "does not operate in any defined territory",
      "C": "is a loosely organized structure",
      "D": "enforces its will on the people of the State"
    },
    "answer_url": "https://myschool.ng/classroom/government/21327?exam_type=waec&type=obj&page=235",
    "correct_answer": "A",
    "explanation": "The main difference between state and government is that the government refers to a particular group of people who control the state at a given time whereas the state is an organized political community. Basically, the state power is employed through the government.",
    "year": "2010"
  },
  {
    "number": "1175",
    "text": "A government is legitimate if it",
    "options": {
      "A": "comes to power through a coup d'etat",
      "B": "is not oppressive",
      "C": "provides social services for the people",
      "D": "has the mandate of the people to rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/21329?exam_type=waec&type=obj&page=235",
    "correct_answer": "D",
    "explanation": "Legitimacy of government is the popular acceptance of a government, political regime, or system of governance.",
    "year": "2010"
  },
  {
    "number": "1176",
    "text": "A sovereign power over a number of people in a specific geographical area is called",
    "options": {
      "A": "society",
      "B": "region",
      "C": "state",
      "D": "nation"
    },
    "answer_url": "https://myschool.ng/classroom/government/21331?exam_type=waec&type=obj&page=236",
    "correct_answer": "C",
    "explanation": "A state is a political organization with a centralized government that maintains a monopoly by use of force within a certain geographical territory. Some states are sovereign, other states are subject to external sovereignty or hegemony, where supreme authority lies in another state. The term \"state\" also applies to federated states that are members of a federation, which is the sovereign state.",
    "year": "2010"
  },
  {
    "number": "1177",
    "text": "Absence of government in a state is referred to as",
    "options": {
      "A": "anarchy",
      "B": "confusion",
      "C": "coup détat",
      "D": "ínstability"
    },
    "answer_url": "https://myschool.ng/classroom/government/21333?exam_type=waec&type=obj&page=236",
    "correct_answer": "A",
    "explanation": "Anarchy refers to a society, entity, group of people, or a single person that rejects hierarchy. The word originally meant leaderlessness. The earliest recorded use of the word, from the early 16th century, meant simply “absence of government,”",
    "year": "2010"
  },
  {
    "number": "1178",
    "text": "A situation where all the citizens meet in an open place to govern the state is called",
    "options": {
      "A": "direct democracy",
      "B": "electoral college",
      "C": "representative democracy",
      "D": "guided democracy"
    },
    "answer_url": "https://myschool.ng/classroom/government/21335?exam_type=waec&type=obj&page=236",
    "correct_answer": "A",
    "explanation": "Direct democracy or pure democracy is a form of democracy in which people decide on policy initiatives directly. it is a form of democracy in which all laws and policies imposed by governments are determined by the people themselves, rather than by representatives who are elected by the people.",
    "year": "2010"
  },
  {
    "number": "1179",
    "text": "A system of government in which the political power is vested in the elected representatives is known as",
    "options": {
      "A": "oligarchy",
      "B": "democracy",
      "C": "feudalism",
      "D": "Fascism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21338?exam_type=waec&type=obj&page=236",
    "correct_answer": "B",
    "explanation": "democracy is a system of government by the whole population or all the eligible members of a state, typically through elected representatives.",
    "year": "2010"
  },
  {
    "number": "1180",
    "text": "Sovereignty implies all the following except",
    "options": {
      "A": "the highest authority in a state",
      "B": "a state of political independence",
      "C": "unilimited powers of a state to make and enforce laws",
      "D": "the supremacy of political parties"
    },
    "answer_url": "https://myschool.ng/classroom/government/21341?exam_type=waec&type=obj&page=236",
    "correct_answer": "D",
    "explanation": "1.Permanence– This is the major attribute of sovereignty. Sovereignty should exist as long as a state remain independent. Sovereignty is a permanent feature of astateunlike the government.2.Absoluteness– Sovereignty is supreme and absolute. It is not subject to any control or interference.3.Independence– Sovereignty doesn’t allow external interference , therefore, a sovereign state is independent and free from external control.4.Indivisibility– The sovereignty of a state is indivisible. It remains single and absolute.5.Unity– “Unity is the spirit of Sovereignty”. A sovereign state should stay united.6.Comprehensiveness– Every member of the state is subject to the sovereignty of the state. The power of a state is universally applicable.",
    "year": "2010"
  },
  {
    "number": "1181",
    "text": "Popular Sovereignty is located in the",
    "options": {
      "A": "military",
      "B": "police",
      "C": "electorate",
      "D": "opinion leaders"
    },
    "answer_url": "https://myschool.ng/classroom/government/21343?exam_type=waec&type=obj&page=237",
    "correct_answer": "C",
    "explanation": "TYPES OF SOVEREIGNTY\n1.Legal Sovereignty– This is the sovereignty vested on the law making body in a state. E.g. Parliament2.Internal Sovereignty– This is the absolute power of a state to make and enforce law within its area of jurisdiction.3.External Sovereignty– This refers to the power of the state to run its affairs without any form of foreign interference.4.De jure Sovereignty– De jure sovereignty is having independent legal rule over one’s own country. The state have the right to control its military, finances, territory and people.4.De Facto Sovereignty– This sovereignty make use of force in compelling obedience. However, such state might see itself as a sovereign state while other external nations might not. E.g. Military government.5.Political Sovereignty (popular)– This sovereignty resides with the supreme body in a state. Political sovereignty lies with the electorates/ citizens.",
    "year": "2010"
  },
  {
    "number": "1182",
    "text": "Popular Sovereignty is located in the",
    "options": {
      "A": "military",
      "B": "police",
      "C": "electorate",
      "D": "opinion leaders"
    },
    "answer_url": "https://myschool.ng/classroom/government/21346?exam_type=waec&type=obj&page=237",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2010"
  },
  {
    "number": "1183",
    "text": "A system of government in which the leader exercises absolute power and allows no opposition is called",
    "options": {
      "A": "totalitariansim",
      "B": "capitalism",
      "C": "communism",
      "D": "socialism"
    },
    "answer_url": "https://myschool.ng/classroom/government/21349?exam_type=waec&type=obj&page=237",
    "correct_answer": "A",
    "explanation": "Totalitarianism is a political concept of a mode of government that prohibits opposition parties, restricts individual opposition to the state and its claims, and exercises an extremely high degree of control over public and private life.",
    "year": "2010"
  },
  {
    "number": "1184",
    "text": "Which of the following is a basic component of political culture?",
    "options": {
      "A": "Cultural development",
      "B": "Cultural design",
      "C": "Cultural display",
      "D": "Cognitive orientation"
    },
    "answer_url": "https://myschool.ng/classroom/government/21355?exam_type=waec&type=obj&page=237",
    "correct_answer": "D",
    "explanation": "Political culture takes into account the attitudes, values, and beliefs that people in a society have about the political system, including standard assumptions about the way that government works. The building blocks of political culture include the beliefs, opinions, and emotions of the citizens toward their form of government.\nThe cognitive orientation represents ourinterpretation of personal experience in contact with the physical world",
    "year": "2010"
  },
  {
    "number": "1185",
    "text": "Communism as propounded by Karl Max was later interpreted by",
    "options": {
      "A": "Locke",
      "B": "Dicey",
      "C": "Bentham",
      "D": "Lennin"
    },
    "answer_url": "https://myschool.ng/classroom/government/21357?exam_type=waec&type=obj&page=237",
    "correct_answer": "D",
    "explanation": "Communism, as propounded by Karl Marx, was later interpreted and expanded upon by Vladimir Lenin. Lenin was a key figure in the development of the ideology of communism, and his contributions to Marxist theory and revolutionary practice significantly influenced the course of history, particularly in Russia and other parts of the world.",
    "year": "2010"
  },
  {
    "number": "1186",
    "text": "According to Karl Marx, those who own and control the means of production in a capitalist society are the",
    "options": {
      "A": "colonialists",
      "B": "workers",
      "C": "bourgeoisies",
      "D": "peasants"
    },
    "answer_url": "https://myschool.ng/classroom/government/21360?exam_type=waec&type=obj&page=238",
    "correct_answer": "C",
    "explanation": "Marx's theory of class defines classes in their relation to their ownership and control of the means of production. In a capitalist society, thebourgeoisie,or the capitalist class, is the class that owns the means of production and derives a passive income from their operation.",
    "year": "2010"
  },
  {
    "number": "1187",
    "text": "The Rule of law is limited by",
    "options": {
      "A": "free press",
      "B": "diplomatic immunity",
      "C": "constitutionalism",
      "D": "separation of powers"
    },
    "answer_url": "https://myschool.ng/classroom/government/21361?exam_type=waec&type=obj&page=238",
    "correct_answer": "B",
    "explanation": "Diplomatic immunity is a form of legal immunity that ensures diplomats are given safe passage and are considered not susceptible to lawsuit or prosecution under the host country's laws, but they can still be expelled.",
    "year": "2010"
  },
  {
    "number": "1188",
    "text": "The institution created for checking abuses by government department is known as the",
    "options": {
      "A": "secret service",
      "B": "judicial commission",
      "C": "ombudsman",
      "D": "corps marshall"
    },
    "answer_url": "https://myschool.ng/classroom/government/21387?exam_type=waec&type=obj&page=238",
    "correct_answer": "C",
    "explanation": "An ombudsman, ombudsperson, ombud, or public advocate is an official who is charged with representing the interests of the public by investigating and addressing complaints of maladministration or a violation of rights.",
    "year": "2010"
  },
  {
    "number": "1189",
    "text": "A good example of an absolute monarch is",
    "options": {
      "A": "Adolf Hitler of Germany",
      "B": "Benito Mussohni of Italy",
      "C": "Haile Salessie of Ethiopia",
      "D": "Margaret Thatcher of Britain"
    },
    "answer_url": "https://myschool.ng/classroom/government/21390?exam_type=waec&type=obj&page=238",
    "correct_answer": "C",
    "explanation": "An absolute monarchy is a form of monarchy where the ruler rules a state and its citizens (i.e., his subjects) without any legal or political interference. ✦ In this form of government, power is usually passed onto children or family. he monarch can put as much tax as they wish and doesnt need to follow their advisors if they have any. In short, power only under that of God. An example of absolute monarch is Haile Salessie of Ethiopia.\nHe was an old-styleabsolute monarchwho ruled his nation with a sense of paternalism. He believed he knew what is best forEthiopia. He believed he knew what is best forEthiopia. He sought to modernize a feudal system but failed to undertake land reform.",
    "year": "2010"
  },
  {
    "number": "1190",
    "text": "The power of the central government to dissolve subordinate units at will is a feature of",
    "options": {
      "A": "confederal system of government",
      "B": "unitary system of government",
      "C": "parlimentary system of government",
      "D": "federal system of government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21396?exam_type=waec&type=obj&page=238",
    "correct_answer": "B",
    "explanation": "The following are some basic characteristics of a unitary state\n(a) The central government not only has the power to dissolve the subordinate levels it has created, it can equally modify or reduce the powers given to them.\n(b) The subordinate levels are created as agents of the center to administer the local areas on behalf of the centre and to also convey the wishes of the people in the local areas to the center where real power lies.\n(c) A unitary government may either operate a unicameral or bicameral legislature. For example Ghana and Britain are unitary states, with the former operating a unicameral while the latter a bicameral legislature.",
    "year": "2010"
  },
  {
    "number": "1191",
    "text": "Which of the following is a feature of federalism ?",
    "options": {
      "A": "Unwritten Constitution",
      "B": "Flexible Constitution",
      "C": "Unitary Constitution",
      "D": "Written Constitution"
    },
    "answer_url": "https://myschool.ng/classroom/government/21407?exam_type=waec&type=obj&page=239",
    "correct_answer": "D",
    "explanation": "Federalism is the mixed or compound mode of government, combining a general government with regional governments in a single political system. the following are some key features of federalism\nThe presence of constituent parts called republics, states, etc.The relations between the federation and its entities are governed by the Federal Constitution.Foreign policy activities are conducted by the federal government on behalf of all entities.The bicameral structure of the federal parliament where one is the organ of the federal government, and the other is representing the interests of the federation (this is a mandatory feature of a federal state). with a Written ConstitutionThe regions may issue their own constitution, decrees and other normative-legal acts that will be legal in their territory on a par with the federal constitution and federal laws.The subjects of the federation can have their own flags, emblems anthems and all other signs of the state, except state sovereignty.The subjects of the federation cannot be independent subjects of international relations.",
    "year": "2010"
  },
  {
    "number": "1192",
    "text": "The exclusive list in federalism includes all the following except",
    "options": {
      "A": "defence",
      "B": "foreign relation",
      "C": "currency",
      "D": "transportation"
    },
    "answer_url": "https://myschool.ng/classroom/government/21455?exam_type=waec&type=obj&page=239",
    "correct_answer": "D",
    "explanation": "In the context of Nigerian federalism, exclusive legislative list is the list on which matters over which only the federal authority can legislate are enumerated. This is contained in Part I of the Second Schedule of the 1999 constitution. There are 68 of such matters.",
    "year": "2010"
  },
  {
    "number": "1193",
    "text": "The order of mandamus is a",
    "options": {
      "A": "form of order by a superior body to perform a function",
      "B": "mandate from the executive to the public corporations",
      "C": "plea for man of alibi in court",
      "D": "writ to produce a detanied person for trial"
    },
    "answer_url": "https://myschool.ng/classroom/government/21458?exam_type=waec&type=obj&page=239",
    "correct_answer": "A",
    "explanation": "The legal term writ of mandamus refers to an order by a court to a lesser government official to perform an act required by law, which he has refused or neglected to do.\nA writ ororderofmandamusis an extraordinary courtorderbecause it is made without the benefit of full judicial process, or before a case has concluded. It may be issued by a court at any time that it is appropriate, but it is usually issued in a case that has already begun.",
    "year": "2010"
  },
  {
    "number": "1194",
    "text": "In the legislature, a filibuster is one who",
    "options": {
      "A": "is in charge of party discipline",
      "B": "presents partmanifesto during parliamentary system sessions",
      "C": "does not take part in law making",
      "D": "prevents the passage of a bill by making long speeches"
    },
    "answer_url": "https://myschool.ng/classroom/government/21466?exam_type=waec&type=obj&page=239",
    "correct_answer": "D",
    "explanation": "A filibuster is a political procedure where one or more members of parliament or congress debate over a proposed piece of legislation so as to delay or entirely prevent a decision being made on the proposal. It is sometimes referred to as \"talking a bill to death\" or \"talking out a bill\" and is characterized as a form of obstruction in a legislature or other decision-making body.",
    "year": "2010"
  },
  {
    "number": "1195",
    "text": "Which of the following measures will ensure the independence of the judiciary? Judges",
    "options": {
      "A": "salaries must be handled by foreign banks",
      "B": "must be controlled by the president",
      "C": "salaries must be fixed and not subject to arbitary review",
      "D": "must not be separated from the executive"
    },
    "answer_url": "https://myschool.ng/classroom/government/21569?exam_type=waec&type=obj&page=239",
    "correct_answer": "C",
    "explanation": "The judiciary is the system of courts that interprets and applies the law in the name of the state. The following are various ways to ensure the independence of the judiciary\nSeparation of Judiciary from the Executive and Legislature:Judiciary in nigeria is neither a branch of the executive nor a hand-maid of the legislature. It has an independent identity under the Constitution. It enjoys full autonomy in its working.Appointment of Judges by the President:The method of appointment of judges has been very sound. The Judges of the Supreme Court and High Courts are appointed by the President. While appointing other judges the Supreme Court, the President consults the Chief Justice of nigeria.High Qualifications:The Constitution prescribes specific and high qualifications for the Judges. A person eligible for judgeship has to be an nigerian citizen etc.Long Tenure:Judges of Supreme Court remain in office till they attain the statutory retirement age. This age limit ensures a long tenure for the Judges.Security of Service:The Judges in Nigeria enjoy good security of service. No judge can be removed from the office except by a very difficult process of impeachment.High Salary:Every Judge of the Supreme Court gets a high salary. Besides this, each judge is entitled to free residential accommodation, medical allowance and several other perks. Salaries and allowances of judges cannot be reduced during their terms of office, except in the situation of a financial emergency in the country.Power to Punish the Contempt of Court:Courts in Nigeria have been given the power to punish all cases involving a contempt of court. The Supreme Court can punish any institution or person who is found guilty of contempt of court.Vast Jurisdiction and the Power of Judicial Review:Judiciary in Nigeria enjoys a vast jurisdiction. It acts as the guardian interpreter of the Constitution, the protector of Fundamental Rights of the people and the arbiter of disputes between the Union and the States. It has the power to determine the constitutional validity of every law.",
    "year": "2010"
  },
  {
    "number": "1196",
    "text": "The most important function of the Upper House in a federation is to",
    "options": {
      "A": "serve as the highest court of the land",
      "B": "ensure equal representation of the component units",
      "C": "provide a place for retired politicians in the legislature",
      "D": "invite politicians for questioning"
    },
    "answer_url": "https://myschool.ng/classroom/government/21572?exam_type=waec&type=obj&page=240",
    "correct_answer": "B",
    "explanation": "The upper house also known as house of senate, is supposed to guarantee equal representation of the 36 states irrespective of size in the Senate and proportional representation of population in the House.",
    "year": "2010"
  },
  {
    "number": "1197",
    "text": "The most important function of the Upper House in a federation is to",
    "options": {
      "A": "serve as the highest court of the land",
      "B": "ensure equal representation of the component units",
      "C": "provide a place for retired politicians in the legislature",
      "D": "invite politicians for questioning"
    },
    "answer_url": "https://myschool.ng/classroom/government/21574?exam_type=waec&type=obj&page=240",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2010"
  },
  {
    "number": "1198",
    "text": "Bi-cameral legislature is the same as",
    "options": {
      "A": "legislature with two chambers",
      "B": "one chamber legislature",
      "C": "the Upper House in any legislature",
      "D": "the Lower House in any Legislature"
    },
    "answer_url": "https://myschool.ng/classroom/government/21576?exam_type=waec&type=obj&page=240",
    "correct_answer": "A",
    "explanation": "Bicameral literally means 'two-Chamber', A bicameral legislature simply refers to a particular body of government that consists of two legislative houses or chambers.",
    "year": "2010"
  },
  {
    "number": "1199",
    "text": "A short break in parliamentary session is referred to as",
    "options": {
      "A": "suspension",
      "B": "recess",
      "C": "dissolution",
      "D": "termination"
    },
    "answer_url": "https://myschool.ng/classroom/government/21593?exam_type=waec&type=obj&page=240",
    "correct_answer": "B",
    "explanation": "Recess is a period of time in the year when the members of a parliament, court of law, or other government organization are not meeting",
    "year": "2010"
  },
  {
    "number": "1200",
    "text": "The term guillotine in the legislature refers to",
    "options": {
      "A": "allocation of time to a  bill",
      "B": "passing a bill into law",
      "C": "voting a bill into law",
      "D": "passing an appropriation bil"
    },
    "answer_url": "https://myschool.ng/classroom/government/21595?exam_type=waec&type=obj&page=240",
    "correct_answer": "A",
    "explanation": "A guillotine isalimiton theamountofdiscussionallowedabout aparticularlawin Parliament, made by setting afixedtimebefore afinalvotemust be taken",
    "year": "2010"
  },
  {
    "number": "1201",
    "text": "Th rights of individuals are usually enshrined in the",
    "options": {
      "A": "law books",
      "B": "courts",
      "C": "constitutions",
      "D": "journals"
    },
    "answer_url": "https://myschool.ng/classroom/government/21599?exam_type=waec&type=obj&page=241",
    "correct_answer": "C",
    "explanation": "A constitution is an aggregate of fundamental principles or established precedents that constitute the legal basis of a polity, organisation or other type of entity, and commonly determine how that entity is to be governed.",
    "year": "2010"
  },
  {
    "number": "1202",
    "text": "A citizen's freedom of movement may be restrained if he",
    "options": {
      "A": "has refused to salute the Head of State",
      "B": "has been convicted by the courts",
      "C": "refuses to vote at elections",
      "D": "criticizes the government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21605?exam_type=waec&type=obj&page=241",
    "correct_answer": "B",
    "explanation": "Limitations to Human Rights\nCivil unrest – Whenever there is riot or crisis, there will not be freedom of movement.Some people’s movement can be limited if they have a case in the law court.A citizen who is infected with deadly diseases may be isolated for treatment in order not to infect other people thereby denying him/ her freedom of movement.A person’s land and property can be destroyed if built on the wrong place or if government wants to make some construction of roads or other project that will be useful for the public.A person who is found guilty of a murder case can lose his/her right to life.",
    "year": "2010"
  },
  {
    "number": "1203",
    "text": "A major advantage of a one-party system is that it",
    "options": {
      "A": "prevents dictatorship",
      "B": "promotes unity",
      "C": "allows opposition",
      "D": "promotes freedom and liberty"
    },
    "answer_url": "https://myschool.ng/classroom/government/21608?exam_type=waec&type=obj&page=241",
    "correct_answer": "B",
    "explanation": "Merits of one-party system:\n(1) It helps in the establishment of stable administration which further helps in the progress of the country. The progress of the Soviet Union is a glaring example in this regard.\n(2) In this system, formation and execution of long-term planning is possible.\n(3) The country achieves remarkable economic progress as the Government ends the conflicts among all the classes and it devotes its entire energy, towards the increase of production in the country.\n(4) The administration becomes efficient because all the powers are concentrated in the hands of one leader and there favouritism, nepotism and black-marketing are banished altogether.\n(5) There is a unity and discipline in the country.\n(6) Time is not wasted in unnecessary criticism and propaganda.",
    "year": "2010"
  },
  {
    "number": "1204",
    "text": "Which of the following best describes the concept of enfranchisement Right",
    "options": {
      "A": "to campaign for candidates during elections",
      "B": "to sue and be sued",
      "C": "given to people to vote and be voted for",
      "D": "to free expression on political issues"
    },
    "answer_url": "https://myschool.ng/classroom/government/21610?exam_type=waec&type=obj&page=241",
    "correct_answer": "C",
    "explanation": "enfranchisement- a statutory right or privilege granted to a person or group by a government (especially the rights of citizenship and the right to vote)\nEnfranchisementThe act of making free (as from Slavery); giving a franchise or freedom to; investiture with privileges or capacities of freedom, or municipal or political liberty. Conferring the privilege of voting upon classes of persons who have not previously possessed such",
    "year": "2010"
  },
  {
    "number": "1205",
    "text": "The process by which voters may remove a public officer before the end of his term of office is called",
    "options": {
      "A": "referendum",
      "B": "genymandering",
      "C": "recall",
      "D": "bye-election"
    },
    "answer_url": "https://myschool.ng/classroom/government/21612?exam_type=waec&type=obj&page=241",
    "correct_answer": "C",
    "explanation": "Arecall election(also called arecall referendum or representative recall)is a procedure by which, in certain polities, voters can remove an elected official from office through a direct vote before that official's term has ended.",
    "year": "2010"
  },
  {
    "number": "1206",
    "text": "The arrangement by which a country is divided into parts for election purposes is called",
    "options": {
      "A": "enfranchisement",
      "B": "gerrymandering",
      "C": "delimitation",
      "D": "democratization"
    },
    "answer_url": "https://myschool.ng/classroom/government/21613?exam_type=waec&type=obj&page=242",
    "correct_answer": "C",
    "explanation": "Boundarydelimitation(or simplydelimitation) is the drawing of boundaries, particularly ofelectoralprecincts, states, counties or other municipalities. In the context ofelections, it can be called redistribution and is used to prevent unbalance of population across districts.",
    "year": "2010"
  },
  {
    "number": "1207",
    "text": "A yes or no vote cast by electorate to decide an important issue in an area is known as",
    "options": {
      "A": "franchise",
      "B": "plebiscite",
      "C": "electorate college",
      "D": "public opinion"
    },
    "answer_url": "https://myschool.ng/classroom/government/21615?exam_type=waec&type=obj&page=242",
    "correct_answer": "B",
    "explanation": "A plebiscite is the direct vote of all the members of an electorate on an important public question such as a change in the constitution.",
    "year": "2010"
  },
  {
    "number": "1208",
    "text": "The term winner-takes all can be associated with",
    "options": {
      "A": "second ballot system",
      "B": "representative government",
      "C": "first-past-the post system",
      "D": "proportinal representation"
    },
    "answer_url": "https://myschool.ng/classroom/government/21617?exam_type=waec&type=obj&page=242",
    "correct_answer": "C",
    "explanation": "A first-past-the-post (FPTP and sometimes abbreviated to FPP) electoral system is one in which voters indicate on a ballot the candidate of their choice, and the candidate who receives the most votes wins. This is sometimes described as winner takes all. First-past-the-post voting is a plurality voting method. FPTP is a common, but not universal, feature of electoral systems with single-member electoral divisions, and is practiced in close to one third of countries. Notable examples include Canada, India, the United Kingdom, and the United States, as well as most of their current or former colonies and protectorates.",
    "year": "2010"
  },
  {
    "number": "1209",
    "text": "Anonymity of the civil servants means that they",
    "options": {
      "A": "are free from their political heads",
      "B": "are to be seen but not be heard",
      "C": "cannot vote for any political party",
      "D": "are to execute government policies"
    },
    "answer_url": "https://myschool.ng/classroom/government/21620?exam_type=waec&type=obj&page=242",
    "correct_answer": "B",
    "explanation": "Civil servants must therefore be anonymous. And it follows from both of the above that civil servants cannot be held accountable for the success or otherwise of government policy, for otherwise their public explanations could contain criticisms of their political masters.",
    "year": "2010"
  },
  {
    "number": "1210",
    "text": "The Loi-Cadre Reforms of 1956 in the French West Africa were as a result of",
    "options": {
      "A": "pressure from the French territories",
      "B": "change in French Policy of Association",
      "C": "opposition to Bamako Conference",
      "D": "British colonial policy of granting internal self-government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21623?exam_type=waec&type=obj&page=242",
    "correct_answer": "A",
    "explanation": "Theloi-cadre( Reform Act) was a French legal reform passed by the French National Assembly on 23 June 1956. It marked a turning point in relations between France and its overseas empire. Under pressure from independence movements in the colonies, the government transferred a number of powers from Paris to elected territorial governments in French African colonies and also removed remaining voting inequalities by implementing universal suffrage and abolishing the multiple electoral college system. It was the first step in the creation of the French Community, comparable to the British Commonwealth of Nations. Most French African colonies held elections under the new universal suffrage Loi Cadre system on 31 March 1957, the exceptions being Cameroon which held its election on 23 December 1956, and Togo which held its election on 17 April 1958. (Cameroon and Togo were United Nations mandated territories and so were on a different trajectory than the rest of French Africa).",
    "year": "2010"
  },
  {
    "number": "1211",
    "text": "Which of following best describes the status of Governor-General in British West African countries at independence? They",
    "options": {
      "A": "were representing the Queen of England",
      "B": "were above the law",
      "C": "maintained friendly relations with France",
      "D": "were the heads of government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21626?exam_type=waec&type=obj&page=243",
    "correct_answer": "A",
    "explanation": "Governors-general were British subjects, appointed on the advice of the British government, who acted as agents of the British government in each Dominion, as well as being representatives of the monarch. As such they notionally held the prerogative powers of the monarch, and also held the executive power of the country to which they were assigned. In these countries the governor-general acts as the monarch's representative, performing the ceremonial and constitutional functions of a head of state.",
    "year": "2010"
  },
  {
    "number": "1212",
    "text": "Before the Second World War, the British Colonial Executive Council consisted of",
    "options": {
      "A": "only elected Africans",
      "B": "only White officials",
      "C": "unofficial members",
      "D": "official and unofficial members"
    },
    "answer_url": "https://myschool.ng/classroom/government/21629?exam_type=waec&type=obj&page=243",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2010"
  },
  {
    "number": "1213",
    "text": "The West African Students' Union worked towards",
    "options": {
      "A": "the end of colonial rule",
      "B": "the end of indirect rule",
      "C": "getting accommodation for West African Students",
      "D": "the end of the policy of direct rule"
    },
    "answer_url": "https://myschool.ng/classroom/government/21631?exam_type=waec&type=obj&page=243",
    "correct_answer": "C",
    "explanation": "The West African Students' Union, founded in London in 1925 and active into the 1960s, was an association of students from various West African countries who were studying in the United Kingdom. , it had begun to campaign for improved welfare for all African students in London, and for assorted measures for progress in Britain's African colonies.\nThe organisation made opposition to the colour bar its first priority, while also including the promotion of political research, support for the NCBWA and the provision of a student hostel in its founding aims\nThe aim of founding a hostel was taken directly from USAD and the NPU. Many African students in Britain found that, due to racism, it was difficult to secure satisfactory lodgings. While the Colonial Office showed some interest in establishing such a hostel, WASU was keen to maintain control of the project, and in 1929, Solanke left for a fundraising journey through West Africa. Despite this, the Colonial Office assembled a secret committee to plan for a hostel under its control, and attempted to secure private funding for its construction.",
    "year": "2010"
  },
  {
    "number": "1214",
    "text": "The policy of Assimilation was abandoned because",
    "options": {
      "A": "it was too expensive to maintain",
      "B": "the French were fed up",
      "C": "the Africans liked it",
      "D": "it was less expensive"
    },
    "answer_url": "https://myschool.ng/classroom/government/21635?exam_type=waec&type=obj&page=243",
    "correct_answer": "B",
    "explanation": "assimilationin Africa has to do with the French attempting to turn Africans into model French citizens. They did this by teaching the French language at schools and churches, along with French history and other aspects of the French culture.\nThe French abandoned the policy of assimilation partly because the policy itself contravened with their original pre-occupations of their colonial policy in several ways.",
    "year": "2010"
  },
  {
    "number": "1215",
    "text": "The constitutional reforms in West Africa after the Second World War were geared towards",
    "options": {
      "A": "the assimilation of the people",
      "B": "the evaluation of colonialism",
      "C": "making the colonies independent states",
      "D": "making the people support their economic interests"
    },
    "answer_url": "https://myschool.ng/classroom/government/21644?exam_type=waec&type=obj&page=243",
    "correct_answer": "C",
    "explanation": "The Second World War brought into focus the illegality of colonialism in A frica. It istrue that most African nations became related after the war in the attempt to regain theirlost so vereignty. The effect of the Second World War on A frica situation especially in thearea of self-government and self-determination was very vital, it contributed more to a newpolitical climate, the rise of nationalism and the waging of independence campaigns invarious colonies as well as the new domestic priorities in the post-war period for colonialrulers. The war however saw the rise and demand for hurriedness in the process ofadministrative government. By the end of the Second World War, Africa has been well-equipped for the task of nation building. A quite number of African leaders played vital rolesin the struggle of political independence in the 1950s. Lots of African countries gainedtheirindependence later either through decolonisation or liberation.",
    "year": "2010"
  },
  {
    "number": "1216",
    "text": "One of the reasons for military takeover in West Africa is",
    "options": {
      "A": "smooth administration",
      "B": "political stability",
      "C": "corruption among political leaders",
      "D": "good governance"
    },
    "answer_url": "https://myschool.ng/classroom/government/21647?exam_type=waec&type=obj&page=244",
    "correct_answer": "C",
    "explanation": "Reasons why military leaders stage coup d'etat is when especially the civilian government is corrupt in many ways, when there is a lot of crisis in the country either religious, political and otherwise that the civilian government cannot handle, the military will stage in coup d'etat. Bellow are some other reasons;\n1) Grievence: this theory explains that coups are caused by groups that mobilize to fight injustices committed by the state. After a long history of political, economic, and social injustices, many groups begin to start coups to stop the trend of injustice.\n2) Greed: coups are started by groups of people who are tired of resource and other kinds of economic exploitation. Many leaders in Africa exploit their own land and people to extract valuable natural resource reserves, which eventually takes a toll on citizens. These citizens eventually start coups in hopes of attaining benefits of resources. (ex. Chad - many of Chad's coups have been started because of greed - stemming from exploitation of oil reserves in Chad)\n3) Colonial Effect: many scholars argue that the cause of coups in Africa stems from colonialism. Colonialism implemented an ideology across Africa that justified the attainment of power through force. Scholars believe that this lasting effect has contributed to the cause of coups around Africa.",
    "year": "2010"
  },
  {
    "number": "1217",
    "text": "Which of the following best describes the foreign policy of West African Countries during the Cold War?",
    "options": {
      "A": "Support for the Western bloc",
      "B": "Support for the Eastern bloc",
      "C": "Non-alignment with any power bloc",
      "D": "Allegiance to Nazi government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21652?exam_type=waec&type=obj&page=244",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2010"
  },
  {
    "number": "1218",
    "text": "Which of the following best describes the foreign policy of West African Countries during the Cold War?",
    "options": {
      "A": "Support for the Western bloc",
      "B": "Support for the Eastern bloc",
      "C": "Non-alignment with any power bloc",
      "D": "Allegiance to Nazi government"
    },
    "answer_url": "https://myschool.ng/classroom/government/21653?exam_type=waec&type=obj&page=244",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2010"
  },
  {
    "number": "1219",
    "text": "The Administrative Headquarters of the Economic Community of West African State (ECOWAS) is in",
    "options": {
      "A": "Freetown",
      "B": "Lome",
      "C": "Banjul",
      "D": "Abuja"
    },
    "answer_url": "https://myschool.ng/classroom/government/21655?exam_type=waec&type=obj&page=244",
    "correct_answer": "D",
    "explanation": "ECOWAS Secretariat Abuja. It is a regional group of fifteen West African countries. It was founded on 28 May 1975, with the signing of the Treaty of Lagos, its mission is to promote economic integration across the region. The administrative headquarters (secretariat) of ECOWAS is located inAbuja along Yakubu Gowon Cresent in Asokoro district of the city.",
    "year": "2010"
  },
  {
    "number": "1220",
    "text": "A representative of one country in another within the Commonwealth of Nations is called",
    "options": {
      "A": "High Commissioner",
      "B": "Attache",
      "C": "Foreigh Minister",
      "D": "Consul"
    },
    "answer_url": "https://myschool.ng/classroom/government/21658?exam_type=waec&type=obj&page=244",
    "correct_answer": "A",
    "explanation": "High Commissioner A chief representative of the government of one country who is assigned to an ambassadorial post in another country",
    "year": "2010"
  },
  {
    "number": "1221",
    "text": "The use of veto power in the United Nations Organization (UNO) is only exercised by the",
    "options": {
      "A": "Economic and Social Council",
      "B": "International Court of Justice",
      "C": "Trusteeship Council",
      "D": "Security Council"
    },
    "answer_url": "https://myschool.ng/classroom/government/21660?exam_type=waec&type=obj&page=245",
    "correct_answer": "D",
    "explanation": "The United Nations Security Council has 15 members, but only its five permanent members - the United States, the United Kingdom, France, China and Russia - hold the power to impose a veto on the council's resolutions.",
    "year": "2010"
  },
  {
    "number": "1222",
    "text": "The head of the Commonwealth of Nations is the",
    "options": {
      "A": "Colonial Secretary",
      "B": "Australian Foreign Secretary",
      "C": "British Monarch",
      "D": "New Zealand Foreign Minister"
    },
    "answer_url": "https://myschool.ng/classroom/government/21662?exam_type=waec&type=obj&page=245",
    "correct_answer": "C",
    "explanation": "The british monarch Queen Elizabeth II is the Head of the Commonwealth. The Queen’s role carries no formal functions, but has great symbolic significance and has helped to underline the sense of the Commonwealth as a family of nations. The Queen has laid considerable stress on her role as Head of the Commonwealth, and made a great contribution to the association.",
    "year": "2010"
  }
]