[
  {
    "number": "1676",
    "text": "A document through which invitation is extended to the public to subscribe to shares is?",
    "options": {
      "A": "article of association",
      "B": "memorandum of association",
      "C": "prospectus",
      "D": "qoutation"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48537?exam_type=waec&type=obj&page=336",
    "correct_answer": "C",
    "explanation": "A prospectus is a document published by every firm offering its securities to public for purchase. its an invitation for the purchase of a company's finanacial security.\nit is a disclosure document that describes a financial security for potential buyers. It commonly provides investors with material information about mutual funds, stocks, bonds and other investments, such as a description of the company's business, financial statements, biographies of officers and directors, detailed information about their compensation, any litigation that is taking place, a list of material properties and any other material information.",
    "year": "2018"
  },
  {
    "number": "1677",
    "text": "Activities which fascilitates commerce include",
    "options": {
      "A": "engaging youths in environmental sanitation",
      "B": "funding political campaigns",
      "C": "providing recreational facilities",
      "D": "improving road network"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48540?exam_type=waec&type=obj&page=336",
    "correct_answer": "D",
    "explanation": "In general,good road networkimproves overall accessibility (i.e., they improve businesses ability to provide goods andservices, and people's ability to access these goods, education, employment andservices) and reducetransportationcosts (including travel time, vehicle operating costs, road and parking facility costs.",
    "year": "2018"
  },
  {
    "number": "1678",
    "text": "A person authorized to sell the property of a company in a winding up is",
    "options": {
      "A": "an auctioneer",
      "B": "an agent",
      "C": "a liquidator",
      "D": "a bailee"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48543?exam_type=waec&type=obj&page=336",
    "correct_answer": "C",
    "explanation": "A liquidator is the officer appointed when a company goes into winding-up or liquidation who has responsibility for collecting in all of the assets under such circumstances of the company and settling all claims against the company before putting the company into dissolution",
    "year": "2018"
  },
  {
    "number": "1679",
    "text": "one example of of a product of a construction industry is a",
    "options": {
      "A": "chair",
      "B": "bag of cement",
      "C": "piece of cloth",
      "D": "television"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48545?exam_type=waec&type=obj&page=336",
    "correct_answer": "A",
    "explanation": "Construction is the process of constructing a building or infrastructure.Constructionis a general term meaning the art and science to form objects, systems, or organizations. A chair is shaped, fine- tuned and put together and the process of putting all the required material to form a tangible piece, is construction.",
    "year": "2018"
  },
  {
    "number": "1680",
    "text": "one disadvantage of a sole proprietorship is?",
    "options": {
      "A": "quick decision making",
      "B": "unlimited liability",
      "C": "pride of ownership",
      "D": "unlimited source of capital"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48547?exam_type=waec&type=obj&page=336",
    "correct_answer": "B",
    "explanation": "The maindisadvantagesto being asole proprietorshipare: Unlimited liability: Your small business, in the form of asole proprietorship, is personally liable for all debts and actions of the company. This means that, in the event of winding up, the personal properties of the sole proprietor would be used the settle the debts of the business.",
    "year": "2018"
  },
  {
    "number": "1681",
    "text": "which of the following is a source of short term finance",
    "options": {
      "A": "hire purchase",
      "B": "overdraft",
      "C": "lease",
      "D": "debenture"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48551?exam_type=waec&type=obj&page=337",
    "correct_answer": "B",
    "explanation": "Anoverdraftis an extension of credit from a lending institution when an account reaches zero. Overdrafts come with interest and additional fees and should only be used sparingly. Anoverdraftwill allow you to borrow money through your current account. Usually there’s a charge. You might request one from your bank or your account might automatically offer you anoverdraft\nLoan (such as an overdraft) with or without a fixed maturity date, can be recalled anytime (often on a 24-hour notice) by the lender and must be paid in full on the date of demand. Also, the borrower can pay off a demand loan at any time without incurring early-payment penalties. Also called call loan or money at call.",
    "year": "2018"
  },
  {
    "number": "1682",
    "text": "The portion of share capital which the company has asked shareholder to pay is?",
    "options": {
      "A": "called-up capital",
      "B": "authorized capital",
      "C": "paid-up capital",
      "D": "unpaid capital"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48556?exam_type=waec&type=obj&page=337",
    "correct_answer": "A",
    "explanation": "The authorized capitalof a company is the maximum amount of share capital that the company is authorized by its constitutional documents to issue to shareholders.\nPaid-up capitalis the amount of money a company has received from shareholders in exchange forsharesof stock.Paid-up capitalis created when a company sells itsshareson the primary market directly to investors.\nUnpaid share capitalis where none of the monies due for an allotment ofshareswhich have been issued has been paid. It is quite common in smaller companies for theshare capitalto beunpaidand remain due to the company indefinitely.\n\"called up capital\"The value of the issued shares that have remained fully or partially unpaid, and whose holders have now been called upon to pay all the unpaid balance.",
    "year": "2018"
  },
  {
    "number": "1683",
    "text": "multilateral trade is carried out",
    "options": {
      "A": "between two countries only",
      "B": "within many countries",
      "C": "among many countries",
      "D": "between neighbouring countries only"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48561?exam_type=waec&type=obj&page=337",
    "correct_answer": "C",
    "explanation": "Multilateral trade agreements are commerce treaties between three or more nations. The agreements reduce tariffs and make it easier for businesses to import and export. Since they are among many countries, they are difficult to negotiate. That same broad scope makes them more robust than other types of trade agreements once all parties sign.",
    "year": "2018"
  },
  {
    "number": "1684",
    "text": "An association of businesses engaged in both trade and industry is a?",
    "options": {
      "A": "co-operative society",
      "B": "trade union",
      "C": "trust fund",
      "D": "chamber of commerce"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48562?exam_type=waec&type=obj&page=337",
    "correct_answer": "D",
    "explanation": "Achamber of commerce(or board of trade) is a form of business network, for example, a local organization of businesses whose goal is to further the interests of businesses. Business owners in towns and cities form these local societies to advocate on behalf of the business community.",
    "year": "2018"
  },
  {
    "number": "1685",
    "text": "which of the following statement is true of a debenture?",
    "options": {
      "A": "its holders receive interest",
      "B": "it forms part of a company's authorized capital",
      "C": "its owners are co-owners of the company",
      "D": "its owners control the company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48563?exam_type=waec&type=obj&page=337",
    "correct_answer": "A",
    "explanation": "In corporate finance, a debenture is a medium- to long-term debt instrument used by large companies to borrow money, at a fixed rate of interest. The legal term \"debenture\" originally referred to a document that either creates a debt or acknowledges it.\nA debenture is thus like a certificate of loan or a loan bond evidencing the fact that the company is liable to pay a specifiedamount with interestand although the money raised by the debentures becomes a part of the company's capital structure, it does not become share capital.",
    "year": "2018"
  },
  {
    "number": "1686",
    "text": "The path through which a product moves from the manufacturer to the consumer is a?",
    "options": {
      "A": "channel of communication",
      "B": "line of production",
      "C": "means of transportation",
      "D": "channel of distribution"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48578?exam_type=waec&type=obj&page=338",
    "correct_answer": "D",
    "explanation": "A channel of distribution is the network of individuals and organizations involved in getting a product or service from the producer to the customer. Distribution channels are also known asmarketing channels or marketing distribution channels.",
    "year": "2018"
  },
  {
    "number": "1687",
    "text": "If the opening stock of Ali ltd is N40,000, the cost of goods sold is N48,000 and the closing stock is N24,000, its rate of turnover will be?",
    "options": {
      "A": "1.2 times",
      "B": "1.5 times",
      "C": "2.0 times",
      "D": "7.5 times"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48590?exam_type=waec&type=obj&page=338",
    "correct_answer": "B",
    "explanation": "To calculate the rate of turnover, the following things are Needed;\nopening stockclosing stockcost of goods sold.\nAll this have been given in the question so we go ahead to calculate our rate of turnover.\nfirst step is calculating theaverage stock which is gotten as;opening stock + closing stock / 2\nThus we have;Average stock =40,000 + 24,000= 64,000 / 2= 32,000\nrate of turnover=cost of goods sold / average stock.\n48,000 / 32,000= 1.5 times",
    "year": "2018"
  },
  {
    "number": "1688",
    "text": "A business which requires a certificate of trading in order to commence operation is a?",
    "options": {
      "A": "co-operative society",
      "B": "private company",
      "C": "sole propietorship",
      "D": "public company"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48594?exam_type=waec&type=obj&page=338",
    "correct_answer": "D",
    "explanation": "A certificate of incorporation is a legal document relating to the formation of a company or corporation. It is a license to form a corporation issued by state government or, in some jurisdictions, by non-governmental entity/corporation. Its precise meaning depends upon the legal system in which it is used. also known as the birth certificate of a company. A certificate of incorporation are issued to public limited liabilty companies.",
    "year": "2018"
  },
  {
    "number": "1689",
    "text": "Exchange of goods in international market which does not involve the use of money is a",
    "options": {
      "A": "barter trade",
      "B": "entreport trade",
      "C": "counter trade",
      "D": "bilateral trade"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48596?exam_type=waec&type=obj&page=338",
    "correct_answer": "C",
    "explanation": "Counter trade is a form of international trade in which goods or services are exchanged for other goods or services rather than the use of hard currency.\nCountries that engage in countertrade have limited foreign exchange or credit facilities, and it is most common in developing countries.",
    "year": "2018"
  },
  {
    "number": "1690",
    "text": "which of the following features is not associated with a chamber of commerce? it is",
    "options": {
      "A": "democratically administered",
      "B": "an independent association",
      "C": "open only to entrepreneurs",
      "D": "a voluntary association"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48608?exam_type=waec&type=obj&page=338",
    "correct_answer": "A",
    "explanation": "Achamber of commerce(orboard of trade) is a form of business network, whose goal is to further the interests of businesses. it is formed by Business owners in towns and cities to advocate on behalf of the business community.\nA chamber of commerce is a voluntary association of business firms belonging to different trades and industries. They serve as spokesmen and representatives of business community. They differ from country to country. It is made up of entrepreneurs, who work independently to achieve their goals.",
    "year": "2018"
  },
  {
    "number": "1691",
    "text": "The reason for sending a proforma invoice to a potential customer is that it is?",
    "options": {
      "A": "an indication of the seller's willingness to grant credit",
      "B": "a polite way of telling the customer to return the goods",
      "C": "an invitation to the buyer to buy on hire purchase",
      "D": "a polite way of refusing to sell on credit"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48610?exam_type=waec&type=obj&page=339",
    "correct_answer": "D",
    "explanation": "A proforma invoice is an estimated invoice sent by a seller to a buyer in advance of a shipment or delivery of goods. It notes the kind and quantity of goods, their value, and other important information such as weight and transportation charges.\nApro formainvoice is generally raised when the seller is ready for dispatching the goods but they want to ensure that the payment is being sent before dispatch.",
    "year": "2018"
  },
  {
    "number": "1692",
    "text": "The insurance policy taken to cover dishonesty of account personnel of an organisation is?",
    "options": {
      "A": "employers laibility",
      "B": "fidelity guarantee",
      "C": "life endowment",
      "D": "marine insurance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48611?exam_type=waec&type=obj&page=339",
    "correct_answer": "B",
    "explanation": "Fidelityguaranteeinsurance;Anagreementwhereby,foradesignatedsumofmoney,onepartyagreestoguaranteetheloyaltyandhonestyofanagent,officer,oremployeeofanemployerbypromisingtocompensatetheemployerforlossesincurredasaresultofthedisloyaltyordishonestyofsuchindividuals. Itis most often sought by companies where employees are more likely to cause financial loss because of their constant exposure to cash, stocks or other assets.",
    "year": "2018"
  },
  {
    "number": "1693",
    "text": "which of the following documents is used when goods are being sent by a common carrier",
    "options": {
      "A": "delivery note",
      "B": "consignment note",
      "C": "advice note",
      "D": "credit note"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48613?exam_type=waec&type=obj&page=339",
    "correct_answer": "A",
    "explanation": "Adelivery noteis a document accompanying a shipment of goods that lists the description, grade, and quantity of the goods delivered, but does not include the prices.Delivery noteis a mandatory requirement for any shipping process to be initiated and completed in a systematic manner. It is compulsory that adelivery noteaccompanies a shipment.",
    "year": "2018"
  },
  {
    "number": "1694",
    "text": "A put option in the stock exchange is an option",
    "options": {
      "A": "to sell",
      "B": "not to sell",
      "C": "to buy",
      "D": "not to buy"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48614?exam_type=waec&type=obj&page=339",
    "correct_answer": "A",
    "explanation": "A put or put optionis a stock market device which gives the owner the right, but not the obligation, to sell an asset at a specified price by a predetermined date (the expiry or maturity) to a given party (the seller of the put).",
    "year": "2018"
  },
  {
    "number": "1695",
    "text": "The functions of money do not include",
    "options": {
      "A": "store of value",
      "B": "medium of exchange",
      "C": "double coincidence of wants",
      "D": "means of deferred payment"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48617?exam_type=waec&type=obj&page=339",
    "correct_answer": "C",
    "explanation": "The following are some of the functions of money\nMoney as the Medium of ExchangeMoney as a Store of ValueMoney as a Measure of ValueMoney as the Standard of Deferred Payment\ndouble coincidence of wants is a feature of barter system and a function of money.",
    "year": "2018"
  },
  {
    "number": "1696",
    "text": "A document of title to goods written by the ship owner specifying that certain goods are being conveyed in the ship is the?",
    "options": {
      "A": "bill of sale",
      "B": "bill of sight",
      "C": "bill of entry",
      "D": "bill of lading"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48624?exam_type=waec&type=obj&page=340",
    "correct_answer": "D",
    "explanation": "A bill of lading is a document issued by a carrier to acknowledge receipt of cargo for shipment. Abillofladingis a contract. It covers the specific terms of the transportation agreement between a shipper and a carrier. Abillofladingis also a receipt, because it proves that the carrier accepted the goods and agreed to take them to their agreed-upon destination.",
    "year": "2018"
  },
  {
    "number": "1697",
    "text": "informative advertisig is aimed at?",
    "options": {
      "A": "giving advice on the use of a product",
      "B": "influencing customers to buy a product",
      "C": "giving gifts to attract customers",
      "D": "encouraging specific customers to buy a product"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48630?exam_type=waec&type=obj&page=340",
    "correct_answer": "A",
    "explanation": "Informative advertisingis a sales and marketing approach that focuses on the task of attracting consumers by educating them on the nature and benefits of products, along with identifying the benefits derived from choosing to purchase those products.",
    "year": "2018"
  },
  {
    "number": "1698",
    "text": "A cheap means of carrying bulky goods over long distance is by?",
    "options": {
      "A": "rail",
      "B": "road",
      "C": "air",
      "D": "pipeline"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48634?exam_type=waec&type=obj&page=340",
    "correct_answer": "A",
    "explanation": "Railway transport is cheaper as compared to other means of  transport. As a matter of fact, railway transport is even cheaper than road transport because of the reason that goods in bulk quantities are carried from a desired destination to the other. In cases of road transport for instance, less goods as compared to rail transport can be carried and at a cheaper and inexpensive rate.",
    "year": "2018"
  },
  {
    "number": "1699",
    "text": "A contract terminated by the occurence of an event which makes performance impossible is discharged by?",
    "options": {
      "A": "breach",
      "B": "agreement",
      "C": "frustration",
      "D": "performance"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48637?exam_type=waec&type=obj&page=340",
    "correct_answer": "C",
    "explanation": "frustration of contract; is theLegal termination of a contract due to unforeseen circumstances that (1) prevent achievement of its objectives, (2) render its performance illegal, or(3) make it practically impossible to execute.",
    "year": "2018"
  },
  {
    "number": "1700",
    "text": "An individual  employed to act on behalf of another within a specified guideline is?",
    "options": {
      "A": "a jobber",
      "B": "an agent",
      "C": "a broker",
      "D": "a distributor"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48639?exam_type=waec&type=obj&page=340",
    "correct_answer": "B",
    "explanation": "An agent, in legal terminology, is a person who has been legally empowered to act on behalf of another person or an entity.An agentmay be employed to represent a client in negotiations and other dealings with third parties. A person who acts on behalf of another person or group.",
    "year": "2018"
  },
  {
    "number": "1701",
    "text": "which of the following is not a component of the marketing mix",
    "options": {
      "A": "price",
      "B": "place",
      "C": "population",
      "D": "product"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48640?exam_type=waec&type=obj&page=341",
    "correct_answer": "C",
    "explanation": "The marketing mix (also known as the 4 Ps) is a foundation model in marketing. The marketing mix has been defined as the \"set of marketing tools that the firm uses to pursue its marketing objectives in the target\". Thus the marketing mix refers to four broad levels of marketing decision, namely:product, price, promotion, and place.",
    "year": "2018"
  },
  {
    "number": "1702",
    "text": "A method of buying in anticipation of price fluctuation in the commodity market is?",
    "options": {
      "A": "speculation",
      "B": "arbitrage",
      "C": "contango",
      "D": "hedging"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48642?exam_type=waec&type=obj&page=341",
    "correct_answer": "A",
    "explanation": "Speculation in regards to commodity market, is the purchase of a commodity with the hope and expectation that, they maybe variation or changes in prices of the said product. This normally happens when there is fear that they maybe an upward turn or increase in price in future.",
    "year": "2018"
  },
  {
    "number": "1703",
    "text": "A shipping document detailing the charges for carrying a particular cargo for a specified voyage is?",
    "options": {
      "A": "dock warrant",
      "B": "freight note",
      "C": "bill of lading",
      "D": "mate's receipt"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48646?exam_type=waec&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "freight note is a document detailing A charge paid for carriage or transportation of goods by air, land, or sea.",
    "year": "2018"
  },
  {
    "number": "1704",
    "text": "commercial agents who are authorized to keep goods untill they are sold are?",
    "options": {
      "A": "factors",
      "B": "distributors",
      "C": "brokers",
      "D": "auctioneers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48648?exam_type=waec&type=obj&page=341",
    "correct_answer": "A",
    "explanation": "Afactoris a type of trader who receives and sells goods on commission (called factorage). Afactoris a mercantile fiduciary transacting business in his own name and not disclosing his principal.",
    "year": "2018"
  },
  {
    "number": "1705",
    "text": "An advertisement method whose objective is to convince customers to buy a product  is?",
    "options": {
      "A": "informative advertisement",
      "B": "persuasive advertising",
      "C": "competitive advertising",
      "D": "mass advertisement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48654?exam_type=waec&type=obj&page=341",
    "correct_answer": "B",
    "explanation": "Persuasive Advertisingis a type of product promotion that aims to persuade a consumer for buying a particular product, especially in the presence of several similar products in the same category. In addition to encouraging trial purchase, persuasive advertising can also be used to coax consumers to add and retain a particular brand in their consideration set, thereby increasing the chances of customer loyalty.\nMarketers use this form of advertising to generate demand for a new product or service or increase the demand for a product or service that already exists in the market. Comparative approach, where a brand demonstrates its superiority over some other brands in the same product category, is a commonly used form of persuasive advertising.",
    "year": "2018"
  },
  {
    "number": "1706",
    "text": "A government legislation which ensures that quality goods and services are available  to customers is?",
    "options": {
      "A": "hire purchase act",
      "B": "copyright act",
      "C": "price control act",
      "D": "standard organisation act"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48665?exam_type=waec&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "Standards Organisation of Nigeriais a federal government parastatal, established with the sole aim of maintainingstandardin manufactured products. TheStandards Organization of Nigeriastatutoryfunctioninclude, the development and enforcement of product and processstandards",
    "year": "2018"
  },
  {
    "number": "1707",
    "text": "a bank draft is a cheque drawn by a bank on?",
    "options": {
      "A": "another bank",
      "B": "itself",
      "C": "creditors",
      "D": "customers' deposits"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48668?exam_type=waec&type=obj&page=342",
    "correct_answer": "B",
    "explanation": "A bank draft is a cheque drawn by a bank on its own funds. A banker'sdraft, also known as a banker's cheque, is like asking abankto write a cheque for you. You give them your money andtheygive you a cheque for that amount to give to the person you're paying. For this reason,they donot bounce because of a lack of funds.",
    "year": "2018"
  },
  {
    "number": "1708",
    "text": "which of the following functions is not performed by the export promption council",
    "options": {
      "A": "prevention of importation of harmful goods",
      "B": "provision of credit facilities to exporters",
      "C": "provision of technical advice to exporters",
      "D": "creation of export free zones"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48673?exam_type=waec&type=obj&page=342",
    "correct_answer": "B",
    "explanation": "The following are the functions of the export promotion council\nTo promote the development and diversification of Nigeria’s export trade.To assist in promoting the development of export related industries in Nigeria.To spearhead the creation of appropriate export incentives andTo actively articulate and to promote the implementation of export policies and programmes of the Nigerian Government.To co-ordinate and monitor export promotion activities in Nigeria.To collect and disseminate information on products available for export.To collect and disseminate to local manufacturers and exporters information on foreign markets.To Provide technical assistance to local exporters in such areas as export procedures and documentation, transportation, financing, marketing techniques, quality control, export packaging, costing and pricing, publicity and in other similar areas.To maintain adequate and effective representation in other countries.To provide, directly or jointly, with training institutions, training for its staff and assist with the manpower development of the export community in Nigeria.To organize and plan the participation of Nigeria in trade fairs and exhibitions.To administer grants and other benefits related to export promotion and development.To undertake studies of the current economic conditions, with special attention to the export sector with the aim of advising government on necessary policies and measures.To establish specific trade promotion facilities in Nigeria and in other countries including the establishment of permanent showrooms at important commercial centers in other countries.To engage in export promotion publicityTo pursue the simplification and streamline of export procedures and documentation on continuous basis.To assist in finding appropriate solutions to practical problems encountered by exporters in the process of exportation.To plan and organize outward trade missions and provide support from Nigeria.To perform such other functions as maybe conducive to the achievement of the objective of the Export Decrees.",
    "year": "2018"
  },
  {
    "number": "1709",
    "text": "Activities undertaken to creat awareness of a product by giving out samples or gifts is?",
    "options": {
      "A": "marketing mix",
      "B": "marketing concepts",
      "C": "window display",
      "D": "sales promotion"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48679?exam_type=waec&type=obj&page=342",
    "correct_answer": "D",
    "explanation": "Sales Promotion is one of the elements of the promotional mix. Sales promotion uses both media and non-media marketing communications for a pre-determined, limited time to increase consumer demand, stimulate market demand or improve product availability.",
    "year": "2018"
  },
  {
    "number": "1710",
    "text": "an advantage of privatizing a firm is that it?",
    "options": {
      "A": "becomes more efficient",
      "B": "sells goods at low prices",
      "C": "employs more workers",
      "D": "attracts more customers"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48682?exam_type=waec&type=obj&page=342",
    "correct_answer": "A",
    "explanation": "Theadvantagesof transferring government-owned assets to the private sector are increased efficiency and profits, largely because competition incentivizes innovation and improvement.",
    "year": "2018"
  },
  {
    "number": "1711",
    "text": "a transfer of authority from a superior officer to his subordinate in an organisation is?",
    "options": {
      "A": "controlling",
      "B": "decentralization",
      "C": "delegation",
      "D": "directing"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48685?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "Delegationis the assignment of any responsibility or authority to another person (normally from a manager to a subordinate) to carry out specific activities.",
    "year": "2018"
  },
  {
    "number": "1712",
    "text": "The provision of scholarship by a firm to needy students is part of its?",
    "options": {
      "A": "political responsibility",
      "B": "economic responsibility",
      "C": "social responsibility",
      "D": "legal responsibility"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48689?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "Social responsibilityis an ethical framework and suggests that an entity, be it an organization or individual, has an obligation to act for the benefit of society at large. The actions of a firm must benefit the whole of society. In this way, there must be a balance between economic growth and the welfare of society and the environment.",
    "year": "2018"
  },
  {
    "number": "1713",
    "text": "The provision of scholarship by a firm to needy students is part of its?",
    "options": {
      "A": "political responsibility",
      "B": "economic responsibility",
      "C": "social responsibility",
      "D": "legal reponsibility"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48692?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "Social responsibilityis an ethical framework and suggests that an entity, be it an organization or individual, has an obligation to act for the benefit of society at large. The actions of a firm must benefit the whole of society. In this way, there must be a balance between economic growth and the welfare of society and the environment.",
    "year": "2018"
  },
  {
    "number": "1714",
    "text": "How many countries form ECOWAS",
    "options": {
      "A": "17",
      "B": "16",
      "C": "15",
      "D": "14"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48695?exam_type=waec&type=obj&page=343",
    "correct_answer": "C",
    "explanation": "There are currently15member countries in the Economic Community of West African States. The founding members of ECOWAS were: Benin, Côte d'Ivoire, Gambia, Ghana, Guinea, Guinea-Bissau, Liberia, Mali, Mauritania (left 2002), Niger, Nigeria, Senegal, Sierra Leone, Togo, and Burkina Faso (which joined as Upper Volta).",
    "year": "2018"
  },
  {
    "number": "1715",
    "text": "which of the following is the modern means of communication",
    "options": {
      "A": "grape vine",
      "B": "email",
      "C": "whistles",
      "D": "town crier"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48696?exam_type=waec&type=obj&page=343",
    "correct_answer": "B",
    "explanation": "lectronic mail,email(ore-mail) is defined as the transmission of messages overcommunicationsnetworks. Typically the messages are notes entered from the keyboard orelectronicfiles stored on disk. Most mainframes, minicomputers, and computer networks have anemailsystem.",
    "year": "2018"
  },
  {
    "number": "1716",
    "text": "A company is qouted on the stock exchange when its shares are?",
    "options": {
      "A": "put under private payment",
      "B": "not for sale to the public",
      "C": "listed  for sale on the exchange",
      "D": "owned by the government"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48700?exam_type=waec&type=obj&page=344",
    "correct_answer": "C",
    "explanation": "Alistedsecurity is a financial instrument that is traded through a the stockexchange market.when a  company is quoted, it means it can be traded in the stock exchange for public subscription.",
    "year": "2018"
  },
  {
    "number": "1717",
    "text": "A system of issueing new shares to selected investors instead of the general public is?",
    "options": {
      "A": "public offer",
      "B": "issue by tender",
      "C": "offer for sale",
      "D": "private placement"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48704?exam_type=waec&type=obj&page=344",
    "correct_answer": "D",
    "explanation": "Private placement is a funding round of securities which are sold not through a public offering, but rather through a private offering, mostly to a small number of chosen investors.",
    "year": "2018"
  },
  {
    "number": "1718",
    "text": "one of the aims of the European union is to?",
    "options": {
      "A": "ease trade among member countries",
      "B": "enhance better trade with Africa",
      "C": "enhance free trade with America",
      "D": "offer financial assistance to poor countries"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48707?exam_type=waec&type=obj&page=344",
    "correct_answer": "A",
    "explanation": "Theobjectiveis to ensure Europe's sustainable and steady development. It means balanced economic growth and stable prices. TheEuropean Unionseeks to create a competitive market economy which takes into account people's wellbeing and social needs. An important issue is environmental protection.",
    "year": "2018"
  },
  {
    "number": "1719",
    "text": "the time allowed for loading and unloading a ship at the harbour is?",
    "options": {
      "A": "demurrage",
      "B": "tenure",
      "C": "lay days",
      "D": "dead freight"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48709?exam_type=waec&type=obj&page=344",
    "correct_answer": "C",
    "explanation": "Lay days is the Number of days allowed by a port authority to a ship to load or unload cargo without incurring demurrage or late charges.",
    "year": "2018"
  },
  {
    "number": "1720",
    "text": "The inter bank indebtedness is settled at the",
    "options": {
      "A": "clearing house",
      "B": "money market",
      "C": "discount house",
      "D": "stock exchange"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48711?exam_type=waec&type=obj&page=344",
    "correct_answer": "A",
    "explanation": "A clearing house is an institution where cheques and other commercial papers drawn on member banks are cancelled against each other so that only net balances are payable",
    "year": "2018"
  },
  {
    "number": "1721",
    "text": "The concern of a marketing manager whose company has adopted the marketing mix concept is to?",
    "options": {
      "A": "recruit more",
      "B": "make maximum profit",
      "C": "identify and satisfy customers needs",
      "D": "maintain the company's share of the market"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48713?exam_type=waec&type=obj&page=345",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2018"
  },
  {
    "number": "1722",
    "text": "The purpose of commercialization is to?",
    "options": {
      "A": "encourage the participation of the private sector",
      "B": "make state-owned firms more efficient",
      "C": "encourage the flow of foreign capital",
      "D": "enable state-owned firms pay tax"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/48715?exam_type=waec&type=obj&page=345",
    "correct_answer": "B",
    "explanation": "Aimsandobjectives of commercialization isto achieve value for money in the consumption and delivery of Government services by applying commercial principles.",
    "year": "2018"
  },
  {
    "number": "1870",
    "text": "Which of the following is a legal tender?",
    "options": {
      "A": "Cheque",
      "B": "Travellers cheque",
      "C": "Bank note",
      "D": "Goldsmith receipt"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/49982?exam_type=waec&type=obj&page=374",
    "correct_answer": "C",
    "explanation": "Legal tender are coins or banknotes that must be accepted if offered in payment of a debt.",
    "year": "2018"
  },
  {
    "number": "1871",
    "text": "Labour as an input in production can be motivated by",
    "options": {
      "A": "training",
      "B": "profit",
      "C": "remuneration",
      "D": "promotion"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/49983?exam_type=waec&type=obj&page=375",
    "correct_answer": "C",
    "explanation": "The compensation given to labourers in return for their productive work is calledwages(renumeration or compensation of employees).",
    "year": "2018"
  },
  {
    "number": "1872",
    "text": "The minimum lending rate of a bank is a component of its",
    "options": {
      "A": "current assets",
      "B": "debit balances",
      "C": "credit balance",
      "D": "fixed assets"
    },
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/commerce/49985?exam_type=waec&type=obj&page=375",
    "correct_answer": "A",
    "explanation": "current assets are cash and other assets that are expected to be converted to cash within a year.",
    "year": "2018"
  }
]