[
  {
    "number": "73",
    "text": "Study carefully the experimental set-up labelled A and use it to answer questions (a) - (d)\n(a) State the aim of the experimental set-up.\n(b) Describe briefly the procedure for carrying out the experiment. \n(c) Describe briefly your observation on the experimental set-up.\n(d) Outline how the different soil particle sizes can be estimated.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59958?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "74",
    "text": "(a) ldentify specimens B, C, and D.\nSpecimen B;            Specimen C;              Specimen D;\n          \n(b) Give two observable physical properties of each.\n(C) State two main nutrients supplied by each of specimens B and Ď.\n(d) State two methods of application of specimen C on the field.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59959?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "75",
    "text": "(a) ldentify specimen E.\nSpecimen E;\n\n(b) State four damages caused to crops by the specimen.\n(c) Briefly describe its life cycle\n(d)(i) Name the stage of development at which the specimen is most dangerous to crops.\n(ii) Give one reason for your answer.\ne) List three control measures of the specimen.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59961?exam_type=waec&type=practical&page=15",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  },
  {
    "number": "76",
    "text": "(a) Which of specimens F, G, and H is the most common source of energy in livestock rations?\n(b) Mention one ingredient in specimen I which has a laxative effect on farm animals.\n(c) State three important feed ingredients in specimen I essential for bone and teeth formation in livestock.\n(d) Name four types of specimen l and the class of poultry to which each type is fed.\n(e) Name four farm animals that feed largely on specimen J.\n(f) State four plant protein sources used in livestock feeds.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59962?exam_type=waec&type=practical&page=16",
    "correct_answer": null,
    "explanation": "",
    "year": "2002"
  }
]