[
  {
    "number": "53",
    "text": "Study carefully the experimental set-ups labelled A, B and C. \n(a) What is the aim of the experiment for which the apparatus has been set up?\n(b) List the experimental set-ups in the order in which water has risen through the soil samples, starting with the highest \n(c) List six items of apparatus used in the experimental set-up.\n(d) Describe briefly the procedure used in setting up the experiment.\n(e) Why is there a difference in the water levels of the soil samples in the set ups labelled B and C?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59907?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  },
  {
    "number": "54",
    "text": "Study the diagrams below and use them to answer questions (a) to (c).\n\n\na) ldentify the equipment illustrated by diagrams D, E, F, and G.\n(b) State the farm operation for which the equipment illustrated by diagrams D,E,F and G.\n(c) Enumerate two specific uses of each of the equipment illustrated by diagrams F and G.\n(d) State six general ways of maintaining the equipment illustrated by diagrams F and G.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59908?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  },
  {
    "number": "55",
    "text": "Observe specimens H, l, J, and K carefully.\n(a) State one method of propagation of each of the specimens \n(b) State four advantages of staking the crop which specimen I is obtained.\n(c) Name the toxic substance present in specimen H and give two methods of reducing it\n(d) Describe the processing of specimen H into garri.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59910?exam_type=waec&type=practical&page=11",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  },
  {
    "number": "56",
    "text": "(a) State a breed of specimen L which may be used for only commercial egg production.\n(b) How long does it take an improved specimen L from day old to reach its point of lay\n(c) Name any four features on the head of specimen Lour diseases that attack specimen L.\n(d) Mention three parasites and four diseases that attack specimen L\n(e) Mention two ways of controlling the parasites mentioned in (d) above",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59914?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2007"
  }
]