[
  {
    "number": "1277",
    "text": "Economics is regarded as a science because?",
    "options": {
      "A": "its issues can be easily verified by reference to facts",
      "B": "it adopts scientific methods in making its analysis",
      "C": "its issues are relevant for national development",
      "D": "its subject matter studies human behaviour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49233?exam_type=waec&type=obj&page=256",
    "correct_answer": "B",
    "explanation": "Economics is regarded as a social science because it uses scientific methods to build theories that can help explain the behavior of individuals, groups, and organizations.",
    "year": "2017"
  },
  {
    "number": "1278",
    "text": "the opportunity cost of a worker going to the university  is",
    "options": {
      "A": "tuition, fees and books",
      "B": "boarding and lodging",
      "C": "the wages given up to attend the university",
      "D": "transportation and entertainment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49236?exam_type=waec&type=obj&page=256",
    "correct_answer": "C",
    "explanation": "Opportunity costis the value of the next best thing you give up whenever you make a decision. It is \"the loss of potential gain from other alternatives when onealternativeis chosen\". it is simply the forgone alternative\nIf, forexample, you spend timeandmoney going to a movie, you cannot spend that time at home reading a book,andyou can't spend the money on something else.",
    "year": "2017"
  },
  {
    "number": "1279",
    "text": "which of the following items is not an example of circulating capital",
    "options": {
      "A": "raw material",
      "B": "money",
      "C": "fuel",
      "D": "machinery"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49239?exam_type=waec&type=obj&page=256",
    "correct_answer": "D",
    "explanation": "Circulating capitalcan consist of cash, operating expenses, raw materials, inventory in process, finished goods inventory and accounts receivable.\nCirculating capitalis frequently referred to as workingcapitalor alternatively, revolvingcapital.",
    "year": "2017"
  },
  {
    "number": "1280",
    "text": "in a market economy, the problem of what goods to produced is solved primarily by",
    "options": {
      "A": "directives of the government",
      "B": "the pattern of consumers spending",
      "C": "producers of consumer goods",
      "D": "people producing what they want"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49244?exam_type=waec&type=obj&page=256",
    "correct_answer": "B",
    "explanation": "Consumer preferences and resource scarcity determine which goods are produced and in what quantity; the prices in a market economy act as signals to producers and consumers who use these price signals to help make decisions. Governments play a minor role in the direction of economic activity.",
    "year": "2017"
  },
  {
    "number": "1281",
    "text": "if the weight of five puppies in kilograms are 3.5, 3.0, 4.2, 5.0 and 4.3, then mean weight of the puppies is?",
    "options": {
      "A": "3.5 kg",
      "B": "4.0 kg",
      "C": "4.2 kg",
      "D": "5.0 kg"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49253?exam_type=waec&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "Themeanis theaverageof the numbers. It is easy to calculate: add up all the numbers, then divide by how many numbers there are. In other words it is the sum divided by the count.\nthus we have;\nmean = 3.5 + 3.0 + 4.2 + 5.0 + 4.3 = 20 / 5 = 4",
    "year": "2017"
  },
  {
    "number": "1282",
    "text": "if the coefficient of cross elasticity of demand for goods Y and Z is positive, the two goods are?",
    "options": {
      "A": "complements",
      "B": "substitutes",
      "C": "luxurious",
      "D": "inferior"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49256?exam_type=waec&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "Apositive cross-priceelasticityvalue indicates that the twogoodsare substitutes.\nTwogoodsthat complement each other have a negativecross elasticity of demand: as the price of goodYrises, thedemandfor good X falls.",
    "year": "2017"
  },
  {
    "number": "1283",
    "text": "The difference between demand and wants is in the",
    "options": {
      "A": "desire for the commodity",
      "B": "significance of the commodity",
      "C": "ability to pay for the commodity",
      "D": "economic value of the commodity"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49258?exam_type=waec&type=obj&page=257",
    "correct_answer": "C",
    "explanation": "Want is the desire to have something or to buy a product. Demands on the other hand are requests for specific products that the buyer is willing to and able to pay for.\nSo, the key difference between wants and demand is the ability of the consumer to pay for the product. In other words, if a customer is willing and able to buy a product, that is demand while wishing to buy a product is simply a want.",
    "year": "2017"
  },
  {
    "number": "1284",
    "text": "A demand curve parallel to the Y-axis indicates",
    "options": {
      "A": "fairly elastic demand",
      "B": "perfectly elastic demand",
      "C": "perfectly inelastic",
      "D": "fairly inelastic demand"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49259?exam_type=waec&type=obj&page=257",
    "correct_answer": "C",
    "explanation": "When thedemand curveisparallel to the vertical axis, it means, that the same amount of goods are demanded at any price level. Which further means that there is no effect of change in price on the quantity demanded. Hence, the product is perfectly Inelastic and quantitatively, elasticity ofdemandis 0.",
    "year": "2017"
  },
  {
    "number": "1285",
    "text": "which of the following is an example of derived demand",
    "options": {
      "A": "textbook",
      "B": "labour",
      "C": "staple food",
      "D": "mobile phone"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49264?exam_type=waec&type=obj&page=257",
    "correct_answer": "B",
    "explanation": "Derived demandis aneconomicterm describing thedemandfor a good/service resulting from thedemandfor an intermediate or related good/service. It is a  demandfor some physical or intangible thing where a market exists for both related goods and services in question.\nExamples. Producers have aderived demandfor employees.  For anotherexample,demandfor steel leads toderived demandfor steel workers, as steel workers are necessary for the production of steel. As thedemandfor steel increases, so does its price.",
    "year": "2017"
  },
  {
    "number": "1286",
    "text": "A rightward shift in the supply curve of a commodity is brought about by an increase in?",
    "options": {
      "A": "the level of technology",
      "B": "the price of the commodity",
      "C": "cost of production",
      "D": "taxation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49266?exam_type=waec&type=obj&page=258",
    "correct_answer": "B",
    "explanation": "Ashifttowards the right in thesupply curveindicates that there is an increase in the quantity supplied at the existing price.",
    "year": "2017"
  },
  {
    "number": "1287",
    "text": "Effective supply is the total amount of a commodity",
    "options": {
      "A": "from a single producer",
      "B": "in the warehouse of producers",
      "C": "offered for sale at a market place",
      "D": "produced for the market"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49270?exam_type=waec&type=obj&page=258",
    "correct_answer": "C",
    "explanation": "In economics,effectivedemand (ED) in a market is the demand for a product or service which occurs when purchasers are constrained in a different market. it is the Quantity of a good or service that consumersareactually buying at the current market price.",
    "year": "2017"
  },
  {
    "number": "1288",
    "text": "price elasticity of supply can be influenced by the following factors except?",
    "options": {
      "A": "time period",
      "B": "cost of production",
      "C": "size of consumer income",
      "D": "nature of the product"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49273?exam_type=waec&type=obj&page=258",
    "correct_answer": "D",
    "explanation": "It refers to how the amount supplied of a good or service changes in response to a price orfactorchange.\nFactors that Influence the PES. There are numerous factors that impact the price elasticity of supply including the number of producers, sparecapacity, ease of switching, ease of storage, length of production period, time period of training, factormobility, and how costs react.",
    "year": "2017"
  },
  {
    "number": "1289",
    "text": "increase in the supply of a product can be caused by?",
    "options": {
      "A": "change and taste and fashion of consumers",
      "B": "increase in the income of consumers",
      "C": "a fall in the cost of production",
      "D": "increase in the price of a product"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49282?exam_type=waec&type=obj&page=258",
    "correct_answer": "C",
    "explanation": "Anincrease in supplyis illustrated by a shift of thesupplycurve to the right. Anincrease in supplycan be caused by: anincreasein the number of producers. a decrease in the costs of production (such as higher prices for oil, labor, or other factors of production).",
    "year": "2017"
  },
  {
    "number": "1290",
    "text": "a rational consumer will purchase a product whose price is?",
    "options": {
      "A": "greater than his marginal utility",
      "B": "less than his marginal utility",
      "C": "equal to his marginal utility",
      "D": "equal to his total utility"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49283?exam_type=waec&type=obj&page=258",
    "correct_answer": "C",
    "explanation": "Aconsumerisrationalif he decides for the option that maximizes his/her utility. When studying the bachelor for Economics, in microeconomics class, the teacher would always tell you that it is assumed thatconsumersarerational, meaning that they maximize their profits based on their utility payoffs.",
    "year": "2017"
  },
  {
    "number": "1291",
    "text": "parallel markets are usually the results of",
    "options": {
      "A": "excess supply",
      "B": "the activities of rich individuals",
      "C": "price legislation",
      "D": "inadequate information"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49284?exam_type=waec&type=obj&page=259",
    "correct_answer": "C",
    "explanation": "Aparallel marketarises when the government limits the amount of foreign exchange that can be bought or sold for particular transactions,causingexcess demand or supply to spill over into aparallelmarket, or authorizes that exchange rates for certain transactions be pegged and for other transactions be floating",
    "year": "2017"
  },
  {
    "number": "1292",
    "text": "Another term for equilibrium price is?",
    "options": {
      "A": "price floor",
      "B": "demand price",
      "C": "market clearing price",
      "D": "satisfactory price"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49285?exam_type=waec&type=obj&page=259",
    "correct_answer": "C",
    "explanation": "Market-clearingpriceisanother termused interchangeably withequilibrium price.Equilibrium priceis a common economicstermthat refers to the exactpriceat which market supply equals market demand.",
    "year": "2017"
  },
  {
    "number": "1293",
    "text": "when a firm is enjoying internal economies of scale, its?",
    "options": {
      "A": "total cost of production is increasing",
      "B": "average fixed cost is rising continuously",
      "C": "average cost of production decreases as output increases",
      "D": "average revenue and marginal revenue are decreasing"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49287?exam_type=waec&type=obj&page=259",
    "correct_answer": "C",
    "explanation": "Internal economies of scaleare related to the shift in average production costs for a business as it boosts its overall product output and the average cost per unit falls until maximum efficiency is attained. This means that, the overall production cost decreases, while output increases",
    "year": "2017"
  },
  {
    "number": "1294",
    "text": "The specialization of labour enhances production because people?",
    "options": {
      "A": "can concentrate on all goods",
      "B": "can efficiently produce their own needs",
      "C": "can save time and produce more",
      "D": "become experts in all areas of production"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49292?exam_type=waec&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "Division of labour is the separation of tasks in any system so that people can specialize in their various fields of expertise\nDivision of labour leads to specialization where people can concentrate on task they perform better than others.",
    "year": "2017"
  },
  {
    "number": "1295",
    "text": "which of the following can be added to a firm's profit to obtain total revenue",
    "options": {
      "A": "total variable cost",
      "B": "total fixed cost",
      "C": "marginal cost",
      "D": "total revenue"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49298?exam_type=waec&type=obj&page=259",
    "correct_answer": "D",
    "explanation": "Total Revenue (TR) is calculated by multiplying the quantity of goods sold (Q) by the price of the goods (P).\nFor example, if you sold 120 pens for N2 each: To find your Profit: You will have to subtract the Total Cost (TC) from your Total Revenue(TR).\nRecall that we defined a firm's short-run total costs as\nTotal Cost = TFC + TVC.\nNow we can define economic profit as:\nProfit = Total Revenue - Total Cost",
    "year": "2017"
  },
  {
    "number": "1296",
    "text": "The amount of money that a firm recieves from the sales of its output is called",
    "options": {
      "A": "total profit",
      "B": "total revenue",
      "C": "total cost",
      "D": "average revenue"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49301?exam_type=waec&type=obj&page=260",
    "correct_answer": "B",
    "explanation": "Total revenuein economics refers to thetotalreceipts/ income from sales of a given quantity of goods or services. It is thetotalincome of a business and is calculated by multiplying the quantity of goods sold by the price of the goods.",
    "year": "2017"
  },
  {
    "number": "1297",
    "text": "which of the following is trueof the monopolist",
    "options": {
      "A": "his average revenue curve is horizontal",
      "B": "He determines both price and output",
      "C": "his demand and marginal revenue curve are the same",
      "D": "he determines either price or output"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49306?exam_type=waec&type=obj&page=260",
    "correct_answer": "B",
    "explanation": "Monopoly refers to a market situation where there is only single seller of a commodity and there are no close substitutes of that commodity. the following are features of a monopolist\n1.Single seller:\nThe producer or seller of the commodity is a single person, firm or an individual and that firm has complete control on the output of the commodity.\n2.No Close Substitutes:\nAll the units of a commodity are similar and there are no substitutes to that commodity.\n3.No Entry for New Firms:\nMonopoly situation in a market can continue only when other firms do not enter the industry. If new firms enter the industry, there will not be complete control of a firm on the supply. As such, whenever a firm enters the industry, monopoly situation comes to an end. There/art, monopoly industry is essentially one-firm industry. This signifies that under monopoly there is no differ­ence between a firm and an industry.\n4.Profit in the Long Run:\nA monopolist can earn abnormal profit even in the long run because he has no fear of a competitive seller. In other words, if a monopolist gets abnormal profits in the long run, he cannot be dislodged from this position. However, this is not possible under perfect competition. If abnormal profits are available to a competitive firm, other firms will enter the competition with the result abnormal profits will be eliminated.\n5.Losses in the Short Period:Generally, a common man thinks that a monopoly firm cannot incur loss because it can fix any price it wants. However, this understanding is not correct. A monopoly firm can sustain losses equal to fixed cost in the short period. A monopolist means that there is only a single person or a firm to sell the commodity.\n6.Nature of Demand Curve:\nUnder monopoly the demand for the commodity of the firm is less than being per­fectly elastic and, therefore, it slopes downwards to the right. The main reason of the demand curve sloping downwards to the right is the complete control of the monopolist on the supply of the commodity. Due to control on the supply a monopolist makes changes in the supply which brings about changes in the price and because of this demand changes in the opposite direction.\n7.Price-discrimination:\nFrom the point of view of profit a monopolist can change different prices from different consumers of his commodity. This policy is known as price discrimination. He adopts the policy of price discrimination on various bases such as charging different prices from different consum­ers or fixing different prices at different places etc.\n8.Firm is a Price-Maker:\nA competitive firm is a price-taker whereas a monopoly firm is a price-maker. This is be­cause a competitive firm is small compared to market and therefore, it does not have market power. This is not true in the case of a monopoly firm because it has market power. Hence, it is a price maker\n9.Average and Marginal Revenue Curves:\nUnder monopoly, average revenue is greater than marginal revenue. Under monopoly, if the firm wants to increase the sale it can do so only when it reduces its price. This means AR would decline when sale increases. In that case MR would be less than AR. (ii) AR slopes downwards to the right and is greater than MR.",
    "year": "2017"
  },
  {
    "number": "1298",
    "text": "Equity shares form the bulk of the capital of a?",
    "options": {
      "A": "private firm",
      "B": "public company",
      "C": "statutory company",
      "D": "limited partnership"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49309?exam_type=waec&type=obj&page=260",
    "correct_answer": "B",
    "explanation": "Anequityshare, commonly referred to as ordinary share also represents the form of fractional or part ownership in which a shareholder, as a fractional owner, undertakes the maximum entrepreneurial risk associated with a business venture. The holders of suchsharesare members of the company and have voting rights. This is mainly associated with a public limited liability company",
    "year": "2017"
  },
  {
    "number": "1299",
    "text": "if a state owned firm is sold through the stock market, the organisation becomes?",
    "options": {
      "A": "partnership",
      "B": "private company",
      "C": "public limited company",
      "D": "public corporation"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49314?exam_type=waec&type=obj&page=260",
    "correct_answer": "C",
    "explanation": "Astate-ownedenterprise (SOE) is a business enterprise where the government orstatehas significant controlthroughfull, majority, or significant minority ownership. Defining characteristics of SOEs are their distinct legal form and operation in commercial affairs and activities. When a state owned stocks are traded in the stock exchange, they become a public limited company.",
    "year": "2017"
  },
  {
    "number": "1300",
    "text": "The total number of people of working age who are willing and prepared to work at a given wage rate is the",
    "options": {
      "A": "labour force",
      "B": "supply of labour",
      "C": "demand of labour",
      "D": "occupational demand for labour"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49316?exam_type=waec&type=obj&page=260",
    "correct_answer": "A",
    "explanation": "Thelabor forceis defined simply as the people who are willing and able to work. The size of thelabor forceis used to determine the unemployment rate.The percentage of the unemployed in thelabor forceis called the unemployment rate.\nThelabour forceis the sum of persons in employment plus persons in unemployment. Together these two groups of the population represent the current supply oflabourfor the production of goods and services taking place in acountrythroughmarkettransactions in exchange for remuneration.",
    "year": "2017"
  },
  {
    "number": "1301",
    "text": "A civil engineer who accepts to teach elementary science in a primary school because he cannot get a paid engineering job is an example of?",
    "options": {
      "A": "structural unemployment",
      "B": "disguised unemployment",
      "C": "residual unemployment",
      "D": "frictional unemployment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49317?exam_type=waec&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "Structural unemployment is a form of involuntary unemployment caused by a mismatch between the skills that workers in the economy can offer, and the skills demanded of workers by employers. Structural unemployment is often brought about by technological changes that make the job skills of many workers obsolete.\nit is simplyunemploymentcaused by a mismatch between jobs and skills, or other long-term changes in the economy.",
    "year": "2017"
  },
  {
    "number": "1302",
    "text": "which of the following is an implication  of a large population",
    "options": {
      "A": "decrease in crime rate",
      "B": "increase in food supply",
      "C": "decrease in standard of living",
      "D": "decrease in cost of living"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49319?exam_type=waec&type=obj&page=261",
    "correct_answer": "C",
    "explanation": "A high population means More problems with the distribution of wealth and resources. Problems with food security as pressure on the land due to largerpopulationincreases. Increased pressure on the forest covered area which leads to deforestation. This wll affect the living standard of people with many scampering for the limited available resources",
    "year": "2017"
  },
  {
    "number": "1303",
    "text": "The system of agriculture which involves the cultivation of crops and rearing of animals for family consumption only is termed?",
    "options": {
      "A": "peasant farming",
      "B": "plantation agriculture",
      "C": "commercial farming",
      "D": "subsistent farming"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49322?exam_type=waec&type=obj&page=261",
    "correct_answer": "D",
    "explanation": "Subsistence agriculture occurs when farmers grow food crops to feed themselves and their families. In subsistence agriculture, farm output is targeted to survival and is mostly for local requirements with little or no surplus trade. The typical subsistence farm has a range of crops and animals needed by the family to feed and clothe themselves during the year.",
    "year": "2017"
  },
  {
    "number": "1304",
    "text": "which of the following is a threat to the existence of middlemen",
    "options": {
      "A": "consumers cooperative society",
      "B": "producers cooperative society",
      "C": "sales agents",
      "D": "large scale producers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49325?exam_type=waec&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "consumers cooperative society is an autonomous association of consumers united voluntarily to meet their common needs and aspirations. The cooperativesocietypurchases in bulk directly from the producers which  avails them discounts and in return, sells in small lots to their members, thereby eliminating the middlemen (both the wholesaler and retailer)",
    "year": "2017"
  },
  {
    "number": "1305",
    "text": "which of the following is a threat to the existence of middlemen",
    "options": {
      "A": "consumers cooperative society",
      "B": "producers cooperative society",
      "C": "sales agents",
      "D": "large scale producers"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49327?exam_type=waec&type=obj&page=261",
    "correct_answer": "A",
    "explanation": "consumers cooperative society is an autonomous association of consumers united voluntarily to meet their common needs and aspirations. The cooperativesocietypurchases in bulk directly from the producers which  avails them discounts and in return, sells in small lots to their members, thereby eliminating the middlemen (both the wholesaler and retailer)",
    "year": "2017"
  },
  {
    "number": "1306",
    "text": "in an industrial area, the location of industries is particularly influenced by ?",
    "options": {
      "A": "extent of the division of labour",
      "B": "external economies",
      "C": "internal economies",
      "D": "nearness to financial institution"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49328?exam_type=waec&type=obj&page=262",
    "correct_answer": "B",
    "explanation": "External economies of scale imply that as the size of an industry grows larger or more clustered, the average costs of doing business within the industry fall. This may occur due to increased specialization or training of workers, faster innovation or shared supplier relationships.\nFollowing are the types of external economies of scale\nTransportation and CommunicationSkilled LabourFacility of WorkshopHelping IndustryResearch and ExperimentBanking Facility",
    "year": "2017"
  },
  {
    "number": "1307",
    "text": "which of the following is a transfer income",
    "options": {
      "A": "dividends",
      "B": "rent",
      "C": "pensions",
      "D": "interest"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49329?exam_type=waec&type=obj&page=262",
    "correct_answer": "C",
    "explanation": "Examples of transferpayments include welfare, financial aid, social security, and government making subsidies for certain businesses.",
    "year": "2017"
  },
  {
    "number": "1308",
    "text": "the value added method used in measuring national income is to",
    "options": {
      "A": "measure output at factor cost",
      "B": "avoid multiple counting of output",
      "C": "deduct depreciation of capital assets",
      "D": "add net factor income from abroad"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49332?exam_type=waec&type=obj&page=262",
    "correct_answer": "D",
    "explanation": "Byaddingto its net factorincomefrom abroad, we get NNPFC which is callednational income.",
    "year": "2017"
  },
  {
    "number": "1309",
    "text": "which of the following is most likely to be of benefit to a debtor",
    "options": {
      "A": "inflation",
      "B": "deflation",
      "C": "revaluation",
      "D": "monetization"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49333?exam_type=waec&type=obj&page=262",
    "correct_answer": "A",
    "explanation": "Inflation is the rate at which the general level of prices for goods and services is rising and, consequently, the purchasing power of currency is falling.\nIf wages increase with inflation, and if the borrower already owed money before the inflation occurred, the inflation benefits the borrower. This is because the borrower still owes the same amount of money, but now he or she has more money in his or her paycheck to pay off the debt.",
    "year": "2017"
  },
  {
    "number": "1310",
    "text": "A measure of the value of money in an economy is the",
    "options": {
      "A": "size of workers",
      "B": "general price",
      "C": "total level of savings",
      "D": "total amount of loans granted by the banks"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49339?exam_type=waec&type=obj&page=262",
    "correct_answer": "B",
    "explanation": "Thevalueof any good is determined by its supply and demand and the supply and demand for other goods in the economy. A price for any good is the amount ofmoneyit takes to get that good. the value is inherent in its purchasing power which is price",
    "year": "2017"
  },
  {
    "number": "1311",
    "text": "one of the major functions of money is?",
    "options": {
      "A": "medium of exchange",
      "B": "stable in value",
      "C": "store of value",
      "D": "acceptance by the central bank"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49340?exam_type=waec&type=obj&page=263",
    "correct_answer": "A",
    "explanation": "Money's most important function is as a medium of exchange to facilitate transactions. Without money, all transactions would have to be conducted by barter, which involves direct exchange of one good or service for another.",
    "year": "2017"
  },
  {
    "number": "1312",
    "text": "The function that distinguishes commercial banks from the central bank is that the former",
    "options": {
      "A": "is a lender of last resort",
      "B": "accepts deposits from the public",
      "C": "services the public debt",
      "D": "regulates foreign exchange"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49343?exam_type=waec&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "Commercial banksserve individuals and businesses, whilecentral banksserve the country'sbankingsystem. They provide money transfers back and forthbetween banksand governmental institutions both domestically and in cases of transactions with foreign entities.\nthe major difference here is that, the central bank is the government bank and serves the country in a whole while commercial banks accepts deposit from the public",
    "year": "2017"
  },
  {
    "number": "1313",
    "text": "Direct taxes include?",
    "options": {
      "A": "excise duty",
      "B": "ad valorem tax",
      "C": "specific tax",
      "D": "capital gain tax"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49344?exam_type=waec&type=obj&page=263",
    "correct_answer": "D",
    "explanation": "A direct tax is a tax, such as income tax, which is levied on the income or profits of the person who pays it, rather than on goods or services. Some of thedifferent direct taxesare incometax, corporatetax, wealthtax, and capital gainstax.",
    "year": "2017"
  },
  {
    "number": "1314",
    "text": "The control of aggregate demand through changes in government spending and tax rates is referred to as?",
    "options": {
      "A": "monetary policy",
      "B": "government policy",
      "C": "income policy",
      "D": "fiscal policy"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49347?exam_type=waec&type=obj&page=263",
    "correct_answer": "D",
    "explanation": "In economics and political science,fiscalpolicyis the use of government revenue collection (mainly taxes) and expenditure (spending) to influence the economy.",
    "year": "2017"
  },
  {
    "number": "1315",
    "text": "which of the following is not a feature of economic underdevelopment",
    "options": {
      "A": "monocultural economy",
      "B": "high productivity",
      "C": "low life expectancy",
      "D": "income inequality"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49350?exam_type=waec&type=obj&page=263",
    "correct_answer": "B",
    "explanation": "The termunderdevelopmentrefers to that state of aneconomywhere levels of living of masses are extremely low due to very low levels of per capita income resulting from low levels of productivity and high growth rates of population.\nthere is a set of common characteristics of underdeveloped economies such as low per capita income, low levels of living, high rate ofpopulationgrowth, illiteracy, technical backwardness,capitaldeficiency, dependence on backward agriculture, high level of unemployment, unfavourable institutions and so on.",
    "year": "2017"
  },
  {
    "number": "1316",
    "text": "one way of speeding up the economic development of a country is by encouraging",
    "options": {
      "A": "the consumption of consumer goods",
      "B": "early marriage",
      "C": "the importation of more consumer goods",
      "D": "savings and investment"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49351?exam_type=waec&type=obj&page=264",
    "correct_answer": "D",
    "explanation": "Typically a highersavingsrate, the fraction of GDP not consumed today, results in higherinvestmentrates.Thus, the more a society invests (andsaves) results in more production opportunities in the future, implying a higher rate ofgrowth.\nSavingcan therefore be vital to increase the amount of fixed capital available, which contributes toeconomic growth. However, increasedsavingdoes not always correspond to increasedinvestment. In the short term, ifsavingfalls belowinvestment, it can lead to agrowthof aggregate demand and aneconomicboom.",
    "year": "2017"
  },
  {
    "number": "1317",
    "text": "Dumping in international occurs when a foreign firm sells",
    "options": {
      "A": "above its cost of production at home and abroad",
      "B": "below its cost of production at home and abroad",
      "C": "more goods to a country than the country has need of",
      "D": "below its cost of production in a foreign market"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49353?exam_type=waec&type=obj&page=264",
    "correct_answer": "D",
    "explanation": "Dumpingis a term used in the context ofinternationaltrade. It's when a country or company exports a product at a price that is lower in the foreign importing market than the price in the exporter's domestic market. it means exported goods are sold cheaper in the foreign market than the the exporter's domestic. that means the goods are sold below its cost of production",
    "year": "2017"
  },
  {
    "number": "1318",
    "text": "Infant industries can be described as?",
    "options": {
      "A": "newly established industries",
      "B": "industries enjoying tax holidays",
      "C": "industries producing baby products",
      "D": "newly commercialized industries"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49354?exam_type=waec&type=obj&page=264",
    "correct_answer": "A",
    "explanation": "In economics, an infant industry is a new industry, which in its early stages experiences relative difficulty or is absolutely incapable in competing with established competitors abroad.",
    "year": "2017"
  },
  {
    "number": "1319",
    "text": "Modern international trade is based on the principle of?",
    "options": {
      "A": "absolute cost advantage",
      "B": "comparative advantage",
      "C": "terms of trade",
      "D": "balance of trade"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49356?exam_type=waec&type=obj&page=264",
    "correct_answer": "B",
    "explanation": "Comparative advantageis an economic term that refers to an economy's ability to produce goods and services at a lower opportunity cost than that of trade partners. Acomparative advantagegives a company the ability to sell goods and services at a lower price than its competitors and realize stronger sales margins.",
    "year": "2017"
  },
  {
    "number": "1320",
    "text": "which of the following terms of trade is recorded in a country's current account section of the balance of payments",
    "options": {
      "A": "investment income",
      "B": "foreign direct investment",
      "C": "longterm capital flows",
      "D": "long-term loans"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49358?exam_type=waec&type=obj&page=264",
    "correct_answer": "A",
    "explanation": "Thecurrent accounton thebalance of paymentsmeasures the inflow and outflow of goods, services, investment incomes and transferpayments.",
    "year": "2017"
  },
  {
    "number": "1321",
    "text": "one problem facing the economic integration of countries in west Africa is the",
    "options": {
      "A": "presence of large and developed market",
      "B": "uneven development among west African countries",
      "C": "existence of different central banks in the countries",
      "D": "fairly of labour to move freely in the country"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49362?exam_type=waec&type=obj&page=265",
    "correct_answer": "B",
    "explanation": "click here",
    "year": "2017"
  },
  {
    "number": "1322",
    "text": "one objective of organisation of patroleum exporting countries (OPEC) is to?",
    "options": {
      "A": "harmonize and stabilize oil prizes",
      "B": "ensure excess supply of oil to consuming countries",
      "C": "subsidize oil prices in member countries",
      "D": "assist member countries to exploit oil resources"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49366?exam_type=waec&type=obj&page=265",
    "correct_answer": "A",
    "explanation": "OPEC's objective is to co-ordinateand unify petroleum policies among Member Countries, in order tosecure fairand stable prices for petroleum producers; anefficient,economicand regular supply of petroleum to consuming nations; and afairreturn on capital to those investing in the industry.",
    "year": "2017"
  },
  {
    "number": "1323",
    "text": "Which of the following resources is renewable",
    "options": {
      "A": "coal",
      "B": "iron ore",
      "C": "rice",
      "D": "limestone"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49367?exam_type=waec&type=obj&page=265",
    "correct_answer": "C",
    "explanation": "A renewable resource is a natural resource that will renew to replace the portion that is worn off due to usage and consumption, either through natural reproduction or other recurring processes in a determinate amount of time.\nRenewable resources are a part of Earth's natural environment and the largest components of its ecosphere. Rice is a renewable resource as a source of food.",
    "year": "2017"
  },
  {
    "number": "1324",
    "text": "the negative effects of mining in wast A frica does not include?",
    "options": {
      "A": "Reafforestation in rural communities",
      "B": "land degradation",
      "C": "destruction of farm lands",
      "D": "pollution of water bodies"
    },
    "answer_url": "https://myschool.ng/classroom/economics/49370?exam_type=waec&type=obj&page=265",
    "correct_answer": "A",
    "explanation": "Mining has the potential to have severely adverse effects on the environment including loss of biodiversity, erosion, contamination of surfacewater, groundwater, and soil. The formation of sinkholes is also possible.",
    "year": "2017"
  }
]