[
  {
    "number": "7",
    "text": "You are provided with a pendulum bob, a metre rule, a stopwatch, a retort stand with clamp, and other necessary apparatus.\ni. Suspend the pendulum bob from the clamp as illustrated in the diagram.\nii. Adjust the pendulum such that AC=L= 90 cm\niii. Displace the pendulum bob slightly such that it oscillates in a vertical plane.\niv. Measure and record the time t for 20 complete oscillations.\nv. Evaluate T and \\(\\sqrt L\\)\nvi.Repeat the procedure for four others values of L= 80 cm,70 cm, 60 cm, and 50cm.\nvii. Tabulate your readings\n\nviii. Plot a graph with T on the vertical axis and \\(\\sqrt L\\) on the horizontal axis.\nix. Determine the slope, s, of the graph.\nx. Evaluate g= \\(\\frac{4\\pi^{2}}{5^{2}}\\) \nxi. State two precautions taken to ensure accurate results.\n(b) i. Determine from your graph, the period of the pendulum for L= 75 cm.\nii. A simple pendulum bob is set into simple harmonic motion. Sketch a diagram of the setup and indicate on it; the positions of:\n(a) maximum velocity.\n(b) maximum acceleration of the bob",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59880?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  },
  {
    "number": "8",
    "text": "You are provided with a metre rule, lens, screen, ray box, and other necessary apparatus.\ni. Set up the experiment as shown in the diagram above. Measure and record the diameter a\\(_{0}\\), of the illuminated object.\nii. Place the object at a distance x= 25cm from the lens. Adjust the screen until a sharp image is obtained on the screen.\niii. Measure and record the diameter, a, of the image.\niv. Measure and record the distance v between the lens and the screen.\nv. Evaluate y = P = \\(\\frac{1+y^{2}}{y}\\) and T= x+v.\nvi. Repeat the procedure for x = 30cm, 35cm, 40cm and 45cm. In each case, determine the corresponding values of a,v,y, P and T.\nvii. Tabulate your results.\nviii. Plot a graph of P on the vertical axis against T on the horizontal axis starting both axes from the origin (0,0).\nix. Determine the slope, s, of the graph.\nx. Determine the intercept, c, on the horizontal axis.\nxi Evaluate K = \\(\\frac{c}{2}\\)\nxii. State two precautions taken to ensure accurate results.\n(b)i.  Explain the statement, the focal length of a converging lens is 20cm.\nii. An object is placed at a distance x from a converging lens of focal length 20cm. If the magnification of the real image is 5, calculate the value of x.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59884?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  },
  {
    "number": "9",
    "text": "You are provided with an ammeter, a resistor, key, metre bridge, and other necessary apparatus.\ni. Connect a circuit as shown in the diagram above.\nii. Close the key and use the jockey to make contact with AB at N such that AN = d = 25cm\niii. Read and record the ammeter reading.\niv. Evaluate 1\\(^{-1}\\).\nv. Repeat the procedures for values of d = 35cmm, 50cm, 65cm and 80cm. In each case, record I and determine 1\\(^{-1}\\)\nvi. Tabulate your results.\nvii. Plot a graph with log on the vertical axis and d on the horizontal axis.\nviii. Determine the slope, s of the graph.\nix. State two precautions taken to obtain accurate results.\n(b)i. Use your graph to determine the value of d = l = 1.5A.\nii. State two factors that affect the resistance of a wire.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/59891?exam_type=waec&type=practical&page=2",
    "correct_answer": null,
    "explanation": "",
    "year": "2018"
  }
]