[
  {
    "number": "8",
    "text": "OVERCOMING THE CHALLENGES AT THEOLAS INTERNATIONAL COMPANY\n\nPrior to Mr.Okonkwo's employment as the Human Resource Manager of Theolas International Company, the organization was faced with the problem of absenteeism by its workers. They came late to work and left before the closing time. As a result of this, the volume of production of the company reduced. This inturn, reduced the income of the organization so much that payments of workers' wages and salaries became difficult. Many experienced workers began to leave the firm for greener pastures.\n\nThe firm also found it difficult to meet its financial obligations to suppliers. On assumption of duty, Mr. Okonkwo quickly swung into action. He carried out an investigation to ascertain the causes of these problems. One of his findings was that workers bitterly complained about their conditions of service. Although their wages and salaries were acceptable, they asked for other benefits from the company which were denied them\n\nMr. Okonkwo also discovered that workers were employed without following due process. Finally, he found out that no measure was put in place to regulate the punctuality of workers. Armed with these finding, Mr Okonkwo addressed each of the issues and put in place adequate measures to ensure proper supervision and satisfaction of workers.\n\n(a). Suggest one measure that Mr. Okonkwo could use to improve staff regularity at work\n(b).  Apart from irregularity at work, state two other problems in Theolas International Company\n(c). List six welfare packages that would improve workers satisfaction at Theolas International Company\n(d). State four pre-employment activities the company should have carried out in recruiting its staff",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66315?exam_type=waec&type=theory&page=2",
    "correct_answer": "(a). Mr Okonkwo should put up a measure that would regulate the punctuality of workers after the company fulfills its own obligation.\n(b). - The volume of production of the company reduced which led to the reduction of the organisation's income which as well made it difficult to pay worker's salaries and wages.- The firm also found it difficult to meet its financial obligations to suppliers.\n(c).\n- Reward the workers- Recognize the workers- Training and investment- Compensation- Drive communication and transparency- Promote good health- Allow employees to shape their own roles- Correct planning of employee's schedules\n(d). - identify the hring need- Devise a recruitment plan- Write a job description- Adertise the position- Recruit the position- Review applications- Screening- Interviews",
    "explanation": "(a). Mr Okonkwo should put up a measure that would regulate the punctuality of workers after the company fulfills its own obligation.\n(b). - The volume of production of the company reduced which led to the reduction of the organisation's income which as well made it difficult to pay worker's salaries and wages.- The firm also found it difficult to meet its financial obligations to suppliers.\n(c).\n- Reward the workers- Recognize the workers- Training and investment- Compensation- Drive communication and transparency- Promote good health- Allow employees to shape their own roles- Correct planning of employee's schedules\n(d). - identify the hring need- Devise a recruitment plan- Write a job description- Adertise the position- Recruit the position- Review applications- Screening- Interviews",
    "year": "2021"
  },
  {
    "number": "9",
    "text": "(a). Outline three principles of a good organization\n(b). State three advantages derived from office correspondence\n(c). Explan the following methods of payment\ni. Money order\nii. Postal order\niii. Cheque\niv. Standing order",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66324?exam_type=waec&type=theory&page=2",
    "correct_answer": "(a).\n- The principle of authority: Responsibility for results should correspond with manager's authority and influence.- The principle of span of control: Span of control refers to span of supervision or management or authority and responsibility. It stands for the number of subordinates seeking the direction, guidance and supervision from their immediate superior.- The principle of balance: Balance in organisation structure does not stand for equal emphasis on size and number of people working; it does not mean equality per se. There should be balance from the point view of overall effectiveness.\n(b).\n- The basic purpose of any business letter is to convey information regarding business activities. Information can be transmitted through business letter to customers, suppliers, debtors, government authorities, financial institutions, bank and insurance companies and to any other parties related with the business.- Memo: It can help maintain the good relationship among boss and subordinates, because the bossing attitude is absent here- The main objective of memo is to inform the decisions and actions. For this purpose, it shouls be wriiten by higher authority.\n(c)i. An order for the payment of a specified amount of money, usually issued and payable at a bank or post office.. It remain a trusted financial instrument.\nii. A postal order or postal note is a type of money order usually intended for sending money through the mail. It is purchased at a post office and is payable at another post office to the named recipient.\niii. A cheque is a written order to a bank to pay a stated sum from the drawer's account, written on a specially printed form. It is also a document that orders a bank to pay a specific amount of money from a person's account to the person in whose name the cheque has been issued.\niv. A standing order is an instruction a bank account holder gives to their bank to pay a set amount at regular intervals to another's accoun. The instruction is sometimes known as a banker's order.",
    "explanation": "(a).\n- The principle of authority: Responsibility for results should correspond with manager's authority and influence.- The principle of span of control: Span of control refers to span of supervision or management or authority and responsibility. It stands for the number of subordinates seeking the direction, guidance and supervision from their immediate superior.- The principle of balance: Balance in organisation structure does not stand for equal emphasis on size and number of people working; it does not mean equality per se. There should be balance from the point view of overall effectiveness.\n(b).\n- The basic purpose of any business letter is to convey information regarding business activities. Information can be transmitted through business letter to customers, suppliers, debtors, government authorities, financial institutions, bank and insurance companies and to any other parties related with the business.- Memo: It can help maintain the good relationship among boss and subordinates, because the bossing attitude is absent here- The main objective of memo is to inform the decisions and actions. For this purpose, it shouls be wriiten by higher authority.\n(c)i. An order for the payment of a specified amount of money, usually issued and payable at a bank or post office.. It remain a trusted financial instrument.\nii. A postal order or postal note is a type of money order usually intended for sending money through the mail. It is purchased at a post office and is payable at another post office to the named recipient.\niii. A cheque is a written order to a bank to pay a stated sum from the drawer's account, written on a specially printed form. It is also a document that orders a bank to pay a specific amount of money from a person's account to the person in whose name the cheque has been issued.\niv. A standing order is an instruction a bank account holder gives to their bank to pay a set amount at regular intervals to another's accoun. The instruction is sometimes known as a banker's order.",
    "year": "2021"
  },
  {
    "number": "10",
    "text": "(a). What is debit note?\n(b). Use the information to answer questions below\nLily & Co Ltd supplied some goods to Timex Enterprise after the order had been paid for. The buyer discovered after receiving the goods that quantities of some goods did not tally with the amount paid. He also found out that they were not accompained by any document.\n\ni. which document should have accompanied the goods?\nii. Outline four items the document named in (b)(i) would contain\n \n(c). Use the information to answer questions beow\nLily & Co Ltd supplied some goods to Timex Enterprise after the order had been paid for. The buyer discovered after receiving the goods that quantities of some goods did not tally with the amount paid. He also found out that they were not accompained by any document.\ni. Identify the document Timex Enterprise would receive from Lily & Co Ltd that the goods supplied were not complete\nii. Outline four items the document identified in 3(b)(i) would contain",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66344?exam_type=waec&type=theory&page=2",
    "correct_answer": "(a). A debit note is a document used by a vendor to inform the buyer of current debt obligations, or a document created by a buyer when returning goods received on credit. The debit note can provide information regarding an upcoming invoice or serve as a reminder for funds currenlty due.\n(b). i. Delivery note\nii. - Data identifying the seller and buyer- Reference to the invoice- Number and description of the products- Date of issue of the document and date of delivery of the goods- Name, signature and stamp of the purchaser, accepting delivery of the goods in good condition\n(c)i. Purchase order\nii. - Delivery date: It shows when the goods will be delivered i.e the time and date when the goods will be delivered.- Delivery location: It shows how where the goods will be delivered by the seller.- Products or services being purchased: It shows the quantity of goods purcahsed by the buyer- Price per unit: It shows the price of quantity of each goods purchased by the buyer.",
    "explanation": "(a). A debit note is a document used by a vendor to inform the buyer of current debt obligations, or a document created by a buyer when returning goods received on credit. The debit note can provide information regarding an upcoming invoice or serve as a reminder for funds currenlty due.\n(b). i. Delivery note\nii. - Data identifying the seller and buyer- Reference to the invoice- Number and description of the products- Date of issue of the document and date of delivery of the goods- Name, signature and stamp of the purchaser, accepting delivery of the goods in good condition\n(c)i. Purchase order\nii. - Delivery date: It shows when the goods will be delivered i.e the time and date when the goods will be delivered.- Delivery location: It shows how where the goods will be delivered by the seller.- Products or services being purchased: It shows the quantity of goods purcahsed by the buyer- Price per unit: It shows the price of quantity of each goods purchased by the buyer.",
    "year": "2021"
  },
  {
    "number": "11",
    "text": "(a). List eight features of minutes of meeting of an organization\n(b). State six benefit of using Global System for Mobile Communications( GSM)",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66356?exam_type=waec&type=theory&page=3",
    "correct_answer": "(a). - Record attendance- Decisions, actions and owners- Report and relevant files- Use a structured format- Distributes the minutes- Name of minute taker- Names of persons- Name of the group holding the meeting- Kind of meeting\n(b). - More suitable network with robust features- No roaming charges on international calls- Worldwide connectivity and extensive coverage- SAIC and DAIC techniques use in GSM provide very high transmission quality- GSM signals don't have any deterioration- Easy to integrate GSM with other wireless technology such as CDMA and LTE- It has the ability to use repeaters",
    "explanation": "(a). - Record attendance- Decisions, actions and owners- Report and relevant files- Use a structured format- Distributes the minutes- Name of minute taker- Names of persons- Name of the group holding the meeting- Kind of meeting\n(b). - More suitable network with robust features- No roaming charges on international calls- Worldwide connectivity and extensive coverage- SAIC and DAIC techniques use in GSM provide very high transmission quality- GSM signals don't have any deterioration- Easy to integrate GSM with other wireless technology such as CDMA and LTE- It has the ability to use repeaters",
    "year": "2021"
  },
  {
    "number": "12",
    "text": "(a). Explain the following terms relating to payment of worker:\ni. Salary\nii. Wages\niii. Time rate\niv. Piece rate\nv. Commission\n(b). State five importance of ofiice procedure",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66360?exam_type=waec&type=theory&page=3",
    "correct_answer": "(a)i. A salary is the money paid each month by their employer, especially when they are in a profession such as teaching, law or medicine.\nii. Wages are form of monetary compensation for employees. They are paid according to the amount of time worked by the employee.\niii. Time rates are use when employees are paid for the amount of time they spend at work\niv. Piece rate gives a payment for each item produced. It is therefore the easiest way for a business to ensure that employees are paid for the amount of work done.\nv. Commission is a service charge assessed by a broker or investment advisor for providing advice or handling purchases or sales of security for a client.\n(b). - An office procedure reduces then general cost of operation- It allows for effective training of new staff- It enhances performance of old staff- A good office procedure facilitataes better flow of work in the office and between department",
    "explanation": "(a)i. A salary is the money paid each month by their employer, especially when they are in a profession such as teaching, law or medicine.\nii. Wages are form of monetary compensation for employees. They are paid according to the amount of time worked by the employee.\niii. Time rates are use when employees are paid for the amount of time they spend at work\niv. Piece rate gives a payment for each item produced. It is therefore the easiest way for a business to ensure that employees are paid for the amount of work done.\nv. Commission is a service charge assessed by a broker or investment advisor for providing advice or handling purchases or sales of security for a client.\n(b). - An office procedure reduces then general cost of operation- It allows for effective training of new staff- It enhances performance of old staff- A good office procedure facilitataes better flow of work in the office and between department",
    "year": "2021"
  },
  {
    "number": "13",
    "text": "(a). As a receptionist of a Manufacturing company, outline any five actions you would take to handle a telephone call from a customer\n(b). The clerk at Toppy Tee has been directed to file a new customer's letter. Meanwhile, there is no file in the cabinet that is relevant to the subject matter of the letter.\n  Outline five actions the office clerk would take in filling the letter.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66363?exam_type=waec&type=theory&page=3",
    "correct_answer": "(a). - Be polite: Have a standard greeting and use it each time you pick up the phone.- Stay organized: Take detailed notes. Pay attention to what time calls came in and write down caller ID. Have the company directory at your fingertips for last transfer.- Listen carefully; Practice active lsitening. Focus on what the caller is saying and quickly determine where to transfer them to best serve their needs.- Communicate effectively: Don't mumble, speak too quickly, or sound forlorn. Do not enunciate properly, speak at a conformtable pace,and assist callers with energy and enthusiasm.- Verify: Take a moment to repeat the caller's number back to him and make sure it's correct. If you are unsure how to spell a caller's name, ask her. confirm the most important details of the call before passing the message along to its intended recipient- Ask the caller's permission: Before placing someone on hold, ask the caller if it's ok.- Say thank you: If the caller says they will hold, say than you.\n(b) - Receiving the document; If it is a letter or document that came through the mail, record it in the mail received register and write the date received or date stamp it.- Action: Forward the letter to the person that has to deal with it.- Follow up: Check that the letter has been dealt with- Collecting the lettter; All letters and two copies of the replies must be collected in a filing tray- Filing: Choose a regular time to file",
    "explanation": "(a). - Be polite: Have a standard greeting and use it each time you pick up the phone.- Stay organized: Take detailed notes. Pay attention to what time calls came in and write down caller ID. Have the company directory at your fingertips for last transfer.- Listen carefully; Practice active lsitening. Focus on what the caller is saying and quickly determine where to transfer them to best serve their needs.- Communicate effectively: Don't mumble, speak too quickly, or sound forlorn. Do not enunciate properly, speak at a conformtable pace,and assist callers with energy and enthusiasm.- Verify: Take a moment to repeat the caller's number back to him and make sure it's correct. If you are unsure how to spell a caller's name, ask her. confirm the most important details of the call before passing the message along to its intended recipient- Ask the caller's permission: Before placing someone on hold, ask the caller if it's ok.- Say thank you: If the caller says they will hold, say than you.\n(b) - Receiving the document; If it is a letter or document that came through the mail, record it in the mail received register and write the date received or date stamp it.- Action: Forward the letter to the person that has to deal with it.- Follow up: Check that the letter has been dealt with- Collecting the lettter; All letters and two copies of the replies must be collected in a filing tray- Filing: Choose a regular time to file",
    "year": "2021"
  },
  {
    "number": "14",
    "text": "(a). Explain the term filling?\n(b). List any three parts of an investigative report\n(c). List and explain five qualities of a formal report.",
    "options": {},
    "diagram_url": null,
    "answer_url": "https://myschool.ng/classroom/office-practice/66365?exam_type=waec&type=theory&page=3",
    "correct_answer": "(a). Filing means keeping documents in a safe place and being able to find them easily and quickly. The purpose of filing is to locate filed documents easily. They are readily available when needed.\n(b). - Information to identify the case- Referral source- Allegation details\n(c).\n- Suitable title- Simple- Promptness- Comparability- Consistency- Suitable title: A suitable title has to be provided to each report according to the nature of the number content- Simple: A report should be reachable by an ordinary layman and in known language- Promptness: A report should be prepared and submitted with short span of time or time stipulated by the request letter- Comparability: Sometimes a report is prepared with some comparative informatiom- Consistency: A report should be prepared for many years from the same type of information and statistical data.",
    "explanation": "(a). Filing means keeping documents in a safe place and being able to find them easily and quickly. The purpose of filing is to locate filed documents easily. They are readily available when needed.\n(b). - Information to identify the case- Referral source- Allegation details\n(c).\n- Suitable title- Simple- Promptness- Comparability- Consistency- Suitable title: A suitable title has to be provided to each report according to the nature of the number content- Simple: A report should be reachable by an ordinary layman and in known language- Promptness: A report should be prepared and submitted with short span of time or time stipulated by the request letter- Comparability: Sometimes a report is prepared with some comparative informatiom- Consistency: A report should be prepared for many years from the same type of information and statistical data.",
    "year": "2021"
  }
]