[
  {
    "number": "91",
    "text": "Study  specimen A, B and C and answer questiions 1(a) to 1(c). (a)(i) Name the part of the body where specimens A, B and C would be found in a mammal. A: _________ B: _________ C: __________\n(ii) State one function each of specimens A, B and C. A: ________ B: _________ C: _________\n(b)(i) Make a drawing , 6cm to 8cm long of the anterior view of specimen C and label fully. (ii) State one function each of four of the parts labelled in 1(b)(i).\n(c)(i) Mention the total number of each of specimens A, B and C in adult humans . A: _________ B: _________ C: _________ (ii) Name two other vertebrae in humans.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/62466?exam_type=waec&type=practical&page=19",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  },
  {
    "number": "92",
    "text": "Beakers D, E, F and G contain seeds that have been sown for seven days. Carefully remove one seed/seedling from each of the beakers labelled D, E, F and place each on the corresponding white tile labelled D, E, F and G. Study them and answer questions 2(a) to 2(c). (a) Observe the soils and seed/seedling then record the observation and result on the table below.\n\n(b)(i) Name one condition for germination that was likely absent in the beakers labelled E, F and G\nE: _________ F: _________ G: _________\n(ii) Give two reasons for the result in beaker D.\n(c) Make a drawing 8cm to 10cm long of one sees/seedling obtained from the beaker labelled D and label fully.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/62468?exam_type=waec&type=practical&page=19",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  },
  {
    "number": "93",
    "text": "Study specimens L and M and answer questions 4(a) to 4(e). (a) Classify each of specimens L and M into its: (i) Phylum L: ________ M: _______(ii) Class L:_______ M:_______ (b)(i) State three observable features of members of the class of specimen L. (ii) Name three other classes of the phylum to which specimen L belongs. (c)(i) State two ways each by which specimens L and M are of economic importance. L: _______ M: ________ (ii) State five ways by which specimen L can be controlled. (d)(i) State five observable differences between specimens L and M.\n\n(ii) State four observable similarities between specimens L and M. (e) Name one habitat each of specimens L and M. L:_______ M:_______",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/biology/62524?exam_type=waec&type=practical&page=19",
    "correct_answer": null,
    "explanation": "",
    "year": "2021"
  }
]