[
  {
    "number": "1950",
    "text": "The type of nutrition in which organisms take solid organic materials into their body is",
    "options": {
      "A": "parasitic",
      "B": "holozoic",
      "C": "saprophytic",
      "D": "symbiotic"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68607?exam_type=waec&type=obj&page=390",
    "correct_answer": "B",
    "explanation": "Holozoic nutrition is a type of nutrition in which organisms consume solid organic materials. This is the type of nutrition seen in most animals, where food is ingested and then broken down through digestion. This is different from symbiotic (where two organisms live together and benefit from each other), saprophytic (where organisms feed on dead and decaying matter), and parasitic (where one organism benefits at the expense of another) nutrition.",
    "year": "2023"
  },
  {
    "number": "1951",
    "text": "The ability of organisms to maintain a constant internal environment is known as",
    "options": {
      "A": "diuresis",
      "B": "plasmolysis",
      "C": "endosmosis",
      "D": "homeostasis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68610?exam_type=waec&type=obj&page=391",
    "correct_answer": "D",
    "explanation": "The ability of organisms to maintain a constant internal environment is known as \"homeostasis.\" Homeostasis is a fundamental biological concept that refers to the ability of living organisms to maintain a stable and relatively constant internal environment despite changes in the external environment.",
    "year": "2023"
  },
  {
    "number": "1952",
    "text": "Organisms that feed on dead, decaying tissues of other organisms are known as",
    "options": {
      "A": "saprophytes",
      "B": "autotrophs",
      "C": "parasites",
      "D": "heterotrophs"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68612?exam_type=waec&type=obj&page=391",
    "correct_answer": "A",
    "explanation": "Organisms that feed on dead, decaying tissues of other organisms are known as \"saprophytes.\" Saprophytes, also known as saprotrophs or decomposers, are organisms that obtain their nutrition by feeding on dead, decaying organic matter (detritus) from other organisms.",
    "year": "2023"
  },
  {
    "number": "1953",
    "text": "Which of the following activities is against the conservation of natural resources?",
    "options": {
      "A": "Contour ploughing",
      "B": "establishment of game reserves",
      "C": "deforestation",
      "D": "afforestation"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68615?exam_type=waec&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "Deforestation: Deforestation is the opposite of afforestation. It involves the clearing or removal of forests or trees from an area. Deforestation leads to the loss of valuable natural resources like timber, biodiversity, soil fertility, and water regulation. It disrupts ecosystems, accelerates soil erosion, and releases stored carbon dioxide, contributing to climate change. Deforestation is detrimental to the conservation of natural resources and has serious environmental consequences.",
    "year": "2023"
  },
  {
    "number": "1954",
    "text": "The food substance that would produce the highest amount of energy is",
    "options": {
      "A": "protein",
      "B": "amino acid",
      "C": "fat",
      "D": "glucose"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68617?exam_type=waec&type=obj&page=391",
    "correct_answer": "C",
    "explanation": "The food substance that would produce the highest amount of energy is fat.Fat is the most energy-dense macronutrient, providing 9 calories per gram. On the other hand, both carbohydrates (including glucose) and proteins provide 4 calories per gram. While amino acids are the building blocks of proteins, they are not a direct source of energy like fat and carbohydrates.",
    "year": "2023"
  },
  {
    "number": "1955",
    "text": "The diagrams above are illustrations of forms in which a particular group of organisms exist. Study them and answer the question.\n\nWhich group of organisms is illustrated?",
    "options": {
      "A": "protozoa",
      "B": "viruses",
      "C": "fungi",
      "D": "bacteria"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68620?exam_type=waec&type=obj&page=391",
    "correct_answer": "D",
    "explanation": "click here",
    "year": "2023"
  },
  {
    "number": "1956",
    "text": "The diagrams above are illustrations of forms in which a particular group of organisms exist. Study them and answer the question.\nin which of the illustrated forms does the organism that causes cholera exist?",
    "options": {
      "A": "III",
      "B": "II",
      "C": "IV",
      "D": "V"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68625?exam_type=waec&type=obj&page=392",
    "correct_answer": "D",
    "explanation": "V.Vibrio: These are comma-shaped bacteria. They are curved rods and are often found in aquatic environments. Vibrio cholerae is an example, responsible for causing cholera.",
    "year": "2023"
  },
  {
    "number": "1957",
    "text": "Growth in animals differs from that in plants because growth in",
    "options": {
      "A": "plants is indefinite",
      "B": "plants is intercalary",
      "C": "animals is apical",
      "D": "plants is from within"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68629?exam_type=waec&type=obj&page=392",
    "correct_answer": "A",
    "explanation": "Growth in plants is indefinite: Unlike animals, which typically have a determinate growth, many plants exhibit indeterminate growth, especially in their early stages of life. Indeterminate growth means that plants can continue to grow throughout their lives, adding new tissues and expanding in size as long as favorable conditions are present.",
    "year": "2023"
  },
  {
    "number": "1958",
    "text": "The structure that its action could result in choking when talking and eating at the same time is",
    "options": {
      "A": "oesophagus",
      "B": "epiglottis",
      "C": "oesophagus",
      "D": "liver"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68631?exam_type=waec&type=obj&page=392",
    "correct_answer": "B",
    "explanation": "The structure that could result in choking when talking and eating at the same time is the epiglottis.The epiglottis is a flap-like structure located at the base of the tongue, near the entrance of the windpipe (trachea). Its primary function is to prevent food and liquids from entering the trachea and lungs during swallowing. When you swallow, the epiglottis covers the opening of the trachea, directing food and liquids into the esophagus, which leads to the stomach. This prevents choking and aspiration of food into the respiratory system.",
    "year": "2023"
  },
  {
    "number": "1959",
    "text": "The diagram above is an illustration of a mango leaf drawn by a student in a Biology test. The student failed the test. Study it and answer the question.\n\nThe likely reason why the student failed the test was that the",
    "options": {
      "A": "labels were wrong and the guidelines were not touching the structures",
      "B": "net venation shown were few, rough, not properly drawn and wrongly placed",
      "C": "leaf venation should have been parallel and the midrib should be thicker",
      "D": "leaf was too tapered at the apex, the leaf stalk was too short and the shape of leaf was wrong."
    },
    "answer_url": "https://myschool.ng/classroom/biology/68634?exam_type=waec&type=obj&page=392",
    "correct_answer": "A",
    "explanation": "The likely reason why the student failed the test was that the labels were wrong and the guidelines were not touching the structures",
    "year": "2023"
  },
  {
    "number": "1960",
    "text": "The diagram below is an illustration of a mango leaf drawn by a student in a Biology test. The student failed the test. Study it and answer the question.\nwhich features of the diagram would have earned the student more marks if shown",
    "options": {
      "A": "colour and size",
      "B": "spelling of label and length of midrib",
      "C": "habitat and agricultural qualities of leaf",
      "D": "title and margin"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68637?exam_type=waec&type=obj&page=392",
    "correct_answer": "D",
    "explanation": "The title and magnification",
    "year": "2023"
  },
  {
    "number": "1961",
    "text": "A group of organisms belonging to different species that coexist in the same habitat and interact is referred to as",
    "options": {
      "A": "community",
      "B": "biosphere",
      "C": "niche",
      "D": "population"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68641?exam_type=waec&type=obj&page=393",
    "correct_answer": "A",
    "explanation": "A community in ecology refers to a group of different species that inhabit the same geographic area and interact with one another. These species share a common habitat and are interconnected through various ecological relationships. In a community, the interactions between different species can be complex and can include competition, predation, mutualism, commensalism, and parasitism.",
    "year": "2023"
  },
  {
    "number": "1962",
    "text": "The mouthparts of a grasshopper are adapted for",
    "options": {
      "A": "sucking",
      "B": "chewing",
      "C": "grinding",
      "D": "absorption"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68643?exam_type=waec&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "Grasshoppers are herbivorous insects that primarily feed on plant material. Their mouthparts are well adapted for chewing, allowing them to consume various parts of plants, such as leaves, stems, and flowers.The mouthparts of a grasshopper consist of several structures that work together during feeding:Mandibles, Maxillae and Labium and Labrum",
    "year": "2023"
  },
  {
    "number": "1963",
    "text": "What is the probability that a pregnancy would result in a male child?",
    "options": {
      "A": "\\(\\frac{3}{4}\\)",
      "B": "\\(\\frac{1}{2}\\)",
      "C": "1",
      "D": "\\(\\frac{1}{4}\\)"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68645?exam_type=waec&type=obj&page=393",
    "correct_answer": "B",
    "explanation": "In humans, the sex of a child is determined by the combination of sex chromosomes received from the parents. The mother contributes an X chromosome, and the father contributes either an X chromosome (resulting in a female child) or a Y chromosome (resulting in a male child).Since the father can contribute either an X or a Y chromosome, there are two possible outcomes for the sex of the child: male (XY) or female (XX). The chance of having a male child (XY) is equal to the chance of having a female child (XX).Therefore, the probability of having a male child is 1 out of 2, which is represented as 1/2.",
    "year": "2023"
  },
  {
    "number": "1964",
    "text": "A vestigial structure in humans is",
    "options": {
      "A": "earlobe",
      "B": "gallbladder",
      "C": "tailbone",
      "D": "villus"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68648?exam_type=waec&type=obj&page=393",
    "correct_answer": "C",
    "explanation": "A vestigial structure in humans is the tailbone, also known as the coccyx.Vestigial structures are anatomical features that have lost their original function over the course of evolution. These structures were once functional and served a purpose in the ancestors of the species but have become reduced or non-functional in the present-day descendants. The tailbone, or coccyx, is a small triangular bone located at the base of the vertebral column in humans. It is a vestige of the tail that was present in the early ancestors of mammals, which had tails for various functions, such as balance, communication, or grasping.",
    "year": "2023"
  },
  {
    "number": "1965",
    "text": "Which of the following instruments is not used in measuring abiotic factors in a habitat?",
    "options": {
      "A": "microscope",
      "B": "Wind vane",
      "C": "thermometer",
      "D": "hygrometer"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68650?exam_type=waec&type=obj&page=393",
    "correct_answer": "A",
    "explanation": "Abiotic factors refer to the non-living components of an ecosystem or habitat that can influence the living organisms within it. Microscope: A microscope is not used to measure abiotic factors. Instead, it is an instrument used to observe and magnify tiny living or non-living things, such as cells, microorganisms, or small structures.",
    "year": "2023"
  },
  {
    "number": "1966",
    "text": "Which of the following factors is the main problem facing xerophytes?",
    "options": {
      "A": "Conservation of excess water",
      "B": "competition for sunlight",
      "C": "lack of adequate water",
      "D": "formation of poor roots"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68652?exam_type=waec&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "Xerophytes are plants that have adapted to survive and thrive in arid or dry environments, where water availability is limited. They have evolved various adaptations to cope with the scarcity of water. However, the primary challenge for xerophytes remains the lack of adequate water.",
    "year": "2023"
  },
  {
    "number": "1967",
    "text": "A Rhesus negative woman may experience stillbirth of the second child that is Rhesus positive because",
    "options": {
      "A": "the foetus is deprived of nourishment",
      "B": "they have poor circulatory system",
      "C": "the blood of the foetus might clump",
      "D": "the woman is susceptible to diseases during pregnancy"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68653?exam_type=waec&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "The stillbirth of a second child that is Rh-positive in an Rh-negative woman can occur due to the clumping of fetal blood caused by the production of Rh antibodies in the mother's immune system during a previous pregnancy with an Rh-positive baby. This condition, known as hemolytic disease of the newborn, can be prevented with appropriate medical interventions like Rh immunoglobulin injections.",
    "year": "2023"
  },
  {
    "number": "1968",
    "text": "Which of the following hormones is wrongly paired with its secretory organ?",
    "options": {
      "A": "oestrogen and ovary",
      "B": "Oxytocin and hypothalamus",
      "C": "adrenalin and kidney",
      "D": "insulin and pancreas"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68658?exam_type=waec&type=obj&page=394",
    "correct_answer": "C",
    "explanation": "Adrenalin, also known as epinephrine, is not secreted by the kidney. It is secreted by the adrenal glands, specifically the adrenal medulla. The adrenal glands are small, triangular glands located on top of both kidneys. Therefore, the option 'Adrenalin and kidney' is incorrect",
    "year": "2023"
  },
  {
    "number": "1969",
    "text": "The rate of decomposition of dead organisms is faster in the tropical rainforest than in other biomes because",
    "options": {
      "A": "of consistent cool temperature",
      "B": "of availability of moisture",
      "C": "of the relatively constant day light.",
      "D": "there are more plants"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68660?exam_type=waec&type=obj&page=394",
    "correct_answer": "B",
    "explanation": "Decomposition is the process by which dead organic matter, such as dead plants and animals, is broken down and recycled back into the ecosystem as nutrients. The rate of decomposition is influenced by various factors, and in the tropical rainforest biome, the availability of moisture is a critical factor that accelerates decomposition.",
    "year": "2023"
  },
  {
    "number": "1970",
    "text": "Which of the following organisms would be the producer in a food chain?",
    "options": {
      "A": "Goat",
      "B": "maize",
      "C": "man",
      "D": "bacterium"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68662?exam_type=waec&type=obj&page=394",
    "correct_answer": "B",
    "explanation": "The producer in a food chain is the organism that produces its food directly from non-living sources (abiotic factors) through processes like photosynthesis or chemosynthesis. Among the options provided, the producer is \"Maize.\" As a plant, maize is the producer in a food chain, serving as the primary source of energy for other organisms.",
    "year": "2023"
  },
  {
    "number": "1971",
    "text": "The diagrams below are illustrations of organisms in a habitat. Study them and answer the question,\nThe feeding relationship between the organisms labelled III and IV in the diagrams is",
    "options": {
      "A": "predation",
      "B": "mutualism",
      "C": "parasitism",
      "D": "saprophytism"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68666?exam_type=waec&type=obj&page=395",
    "correct_answer": "A",
    "explanation": "Predation in biology refers to the act of one organism (the predator) capturing, killing, and consuming another organism (the prey) for nourishment.",
    "year": "2023"
  },
  {
    "number": "1972",
    "text": "The diagrams below are illustrations of organisms in a habitat. Study them and answer the question, the producer in the diagram is",
    "options": {
      "A": "IV because it is the largest organism in the diagram",
      "B": "IV because it is the organism that receives the highest amount of sunlight",
      "C": "I because it uses sunlight to manufacture food",
      "D": "I because it contains the least amount of energy"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68669?exam_type=waec&type=obj&page=395",
    "correct_answer": "C",
    "explanation": "The producer in the diagrams is I because it uses sunlight to manufacture food.",
    "year": "2023"
  },
  {
    "number": "1973",
    "text": "Which of the following soil types have a high capillarity?",
    "options": {
      "A": "Sand and clay",
      "B": "loam and sand",
      "C": "silt and sand",
      "D": "silt and clay"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68672?exam_type=waec&type=obj&page=395",
    "correct_answer": "D",
    "explanation": "Both silt and clay particles have very small pores, which contribute to higher capillarity. When combined, the silt and clay would likely result in a soil with relatively high capillarity.",
    "year": "2023"
  },
  {
    "number": "1974",
    "text": "The diagram above is an illustration of a structure in the skeletal system of humans. Study it and answer the question\nthe illustrated structure is a part of the",
    "options": {
      "A": "appendicular skeleton",
      "B": "axial skeleton",
      "C": "axis vertebrae",
      "D": "cervical vertebrae"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68676?exam_type=waec&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "The skull is part of the axial skeleton. It is the bony structure that forms the head and encloses and protects the brain. The skull is located along the central axis of the body, and it is one of the key components of the axial skeleton.",
    "year": "2023"
  },
  {
    "number": "1975",
    "text": "The diagram below is an illustration of a structure in the skeletal system of humans. Study it and answer the question\nAn individual was involved in a car accident and the illustrated structure was badly injured. Which of the following structures would most likely be affected?",
    "options": {
      "A": "Clavicle, tongue and pelvis",
      "B": "Eye, cerebellum and ear",
      "C": "Ear, brain and hinge joint",
      "D": "Lumbar, eye and teeth"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68678?exam_type=waec&type=obj&page=395",
    "correct_answer": "B",
    "explanation": "An individual was involved in a car accident and the illustrated structure was badly injured. Which of the following structures would most likely be affected?",
    "year": "2023"
  },
  {
    "number": "1976",
    "text": "Study the list of organisms below and use them to answer the questions.\nI-Hydra\nII-Owl\nIII-Snake\nIV-Snail\nThe arrangement of the organisms in order of increasing complexity is",
    "options": {
      "A": "II-III-I-IV",
      "B": "I-IV-III - II",
      "C": "I-II-III-IV",
      "D": "IV-III-II - I."
    },
    "answer_url": "https://myschool.ng/classroom/biology/68680?exam_type=waec&type=obj&page=396",
    "correct_answer": "B",
    "explanation": "The arrangement of organisms in order of increasing complexity is Hydra (a simple multicellular organism), Snail (a more complex invertebrate), Snake (a simple vertebrate), and Owl (a more complex vertebrate). This is because as we move from invertebrates to vertebrates, the level of organization and complexity increases. The complexity of an organism can be determined by its level of organization, from cellular to tissue to organ to system level.",
    "year": "2023"
  },
  {
    "number": "1977",
    "text": "Study the list of organisms below and use them to answer the questions.\nI-Hydra\nII-Owl\nIII-Snake\nIV-Snail\nThe Phylum of the organism labeled IV is",
    "options": {
      "A": "Platyhelminthes",
      "B": "mollusca",
      "C": "Arthropoda",
      "D": "Coelenterata"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68681?exam_type=waec&type=obj&page=396",
    "correct_answer": "B",
    "explanation": "The organism labelled IV is a Snail. Snails belong to the Phylum Mollusca. This phylum is characterized by soft-bodied animals that usually have an external shell, like snails, clams, and squids.",
    "year": "2023"
  },
  {
    "number": "1978",
    "text": "Placentation in fruits is referred to as the",
    "options": {
      "A": "arrangement of ovules in the ovary of a flower",
      "B": "part of the ovary where the ovules originate and remain till maturity",
      "C": "ovules borne on a central column of tissues in an ovary",
      "D": "formation of a single carpel joined at the two edges of an ovule"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68682?exam_type=waec&type=obj&page=396",
    "correct_answer": "A",
    "explanation": "Placentation in fruits refers to the arrangement of ovules within the ovary of a flower, and it is directly related to seed development and fruit formation.",
    "year": "2023"
  },
  {
    "number": "1979",
    "text": "Which of the following characteristics shows discontinuous variation in plants?",
    "options": {
      "A": "Colour of flower",
      "B": "Leaf size",
      "C": "Height of plant",
      "D": "fruit size"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68683?exam_type=waec&type=obj&page=396",
    "correct_answer": "A",
    "explanation": "Colour of flower: The colour of flowers in plants typically shows discontinuous variation. Flowers can have specific colors like red, blue, yellow, or white, and individuals within a population will usually exhibit one of these distinct flower colors. There are no intermediate or blending colors between the different categories.",
    "year": "2023"
  },
  {
    "number": "1980",
    "text": "An example of a process that involves osmosis is the",
    "options": {
      "A": "movement of water from root hairs into cortical cell",
      "B": "reabsorption of food nutrients from the kidney into blood capillaries",
      "C": "translocation of starch from leaves to all parts of a plant",
      "D": "movement of digested food from ileum into blood capillaries"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68689?exam_type=waec&type=obj&page=396",
    "correct_answer": "A",
    "explanation": "Movement of water from root hairs into cortical cells involves osmosis. When a plant's roots absorb water from the soil, it passes through the root hairs and moves into the cortical cells (which are part of the root's inner layer) through osmosis. This osmotic movement of water helps maintain water balance and nutrient distribution within the plant.",
    "year": "2023"
  },
  {
    "number": "1981",
    "text": "Stunted growth and small yellow leaves in plants are symptoms of the deficiencies of",
    "options": {
      "A": "nitrogen",
      "B": "iron",
      "C": "sulphur",
      "D": "magnesium"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68691?exam_type=waec&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "Iron deficiency in plants leads to chlorosis, which is the yellowing of leaves. Chlorosis occurs because iron is necessary for the formation of chlorophyll, which is the green pigment in plants that absorbs light energy for use in photosynthesis. Without sufficient iron, the plant cannot produce enough chlorophyll, leading to yellow leaves. Stunted growth is also a symptom of iron deficiency as iron is essential for various metabolic processes including DNA synthesis.",
    "year": "2023"
  },
  {
    "number": "1982",
    "text": "The eye defect caused by an uneven curvature of the cornea or lens or both is",
    "options": {
      "A": "myopia",
      "B": "presbyopia",
      "C": "astigmatism",
      "D": "hypermetropia"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68692?exam_type=waec&type=obj&page=397",
    "correct_answer": "C",
    "explanation": "Astigmatism is a common refractive error of the eye that occurs when the cornea or lens has an irregular shape. In a normal eye, the cornea and lens have a smooth, evenly curved surface, similar to a sphere. However, in astigmatism, the cornea or lens may be more curved in one direction than the other, resulting in a refractive error.",
    "year": "2023"
  },
  {
    "number": "1983",
    "text": "Which of the following processes does not occur during photosynthesis?",
    "options": {
      "A": "Energy from sunlight is absorbed",
      "B": "Carbon (IV) oxide is evolved",
      "C": "oxygen is evolved",
      "D": "water is split"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68694?exam_type=waec&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "During photosynthesis, carbon dioxide is taken in by the plant, and water is split to produce glucose and oxygen in the presence of sunlight and chlorophyll.",
    "year": "2023"
  },
  {
    "number": "1984",
    "text": "The illustration above is a genetic diagram. Study it and answer the question below.\n          What is the name of the genetic diagram?",
    "options": {
      "A": "Genetic square",
      "B": "Inheritance diagram",
      "C": "Punnett square",
      "D": "Genetic cross"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68698?exam_type=waec&type=obj&page=397",
    "correct_answer": "C",
    "explanation": "A Punnett square is a graphical representation used in genetics to predict the possible genotypes of offspring in a cross between two individuals. It is named after Reginald Punnett, a British geneticist who developed the method. In a Punnett square, the genotypes of the parents are represented on the top and left sides of the square. The possible combinations of alleles from each parent are then filled in the cells of the square to show the potential genotypes of their offspring.",
    "year": "2023"
  },
  {
    "number": "1985",
    "text": "The illustration above is a genetic diagram. Study it and answer the question below\nWhat do the labels I, II, III, and IV respectively represent?",
    "options": {
      "A": "Ee, Ee, EE and E",
      "B": "EE, EE, Ee, and Ee",
      "C": "EE, EE, EE and EE",
      "D": "EE, EE, Ee and ee"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68700?exam_type=waec&type=obj&page=397",
    "correct_answer": "B",
    "explanation": "The labels I, II, III and IV represent the genotypes of the offspring from a cross between two heterozygous parents (Ee). I and II represent the homozygous dominant (EE) and heterozygous (Ee) offspring, respectively, while III and IV represent the heterozygous (Ee) and homozygous recessive (ee) offspring, respectively.",
    "year": "2023"
  },
  {
    "number": "1986",
    "text": "The illustration above is a genetic diagram. Study it and answer the question\nWhat is the genotypic ratio",
    "options": {
      "A": "1:1",
      "B": "4:0",
      "C": "1:3",
      "D": "1:2:1"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68702?exam_type=waec&type=obj&page=398",
    "correct_answer": "A",
    "explanation": "The genotypic ratio is the ratio of the number of individuals with different genotypes. From the diagram, if you do the crossing I = EE, II = EE, III =  Ee, IV = Ee i.e  2 EE and 2 Ee\n⇒ Genotypic ratio will be 2 : 2  which is equivalent to 1:1.",
    "year": "2023"
  },
  {
    "number": "1987",
    "text": "The diagram above is an illustration of a cell in which photosynthesis takes place. Study it and answer the question\nIn which of the labeled parts would molecules of water and carbon (IV) oxide combine to form sugar?",
    "options": {
      "A": "I",
      "B": "III",
      "C": "II",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68705?exam_type=waec&type=obj&page=398",
    "correct_answer": "D",
    "explanation": "The labelled part where water molecule will combine with carbon(IV) oxide to produce sugar is the part where the green pigment(chlorophyll) is found, and that is the Chloroplast. Hence, the correct answer is option D",
    "year": "2023"
  },
  {
    "number": "1988",
    "text": "The diagram above is an illustration of a cell in which photosynthesis takes place. Study it and answer the question. the oxygen gas formed in the cell diffuses out of the cytoplasm into the air spaces through the part labeled",
    "options": {
      "A": "I",
      "B": "II",
      "C": "III",
      "D": "IV"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68708?exam_type=waec&type=obj&page=398",
    "correct_answer": "C",
    "explanation": "click here",
    "year": "2023"
  },
  {
    "number": "1989",
    "text": "Fishes survive in water mainly because they possess",
    "options": {
      "A": "streamlined body",
      "B": "scales",
      "C": "paired fins",
      "D": "gills"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68711?exam_type=waec&type=obj&page=398",
    "correct_answer": "D",
    "explanation": "Gills are specialized respiratory organs found in fish that allow them to extract oxygen from water. While a streamlined body, scales, and paired fins are all essential adaptations for fish to navigate and survive in water, none of them directly relate to the process of oxygen extraction and respiration like gills do. However, without gills, fish would not be able to respire efficiently underwater and would not survive in their aquatic habitats.",
    "year": "2023"
  },
  {
    "number": "1990",
    "text": "The tricuspid valve is located between the",
    "options": {
      "A": "right auricle and right ventricle.",
      "B": "aorta and the left ventricle",
      "C": "left auricle and left ventricle",
      "D": "right auricle and the superior vena cava"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68713?exam_type=waec&type=obj&page=398",
    "correct_answer": "A",
    "explanation": "The heart has four chambers: two atria (auricles) and two ventricles. The tricuspid valve is one of the heart's valves and is located between the right atrium (right auricle) and the right ventricle.",
    "year": "2023"
  },
  {
    "number": "1991",
    "text": "The androecium in a flowering plant is a collection of",
    "options": {
      "A": "stamens",
      "B": "sperms",
      "C": "ovules",
      "D": "filament"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68715?exam_type=waec&type=obj&page=399",
    "correct_answer": "A",
    "explanation": "The androecium is the male reproductive part of a flowering plant, and it is composed of stamens. Each stamen consists of two main parts:FilamentAnther",
    "year": "2023"
  },
  {
    "number": "1992",
    "text": "The diagram above is an illustration of some structures used for gaseous exchange in humans. Study it and answer the question\nThe parts labeled 1, II, III, and IV respectively are",
    "options": {
      "A": "larynx, bronchus, bronchiole and trachea.",
      "B": "bronchus, bronchiole, trachea and larynx.",
      "C": "bronchiole, trachea, bronchus and larynx.",
      "D": "larynx, trachea, bronchiole, and bronchus."
    },
    "answer_url": "https://myschool.ng/classroom/biology/68718?exam_type=waec&type=obj&page=399",
    "correct_answer": "D",
    "explanation": "The parts labelled 1, II, III and IV respectively are larynx, trachea, bronchiole and bronchusThe larynx, commonly known as the voice box, is a cartilaginous structure located in the neck, just below the pharynx and above the trachea.The trachea, also known as the windpipe, is a long tube made of C-shaped rings of cartilage that extend from the larynx to the bronchi.Bronchioles are small, narrow tubes that branch out from the bronchi. They represent the smaller airways within the lungs.The bronchi are the two main branches that arise from the lower end of the trachea, one leading to each lung.",
    "year": "2023"
  },
  {
    "number": "1993",
    "text": "The diagram above is an illustration of some structures used for gaseous exchange in humans. Study it and answer the question\nthe part labeled III can be found in the",
    "options": {
      "A": "lung",
      "B": "heart",
      "C": "kidney",
      "D": "sternum"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68721?exam_type=waec&type=obj&page=399",
    "correct_answer": "A",
    "explanation": "Bronchioles are small, narrow tubes that are part of the respiratory system and are found within the lungs. After the air passes through the trachea and bronchi, it enters the bronchioles, which represent the smaller airways within the lungs.",
    "year": "2023"
  },
  {
    "number": "1994",
    "text": "Use the information below to answer the question\nI - making shoes from crocodile skin\nII - making tables with plastic\nIII - using elephant tusk for decoration\nIV - using firewood for cooking\n\nThe act that should be encouraged for the conservation of wildlife and forests is",
    "options": {
      "A": "III",
      "B": "IV",
      "C": "II",
      "D": "I"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68723?exam_type=waec&type=obj&page=399",
    "correct_answer": "C",
    "explanation": "II - making tables with plastic: Encouraging the use of plastic for making tables is beneficial for wildlife and forests. By using plastic instead of wood for furniture, we reduce the demand for wood, which can help curb deforestation and preserve forest ecosystems. Reducing deforestation is vital for the conservation of wildlife, as forests provide critical habitat for numerous species.",
    "year": "2023"
  },
  {
    "number": "1995",
    "text": "Use the information below to answer the question\nI - making shoes from crocodile skin\nII - making tables with plastic\nIII - using elephant tusk for decoration\nIV - using firewood for cooking\nIn order to avoid some of the acts that would have negative effects on conservation. Government should",
    "options": {
      "A": "encourage over-utilization of forest resources",
      "B": "enact and enforce laws towards conservation of resources",
      "C": "encourage indiscriminate killing of wildlife",
      "D": "promote felling of trees without planting new ones"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68724?exam_type=waec&type=obj&page=399",
    "correct_answer": "B",
    "explanation": "In order to avoid some of the acts that would have negative effects on conservation. Government should enact and enforce laws towards conservation of resources",
    "year": "2023"
  },
  {
    "number": "1996",
    "text": "The following activities are associated with termites except",
    "options": {
      "A": "nuptial flight",
      "B": "searching for food",
      "C": "communication",
      "D": "pollination"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68725?exam_type=waec&type=obj&page=400",
    "correct_answer": "D",
    "explanation": "Pollination is not an activity associated with termites. Pollination is primarily carried out by various animals, such as bees, butterflies, birds, and bats, which transfer pollen from one flower to another, leading to fertilization and seed production. While some insects, like bees, are important pollinators, termites are not known for their role in pollination.",
    "year": "2023"
  },
  {
    "number": "1997",
    "text": "The capturing and digestion of insects by a pitcher plant is a special form of nutrition that is",
    "options": {
      "A": "heterotrophic",
      "B": "saprophytic",
      "C": "chemosynthetic",
      "D": "autotrophic"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68726?exam_type=waec&type=obj&page=400",
    "correct_answer": "A",
    "explanation": "Heterotrophic nutrition is a type of nutrition in which an organism obtains its food by consuming organic matter from other organisms. In the case of pitcher plants, they capture and digest insects as a source of nutrients to supplement their diet, especially in nutrient-poor environments. This carnivorous adaptation is a specialized form of heterotrophic nutrition, as the pitcher plant relies on consuming other living organisms (insects) to meet its nutritional needs. The pitcher plant is a carnivorous plant that has modified leaves forming pitcher-like structures.",
    "year": "2023"
  },
  {
    "number": "1998",
    "text": "Paternity disputes could be resolved accurately through",
    "options": {
      "A": "finger printing",
      "B": "tongue rolling",
      "C": "DNA test",
      "D": "blood group"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68727?exam_type=waec&type=obj&page=400",
    "correct_answer": "C",
    "explanation": "Paternity testing, also known as DNA testing for paternity, is a reliable and accurate method used to determine the biological father of a child. It is based on the analysis of DNA (deoxyribonucleic acid), which is the genetic material found in cells. Every individual inherits their DNA from their biological parents, half from the mother and half from the father.",
    "year": "2023"
  },
  {
    "number": "1999",
    "text": "A sudden change in the genetic composition of an organism is termed",
    "options": {
      "A": "mutation",
      "B": "linkage",
      "C": "variation",
      "D": "epistasis"
    },
    "answer_url": "https://myschool.ng/classroom/biology/68728?exam_type=waec&type=obj&page=400",
    "correct_answer": "A",
    "explanation": "Mutation is the process by which there is a permanent alteration in the DNA sequence of an organism's genome. These changes can occur due to various factors such as exposure to radiation, chemicals, or errors during DNA replication. Mutations can happen in somatic cells, which affect only the individual, or in germ cells (egg or sperm cells), which can be passed on to offspring.",
    "year": "2023"
  }
]