[
  {
    "number": "130",
    "text": "(a) Explain how Eli failed as a parent\n \n(b) In what six ways did Israel suffer as a result of Eli's parental irresponsibility?\n \n(c) State three lessons that can be derived from the attitude of Eli.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51586?exam_type=waec&type=theory&page=26",
    "correct_answer": "(a) Eli, a priest at Shiloh, had two worthless sons. They committed acts of immorality with female worshippers at Shiloh and they also desecrated sacrifices offered to God. The report eventually came to Eli and prophesied doom on his family, but Eli did nothing more to stop the unholy act. A man of God also came to Eli and prophesied doom on his family. And even when God confirmed the prophecy through Samuel, Eli just said \"It is the Lord, let Him do what seems good to him.\"\n(b) As a result of Eli's parental irresponsibility, Israel suffered in the following ways:\n(i) God sent the Philistines to fight Israel.\n(ii) Israel was defeated in the war.\n(iii) About three thousand Israelites died in the war.\n(iv) Hophni and Phinehas, the two sons of Eli, the priest, were among those killed.\nv) Those who survived in the battle fled.\n(vi) The Ark of the Lord was captured by the Philistines.\n(vii) When Eli heard that the enemy captured the Ark of the Lord, he fell backwards, broke his neck and died.\n(viii) When Eli's daughter-in-law heard the bad news, she had a premature baby and she died.\n(ix) That baby was named \"Ichabod\", meaning, \"glory has departed from Israel\".\n(c) The lessons that can be derived from the attitude of Eli are:\n(i) Parents should take time to teach their children the word of God.\n(ii) There is need to pray together-the use of the family altar should be of paramount importance.\n(iii) Parents should inculcate in their children the spirit of fear of God in all they do.\n(iv) There is need to heed the warning of prophets/men of God.\n(v) The consequences of evil relationship between men and women must be pointed out to children.\n(vi) Disobedience to the commandments of God could bring adverse consequences.",
    "explanation": "(a) Eli, a priest at Shiloh, had two worthless sons. They committed acts of immorality with female worshippers at Shiloh and they also desecrated sacrifices offered to God. The report eventually came to Eli and prophesied doom on his family, but Eli did nothing more to stop the unholy act. A man of God also came to Eli and prophesied doom on his family. And even when God confirmed the prophecy through Samuel, Eli just said \"It is the Lord, let Him do what seems good to him.\"\n(b) As a result of Eli's parental irresponsibility, Israel suffered in the following ways:\n(i) God sent the Philistines to fight Israel.\n(ii) Israel was defeated in the war.\n(iii) About three thousand Israelites died in the war.\n(iv) Hophni and Phinehas, the two sons of Eli, the priest, were among those killed.\nv) Those who survived in the battle fled.\n(vi) The Ark of the Lord was captured by the Philistines.\n(vii) When Eli heard that the enemy captured the Ark of the Lord, he fell backwards, broke his neck and died.\n(viii) When Eli's daughter-in-law heard the bad news, she had a premature baby and she died.\n(ix) That baby was named \"Ichabod\", meaning, \"glory has departed from Israel\".\n(c) The lessons that can be derived from the attitude of Eli are:\n(i) Parents should take time to teach their children the word of God.\n(ii) There is need to pray together-the use of the family altar should be of paramount importance.\n(iii) Parents should inculcate in their children the spirit of fear of God in all they do.\n(iv) There is need to heed the warning of prophets/men of God.\n(v) The consequences of evil relationship between men and women must be pointed out to children.\n(vi) Disobedience to the commandments of God could bring adverse consequences.",
    "year": "2006"
  },
  {
    "number": "131",
    "text": "a) What circumstances led to the dismissal of Gehazi?\n \n(b) State three lessons that can be learnt from Gehazi's conduct.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51589?exam_type=waec&type=theory&page=27",
    "correct_answer": "The circumstances that led to the dismissal of Gehazi are: Elisha healed Naaman, the leper, without a charge. Gehazi, Elisha's servant, regretted his master's refusal of Naaman's gifts and swore to collect a reward. So, he ran after Naaman who halted on sighting him. Gehazi lied to him that visitors came to him unexpectedly. He said Elisha requested a talent of silver and two festal garments, which Naaman quickly obliged and even begged to give two talents which his two servants conveyed for Gehazi. At the house, Gehazi took the items and sent the servants away secretly. When Elisha asked where he went, he denied going anywhere. Elisha asked if his spirit did not follow him and whether it was time for acquisition of wealth. He then ordered that Naaman's leprosy be transferred to Gehazi and his descendants for ever. Gehazi left Elisha's presence a leper, as white as snow.\nb) The lessons that can be learnt from Gehazi's conduct are:\n(i) It is not good to be greedy or materialistic.\n(ii) It is wrong to lie to cover an offence.\n(iii) Elisha was a prophet; we should know the kind of people we deal with.\n(iv) One can get diseases (e.g. AIDS) through secret deals/sinful acts.\n(v)The consequences of sin can be generational.\n(vi) God knows the secret sins of man.",
    "explanation": "The circumstances that led to the dismissal of Gehazi are: Elisha healed Naaman, the leper, without a charge. Gehazi, Elisha's servant, regretted his master's refusal of Naaman's gifts and swore to collect a reward. So, he ran after Naaman who halted on sighting him. Gehazi lied to him that visitors came to him unexpectedly. He said Elisha requested a talent of silver and two festal garments, which Naaman quickly obliged and even begged to give two talents which his two servants conveyed for Gehazi. At the house, Gehazi took the items and sent the servants away secretly. When Elisha asked where he went, he denied going anywhere. Elisha asked if his spirit did not follow him and whether it was time for acquisition of wealth. He then ordered that Naaman's leprosy be transferred to Gehazi and his descendants for ever. Gehazi left Elisha's presence a leper, as white as snow.\nb) The lessons that can be learnt from Gehazi's conduct are:\n(i) It is not good to be greedy or materialistic.\n(ii) It is wrong to lie to cover an offence.\n(iii) Elisha was a prophet; we should know the kind of people we deal with.\n(iv) One can get diseases (e.g. AIDS) through secret deals/sinful acts.\n(v)The consequences of sin can be generational.\n(vi) God knows the secret sins of man.",
    "year": "2006"
  },
  {
    "number": "132",
    "text": "(a)(i)Explain how Nehemiah received the news about the state of affairs in Jerusalem.\n(ii)Relate Nehemiah's prayer when he received the news.\n \n(b) Identify three virtues that can be learnt from Nehemiah's reaction.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51590?exam_type=waec&type=theory&page=27",
    "correct_answer": "(a)(i) Nehemiah received the news about the state of affairs in Jerusalem through Hanani: Nehemiah was in Shushan, the Capital, when Hanani came with certain men from Judah. Nehemiah asked them concerning the Jews who were still in Jerusalem. Hanani said the people there were in great trouble and shame. He went further that the wall of Jerusalem was broken down, its gates destroyed by fire. Hearing this, Nehemiah sat down, wept, mourned and fasted for days.\nii) When Nehemiah received the news, he prayed to God to hear the prayer of his servants. He confessed that he and his father's house had sinned. That they had not kept the commandments, statutes and the ordinances Moses commanded. He asked God to remember His words to Moses that if they were, unfaithful He would scatter them among the peoples, but should they repent and keep His commandments, He would gather them and restore them to the place He had chosen for them. Nehemiah then reminded God that He redeemed His people by His great power. He petitioned God to listen to his servants and grant him success and mercy.\nb) Virtues that can be learnt from Nehemiah's reaction are:\n(i) Nehemiah was patriotic. It pays to be patriotic.\n(ii) He was a man of prayer. A prayerful life is necessary for success in every situation.\n(iii) He was conscious of the nation's wrong-doings; so, he confessed to God. There is need for a nation to confess her sins.\n(iv) We should always intercede for our nation.\n(v) It is important to have faith in God.\n(vi) There is need for national repentance.",
    "explanation": "(a)(i) Nehemiah received the news about the state of affairs in Jerusalem through Hanani: Nehemiah was in Shushan, the Capital, when Hanani came with certain men from Judah. Nehemiah asked them concerning the Jews who were still in Jerusalem. Hanani said the people there were in great trouble and shame. He went further that the wall of Jerusalem was broken down, its gates destroyed by fire. Hearing this, Nehemiah sat down, wept, mourned and fasted for days.\nii) When Nehemiah received the news, he prayed to God to hear the prayer of his servants. He confessed that he and his father's house had sinned. That they had not kept the commandments, statutes and the ordinances Moses commanded. He asked God to remember His words to Moses that if they were, unfaithful He would scatter them among the peoples, but should they repent and keep His commandments, He would gather them and restore them to the place He had chosen for them. Nehemiah then reminded God that He redeemed His people by His great power. He petitioned God to listen to his servants and grant him success and mercy.\nb) Virtues that can be learnt from Nehemiah's reaction are:\n(i) Nehemiah was patriotic. It pays to be patriotic.\n(ii) He was a man of prayer. A prayerful life is necessary for success in every situation.\n(iii) He was conscious of the nation's wrong-doings; so, he confessed to God. There is need for a nation to confess her sins.\n(iv) We should always intercede for our nation.\n(v) It is important to have faith in God.\n(vi) There is need for national repentance.",
    "year": "2006"
  },
  {
    "number": "133",
    "text": "(a)(i)Outline Jeremiah's message about the sins of Judah.\n \n(ii)State two consequences of such sinfulness.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51592?exam_type=waec&type=theory&page=27",
    "correct_answer": "(i) Jeremiah's message about the sins of Judah was that;\n(i) Judah had ceased to be a faithful follower of God and a holy nation.\n(ii) That the ancestors of the nation forsook the Lord.\n(iii) They went after worthless gods and became worthless themselves.\n(iv) They forgot God who had led them out of Egypt, through the wilderness and into a new land.\n(v) When they entered the promised land, they defiled it.\n(vi) They made God's heritage an abomination.\n(vii) That the Priests forgot their God.\n(viii) The teachers of the law did not know God.\n(ix) The rulers transgressed against God.\n(x) The prophets prophesied by Baal.\n(xi) He said Judah forsook the fountain of living water.\n(xii) They dug out cisterns for themselves which could hold no water.\n(xiii) They made sinful alliance with other nations, forsaking the Lord their God.\n(xiv) The fear of God was not found in them.\n(xv) They worshipped other gods upon every hill under every green tree.\nii) Consequences of such sinfulness are that;\n(i) Israel would be destroyed by another nation which would eat of their harvest.\n(ii) Their children would be killed, flocks, herds, wines and fig trees eaten and cities destroyed.\n(iii) There would be lack of water for men and animals and there would be no grass for animals.\n(iv) There would be no rain in the land/drought.\n(v) God would not hear their cry or accept their burnt offerings.\n(vi) They would be destroyed by the sword, famine and pestilence.",
    "explanation": "(i) Jeremiah's message about the sins of Judah was that;\n(i) Judah had ceased to be a faithful follower of God and a holy nation.\n(ii) That the ancestors of the nation forsook the Lord.\n(iii) They went after worthless gods and became worthless themselves.\n(iv) They forgot God who had led them out of Egypt, through the wilderness and into a new land.\n(v) When they entered the promised land, they defiled it.\n(vi) They made God's heritage an abomination.\n(vii) That the Priests forgot their God.\n(viii) The teachers of the law did not know God.\n(ix) The rulers transgressed against God.\n(x) The prophets prophesied by Baal.\n(xi) He said Judah forsook the fountain of living water.\n(xii) They dug out cisterns for themselves which could hold no water.\n(xiii) They made sinful alliance with other nations, forsaking the Lord their God.\n(xiv) The fear of God was not found in them.\n(xv) They worshipped other gods upon every hill under every green tree.\nii) Consequences of such sinfulness are that;\n(i) Israel would be destroyed by another nation which would eat of their harvest.\n(ii) Their children would be killed, flocks, herds, wines and fig trees eaten and cities destroyed.\n(iii) There would be lack of water for men and animals and there would be no grass for animals.\n(iv) There would be no rain in the land/drought.\n(v) God would not hear their cry or accept their burnt offerings.\n(vi) They would be destroyed by the sword, famine and pestilence.",
    "year": "2006"
  },
  {
    "number": "134",
    "text": "(a) What circumstances led to Jesus' declaration of Himself as the 'Bread of Life\"?\n \n(b) Identify three moral lessons in this story.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51593?exam_type=waec&type=theory&page=27",
    "correct_answer": "(a) The circumstances that led to Jesus' declaration of Himself as the \"Bread of Life\" are: After feeding the 5000 men, Jesus took a boat and went to the other side of the sea. When the people came to Him, they asked him when he came there. Jesus knew that they were seeking Him, not because of his teachings, signs and wonders but because of food. He asked them not to labour for the ordinary bread that gives temporary satisfaction. That they should instead, labour for the bread that endures to eternal life. The crowd demanded to know what to do as a proof that they were doing the work of God. Jesus asked them to believe in Him as God-sent. For this they demanded signs to prove His messiahship, which would make them believe. Jesus then said, Moses gave their fathers manna from heaven and they believed in Him as God-sent. He explained that it was not Moses who gave their fathers manna from heaven but God Himself. He then assured that God can give them the bread that endures to eternal life. The people requested to be given the life-giving bread always, and Jesus then told them, \"I am the bread of life; he who comes to me shall not hunger and he who believes in me shall never thirst.\"\n(b) The moral lessons in this story are that\n(i) Christians should not base their belief only on signs.\n(ii) Their beliefs should not be based on material possessions.\n(iii) They should depend on Jesus as their source of life.\n(iv) Being physically weak or hungry does not affect spiritual strength.\n(v) Man should not live by bread alone but by the word Df God.\n(vi) There is need to be cautious in giving people title because of what they offer.",
    "explanation": "(a) The circumstances that led to Jesus' declaration of Himself as the \"Bread of Life\" are: After feeding the 5000 men, Jesus took a boat and went to the other side of the sea. When the people came to Him, they asked him when he came there. Jesus knew that they were seeking Him, not because of his teachings, signs and wonders but because of food. He asked them not to labour for the ordinary bread that gives temporary satisfaction. That they should instead, labour for the bread that endures to eternal life. The crowd demanded to know what to do as a proof that they were doing the work of God. Jesus asked them to believe in Him as God-sent. For this they demanded signs to prove His messiahship, which would make them believe. Jesus then said, Moses gave their fathers manna from heaven and they believed in Him as God-sent. He explained that it was not Moses who gave their fathers manna from heaven but God Himself. He then assured that God can give them the bread that endures to eternal life. The people requested to be given the life-giving bread always, and Jesus then told them, \"I am the bread of life; he who comes to me shall not hunger and he who believes in me shall never thirst.\"\n(b) The moral lessons in this story are that\n(i) Christians should not base their belief only on signs.\n(ii) Their beliefs should not be based on material possessions.\n(iii) They should depend on Jesus as their source of life.\n(iv) Being physically weak or hungry does not affect spiritual strength.\n(v) Man should not live by bread alone but by the word Df God.\n(vi) There is need to be cautious in giving people title because of what they offer.",
    "year": "2006"
  },
  {
    "number": "135",
    "text": "(a) Relate Jesus' Sermon on the Mount under the following headings: (i) Worldly Possession. (ii) Anxiety.\n \n(b) What three lessons can be learnt from this teaching?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51595?exam_type=waec&type=theory&page=27",
    "correct_answer": "(i) Sermon on the mount under worldly possession: Jesus taught His followers not to lay their treasures on earth where moth consumes and robbers steal. He admonished that they should lay their treasures in heaven where it would be safe. For where your treasure is, there will your heart be also. According to Jesus, the eye is the amp of the body. So, if the eye is sound, the whole body would be full of light. However, if the eye is not sound, the whole body would be full of darkness. If the light in you is darkness, how great is the darkness? Jesus asked. No one can serve two masters, said Jesus: for either he would hate one and love the other. Or he will be devoted to th one and despise the other. According to Jesus, no one can serve God and Mammon.\n(ii) Sermon on the mount under Anxiety: Jesus taught that people should not be anxious about their life; what the shall eat or drink. Or about their body; what they shall put on. According to Jesus, life is more than food and th body more than clothing. He also said that birds neither sow nor reap or gather, but are fed by God. According t Jesus, human beings are of more value than birds. He asked if by being anxious one can add a cubit to his stature, He wondered why people should be anxious about clothing. The lilies do not toil or spin, but according to Jesus they are better arrayed than Solomon. Jesus said God who clothed the grass will clothe the people and admonishes that they should have more faith as he tagged them, men of little faith. Jesus then asked them to seek first God': kingdom and His righteousness and all other things shall be added.\n(b) The lessons that can be learnt from the teachings are that:\n(i) One should not be too conscious of world!: possessions.\n(ii) Christians should seek the kingdom of God all the time.\n(iii) God is the greatest provider.\n(iv) WE should not be too anxious of what to eat or drink.\n(v) We should serve God alone with all our hearts.\n(vi) God care: for us all and knows our needs.\n(vii) Anxiety does not solve problems.",
    "explanation": "(i) Sermon on the mount under worldly possession: Jesus taught His followers not to lay their treasures on earth where moth consumes and robbers steal. He admonished that they should lay their treasures in heaven where it would be safe. For where your treasure is, there will your heart be also. According to Jesus, the eye is the amp of the body. So, if the eye is sound, the whole body would be full of light. However, if the eye is not sound, the whole body would be full of darkness. If the light in you is darkness, how great is the darkness? Jesus asked. No one can serve two masters, said Jesus: for either he would hate one and love the other. Or he will be devoted to th one and despise the other. According to Jesus, no one can serve God and Mammon.\n(ii) Sermon on the mount under Anxiety: Jesus taught that people should not be anxious about their life; what the shall eat or drink. Or about their body; what they shall put on. According to Jesus, life is more than food and th body more than clothing. He also said that birds neither sow nor reap or gather, but are fed by God. According t Jesus, human beings are of more value than birds. He asked if by being anxious one can add a cubit to his stature, He wondered why people should be anxious about clothing. The lilies do not toil or spin, but according to Jesus they are better arrayed than Solomon. Jesus said God who clothed the grass will clothe the people and admonishes that they should have more faith as he tagged them, men of little faith. Jesus then asked them to seek first God': kingdom and His righteousness and all other things shall be added.\n(b) The lessons that can be learnt from the teachings are that:\n(i) One should not be too conscious of world!: possessions.\n(ii) Christians should seek the kingdom of God all the time.\n(iii) God is the greatest provider.\n(iv) WE should not be too anxious of what to eat or drink.\n(v) We should serve God alone with all our hearts.\n(vi) God care: for us all and knows our needs.\n(vii) Anxiety does not solve problems.",
    "year": "2006"
  },
  {
    "number": "136",
    "text": "(a) Explain the Lukan account of the Resurrection.\n \n(b) State three lessons that can be derived from this episode.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51596?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a) The Lukan Account of the Resurrection: On the first day of the week, the women went to the tomb will spices. Reaching the tomb, they found the stone rolled away from the entrance. They went in and were perplexec for not finding the body of Christ. Instead, two men stood by them and they were frightened. The men asked the women why they were looking for the living among the dead. They then reminded the women of what Christ said it Galilee. That the son of man must be delivered into the hands of sinful men, and be crucified, that on the third day, Jesus would rise. The women remembered the words of Christ and went and told the apostles and the rest. The women were Mary Magdalene, Joanna, Mary, the mother of James and the other women with them. Though they told the apostles about the resurrection, the apostles did not believe them.\n(b) The Lessons;\n(i) Sunday is the first day of the week, i.e. the day of resurrection.\n(ii) With the resurrection, the Christian faith is established.\n(iii) Since Christ rose from the dead, believers will also rise.\n(iv) Believers must proclaim the resurrection of Christ, emphasizing the deity of Jesus.\n(v) Not all will believe in the resurrection.\n(vi) Believers are expected to have in mind what Christ has told them about the resurrection.\n(vii) The prophecy of Jesus will surely come to pass.\n(viii) With the resurrection, Jesus conquered death/Satan.",
    "explanation": "(a) The Lukan Account of the Resurrection: On the first day of the week, the women went to the tomb will spices. Reaching the tomb, they found the stone rolled away from the entrance. They went in and were perplexec for not finding the body of Christ. Instead, two men stood by them and they were frightened. The men asked the women why they were looking for the living among the dead. They then reminded the women of what Christ said it Galilee. That the son of man must be delivered into the hands of sinful men, and be crucified, that on the third day, Jesus would rise. The women remembered the words of Christ and went and told the apostles and the rest. The women were Mary Magdalene, Joanna, Mary, the mother of James and the other women with them. Though they told the apostles about the resurrection, the apostles did not believe them.\n(b) The Lessons;\n(i) Sunday is the first day of the week, i.e. the day of resurrection.\n(ii) With the resurrection, the Christian faith is established.\n(iii) Since Christ rose from the dead, believers will also rise.\n(iv) Believers must proclaim the resurrection of Christ, emphasizing the deity of Jesus.\n(v) Not all will believe in the resurrection.\n(vi) Believers are expected to have in mind what Christ has told them about the resurrection.\n(vii) The prophecy of Jesus will surely come to pass.\n(viii) With the resurrection, Jesus conquered death/Satan.",
    "year": "2006"
  },
  {
    "number": "137",
    "text": "(a) Trace the events that led to the election of Matthias as one of the twelve.\n \n(b) Highlight three guidelines that should be borne in mind while conducting elections.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51597?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a) The events that led to the election of Matthias as one of the twelve are: After the Ascension, Peter assumed leadership of the brethren. He reminded them of the need to maintain their master's original number of twelve. He quoted David in the Psalms to support his suggestion. Since the place of Judas Iscariot in the ministry had become vacant, there was the need to replace him. The person to replace him must be somebody who had witnessed with Jesus from the time of His baptism to His death and resurrection. Joseph Barsabas and Matthias who fitted the description were nominated for the post. The congregation prayed to God to assist in making the choice. After the prayer, they cast lots for them and the lot fell on Matthias. Matthias was then enrolled as one of the twelve to replace Judas.\n(b) Guidelines that should be borne in mind while conducting elections:\n(i) Seek God's guidance in choosing leaders.\n(ii) Consideration should be given to the character and qualities of persons to be elected into positions of authority.\n(iii) People to be elected into positions of authority in the Church should be experienced and faithful Christians who led their lives according to the word of God.\n(iv) Elections should be free and fair.\n(v) Leaders should not be imposed.\n(vi) Results of elections should be taken in good faith.",
    "explanation": "(a) The events that led to the election of Matthias as one of the twelve are: After the Ascension, Peter assumed leadership of the brethren. He reminded them of the need to maintain their master's original number of twelve. He quoted David in the Psalms to support his suggestion. Since the place of Judas Iscariot in the ministry had become vacant, there was the need to replace him. The person to replace him must be somebody who had witnessed with Jesus from the time of His baptism to His death and resurrection. Joseph Barsabas and Matthias who fitted the description were nominated for the post. The congregation prayed to God to assist in making the choice. After the prayer, they cast lots for them and the lot fell on Matthias. Matthias was then enrolled as one of the twelve to replace Judas.\n(b) Guidelines that should be borne in mind while conducting elections:\n(i) Seek God's guidance in choosing leaders.\n(ii) Consideration should be given to the character and qualities of persons to be elected into positions of authority.\n(iii) People to be elected into positions of authority in the Church should be experienced and faithful Christians who led their lives according to the word of God.\n(iv) Elections should be free and fair.\n(v) Leaders should not be imposed.\n(vi) Results of elections should be taken in good faith.",
    "year": "2006"
  },
  {
    "number": "138",
    "text": "(a) Outline the features of the New Life in Christ as stated by Paul in Colossians.\n \n(b) Identify three practices which can have a negative effect in any Christian community.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51599?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a) The features of the New Life in Christ by Paul in Colossians are: According to Paul, one's mind should be set on things above. People should depart from all sinful practices. They should put on the new nature which is renewed after its Creator. They should have compassion, kindness, meekness and patience. They should forbear one another and forgive each other. They should put on love, which builds everything together. They should allow the peace of Christ rule their hearts: They should be thankful always. They should allow the word of Christ dwell richly in them. They should teach and admonish one another in all wisdom. They are advised to sing Psalms and hymns and spiritual songs with thankfulness. They should note that whatever is done in word or deed should be done in the name of the Lord Jesus.\n(b) Practices which can have a negative effect in any Christian community are:\n(i) Gossiping and backbiting.\n(ii) Greed and selfishness.\n(iii) Lack of love.\n(iv) Jealousy and envy.\n(v) Quarrels and in fighting.\n(vi) Unforgiveness.\n(vii) Covetousness and stealing.\n(viii) Bearing false witness.\n(ix) Drug abuse.\n(x) Child abuse.\n(xi) Sexual immorality.\n(xii) Drunkenness.\n(xiii) Fraud and corruption\n(xiv) Social injustice.",
    "explanation": "(a) The features of the New Life in Christ by Paul in Colossians are: According to Paul, one's mind should be set on things above. People should depart from all sinful practices. They should put on the new nature which is renewed after its Creator. They should have compassion, kindness, meekness and patience. They should forbear one another and forgive each other. They should put on love, which builds everything together. They should allow the peace of Christ rule their hearts: They should be thankful always. They should allow the word of Christ dwell richly in them. They should teach and admonish one another in all wisdom. They are advised to sing Psalms and hymns and spiritual songs with thankfulness. They should note that whatever is done in word or deed should be done in the name of the Lord Jesus.\n(b) Practices which can have a negative effect in any Christian community are:\n(i) Gossiping and backbiting.\n(ii) Greed and selfishness.\n(iii) Lack of love.\n(iv) Jealousy and envy.\n(v) Quarrels and in fighting.\n(vi) Unforgiveness.\n(vii) Covetousness and stealing.\n(viii) Bearing false witness.\n(ix) Drug abuse.\n(x) Child abuse.\n(xi) Sexual immorality.\n(xii) Drunkenness.\n(xiii) Fraud and corruption\n(xiv) Social injustice.",
    "year": "2006"
  },
  {
    "number": "139",
    "text": "(a) How did Paul treat the problem of idleness among the Thessalonian Christians?\n \n(b) Give three reasons why Christians should engage in gainful employment.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51601?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a) Paul treated the problem of idleness among the Thessalonian Christians in the following ways: Paul commanded the Thessalonian believers to avoid any lazy person among them. He reminded them that he did not extort money from any one of them but had worked hard to earn his living. Paul told them that he had a right as a preacher to depend on them for maintenance, but had chosen to work in order to lay an example for them. He had earlier instructed that anyone who is not willing to work should not eat. He commanded and encouraged the lazy brethren to work hard to earn their living. Paul also advised them as brethren not to be fed up in well-doing. However, he advised that anyone who refuses to obey the instructions in this letter, should be isolated. Such a lazy one should not be regarded as an enemy though. Rather, he should be warned as a brother.\n(b) Reasons why Christians should engage in gainful employment are:\n(i) Christians should be gainfully employed to avoid undue temptation to do evil.\n(ii) They should be willing to take up any legitimate job to earn their living.\n(iii) Employed Christians should not be a burden to anyone, parents, relatives and friends.\n(iv) Such Christians become assets to themselves and others.\n(v) They are happy serving God without murmuring or grudging.\n(vi) They become a motivation to other young people around them.",
    "explanation": "(a) Paul treated the problem of idleness among the Thessalonian Christians in the following ways: Paul commanded the Thessalonian believers to avoid any lazy person among them. He reminded them that he did not extort money from any one of them but had worked hard to earn his living. Paul told them that he had a right as a preacher to depend on them for maintenance, but had chosen to work in order to lay an example for them. He had earlier instructed that anyone who is not willing to work should not eat. He commanded and encouraged the lazy brethren to work hard to earn their living. Paul also advised them as brethren not to be fed up in well-doing. However, he advised that anyone who refuses to obey the instructions in this letter, should be isolated. Such a lazy one should not be regarded as an enemy though. Rather, he should be warned as a brother.\n(b) Reasons why Christians should engage in gainful employment are:\n(i) Christians should be gainfully employed to avoid undue temptation to do evil.\n(ii) They should be willing to take up any legitimate job to earn their living.\n(iii) Employed Christians should not be a burden to anyone, parents, relatives and friends.\n(iv) Such Christians become assets to themselves and others.\n(v) They are happy serving God without murmuring or grudging.\n(vi) They become a motivation to other young people around them.",
    "year": "2006"
  },
  {
    "number": "140",
    "text": "(a) Explain James concept of works in relation to Faith.\n \n(b) In what three ways can Christians demonstrate their faith in their daily life?",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51603?exam_type=waec&type=theory&page=28",
    "correct_answer": "(a) James' concept of works in relation to faith: To James, hearing the word is good but doing what is heard brings blessing to the doer. It is of no benefit to declare faith which is not matched by works. For James, faith is an abstract expression which, in concrete terms, is put in action by works. Practical response to the needs of brethren profits more than mere verbal expression of faith (\"Go in peace, be warmed and filled\"). James further said that one's work can prove one's faith. It is not enough to believe that God is one, for even demons believe and shudder.Abraham's faith was justified when he offered Isaac his son upon the altar. So, his faith was active along with his works and was completed by his works. By Abraham's action, James insists that a man is justified by works and not by faith alone. That means that faith and works go together, one complementing the other. Rahab, the harlot, believed the spies were God's people. She treated them kindly for her own rescue and her works justified her faith. James thus declared: \"As the body apart from the spirit is dead, so faith apart from works is dead.\"\n(b) Ways by which Christians should demonstrate their faith in their daily life:\n(i) Christians should establish vocational/technical institutions for training of the unemployed.\n(ii) They should obey those in government/authority.\n(iii) They should ensure good governance by participating in government.\n(iv) They should help the poor and needy.\n(v) They should participate in Church activities.\n(vi) They should establish orphanages/mental homes/vocations, etc.",
    "explanation": "(a) James' concept of works in relation to faith: To James, hearing the word is good but doing what is heard brings blessing to the doer. It is of no benefit to declare faith which is not matched by works. For James, faith is an abstract expression which, in concrete terms, is put in action by works. Practical response to the needs of brethren profits more than mere verbal expression of faith (\"Go in peace, be warmed and filled\"). James further said that one's work can prove one's faith. It is not enough to believe that God is one, for even demons believe and shudder.Abraham's faith was justified when he offered Isaac his son upon the altar. So, his faith was active along with his works and was completed by his works. By Abraham's action, James insists that a man is justified by works and not by faith alone. That means that faith and works go together, one complementing the other. Rahab, the harlot, believed the spies were God's people. She treated them kindly for her own rescue and her works justified her faith. James thus declared: \"As the body apart from the spirit is dead, so faith apart from works is dead.\"\n(b) Ways by which Christians should demonstrate their faith in their daily life:\n(i) Christians should establish vocational/technical institutions for training of the unemployed.\n(ii) They should obey those in government/authority.\n(iii) They should ensure good governance by participating in government.\n(iv) They should help the poor and needy.\n(v) They should participate in Church activities.\n(vi) They should establish orphanages/mental homes/vocations, etc.",
    "year": "2006"
  },
  {
    "number": "141",
    "text": "(a) What did Peter teach on interpersonal relationship among Christians?\n \n(b) State three factors which may cause conflict in the society.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/christian-religious-knowledge-crk/51605?exam_type=waec&type=theory&page=29",
    "correct_answer": "(a) Peter taught on interpersonal relationship among Christians by encouraging that: Elders are to tend the flock willingly, not by constraint. They are to tend the flock not for shameful gain but eagerly. That they are not to be domineering over those in their charge. They are to be examples to the flock.\n(b) Factors which may cause conflict in the society include:\n(i) Greed,\n(ii) Jealousy and envy\n(iii) Negligence of one's duties and obligation.\n(iv) Failure to forgive one another.\n(v) Indolence and covetousness.\n(vi) Lack of respect or regard for constituted authority\n(vii) Unwillingness to participate in societal building.",
    "explanation": "(a) Peter taught on interpersonal relationship among Christians by encouraging that: Elders are to tend the flock willingly, not by constraint. They are to tend the flock not for shameful gain but eagerly. That they are not to be domineering over those in their charge. They are to be examples to the flock.\n(b) Factors which may cause conflict in the society include:\n(i) Greed,\n(ii) Jealousy and envy\n(iii) Negligence of one's duties and obligation.\n(iv) Failure to forgive one another.\n(v) Indolence and covetousness.\n(vi) Lack of respect or regard for constituted authority\n(vii) Unwillingness to participate in societal building.",
    "year": "2006"
  }
]