[
  {
    "number": "57",
    "text": "Fix the 100g mass marked P at B, the 80 cm mark of the uniform metre rule, using an adhesive.\nSuspend another 100g mass marked Q at A, a distance V = 10.Ocm from the 0 cm mark of the metre rule.\nBalance the whole arrangement horizontally on a knife edge as shown in the diagram above.\nMeasure and record the distance U of K from the 0 cm mark of the metre rule.\nRepeat the procedure for five other values of V = 15.0, 20.0, 25.0, 30.0 and 35.0 cm\nIn each case, measure and record the Corresponding values of U. Tabulate your readings.\nPlot a graph of U on the vertical axis against V on the horizontal axis.\ndetermine the:\n\t(1) slope, s, of the graph\n\t(2) intercept c, on the vertical axis.\nEvaluate (i) K\\(_{1}\\) =\\(\\frac{(1 - 2s)}{s}\\) 100:\n\t              (ii) K\\(_{2}\\) = \\(\\frac{2c}{s}\\) - 160\nState two precautions taken to ensure an accurate result\n\n(b)i. State two conditions under which a rigid body at rest remains in equilibrium when acted upon by three non-parallel coplanar forces.\nii. Explain how the position of the centre or gravity of a body affects the equilibrium of the body.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60112?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  },
  {
    "number": "58",
    "text": "Using the diagram as a out the guide carry out the following instructions:\n\nPlace the pin O horizontally inside the cylinder provided. Pour some water on the pin in the cylinder such that the length of the water column / = SO = 10.0cm, where S place the represents the water meniscus.\nlnsert another pin, P in the cork held by the boss of the retort stand.\nAdjust the position of P vertically upward or 0 formed by refraction at S.\nRead and record the distance h = PO.\nRepeat the procedure for four other values of 1= 15, 20, 25, and 30cm.\nIn each case measure and record the corresponding value of h. Tabulate your readings.\nPlot a graph of h on the vertical axis against l on the horizontal axis.\nDetermine the slope, s, of the graph\nEvaluate (i) K\\(_{1}\\) = 1 - S\n\t              (ii) K\\(_{2}\\) = \\(\\frac{1}{k}\\)\nState two precautions taken to ensure accurate results.\n\n(b)i. Explain the total internal reflection of light.\nii. A rectangular glass prism of thickness 6 cm and refractive index 1.5 is placed on the page of a book. The prints on the book are viewed vertically down Determine the apparent upward displacement of the print.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60113?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  },
  {
    "number": "59",
    "text": "You are provided with two wires marked P and C. a resistor R\\(_{s}\\) = 1\\(\\Omega\\) and other necessary apparatus.\n\nConnect R\\(_{s}\\) in the left-hand gap of the metre bridge, a length L= 100cm of wire P in the right-hand gap and the other apparatus as shown in the diagram: above\nDetermine the balance point B on the bridge wire AC\nMeasure and record AB =/s, and BC = /\nEvaluate R\\(_{1}\\) = (\\(\\frac{|_{p}}{|_{s}}\\))Rs\nRepeat the procedure for four other values of L = 90, 80, 70 and 60cm. In each case obtain and record the value of |\\(_{s}\\) and |\\(_{p}\\) and evaluate R\\(_{1}\\) = (\\(\\frac{|_{p}}{|_{s}}\\))Rs\nRepeat the experiment with the second wire, Q. Obtain the value of |\\(_{s}\\) and |\\(_{Q}\\) for equal lengths of wire as used in wire P. \nEvaluate R\\(_{1}\\) = (\\(\\frac{|_{p}}{|_{s}}\\))Rs. In each case, tabulate your readings.\nPlot a graph of R\\(_{2}\\) on the Vertical axis against R\\(_{1}\\) on the horizontal axis.\nDetermine the slope S, of the graph.\nEvaluate the k = \\(\\sqrt s\\).\nState two precautions taken to ensure accurate results.\n\n(b)i. Define the resistivity of the material of a wire.\nii. A galvanometer with a full-scale-deflection of 1.5 x10\\(^{3}\\). A has a resistance of 50\\(\\Omega\\). Determine the resistance required to convert it into a voltmeter reading up to 1.5V.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/physics/60114?exam_type=waec&type=practical&page=12",
    "correct_answer": null,
    "explanation": "",
    "year": "2001"
  }
]