[
  {
    "number": "22",
    "text": "Write a letter to your friend in another school giving him/her three reasons why your school has been excelling in academic work.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50559?exam_type=waec&type=theory&page=5",
    "correct_answer": "9, Aderopo Close,\nOke-Okun,\nlbadan\n16\"' July, 2015\nDear James,\nIn response to your previous message on why you think luck has been what makes my school excellent in academic work, I'd like to highlight the reasons in which my school remains unshakeable when talking about academic excellence.\nWould you believe it if I told you that all the teachers in my school have at least, a master's degree? Yes! The school authority saw to it that all teaching staff had at least one master's degree in the disciplines they teach. This has in numerous ways contributed to my school's academic excellence. During classes, it's like you're listening to the modern version of Albert Einstein. Lectures are usually interactive and trust me; you wouldn't want to leave the class during lecture hours. It's always like you're glued to your seat. You get to ask questions and the assignments aren't too much. Understanding is inevitable with the teachers that teach in my school.\nAnother factor that has contributed to the academic excellence in my school is the use of modern educational facilities. Going to school is like paradise on earth. There are three libraries, twelve computer rooms, four laboratories; in fact, our school just acquired a fish pond capable of housing diverse species of fish.\nIn every classroom, there are two air conditioners, a digital board; every desk in the room has a tablet (which means we do not use notebooks). Tell me, how won't we excel academically with these things around? Excellence is just inevitable.\nHere is the part I love most, our school curriculum is arranged in such a way that students find learning interesting. Subjects are made understandable. There is no day I'd go to school without learning something new. The subjects being taught are broken into absorbable bits. My school remains the best in terms of academic excellence and it'll keep being the best.\nI do hope you now understand why my school's success in academic school work is not as a result of luck, I hope to hear from you soon and do send my regards to Juliana.\nYours sincerely,\nBen.",
    "explanation": "9, Aderopo Close,\nOke-Okun,\nlbadan\n16\"' July, 2015\nDear James,\nIn response to your previous message on why you think luck has been what makes my school excellent in academic work, I'd like to highlight the reasons in which my school remains unshakeable when talking about academic excellence.\nWould you believe it if I told you that all the teachers in my school have at least, a master's degree? Yes! The school authority saw to it that all teaching staff had at least one master's degree in the disciplines they teach. This has in numerous ways contributed to my school's academic excellence. During classes, it's like you're listening to the modern version of Albert Einstein. Lectures are usually interactive and trust me; you wouldn't want to leave the class during lecture hours. It's always like you're glued to your seat. You get to ask questions and the assignments aren't too much. Understanding is inevitable with the teachers that teach in my school.\nAnother factor that has contributed to the academic excellence in my school is the use of modern educational facilities. Going to school is like paradise on earth. There are three libraries, twelve computer rooms, four laboratories; in fact, our school just acquired a fish pond capable of housing diverse species of fish.\nIn every classroom, there are two air conditioners, a digital board; every desk in the room has a tablet (which means we do not use notebooks). Tell me, how won't we excel academically with these things around? Excellence is just inevitable.\nHere is the part I love most, our school curriculum is arranged in such a way that students find learning interesting. Subjects are made understandable. There is no day I'd go to school without learning something new. The subjects being taught are broken into absorbable bits. My school remains the best in terms of academic excellence and it'll keep being the best.\nI do hope you now understand why my school's success in academic school work is not as a result of luck, I hope to hear from you soon and do send my regards to Juliana.\nYours sincerely,\nBen.",
    "year": "2015"
  },
  {
    "number": "23",
    "text": "Write an article suitable for publication in a national newspaper on the topic: The importance of national sports festivals.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50562?exam_type=waec&type=theory&page=5",
    "correct_answer": "The Importance of National Sports Festival\nThe National Sports Festival began in 1973 with the sole aim of promoting unity amongst the ethnic groups in the country after the civil war as well as to discover hidden talents that can be harnessed and groomed for the future.\nThe importance of National Sports Festival will be buttressed in the following paragraphs:\nTalented young men and women have been discovered and sponsored to the United States where they grew into world champions. Some of these athletes do not only represent this country in the All Africa Games, they went further to participate in the Commonwealth Games, Olympic Games and World Championship Competitions with their scintillating performances.\nFurthermore, we have consistently witnessed in National, continental and global competitions the power of sport to unite people from different backgrounds and culture, as it settles disputes between states, towns and countries.\nMoreover, we cannot see that sports is more than winning and losing but that in our circumstances it can be used as a catalyst for national integration and development. With careful planning, sport can help to focus the.attention of a country on its goals, and no other part of the world is in such dire need of a facilitator as Africa which has continued to be and extreme case of ethnicity; poverty and under-development. The UN, the EU and FIFA has long recognized that sport can be used to reduce poverty, boost development and achieve the Millennium Development goals set out in 2000.\nAnother point worth mentioning is the fact that sport goes beyond recreation, fitness and the pursuit of medals and trophies so the festival encourages participating of all people within a given society; including the disabled, children, men, women, professionals, amateurs. It contributes to personal development in the sense that professional athletics benefit from the opportunity to communicate with each other and international friends and exchange experience. For disabled athletes, it provides opportunity return to increase self esteem and set new goals. For children, it is a tool which helps them to develop within values related to respect, peace and co-operation. For women, it is a venue of encouragement and most importantly the possibility to get away from fears and difficulties women face during the conflict.\nIn conclusion, the importance of National Sports Festivsl to Nigeria and Nigerians cannot be over-emphasized, as the benefit out-weighs any detrimental it may have. I am strongly convinced that the Government will be able to push Nigeria foward to be a better country using the National Sport Festival.",
    "explanation": "The Importance of National Sports Festival\nThe National Sports Festival began in 1973 with the sole aim of promoting unity amongst the ethnic groups in the country after the civil war as well as to discover hidden talents that can be harnessed and groomed for the future.\nThe importance of National Sports Festival will be buttressed in the following paragraphs:\nTalented young men and women have been discovered and sponsored to the United States where they grew into world champions. Some of these athletes do not only represent this country in the All Africa Games, they went further to participate in the Commonwealth Games, Olympic Games and World Championship Competitions with their scintillating performances.\nFurthermore, we have consistently witnessed in National, continental and global competitions the power of sport to unite people from different backgrounds and culture, as it settles disputes between states, towns and countries.\nMoreover, we cannot see that sports is more than winning and losing but that in our circumstances it can be used as a catalyst for national integration and development. With careful planning, sport can help to focus the.attention of a country on its goals, and no other part of the world is in such dire need of a facilitator as Africa which has continued to be and extreme case of ethnicity; poverty and under-development. The UN, the EU and FIFA has long recognized that sport can be used to reduce poverty, boost development and achieve the Millennium Development goals set out in 2000.\nAnother point worth mentioning is the fact that sport goes beyond recreation, fitness and the pursuit of medals and trophies so the festival encourages participating of all people within a given society; including the disabled, children, men, women, professionals, amateurs. It contributes to personal development in the sense that professional athletics benefit from the opportunity to communicate with each other and international friends and exchange experience. For disabled athletes, it provides opportunity return to increase self esteem and set new goals. For children, it is a tool which helps them to develop within values related to respect, peace and co-operation. For women, it is a venue of encouragement and most importantly the possibility to get away from fears and difficulties women face during the conflict.\nIn conclusion, the importance of National Sports Festivsl to Nigeria and Nigerians cannot be over-emphasized, as the benefit out-weighs any detrimental it may have. I am strongly convinced that the Government will be able to push Nigeria foward to be a better country using the National Sport Festival.",
    "year": "2015"
  },
  {
    "number": "24",
    "text": "The School Hero is an award meant for the student considered to have exhibited exemplary leadership qualities. As the Senior Prefect, write a letter to the Head of your school, giving three reasons why your nominee should be given the award.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50566?exam_type=waec&type=theory&page=5",
    "correct_answer": "2, Adeolu Adebayo Street,\nGalilee Avenue,\nlju-Ishaga,\nLagos State.\n16th July, 2015\nThe Principal,\nIju Grammar School,\nObawole,\nLagos.\nDear Madam,\nREASONS WHY MY NOMINEE SHOULD BE GIVEN AN AWARD\nKudos to you ma for your support and kindness in our school which has helped the students a lot in their social, academic and moral careers.\nI heard that the school has a hero award for student that has exhibited exemplary leadership in the school that is why my nominee should be given this award.\nAs the senior prefect of the school, I have nominated Atiye Mohammed for this award and my reasons are stated below.\nFirstly, he is a very brilliant and hardworking boy, which has contributed to the development of the school. He has gone for many competitions and won which has given the school honour and fame. He has gained recognition to the school because when he wins, people would like to know his school and how he did it.\nThe best of all was the solar panel he won for the school which has helped the students in many ways, teachers use the electricity generated from the solar panel to power infrastructural facilities. It has provided a very convenient environment for learning.\nAlso, he has some leadership trait in him. In his group in the class, he is the leader and everybody knows his group in the school as most brilliant group of people in the school. When there is quarreling and dispute among the students, he helped to settle the matter which has brought peace and harmony to the school.\nEven during free periods in the class, he comes to the front of the white board marker to teach the students one or two topics. Students who did not understand some questions come to him to seek assistance and he always come to their aid.\nTo sum up these. he is respectful and neat and all the teachers know him in the school. He doesn't play; he greets teachers and helps them with their bags if needed. His uniforms are always properly washed and ironed. When he comes to school he looked like a new student because his cloths are always sparkling white. He puts on brown belt, brown sandals and white socks. He doesn't violate any laws in the school.\nI hope with these cogent points of mine ma, he should be given this award. Thanks once again for your support and kindness towards the students and we want more from you, thanks.\nYours faithfully,\nOsadare Gideon",
    "explanation": "2, Adeolu Adebayo Street,\nGalilee Avenue,\nlju-Ishaga,\nLagos State.\n16th July, 2015\nThe Principal,\nIju Grammar School,\nObawole,\nLagos.\nDear Madam,\nREASONS WHY MY NOMINEE SHOULD BE GIVEN AN AWARD\nKudos to you ma for your support and kindness in our school which has helped the students a lot in their social, academic and moral careers.\nI heard that the school has a hero award for student that has exhibited exemplary leadership in the school that is why my nominee should be given this award.\nAs the senior prefect of the school, I have nominated Atiye Mohammed for this award and my reasons are stated below.\nFirstly, he is a very brilliant and hardworking boy, which has contributed to the development of the school. He has gone for many competitions and won which has given the school honour and fame. He has gained recognition to the school because when he wins, people would like to know his school and how he did it.\nThe best of all was the solar panel he won for the school which has helped the students in many ways, teachers use the electricity generated from the solar panel to power infrastructural facilities. It has provided a very convenient environment for learning.\nAlso, he has some leadership trait in him. In his group in the class, he is the leader and everybody knows his group in the school as most brilliant group of people in the school. When there is quarreling and dispute among the students, he helped to settle the matter which has brought peace and harmony to the school.\nEven during free periods in the class, he comes to the front of the white board marker to teach the students one or two topics. Students who did not understand some questions come to him to seek assistance and he always come to their aid.\nTo sum up these. he is respectful and neat and all the teachers know him in the school. He doesn't play; he greets teachers and helps them with their bags if needed. His uniforms are always properly washed and ironed. When he comes to school he looked like a new student because his cloths are always sparkling white. He puts on brown belt, brown sandals and white socks. He doesn't violate any laws in the school.\nI hope with these cogent points of mine ma, he should be given this award. Thanks once again for your support and kindness towards the students and we want more from you, thanks.\nYours faithfully,\nOsadare Gideon",
    "year": "2015"
  },
  {
    "number": "25",
    "text": "You are the main speaker in a debate on the topic: Students in rural schools have more advantages than those in the urban centres. Write your arguments fur or against the motion.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50580?exam_type=waec&type=theory&page=5",
    "correct_answer": "Good day Mr. Chairman. Panel of Impartial Judges, accurate Time Keeper and my co-debaters. My name is Ajoku Wisdom; I am here to oppose the motion which states that \"Schooling in rural areas is better than schooling in urban areas\". Before I proceed, I would like to define the terms urban and rural areas. In the simplest term, a rural area is a village or the most undeveloped part of a country, while an urban area is a city or the most developed part of a country.\nFirst and foremost, in the world today nearly everyone regard the schools in the urban areas as being of higher quality than those of the rural. If we could remember vividly, during the times of our great grand fathers, they used to struggle really hard to send their children to the city to acquire education, isn't it because of the quality of education being offered? Much of the success achieved by the urban areas over the rural areas is fueled by the fact that as people develop in the city, education also develops with them. But in rural areas, the reverse is quite the case. They have become myopic with their diabolic traditions that even in this 21' century they still cling to such ridiculous beliefs. For instance, in the rural it is popularly believed that the role of every girl is in the kitchen and not school. They belief that a girl shouldn't attain some level of formal education but such opportunity is open to the boys and that is gender.discrimination. In the city, this is the exact opposite. The schools in the city have created an avenue for both sexes to attain equal level of education and contribute to the society. This has sky rocketed development of the urban areas to a point that the rural areas can only dream of getting to.\nAnother significant reason is that technology wise or based on social amenities, rural schools are very below. They've been outpaced by the urban borne  schools. Nearly all rural schools cannot boast of constant power, good classrooms, comfortable chairs, clean pipe borne water and a conducive environment for learning. If a school is suffering from epileptic power supplies, dilapidated structures that they call classrooms, how can a child then succeed in such an inimical environment? I can proudly slay that over 90% of students in the urban areas particularly Lagos state has all it takes to groom a child. My school Iju Senior Grammar School is a typical example. Just recently, my school acquired a solar panel in order to augment the power supply from PHCN. This is surely an evidence; the thinking faculty of urban school is way above that of rural schools.\nThirdly, for any school (precisely rural and urban schools) to be regarded as being better, we need to clock the most fundamental foundation which is qualified teachers. A school without qualified teachers is nowhere worthy to be be called a school. In the world today, for a teacher to be regarded as being qualified. he or she must possess at least a master's degree. Urban schools have achieved this feat successfully while rural schools still divide  themselves with the notion that any teacher with an OND or HND is qualified or worthy to be called a teacher. Such is unfounded and ridiculous. There is a popular belief amongst everyone today and that is \"you give out what you have and not what you don't have\". This clearly explains the gap in knowledge between both. A teacher holding a master's degree or PHD will give out a more advanced form of knowledge. while an OND or HND holder cannot give anything other than the basics (i.e. Basic knowledge).\nHowever, I would not feign ignorance to the fact that urban schools have their short comings or flaws but that shouldn't be seen as a basis to conclude that schools in rural areas are better. Though education in the urban areas may be expensive to some point, if you feel that way why don't you give into ignorance and judge for yourself. Even this so called expensive nature of education has caused its value to rise and considering how erroneously cheap education is in the rural area it has caused a huge depreciation in its value. Cost of education in urban areas should not be considered an excuse, cause some states precisely Lagos state. Imo state have declared education (in public schools) free for everyone. Isn't that wonderful?\nLastly. in an urban area's educational system there is the combination of both private (non free) and public (free education) schools. It is just like a mixed economy which is the fastest growing type of economy in the world. This gives those people in the urban area a choice. Therefore, I reasonably conclude that urban areas operate a mixed educational system. On the other hand, rural areas centers on single educational system. I'm not sure they've heard the phrase 'private school' before. Rural schools try to restrain the students within the confines of the failed epileptic systems which is bound not to grow. I can also describe the rural schools as a higher institution for people who want to become farmers. etc.\nI hope that with these few points of mine, I have been able to convince and not to confuse you beyond all reasonable doubts that schools in urban centers are better than that of rural areas.",
    "explanation": "Good day Mr. Chairman. Panel of Impartial Judges, accurate Time Keeper and my co-debaters. My name is Ajoku Wisdom; I am here to oppose the motion which states that \"Schooling in rural areas is better than schooling in urban areas\". Before I proceed, I would like to define the terms urban and rural areas. In the simplest term, a rural area is a village or the most undeveloped part of a country, while an urban area is a city or the most developed part of a country.\nFirst and foremost, in the world today nearly everyone regard the schools in the urban areas as being of higher quality than those of the rural. If we could remember vividly, during the times of our great grand fathers, they used to struggle really hard to send their children to the city to acquire education, isn't it because of the quality of education being offered? Much of the success achieved by the urban areas over the rural areas is fueled by the fact that as people develop in the city, education also develops with them. But in rural areas, the reverse is quite the case. They have become myopic with their diabolic traditions that even in this 21' century they still cling to such ridiculous beliefs. For instance, in the rural it is popularly believed that the role of every girl is in the kitchen and not school. They belief that a girl shouldn't attain some level of formal education but such opportunity is open to the boys and that is gender.discrimination. In the city, this is the exact opposite. The schools in the city have created an avenue for both sexes to attain equal level of education and contribute to the society. This has sky rocketed development of the urban areas to a point that the rural areas can only dream of getting to.\nAnother significant reason is that technology wise or based on social amenities, rural schools are very below. They've been outpaced by the urban borne  schools. Nearly all rural schools cannot boast of constant power, good classrooms, comfortable chairs, clean pipe borne water and a conducive environment for learning. If a school is suffering from epileptic power supplies, dilapidated structures that they call classrooms, how can a child then succeed in such an inimical environment? I can proudly slay that over 90% of students in the urban areas particularly Lagos state has all it takes to groom a child. My school Iju Senior Grammar School is a typical example. Just recently, my school acquired a solar panel in order to augment the power supply from PHCN. This is surely an evidence; the thinking faculty of urban school is way above that of rural schools.\nThirdly, for any school (precisely rural and urban schools) to be regarded as being better, we need to clock the most fundamental foundation which is qualified teachers. A school without qualified teachers is nowhere worthy to be be called a school. In the world today, for a teacher to be regarded as being qualified. he or she must possess at least a master's degree. Urban schools have achieved this feat successfully while rural schools still divide  themselves with the notion that any teacher with an OND or HND is qualified or worthy to be called a teacher. Such is unfounded and ridiculous. There is a popular belief amongst everyone today and that is \"you give out what you have and not what you don't have\". This clearly explains the gap in knowledge between both. A teacher holding a master's degree or PHD will give out a more advanced form of knowledge. while an OND or HND holder cannot give anything other than the basics (i.e. Basic knowledge).\nHowever, I would not feign ignorance to the fact that urban schools have their short comings or flaws but that shouldn't be seen as a basis to conclude that schools in rural areas are better. Though education in the urban areas may be expensive to some point, if you feel that way why don't you give into ignorance and judge for yourself. Even this so called expensive nature of education has caused its value to rise and considering how erroneously cheap education is in the rural area it has caused a huge depreciation in its value. Cost of education in urban areas should not be considered an excuse, cause some states precisely Lagos state. Imo state have declared education (in public schools) free for everyone. Isn't that wonderful?\nLastly. in an urban area's educational system there is the combination of both private (non free) and public (free education) schools. It is just like a mixed economy which is the fastest growing type of economy in the world. This gives those people in the urban area a choice. Therefore, I reasonably conclude that urban areas operate a mixed educational system. On the other hand, rural areas centers on single educational system. I'm not sure they've heard the phrase 'private school' before. Rural schools try to restrain the students within the confines of the failed epileptic systems which is bound not to grow. I can also describe the rural schools as a higher institution for people who want to become farmers. etc.\nI hope that with these few points of mine, I have been able to convince and not to confuse you beyond all reasonable doubts that schools in urban centers are better than that of rural areas.",
    "year": "2015"
  },
  {
    "number": "26",
    "text": "Write e a story ending with the statement: We apologised to each other and reconciled.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50581?exam_type=waec&type=theory&page=6",
    "correct_answer": "It was a tiresome Friday. I had gone to KFC to grab some snacks and drinks when i caught the sight of and alluring figure, it was a woman in a long and straight simple gown, she was not wearing much make-up  she looked twice as nice as someone who did, she looked beautiful as her long tan hair dangled on her back. I decided to take my chance so I moved closer to her and greeted, smiling politely, she replied. She was not like Lagos girls who always feel too big to talk to a guy, I thought, feeling impressed. 'I'm Dan, how about you?' I introduced my name.\n\"I'm Tania\" she replied sweetly and I pressed further by requesting for her cell phone number, we talked for a while and then bade each other farewell. As days rolled by, we got closer and then moved on to the next level; we started dating. I was so fund of her and wanted to show her off to the whole world, I showered her with gifts and spent almost all of my free periods with her and I also confided in her.\nThe son of the manager of the place I work was throwing his birthday party at Forbas Hotel and I had been invited, being his close friend. When I told Tania about the party, she declined saying that she would be extremely busy on the d-day. I believed her because I trusted her so much but on getting to the party, the first person I saw was Tania, she was wearing a very skimpy gown that fitted her like a second skin. 'Tania what's all this! I said angrily, moving towards her.\n`Hey Dan, what's up' Ralph the celebrant said, trying to be friendly.\n`Hey stay out of it please!' I cautioned trying to grab Tania by the wrist.\n`Tania, what's going on here' Ralph blanked 'I don't know' she blurted almost immediately. I tried to hit Ralph but just then, his bodyguards grabbed me and took me out of the hotel, I was given hell of a beating and then thrown out of the gate to face whatever happens to me.\nSomehow, I managed to get home and called the family doctor. he came rushing in and treated me, after telling him what happened to me, he said soothing things to me and then left. After crying my eyes out of its socket, sleep came at 2.00am and I slept still with a heavy day. Next I called my P.A. and told her that I wouldn't be coming to the office that day because I was sick.\nI was shocked to receive a visitor in the person of Ralph. He came on Sunday, the same week of his birthday.\n\"I'm very, very sorry about Friday night' he began as he sat beside me.\n\"It's okay\" I replied,\n\"I never knew she could do this to me, the first day I met her at the bank, I felt she was the one for me,never knew she was cheating on me....\" \"but, but\" I cut in, not knowing the right words to say.\n\"It's okay, it's really not about you, I found out that she was dating four other guys apart from us!\" he exclaimed, raising four fingers up.\n\"Woah, she's so diabolic!' I exclaimed too.\n\"See I'm sorry about the bouncers and what they did to you, I mean she deserved it he said shaking his head in disbelief.\n'I'm sorry too, I shouldn't have made an attempt to hit you in the first place' I said biting my lips.\n\"Its all good now, you're sorry, I'm sorry too\" he said. We apologized to each other and reconciled.",
    "explanation": "It was a tiresome Friday. I had gone to KFC to grab some snacks and drinks when i caught the sight of and alluring figure, it was a woman in a long and straight simple gown, she was not wearing much make-up  she looked twice as nice as someone who did, she looked beautiful as her long tan hair dangled on her back. I decided to take my chance so I moved closer to her and greeted, smiling politely, she replied. She was not like Lagos girls who always feel too big to talk to a guy, I thought, feeling impressed. 'I'm Dan, how about you?' I introduced my name.\n\"I'm Tania\" she replied sweetly and I pressed further by requesting for her cell phone number, we talked for a while and then bade each other farewell. As days rolled by, we got closer and then moved on to the next level; we started dating. I was so fund of her and wanted to show her off to the whole world, I showered her with gifts and spent almost all of my free periods with her and I also confided in her.\nThe son of the manager of the place I work was throwing his birthday party at Forbas Hotel and I had been invited, being his close friend. When I told Tania about the party, she declined saying that she would be extremely busy on the d-day. I believed her because I trusted her so much but on getting to the party, the first person I saw was Tania, she was wearing a very skimpy gown that fitted her like a second skin. 'Tania what's all this! I said angrily, moving towards her.\n`Hey Dan, what's up' Ralph the celebrant said, trying to be friendly.\n`Hey stay out of it please!' I cautioned trying to grab Tania by the wrist.\n`Tania, what's going on here' Ralph blanked 'I don't know' she blurted almost immediately. I tried to hit Ralph but just then, his bodyguards grabbed me and took me out of the hotel, I was given hell of a beating and then thrown out of the gate to face whatever happens to me.\nSomehow, I managed to get home and called the family doctor. he came rushing in and treated me, after telling him what happened to me, he said soothing things to me and then left. After crying my eyes out of its socket, sleep came at 2.00am and I slept still with a heavy day. Next I called my P.A. and told her that I wouldn't be coming to the office that day because I was sick.\nI was shocked to receive a visitor in the person of Ralph. He came on Sunday, the same week of his birthday.\n\"I'm very, very sorry about Friday night' he began as he sat beside me.\n\"It's okay\" I replied,\n\"I never knew she could do this to me, the first day I met her at the bank, I felt she was the one for me,never knew she was cheating on me....\" \"but, but\" I cut in, not knowing the right words to say.\n\"It's okay, it's really not about you, I found out that she was dating four other guys apart from us!\" he exclaimed, raising four fingers up.\n\"Woah, she's so diabolic!' I exclaimed too.\n\"See I'm sorry about the bouncers and what they did to you, I mean she deserved it he said shaking his head in disbelief.\n'I'm sorry too, I shouldn't have made an attempt to hit you in the first place' I said biting my lips.\n\"Its all good now, you're sorry, I'm sorry too\" he said. We apologized to each other and reconciled.",
    "year": "2015"
  },
  {
    "number": "27",
    "text": "Read the following passage carefully and answer the questions on it.\n      The mansion by the roadside in my village reminds me of a similar sight in the state capital, three decades ago. Standing conspicuously by the highway in the heart of the city, the mansion posed a bold challenge to road users. It belonged to Chief Koko who was regarded as untouchable in his community. Nobody dared step on his toes. Motorists had learnt to steer clear of it. It was generally assumed that .moving close to it could cost one one's life,\n      Then came a governor who decided to widen all the major roads in the capital city. He stressed that this would involve the demolition of buildings that fell within twenty metres from the centre of the road. However, although the governor also stressed that compensations would be paid, Chief Koko was not impressed. He made it clear that nothing should tamper with his mansion, warning that whoever defied him risked dire consequences.\n      Not long after the governor's official proclamation, newspaper reporters had a field day speculating on the unprecedented confrontation with Chief. With time, news filtered out that he asserted that whoever dared him would certainly end up where others like them had gone. The message was clear - defiance meant death! So, reporters were pleading for a new route to circumvent the mansion. However, the governor made it clear that there would be no retreat.\n      Before long, work started on the project. One of the first casualties was a post office that was just some metres within the specified distance. It was cut into two Soon, the frontage of a school nearby also followed. But, it was assumed that things would be different with the mansion whose owner tolerated no effrontery. Day by day, the project moved closer to the mansion, with the heavy machine levelling one structure after another. Then, when it was clear that the mansion was next in line, the driver of the bulldozer requested to go on leave This got to the governor who ordered the driver to first do his duty. He sent emissaries to the governor to spare his life since his children were still very young.\n      The following morning, people got a shocker! The governor himself showed up at the site and asked for the key to the bulldozer, ready to assume the role of the driver. The driver, surveying the possible consequence, tearfully climbed up and pleaded that the governor should please care for his children after his demise. The governor announced that if anything was to happen he, not the driver, would be the target.\n      So, the driver got to work and the mansion collapsed like a pack of cards. Press photographers went to town with their cameras, hoping to capture Chief Koko in action But nothing unusual happened, and soon the whole structure became a rubble.\n      The aftermath? Everybody thought either or both men would soon belong to the great beyond. But this much I know: that governor is still around; and so is the driver.\n(a) What opinion did people have of Chief Koko?\n(b) What does the expression, unprecedented confrontation tell us about the governor?\n(c) Why was it necessary to demolish buildings?\n(d) When the driver said that his children were still very young what did he imply?\n(e) ...people got a shocker. Why was the governor's action a shocker?\n(f) What did people expect Chief Koko to do after the demolition of his mansion?\n(g) Not long after the governor 's official proclamation\n(i) What grammatical name is given to this expression as it is used in the passage?\n(ii) What is its function?\n(h) Quote a simile used in the sixth paragraph of the passage\n(i) For each of the following words, find another word or phrase which means the same and which can replace it as it is used in the passage: (i) assumed, (ii) retreat; (iii) specified, (iv) showed up; (v) collapsed.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50587?exam_type=waec&type=theory&page=6",
    "correct_answer": "(a) People regarded him as ruthless/merciless/untouchable. OR People thought that he was untouchable/ruthless/merciless.(b) The expression tells us that the governor was the very first person who dared confront Chief Koka/that the governor was brave/bold/daring/fearless.(c) It was necessary because the (major) roads were to be widened.(d) The driver implied that he was going to die and leave his children behind uncared for.(e) The governor's action was a shocker because people did not expect him to assume the role of a driver.(f) People expected Chief Koko to carry out his of killing whoever defied him. OR Perople expected Chief Koko to kill the driver or the Governor/both of them.(g) (i) It is an adverbial phrase (of time) (ii) It modifies (the verb) 'had'.(h) The simile is \".... the mansion collapsed like a pack of cards\". (i) (i) assumed - thought, believed, accepted (ii) retreat - going back, withdrawal, backing out (iii) specified - prescribed, stipulated, marked out, defined (iv) Showed up - turned up, appeared, arrived (v) collapsed - went down, crumbled, crashed",
    "explanation": "(a) People regarded him as ruthless/merciless/untouchable. OR People thought that he was untouchable/ruthless/merciless.(b) The expression tells us that the governor was the very first person who dared confront Chief Koka/that the governor was brave/bold/daring/fearless.(c) It was necessary because the (major) roads were to be widened.(d) The driver implied that he was going to die and leave his children behind uncared for.(e) The governor's action was a shocker because people did not expect him to assume the role of a driver.(f) People expected Chief Koko to carry out his of killing whoever defied him. OR Perople expected Chief Koko to kill the driver or the Governor/both of them.(g) (i) It is an adverbial phrase (of time) (ii) It modifies (the verb) 'had'.(h) The simile is \".... the mansion collapsed like a pack of cards\". (i) (i) assumed - thought, believed, accepted (ii) retreat - going back, withdrawal, backing out (iii) specified - prescribed, stipulated, marked out, defined (iv) Showed up - turned up, appeared, arrived (v) collapsed - went down, crumbled, crashed",
    "year": "2015"
  },
  {
    "number": "28",
    "text": "Read the following passage carefully and answer the questions on it.\n      Every normal human being would want to put his or her feet up once in a while and relax, but, obviously. one cannot relax all the time. A little work does not kill. Rather. it keeps one active and mentally alert. Some people think that the invention of robots is the best thing that ever happened to man. They are convinced that the invention has saved the day because robots are ideal workers who work without complaining or getting tired. Robots never reveal company secrets for any reason - corruption. fame or blackmail. The admirers of robots think that once a robot is programmed, it can do any piece of work with precision over a long period without slowing down, getting bored or even going on break or vacation. Robots can be made to perform any task. They do not grumble, protest or ask for 'inducement allowance', overtime, bonus or any of the motivations that human beings usually demand. They also work under conditions which human beings would not accept due to either incapability or attitude.\n      One good thing about the robot is that any of its damaged parts can be replaced for work to go on effectively. On the other hand, if a human being loses a vital part of the body, that part may not be replaced for work to go on as effectively as before.\n      There is no doubt at all that the robot is useful but I strongly believe that the human being is more efficient than the robot in many ways. Human beings are sensitive, thinking beings who are flexible and can therefore control their actions. Thus, they can perform more functions than robots. Since human beings can think, discriminate and make value judgements, they can solve problems on the spur of the moment. The robot, on the other hand, cannot do this because what it has been programmed for is all that it is capable of doing. If a robot is wrongly programmed, it will continue to produce the wrong result until its programme is corrected.\n      The human being can take the initiative in many things. He can communicate or even call for assistance when need be, which the robot cannot do. The human being can be appealed to, to make some crucial changes; he can also learn from observing what goes on and modify what he is doing.\n      It is clear that even though robots are useful, they are deficient in many ways, and therefore cannot have an advantage over human beings. In crisis, the robot cannot face the challenge. It neither reacts nor reflects.\n      The robot is designed and programmed by human beings. How then can the created be superior to the creator? Robots are created to assist human beings and relieve them of some of their burdens, not to take over completely from them.\n(a) In three sentences, one for each, state why the admirers of robotics think that robots are more efficient than human beings.\n(b) In three sentences, one for each, state three advantages which the human being has over the robot.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/english-language/50588?exam_type=waec&type=theory&page=6",
    "correct_answer": "(a) (i) Robots work (well) under any circumstance/condition(ii) Robots work without making demands.(iii) Damaged parts of robots can be replaced.(iv) Robots work tirelessly. (v) Robots can be programmed to perform any task.(b) (i) The human being can take initiative/face challenges/deal with crises/ emergencies.(ii)The human being can perform more functions than the robots.(iii) The human being is capable of controlling his actions(iv) Human beings can make spontaneous decisions.",
    "explanation": "(a) (i) Robots work (well) under any circumstance/condition(ii) Robots work without making demands.(iii) Damaged parts of robots can be replaced.(iv) Robots work tirelessly. (v) Robots can be programmed to perform any task.(b) (i) The human being can take initiative/face challenges/deal with crises/ emergencies.(ii)The human being can perform more functions than the robots.(iii) The human being is capable of controlling his actions(iv) Human beings can make spontaneous decisions.",
    "year": "2015"
  }
]