[
  {
    "number": "25",
    "text": "(a) (i) identify specimens A(Clayey soil) and  B(Sandy soil) by the feel method. [2 marks]\n(ii) Name two crops that would thrive well on each of specimens A and B. [2marks]\n(iii) Mention three ways by which specimen B can be improved. (3 marks]\n(b) (i) identify specimens C and D. (2 marks]\n(ii) State three non-ways in which specimen C is important in crop production. [3 marks]\n(iii) State three uses of specimen B in agriculture. [3 marks]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59736?exam_type=waec&type=practical&page=5",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "26",
    "text": "(a) (i) identify specimen H, I, J and K [4 marks]\n(ii) State two uses of each of specimens J and k [4 marks]\n(iii) State three general ways of maintaining specimens H and I [3 marks]\n(iv) State four precautions to be taken when using specimen J [4 marks]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59737?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "27",
    "text": "Forth maize seeds were sown on a raised bed and thirty-five seeds germinated.\n(a) (i) Calculate the percentage of the maize seeds that germinated [2 marks]\n(ii) What is the percentage of the maize seeds that did not germinate? [2 marks]\n(b) State four conditions that could have enhanced the germination of the thirty-five seeds. [4 marks]\n(c) Suggest five reasons why some of the seeds did not germinate [5 marks]\n(d) Give two industrial uses of maize seeds.",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59738?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  },
  {
    "number": "28",
    "text": "a) (i) identify specimens P and R [2 marks]\nSpecimen P:\n\nSpecimen R:\n\n(ii) State three reasons why the use of specimen P is not recommended in a brooder house [3 marks]\n(iii) Mention two other materials that could be used in place of specimen P in a brooder house [2 marks]\n(iv) What is the name given to the product formed when poultry droppings mix with specimen P? [1 mark]\n(v) State four uses of the product mentioned in (a) (iv) in agricultural production [4 marks]\n \n(b) State three ways of controlling specimen R in crop production. (3 marks]",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59745?exam_type=waec&type=practical&page=6",
    "correct_answer": null,
    "explanation": "",
    "year": "2014"
  }
]