[
  {
    "number": "33",
    "text": "a)(i) Give two examples of each of specimens A and B. (2 marks)\n(ii) State three advantages of the application of specimen Ain crop production. (3 marks)\n(iii) Mention two methods of applying specimen B in crop production. (2 marks)\n \n(b) An experiment was conducted to determine the percentage of water in soil samples C and D.\nThe results are as shown in the table below:\n\n\n\n \nSoil Sample\n\n\nData Recorded\nC           D\n\n\nMass of crucible\n80g        80g\n\n\nMass of crucible and fresh soil\n100g       140g\n\n\nMass of crucible and soil after heating\n95g          100g\n\n\n\n\n\n(i) Determine the mass of fresh soil for each of soil samples C and D (2 marks)\n(ii) Determine the mass of water contained in each of soil samples C and D. (2 marks)\n(ii) Calculate the percentage of water in each of soil samples C and D. (2 marks)\n(c) What type of relationship exists between the amount of water and the amount of air in soils? (2 marks)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59776?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "34",
    "text": "(a) identify specimens H, I, J, K, L and M. (3 marks)\n(b) State one major use of each of specimens H, I, J, K, L and M. (6 marks)\n(c) State three general maintenance practices for specimens H, J, and M. (5 marks)\n(d) Name one tractor-coupled implement that can perform similar functions as each of specimens H, I and K. (3 marks)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59778?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "35",
    "text": "(a) ldentify each of specimens N, O, P and Q. (4 marks)\n(b) Determine the plant population per hectare, if one seed of specimens N is sown per hole at a spacing of 60cm x 25cm. (4 marks)\n(c) State two reasons for the inclusion of the plant from which specimen N is obtained in crop rotation. (2 marks)\n(d) Mention three uses of specimen P. (3 marks)\n(e) State two ways by which the activities of specimen Q affect crops (2 marks)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59779?exam_type=waec&type=practical&page=7",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  },
  {
    "number": "36",
    "text": "a)(i) ldentify specimens R. (1 mark)\n\n(ii) State two disadvantages of using specimen R in poultry house. (2 marks)\n(iii) State two precautions to be taken when using specimen R (2 marks)\n(iv) List two ways of maintaining specimen R. (2 marks)\n(v) Name two devices that can be used in place of using specimen R in a poultry house. (2 marks)\n(b) A farmer observed that ten of the sows on the pig farm had reddened and swollen vulvas with whitish mucus discharge. The sows also made undue noise and P mounted one another. Use the information to answer the questions that follow:\n(i) What do the observed signs in the sows indicate? (1 mark)\n(ii) Assuming the farmer serviced a sow on 1st March, 2012, state the date the farmer should expect the sow to farrow. (2 marks)\n(ii) List three preparations that the farmer should make in the farrowing pen before the sow farrows. (3 marks)",
    "options": {},
    "answer_url": "https://myschool.ng/classroom/agricultural-science/59780?exam_type=waec&type=practical&page=8",
    "correct_answer": null,
    "explanation": "",
    "year": "2012"
  }
]